{"title":"'A culture of not only sport, but excellence' - Team Amani's mission to create world-class athletes at the Home of Champions","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-home-of-champions","date":1698157272000,"content":"\n      <p><em>This article was produced in association with Fizik</em></p>\n<p>Sule Kangangi had a dream of a better future. He watched his first bike race in 2004 in the town of Eldoret, Kenya. He was just passing through as he completed his daily job of delivering 60 litres of milk on his Black Mamba bike, and he liked what he saw. A few days later, he entered his first Black Mamba race and that was when it began. Years of hard graft and setbacks followed, but Kangangi was eventually spotted by the Kenyan Cycling Federation and taken to race in Europe. A string of good results meant he joined Team Bike Aid and spent years racing around the world.</p>\n<p>By any measure, Sule Kangangi was a success story. But his own triumphs alone were not enough to satisfy him. In 2019, Kangangi contacted Mikel Delagrange, an international criminal lawyer from the US, who he had known for some years, and was working in East Africa. The two men spoke about Kangangi’s ambitions to create better opportunities for people from East Africa in cycling and the pair came to a common understanding.</p>\n<div></div>\n<div></div>\n<p>“His vision, it was infectious, he had this will to break into cycling and have East African representation. He had clear ideas on what the challenges were,” says Delagrange. “For me, it was a matter of helping him troubleshoot and come up with creative solutions for the problems he identified.”</p>\n<p>Kangangi agreed to become part of the Kenyan based initiative-based Team Amani and use the team as a vehicle for change that would drive forward his ambitions. The pandemic hit and it both checked and accelerated the progress of the project at the same time. Cycling’s financial model is already precarious in Europe – it’s even more so everywhere else – and Covid-19 threatened to destroy even the nascent cycling communities in African countries. However, a solution was found in online racing.</p>\n<p>“Instead of spending all the resources as the previous projects had done before by putting one or two people in these pressure packed auditions in Europe, we just made those investments in the clubhouses in the country,” explains Delagrange. “By putting a couple of smart trainers in a clubhouse, you could allow the entire team to potentially access international competition.”</p>\n<p>Then came the lightbulb moment. Team Amani did not have to be about bringing African riders to Europe, rather, the answer was to bring European riders to Africa. In 2021, the first edition of the four-day Migration Gravel stage race was held. Former professional athletes such as Laurens ten Dam and Ian Boswell took part, and Kangangi finished in second place after a close-fought battle with Ten Dam. His fellow Team Amani member, Nancy Akinyi Debe, won the women’s race.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/A7401504.jpg?v=1696862849\" />“The Kenyans are able to, especially the men, show that they can race against the big boys, and they can see the level they need to work towards,” said Akinyi Debe after the race.</p>\n<p>“When the best in the world come to Migration, for the first time in many of their lives, they are a minority,” says Delagrange. “It’s that little bit of tension they face where they’re just like, fuck, everybody looks way different to me and they’re speaking in a language I don’t understand. I feel foreign here. That is why I think disproportionately our athletes compete at a higher level in our own races at home, versus the ones that we have in Europe. It makes perfect sense.”</p>\n<p>Alongside building their own races, the Amani project facilitated various trips to gravel events in Europe and America, giving their riders the chance to compete at the highest level in races like Unbound Gravel and the inaugural Gravel World Championships last year. “It was about making the world acknowledge that cycling is actually a regional sport, not an international one, it is a Eurocentric sport. Everything is based around Europe, and the rest of the world struggles to access,” says Delagrange. “We wanted to get that message out, and get our guys and girls to show that there’s a whole other world out there who would love to play. That was phase one of our project.”</p>\n<p>Delangrange explains that phase two, which he believes the team has begun to enter, is all about performance. He thinks it is time to build the expectations in Kenya and beyond that Team Amani exists not just to take part but to win the biggest gravel races in the world. In order to do this, serious investments need to be made not only in Amani’s current class, but also the next generation. These come from the help of the team’s sponsors and Team Amani leveraging the success of commercial relationships to increase its financial stability. Last year, for example, the team shot an advert with Meta – formerly named Facebook – which aimed to show the enabling power of technology, and the funds raised from this were put to use straight away.</p>\n<p>“We’ve bought a piece of land in Iten, the Home of Champions,” says Delagrange. “There is a culture of not only sport there, but excellence. It’s in the air. In any given winter you have thousands of Europeans descend on this place to drink the tea, eat the simple food, follow these guys around and figure out what’s in the water so that they could potentially benefit.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC09001.jpg?v=1696862628\" />Iten is a town of 42,000 people in Elgeyo-Marakwet County, Kenya and is known as the Home of Champions because over the last 30 years it has produced a long list of world-class long distance athletes. Runners put in years of training on the hard-packed earthen paths that traverse the mountains overlooking the Great Rift Valley at 2,400 metres above sea level. Sule Kangangi’s dream was to build a world-class cycling facility there, in the Mecca of endurance running.</p>\n<p>Iten has a history of not only sporting success, but also corporate investment. Companies like Nike have invested millions of dollars into the town to help develop athletes there, making running one of the most viable career paths in the area. “In Iten, there is an understanding within the local community that sport is a vehicle, not only to success, but financial stability,” says Delagrange. “There’s a bit of swagger that I think we need. Instead of always just being on the back foot, this is the place where champions come out of.”</p>\n<p>Once the land was secured and the plan had been laid out, the wheels on the Team Amani project in Iten were turning quickly and the vision that the team had of building a new generation of cycling stars seemed like it could become reality. On August 28, 2022, however, tragedy struck the team. Sule Kangangi was competing at the Vermont Overland Gravel Race in the United States and crashed heavily. The 33-year- old was found lying by a tree which it is assumed he hit during his fall. He was unable to be saved by emergency services who attended the scene. Team Amani had lost its talisman and Kangangi’s dream, ambitions and the entire Amani project in Iten was thrown into uncertainty.</p>\n<p>“Sule is our captain, friend, brother. He is also a father, husband and son. Gaping holes are left when giant’s fall. Sule was a giant,” Team Amani wrote in a statement announcing Kangangi’s death.</p>\n<p>*   *   *</p>\n<p>Team Amani was a project that Delagrange and Kangangi had embarked on together. For it to continue after the tragic passing of Kangangi had to mean a change in approach – Delagrange did not want to continue alone. “After Sule’s funeral, I told the other guys, I refuse to do this on my own,” says Delagrange. “That is not what I was interested in. This model of having foreigners, particularly Westerners, at the head of these operations, doesn’t work. I’ve seen it over and over again. I’m only interested in doing something different that enables these guys to stand up on their own and take this thing on themselves.”</p>\n<p>Salim Kipkemboi was a key member of the Amani team who agreed to try to help fill the gaping hole left by the loss of Kangangi. A former pro for Team Bike Aid, the Kenyan rider will now take up a leadership role in the project to help coach and teach the next generation.</p>\n<p>“I’ve got experience which is useful for the community and the young adults here,” says Kipkemboi. “Cycling is becoming bigger and bigger in the area, young kids are more into cycling than running because they find it more fun. Kids see opportunities where they can get bikes to ride and make a career from it.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSCF2031.jpg?v=1696862656\" />Delagrange believes that the younger generation needs role models like Kipkemboi to show the possibilities that cycling can bring. “It’s super important that people see that Salim has built a house off of riding a bike. He drives a car around and he has a fancy bike. How did this happen? Because he was good at riding bikes,” says Delagrange. “Empowering guys like Salim is important because they understand some of the imperceptible hidden barriers and things that hold people back from being able to get to the camps or train properly. These are the kinds of blind spots that we’re really hoping we can address so we can create an atmosphere where a kid from rural areas, even in other countries like Uganda or Congo or anywhere, can still meaningfully turn up and have a shot at their dream.”</p>\n<p>To pivot the project after Kangangi’s death was not without its challenges. Delagrange points out that he pays all of the Team Amani riders a living wage and wants them to have the opportunities to live and train as professional athletes. Putting the pressure on them to take part in the structural and managerial side of the team is additional workload and stress that riders from European countries wouldn’t have to deal with.</p>\n<p>“In the beginning, I was so impatient to just have someone else in that space that Sule left, that I put maybe too much pressure on a number of the riders. Their contemporaries in Belgium or France, they don’t have to deal with that kind of pressure. They don’t have to be top performing athletes and also take on the managerial aspects of a development project, it is not fair,” says Delagrange. “But at the same time, this life isn’t fair. There are advantages, in both normal life and in sport to being born in the West and these are the things that we’re just trying to acknowledge and level out with a bit of hustle. Now we have people who are stepping up organically, and taking on aspects of that Sule function so that now we are back on track.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSCF2019.jpg?v=1696862803\" />While the pump track in Iten is built and is already having a tangible impact on interest in cycling in the area, building the Team Amani training facilities has led to more financial stumbling blocks for Delagrange. “I feel like I am just one heartbeat away from some dude with money being like, is that all you need? I’m waiting for this phone call. It’s going to happen. The momentum is not going away and we’ve secured so much of the financing on our own and gone so far with the athlete’s house, the pump track and everything else,” says Delagrange. “It just needs a bit of starter fluid just to get the rest of the fire going.”</p>\n<p>While the high-performance centre is still in the making, by the end of August 2023, Delagrange expects that the athletes’ house in Iten will be lived in by riders. Team Amani has plans to bring in high-performance coaches to help develop and spot talent. For example, EF Education-EasyPost rider Lachlan Morton’s trainer from Australia will be present to help the team at the camp they are organising in November where they will have trials to finalise next year’s roster.</p>\n<p>“We want people to see there are openings on this team. If you’re hungry enough, you can come for it,” says Delagrange. “The house is about allowing this current class to express their full potential and continue to show that we can perform at the highest levels, while at the same time holding that space for the class coming up behind them. With these resources, not only the house but also the performance centre that we will, I’m confident, have built within the year and then have outfitted by our partners like Wahoo and Fizik, they will have what they need.”</p>\n<p>Team Amani envisions a tiered structure whereby riders get different levels of support depending on what stage of development they are at. At the pinnacle, there will be spaces for riders who will be paid a salary and get taken to race in Europe and the US, then just below them will be the Amani stagiaire programme. For the riders at this level, they will be given equipment like the previous year’s team bikes, helmets and the basic tools they need to train for six months and then attend a selectio camp. They can come to this camp with equal equipment and show if they have done enough to step up.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/A7401453.jpg?v=1696862822\" />Below them are the younger kids on bikes who are just riding for fun. “We’ve already seen with the pump track alone, kids doing crazy sh*t after two or three weeks,” laughs Delagrange. “They have this amazing ability because it is just there, they’re sneaking out and they’re coming and doing it again and again. Through this, we hope to find those kids who have a natural gift for it which will also facilitate our recruitment processes.”</p>\n<p>Delagrange also acknowledges that there are some who will have the dream of becoming cyclists but don’t make the cut. He wants to be clear that Team Amani’s project is not a charity, it is about building world-class athletes. “You have to create that culture, just like they have on the running side, of fearlessness, being bold and also risk. There’s a risk that you can dedicate yourself to this and not make it”, he says.</p>\n<p>Boldness and bravery is in Team Amani’s DNA, and Delagrange shares an anecdote about the UCI Gravel World Series races so far this year which perfectly sums up the team’s plucky resoluteness. “At the UCI gravel races this year, like Ranxo Gravel in Spain, our guys were told they had to line up at around position 100 because they didn’t have UCI points. So they were 100 spaces behind Alejandro Valverde and no one saw him again for the rest of the race,” says Delagrange. “Again, it is just perpetuating the bullsh*t through the application of these rules, preventing people who come from outside of Europe from meaningfully competing.”</p>\n<p>While Delagrange acknowledges the frustration of this situation, it is not Team Amani’s style to sit back and accept it. Instead, they found a solution by running a one-day race in Africa next year called Safari Gravel, which will be part of the UCI Gravel World Series and give Amani riders a chance to secure UCI points on home soil. When they go over to Europe, they’ll be prepared with the points they need to get a good starting position. This is the Amani ethos. They are a team that just wants the chance to race, and they are prepared to fight to get it. This was Sule Kangangi’s attitude too.</p>\n<p>“There’s a stubbornness there to not accept Sule’s death as defeat,” says Delagrange. “I just asked myself, what would he do if the situation was reversed? Would he have just called it a day? I don’t think he would have. I feel a bit of an obligation, but not an obligation to save anyone, or to do any bullsh*t like that. It’s an obligation to him personally, to see through the dream that he helped start.”</p>\n<div>\n<div>\n<div>\n<p><em>If you would like to contribute to the building of the Amani House, you can donate to the GoFundMe page at <a href=\"www.teamamani.com\" target=\"_blank\">teamamani.com</a></em></p>\n</div>\n<div></div>\n</div>\n</div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e17acbf8b58b3440d1a1fb7c5f674e466d2f4d4cc35f0e9752685138f23f3ecd","category":"Cycling"}