{"title":"Advancing the performance characteristics of rubber asphalt mixtures through the integration of Basic Oxygen Furnace (BOF) slag: A focus on static and dynamic mechanical enhancements","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310499","date":1726668000000,"content":"<p>by Zhongnan Tian, Peng Liang, Bochao Zhai, Yue Zhou</p>\r\n\r\nTo investigate the advantageous effects of incorporating industrial solid waste basic oxygen furnace (BOF) slag on the mechanical characteristics of warm-mixed rubber asphalt (WMRA) and hot-mixed rubber asphalt (HMRA) mixture, varying proportions of BOF slag were substituted for limestone coarse aggregates (0%, 25%, 50%, and 75%). Additionally, a 1.5% dosage of Sasobit warm-mixed modifier was introduced to prepare the rubber asphalt. Subsequent to preparation, both static mechanical tests (including Marshall and indirect tensile tests) and dynamic mechanical tests (including dynamic creep and elastic modulus tests) were conducted to evaluate the influence of BOF slag on the mechanical behavior of WMRA and HMRA mixtures across different substitution levels. Following testing, a two-way analysis of variance (ANOVA) was employed to dissect the impact of BOF slag content and Sasobit warm-mixed modifier on the static and dynamic mechanical properties of the rubber asphalt mixtures. The findings reveal that BOF slag exhibits commendable engineering aggregate properties, enabling substantial substitution of coarse aggregates in both HMRA and WMRA mixtures. As the proportion of BOF slag increases, it enhances the resistance of asphalt mixtures to permanent deformation and cracking under static and dynamic loading conditions, while broadening the range of elastic deformation for both WMRA and HMRA mixtures subjected to repeated loading. Moreover, a synergistic enhancement in the resistance of rubber asphalt mixtures to dynamic load-induced deformation is observed when employing both BOF slag and Sasobit warm-mixed modifier. The findings offer valuable insights for enhancing the performance of WMRA and HMRA mixtures, as well as broadening the utilization of BOF slag and waste rubber.","author":"Zhongnan Tian","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e17c88b172f37f2ae39dd5a56e83e391f9ed383e0b8d19d5f7c373e73580fb87","category":"Interdisciplinary"}