{"title":"E3 SUMO ligase SIZ1 splicing variants localize and function according to external conditions","link":"https://academic.oup.com/plphys/article/195/2/1601/7630795?rss=1","date":1710720000000,"content":"<span><div>Abstract</div>SIZ1 (SAP and MIZ1) is a member of the Siz/PIAS-type RING family of E3 SUMO (small ubiquitin-related modifier) ligases that play key roles in growth, development, and stress responses in plant and animal systems. Nevertheless, splicing variants of <span>SIZ1</span> have not yet been characterized. Here, we identified four splicing variants of Arabidopsis (<span>Arabidopsis thaliana</span>) <span>SIZ1</span>, which encode three different protein isoforms. The <span>SIZ1</span> gene encodes an 873-amino acid (aa) protein. Among the four <span>SIZ1</span> splicing variants (<span>SSV</span>s), <span>SSV1</span> and <span>SSV4</span> encode identical 885 aa proteins; <span>SSV2</span> encodes an 832 aa protein; and <span>SSV3</span> encodes an 884 aa protein. SSV2 mainly localized to the plasma membrane, whereas SIZ1, SSV1/SSV4, and SSV3 localized to the nucleus. Interestingly, SIZ1 and all SSVs exhibited similar E3 SUMO ligase activities and preferred SUMO1 and SUMO2 for their E3 ligase activity. Transcript levels of <span>SSV2</span> were substantially increased by heat treatment, while those of <span>SSV1</span>, <span>SSV3</span>, and <span>SSV4</span> transcripts were unaffected by various abiotic stresses. SSV2 directly interacted with and sumoylated cyclic nucleotide-gated ion channel 6 (CNGC6), a positive thermotolerance regulator, enhancing the stability of CNGC6. Notably, transgenic <span>siz1-2</span> mutants expressing <span>SSV2</span> exhibited greater heat stress tolerance than wild-type plants, whereas those expressing <span>SIZ1</span> were sensitive to heat stress. Furthermore, transgenic <span>cngc6</span> plants overaccumulating a mutated mCNGC6 protein (K347R, a mutation at the sumoylation site) were sensitive to heat stress, similar to the <span>cngc6</span> mutants, while transgenic <span>cngc6</span> plants overaccumulating CNGC6 exhibited restored heat tolerance. Together, we propose that alternative splicing is an important mechanism that regulates the function of SSVs during development or under adverse conditions, including heat stress.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"e17dae5fcc58c97cf3f720e725666582818fc07938499ce509274ee5f5589915","category":"Environment"}