{"title":"Jason Snell on the MacOS 12 ‘Monterey’ Public Beta","link":"https://sixcolors.com/post/2021/07/first-look-macos-monterey-public-beta/","date":1625187361000,"content":"\n<p>Jason Snell, writing at Six Colors:</p>\n\n<blockquote>\n  <p>The Mac is also getting a boost with older iOS features finally\nbeing brought to the other side, most notably Shortcuts, the iOS\nautomation tool that is the first sign of a renaissance of user\nautomation on macOS.</p>\n\n<p>The good news is, for all the recent fears among Mac users that\nApple might be attempting to collapse Mac, iPhone, and iPad into a\nsingle amorphous product, macOS Monterey still feels unreservedly\nlike a Mac. Apple wants its platforms to share features, but it\nalso recognizes that each serves a different (albeit overlapping)\naudience.</p>\n</blockquote>\n\n<p>Worth pointing out again that Shortcuts for Mac is <em>not</em> a Catalyst app. In fact, there are <em>no</em> new Catalyst apps from Apple in MacOS 12. It’s seemed clear to me all along that Catalyst was a transitional framework and that SwiftUI is the future. MacOS 12 Monterey seems to be bearing that out. (Snell has a screenshot of the new Shortcuts for Mac with an interesting-looking shortcut based on a Perl script….)</p>\n\n<p>The elephant in the room with MacOS 12 (and iOS, but to a lesser extent): the new Safari tabs interface:</p>\n\n<blockquote>\n  <p>To make matters even worse, the background color of the entire\ntop of the Safari window is now matched to the color of the\nwebsite you’re viewing. It’s a cute trick, but while I understand\nthe desire to make Safari feel more like it’s a part of the\ncontent it’s displaying, it’s a readability disaster. Contrast\nwith the text on tabs is frequently poor, and since the color\nshifts depending on which tab is active, it feels like my brain\nis constantly recalibrating how to read that particular text\ncontrast. On top of that, there’s also the cognitive dissonance\nof seeing tabs for sites with a strong color identity displayed\nin a <em>different</em> color because they’re not the currently active\ntab. And you can’t see the title of the page you’re currently\nviewing, because the URL displays instead unless you hover the\npointer over it.</p>\n\n<p>Because the address bar is embedded in individual tabs now, it\nalso means that when I type Command-L or Command-T, I have to hunt\ndown the place where that URL is being entered — the URL box\njumps around based on the location of the particular tab I’m\ncurrently using.</p>\n\n<p>A lot of user interface elements have also been hidden away to\nprovide more space for tabs. Tasks that were once a click away\nsometimes need to be searched for in a sub-menu.</p>\n</blockquote>\n\n<p>I think the new Safari interface is a noble experiment — intriguing ideas that were worth trying out. But I don’t know anyone who thinks, in practice, that they’re not a huge regression in usability. I’d love it if Apple just went back to the previous Safari interface for tabs and browser chrome. It’s crazy to me that even the Share button is now an extra click or tap away. If Apple ships this design for the Mac it’s going to push a lot of current Safari users to Chrome or other Chromium-based browsers.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/07/01/snell-monterey-public-beta\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"e1806cf940ed98e616cbc4605326d43dd42969c5cf535f3cb442a9be4551104c","category":"Tech"}