{"title":"Application of Isokinetic Dynamometry Data in Predicting Gait Deviation Index Using Machine Learning in Stroke Patients","link":"https://www.preprints.org/manuscript/202408.1199/v1","date":1724082976000,"content":"Background: Three-dimensional gait analysis plays a crucial role in the rehabilitation assessment of post-stroke hemiplegic patients. However, the data generated from such analysis is often complex and difficult to interpret in clinical practice, requiring extensive time and complicated procedures. The Gait Deviation Index (GDI) serves as a simplified metric for quantifying the severity of pathological gait. Although isokinetic dynamometry is widely employed in muscle function assessment and rehabilitation, its application in gait analysis remains underexplored. Objective: This study aims to investigate the use of isokinetic muscle strength data obtained from the Biodex system, combined with machine learning techniques, to predict the GDI in hemiplegic patients. Methods: A cohort of 150 post-stroke hemiplegic patients was evaluated. The peak torque, peak torque/body weight, maximum work of repeated actions, coefficient of variation, average power, total work, acceleration time, deceleration time, range of motion, and average peak torque for both flexor and extensor muscles on the affected side were measured at three angular velocities (60°/s, 90°/s, and 120°/s) using the Biodex System 4 Pro. GDI was calculated using data from a Vicon three-dimensional motion capture system. The study employed four machine learning models—Lasso regression, random forest (RF), support vector regression (SVR), and BP neural networks—to model and validate the data. Model performance was evaluated using mean squared error (MSE), the coefficient of determination (R²), and mean absolute error (MAE). SHapley Additive exPlanations (SHAP) analysis was used to enhance model interpretability. Results: The RF model outperformed others in predicting GDI, with an MSE of 16.18, an R² of 0.89, and an MAE of 2.99. In contrast, the Lasso regression model yielded an MSE of 22.29, an R² of 0.85, and an MAE of 3.71. The SVR model had an MSE of 31.58, an R² of 0.82, and an MAE of 7.68, while the BP neural network exhibited the poorest performance with an MSE of 50.38, an R² of 0.79, and an MAE of 9.59. SHAP analysis identified the maximum work of repeated actions of the extensor muscles at 60°/s and 120°/s as the most critical features for predicting GDI, underscoring the importance of muscle strength metrics at varying speeds in rehabilitation assessments. Conclusion: This study highlights the potential of machine learning techniques in analyzing complex clinical data. The developed GDI prediction model, based on isokinetic dynamometry data, offers a novel, streamlined, and effective tool for assessing rehabilitation progress in post-stroke hemiplegic patients, with promising implications for broader clinical application.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e1836ae078a5baefd58676d5cb365b36e3f91a37f593d9cbb3467fb1a9b3ee29","category":"Interdisciplinary"}