{"title":"Low-molecular-weight heparin in the prevention of venous thromboembolism among patients with acute intracerebral hemorrhage: A meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311858","date":1729087200000,"content":"<p>by Haizheng Li, Zhiguo Wu, Hongyu Zhang, Baohua Qiu, Yajun Wang</p>\r\nObjective <p>It remains unclear whether low-molecular-weight heparin (LMWH) is effective and safe for intracerebral hemorrhage (ICH) patients. This study presents a meta-analysis for elucidating effect of LMWH on preventing venous thromboembolism (VTE) among ICH patients.</p> Methods <p>Articles were located by systematically searching PubMed, Embase, Web of Science, Cochrane Library, China National Knowledge Infrastructure (CNKI), WANFANG DATA, VIP, and SinoMed databases. The literature was independently screened by two authors, who also extracted data and conducted a qualitative evaluation. With regard to outcomes, their risk ratios (RRs) and 95% confidence intervals (CIs) were computed, and the findings were combined using the random effects model by using Mantel-Haenszel approach.</p> Results <p>30 studies involving 2904 patients were analyzed and compared to control group. According to our findings, early low-dose LMWH, prophylaxis for VTE, was related to the markedly reduced deep vein thrombosis (DVT) (3.6% vs. 17.5%; RR, 0.25; 95% CI, 0.18–0.35; p-value&lt;0.00001) and pulmonary embolism (PE) (0.4% vs. 3.2%; RR, 0.29; 95% CI, 0.14–0.57; p-value = 0.003), while the non-significantly increased hematoma progression (3.8% vs. 3.4%; RR, 1.06; 95% CI, 0.68–1.68; p-value = 0.79) and gastrointestinal bleeding (3.6% vs. 6.1%; RR, 0.63; 95% CI, 0.31–1.28; p-value = 0.20). Also, mortality (14.1% vs. 15.8%; RR, 0.90; 95% CI, 0.63–1.28; p-value = 0.55) did not show any significant difference in LMWH compared with control groups.</p> Conclusions <p>Our meta-analysis suggested that early low-dose of LMWH are safe and effective in ICH patients. More extensive, multicenter, high-quality randomized clinical trials (RCTs) should be conducted to validate the findings and inform clinical practice.</p>","author":"Haizheng Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e1866f1a7bdfd96df826fc9554a2e14fee156a4736d47d1e0de2d77c0537ddb4","category":"Interdisciplinary"}