{"title":"A Century of Change in a Mature Urban Forest: the Thain Family Forest of the New York Botanical Garden, Bronx, New York","link":"https://academic.oup.com/jof/article/122/3/258/7606971?rss=1","date":1707782400000,"content":"<span><div>Abstract</div>Urban forests have long been understudied, resulting in a scarcity of long-term data to guide future management. The New York Botanical Garden in New York City has been stewarding the 20 ha Thain Family Forest since 1895. Using inventory data between 1937 and 2021, we document how structure, diversity, and composition of the forest have changed over the past century. Our results show an increase in the proportion and diversity of hardwood species, including oaks, hickories, red maple, black cherry, and American beech, following the loss of a dominant species, eastern hemlock. Despite changes in composition, we find no significant differences in the mean basal area, density, and tree diameter of canopy trees (diameter at breast height [DBH] ≥ 15 cm) from 1937 to 2021. Assessments of small diameter stems (DBH ≥ 2.54 cm) show increasing density, decreasing diameter, and increasing richness from 1985 to 2021, suggesting a period of understory recruitment/regeneration. During this time, native species have been dominant in both overstory and understory strata. These observations mirror trends recorded in hemlock–hardwood and oak–hickory forests region-wide, indicating that, with continued conservation and active management, urban and rural forests may develop in similar patterns and encouraging regional approaches to forest management.<strong>Study Implications:</strong> Urban forests have long been understudied, resulting in a scarcity of long-term data to guide future management. Over the past century, the 20 ha Thain Family Forest in New York City has experienced a significant change in species composition, with an increase in the proportion and diversity of hardwood species following the loss of eastern hemlock. Despite these changes, forest canopy structure has remained stable. These observations mirror those observed in hemlock–hardwood and oak–hickory forests regionwide, suggesting that with continued conservation and active management, urban and rural forests may develop in similar patterns. The results of this study support continued investment in the research and management of urban forests as a comprehensive part of regional forest management efforts.</span>","author":"","siteTitle":"Journal of Forestry Current Issue","siteHash":"f325018648ab04fba35e6e1191e9c9d953f9458bd233a7a41545c2e465328e3b","entryHash":"e18bb8bcb626b66c1538cf7c7a0eda70a6359e7619143d2e3d1b0d61047a7d74","category":"Environment"}