{"title":"La Vuelta a España 2021 Stage 19 Preview - Breakaway or sprint?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-stage-19-preview-breakaway-or-sprint-in-monforte-de-lemos","date":1630577775000,"content":"\n      <p><span>Three categorised climbs are squeezed into the first third of stage 19 of La Vuelta. With most of the 3,500 climbing metres crammed into the first half of the stage. A plethora of riders could be targeting victory in Monforte de Lemos. </span>Primož Roglič starts the stage wearing the red jersey. <span>Despite tackling extensive climbing metres, we don't expect any GC action. </span></p>\n<div></div>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-preview\"><b><i>Vuelta 2021 Guide</i></b></a></p>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/VE21-Altimetriasv4-19_1024x1024.png?v=1630515546\" />Stage 19 profile</span></i></p>\n<p><span>The road shoots uphill just 12km after departing from Tapia, which hosts the start of Vuelta a España stage for the first time since 1995. The third category Alto da Sela d'Entorcisa is 9.9km in length and averages 3.9%. The climbing swiftly continues after a brief descent, which is just 2km long, with the Alto da Garganta. The second category climb averages 5.6% over 10.3km. The Garganta is irregular, with some sections exceeding 10%.</span></p>\n<p><span>A long descent heads directly into the final categorised ascent of the stage. The second category Alto de Barbeitos averages 3.8% over 11.8km, but the first 5.7km are much steeper at 5.6%.</span></p>\n<p><span>There are many shorter, less substantial climbs scattered throughout the remaining 130km. However, the first 60km will be fiery, with 13 KOM points up for grabs and opportunities to gain points swiftly diminishing, anyone interested in the KOM jersey must make the most of the early opportunities. This gives the pure sprinters, such as Fabio Jakobsen, almost no chance of holding onto the front of the race.</span></p>\n<p><span>An intermediate sprint occurs with 28km left in Oural. Bonus seconds are handed out to the first three riders across.</span></p>\n<p><span>The concluding kilometres aren’t particularly technical, but there are numerous key moments. A 90-degree right-hand corner occurs w<span>ith 4km to go, which</span> leads into a long, sweeping left-hander. This carries the riders to an acute, left-hand turn with 2.4km remaining. The next 1.5km are straight, providing the final opportunity for those out of position </span><span>to move up. Two right-hand corners occur with 900 and 500 metres left. If the stage is decided in a sprint, there will be a considerable fight for positioning entering these two corners.</span></p>\n<h4><b>Contenders</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1336503073-min_1024x1024.jpg?v=1630515575\" />Magnus Cort beats Andrea Bagioli on stage 12 (Image credit: Stuart Franklin/Getty Images)</span></i></p>\n<p><span>The pure sprinters, such as</span><b> Fabio Jakobsen,</b><span> have a miniscule chance of</span><b> </b><span>surviving the early climbs. With the green jersey holder unlikely to compete, the door opens to an abundance of riders.</span></p>\n<p><b>Matteo Trentin</b><span> and</span><b> Michael Matthews</b><span> are not pure sprinters. Both riders can climb in addition to being quick in a sprint finish. UAE Team Emirates and Team BikeExchange know they cannot compete with Jakobsen, so they'll ensure he's dispatched early on. Both squads haven’t been afraid of working frequently on the front of the peloton, but they must retain the resources to chase down a breakaway. Alternatively, they could throw</span><span> their leaders into the breakaway, though this would give the teams less control.</span></p>\n<p><span>EF Education - Nippo lost their GC leader Hugh Carthy early on. However, they quickly refocused on stage victories, and </span><b>Magnus Cort</b><span> has been one of the best at doing just that at La Vuelta in recent times. He’s won two stages this year in varying scenarios. The versatile Dane would need to reuse</span><span> the skills he demonstrated when winning stage 12: climbing and sprinting. Cort will be able to cope with the early climbs, and afterwards, he’d be one of the fastest riders remaining.</span></p>\n<p><span>If a dangerous, large breakaway does escape, they have a good chance of going to the line. There’s no reason for the GC teams to chase, so only those with a sprinter present after the climbs — of which they’ll be very few — would chase a large breakaway.</span></p>\n<p><span>Deceuninck-Quick Step boast numerous options aside from Jakobsen. </span><b>Andrea Bagioli</b><span> demonstrated his sprinting prowess when he was second to Magnus Cort in Córdoba. The 22-year-old’s skillset is ever expanding, so don’t be surprised to see him to the fore. </span><b>Mauri Vansevenant</b><span> may try his luck too — he sprinted to second on stage 10.</span></p>\n<p><span>The Spanish ProTeams have been ever present in the breakaway throughout. Burgos-BH’s </span><b>Jetse Bol</b><span> has joined the breakaway at every opportunity. The Dutchman can climb fairly well and has demonstrated a turn of speed previously. The same can be said of Euskaltel - Euskadi’s </span><b>Antonio Jesús Soto,</b><span> who has finished in the top ten three times at his debut Grand Tour.</span></p>\n<p><span>Other riders to keep an eye on from the breakaway include </span><b>Andreas Kron, Lilian Calmejane, Ryan Gibbons, Nico Denz, Rui Oliveira </b><span>and </span><b>Stan Dewulf.</b></p>\n<p><i><span>Cover image: Stuart Franklin/Getty Images</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e18c38e44bce63a8c43c787f00a6980e66355c3a1767f6af0aa813a8199f32a6","category":"Cycling"}