{"title":"The time of tubulars is coming to an end","link":"https://cyclingtips.com/2021/04/the-time-of-tubulars-is-coming-to-an-end/","date":1619572335000,"content":"<p>Tubular bicycle tires were invented all the way back in 1888. They’ve had one heck of a good run since then, but after several false alarms, it genuinely feels like their glory days are over this time around. Now that even top-tier pro racers and teams are starting to abandon them in larger numbers — and now that most wheel brands are no longer committing any resources to them — it seems clear that tubulars will soon be relegated to the parts bins of traditionally minded connoisseurs and cyclocross racers, never to regain their lofty status.</p>\n\n\n\n<p>We’ve reached the end of an era. Probably.</p>\n\n\n\n<h2>The exodus</h2>\n\n\n\n<p>It started innocently enough. </p>\n\n\n\n<p><a href=\"https://www.bicyclerollingresistance.com/\" target=\"_blank\">Independent tire rolling resistance tests</a> have been dominated in recent years by tubeless (and even tube-type) clinchers. Given the reluctance of pro road racers to give up the security of tires that are glued onto the rim, though, it makes sense that the first discipline to make the switch was time trials. Every bit of additional speed is as good as gold there — sometimes literally — and there isn’t as much risk of a puncture given the swept roads and shorter courses. One of the earliest proponents of clinchers in top-level competition was Tony Martin, who famously won the 2011 men’s time trial world championship on Continental clinchers. As far as I can tell, he’s continued the practice ever since. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/The-end-of-tubulars-2-1340x754.jpg\" /><figcaption>Time trials have long been a prime proving ground for fast-rolling clinchers, and it continues to be a discipline where companies are dedicating development resources.</figcaption></figure>\n\n\n\n<p>Time trial specialists aren’t the only ones interested in “free” speed, however. After all, why wouldn’t other racers want to go faster everywhere else, too? Although Martin’s earlier experiences with clinchers in time trial races were decidedly mixed in terms of reliability (he flatted during both time trial stages at the 2012 Tour de France, for example), tire technology has improved since then, and so, too, has the adoption of clinchers in road stages.</p>\n\n\n\n<p>2019 was <a href=\"https://cyclingtips.com/2019/05/less-resistance-with-each-worldtour-win-tubeless-tires-gain-acceptance/\" target=\"_blank\">quite the turning point</a> in that respect. Fabio Jakobsen (Deceuninck-QuickStep) won a stage of the Tour of California that year on Specialized tubeless clinchers, and Alexander Kristoff (UAE-Team Emirates) won Gent-Wevelgem on tubeless Vittorias. Several Specialized-sponsored riders also raced stages of the <a href=\"https://cyclingtips.com/2019/07/specialized-s-works-turbo-rapidair-tubeless-tire-unveiled/\" target=\"_blank\">Tour de France on tubeless clinchers</a> later that same season, and both the UAE-Team Emirates and EF Education First teams both apparently followed suit at the Tour de France in 2020, the latter even running <a href=\"https://cyclingtips.com/2020/09/2020-tour-de-france-tech-inside-efs-tubeless-tire-foam-party/\" target=\"_blank\">prototype foam inserts from Vittoria</a>. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/The-end-of-tubulars-3-1340x754.jpg\" /><figcaption>Tubeless clinchers have been seeing a lot of action at major road events in recent years, too.</figcaption></figure>\n\n\n\n<p>Roval — the separate wheel brand of Specialized — recently made a curious about-face on the tubeless front with the unexpected announcement that its latest road wheels were <a href=\"https://cyclingtips.com/2020/09/specialized-and-roval-have-stopped-investing-in-tubulars-heres-why/\" target=\"_blank\">not tubeless-compatible</a>, but that doesn’t seem to have slowed things down much. Just a few weeks ago, Deceuninck-QuickStep rider Kasper Asgreen won the Tour of Flanders on clinchers — <a href=\"https://cyclingtips.com/2021/04/the-tour-of-flanders-was-won-on-tubed-clinchers/\" target=\"_blank\">with a latex tube inside</a> — and just before that, Trek-Segafredo rider Jasper Stuyven won Milan-San Remo <a href=\"https://cyclingtips.com/2021/04/bontrager-announces-next-generation-of-aeolus-rsl-superwide-aero-road-wheels/\" target=\"_blank\">on Bontrager’s new tubeless Aeolus RSL</a> wheels (well, at least one of them; he flatted his front and finished on a spare tubular). </p>\n\n\n\n<p>With much of the season still remaining, it seems likely we’ll see more of the same in the months ahead.</p>\n\n\n\n<p>And those are only the successes we know about for sure.</p>\n\n\n\n<h2>The nays have it</h2>\n\n\n\n<p>Cynics will undoubtedly say that these changes aren’t the result of rider preferences, but rather the demands of equipment sponsors. After all, it’s perhaps a bit too much of a coincidence, for example, that Specialized-sponsored riders just happened to find some success with tubeless clinchers when the company was pushing the technology the hardest, and then started campaigning for tube-type clinchers after Roval’s latest crop of curiously non-tubeless clincher race wheels were released. </p>\n\n\n\n<p>There may very well be an element to that, of course, but that doesn’t change the test numbers, which still say that tubulars are slower. Perhaps more importantly, even if pro riders still have a quiet preference for tubulars, there’s now so much less support for the technology in the amateur ranks that most companies can’t justify setting aside engineering costs to continue developing a technology that will mostly just be given away to sponsored teams and athletes.</p>\n\n\n\n<p>The whole “race on Sunday, sell on Monday” thing might work in the automotive world, but bike companies are increasingly resistant — and rightfully so — to throwing development resources at stuff almost no one is buying.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/The-end-of-tubulars-5-1340x754.jpg\" /><figcaption>Continental is arguably the most highly sought-after brand of tubular tires in the pro ranks, and so it perhaps shouldn’t be a surprise to hear that the German company hasn’t seen a decline in demand.</figcaption></figure>\n\n\n\n<p>Not every wheel company is abandoning tubulars entirely, of course, but so far, the list of brands that have openly stated they’ve ceased continuing development of tubular wheels includes heavy-hitters like Zipp, Enve, Bontrager, Roval, <a href=\"https://cyclingtips.com/2021/04/campagnolo-debuts-new-bora-ultra-wto-flagship-aero-road-racing-wheels/\" target=\"_blank\">and even Campagnolo</a>. Mavic still offers tubulars, although the company doesn’t have quite the stature it once did, and while Shimano hasn’t announced its next generation of wheels, product manager Jessie Gascon told CyclingTips that “as long as there are requests from our sponsored race teams, we will support [them] with tubular wheel production.”</p>\n\n\n\n<p>When it comes to the bulk of the bell curve in the consumer market, there’s not a whole lot of debate.</p>\n\n\n\n<p>“Sales of tubular wheels have decreased an average of 45% every year since 2016,” said Zipp product manager Bastien Donzé. “Looking at the past 12 months, [tubular] sales this year are only 8% of what they were five years ago. In those conditions, and given the trend, we will continue to examine where the market takes us. At this point, we are confident there are superior wheel and tire technologies available and so new projects for tubular wheels will be challenged.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/The-end-of-tubulars-6-1340x754.jpg\" /><figcaption>It wasn’t long ago that virtually every high-end carbon road racing wheel was offered in a tubular version, but those days are seemingly over.</figcaption></figure>\n\n\n\n<p>It’s a similar story at Enve.</p>\n\n\n\n<p>“In Q4 of last year, we communicated to our channel partners that we’d be discontinuing tubulars at a commercial level, which means we aren’t trying to sell more,” said Enve VP of product and brand Jake Pantone. “The reality is that our demand for clinchers takes up all of our current capacity. Of all the tubulars we made in 2019 and 2020, something like 80% were for sponsorship and/or other low-to-no-margin business. We continue to make tubulars for our sponsored athletes and teams where needed. We have molds to support sponsorship and warranty, but we aren’t actively promoting their sell.</p>\n\n\n\n<p>“My personal opinion is that tubulars have no future given how good tubeless rim/tire technology is. We are even seeing our professional athletes embrace tubeless; triathletes did years ago. While the WorldTour road racers aren’t quite ready to abandon the tubular, they are testing tubeless and having great results with it.”</p>\n\n\n\n<h2>Hanging on by a thread</h2>\n\n\n\n<p>People have predicted the fall of tubulars several times before — British magazine Cyclist penned <a href=\"https://www.cyclist.co.uk/in-depth/1331/are-tubular-tyres-dead\" target=\"_blank\">this editorial</a> in 2016, for example — but it’s only recently that we’ve seen such a widespread departure from tubulars.</p>\n\n\n\n<p>Boutique labels like Lightweight and AX-Lightness still cater heavily to the weight-weenie crowd, of course, but those are niche brands that service relatively tiny market shares almost by definition. In the mainstream market, it’s clear that the majority of brands are going all-in on tubeless and tube-type clinchers. Tubular wheels will continue to be around for a while, but the technology gap will only grow wider as legacy tubular product gets progressively older.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/The-end-of-tubulars-7-1340x754.jpg\" /><figcaption>Teams once consumed this stuff in bulk, but tubular cement is gradually being replaced with tubeless sealant instead.</figcaption></figure>\n\n\n\n<p>The only high-end road tubular wheel in the Bontrager range is the Aeolus RSL 37, which sponsored teams will likely continue to prefer for big mountain stages. Zipp has also committed to offering tubular versions of its 303 Firecrest and 454 NSW for cyclocross and road, and the 404 and 808 Firecrest for the track, “for as long as the market and our race teams require them.” </p>\n\n\n\n<p>Roval still has its older wheels in tubular form if/when racers want them, too, but the picture for tubulars is decidedly bleaker over at Enve. You can still get a carbon tubular rim that says Enve on it, but you have to know to ask for it; it’s not even listed on the company web site.</p>\n\n\n\n<p>Nevertheless, not every company is quite so resigned to tubulars’ apparent demise. One notable outlier is Continental, whose tubular tires have seemingly been the most popular in the pro peloton, even among teams that aren’t officially sponsored by the German company.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/The-end-of-tubulars-8-1340x754.jpg\" /><figcaption>Will this be another lost art in the years ahead?</figcaption></figure>\n\n\n\n<p>“From a technical point of view, clinchers or tubeless offer the lower end of rolling resistance where the tubulars just miss out and can’t get any faster,” said Continental product manager Jan-Niklas Jünger. “But nevertheless, the system weight is currently still better with a tubular setup. Rolling resistance can’t come down as drastically because there are several layers in the tubular that absorb energy (tread, puncture protection, carcass, tube, inner tape, glue) whereas the tubeless tire only has tread, puncture protection, and carcass.</p>\n\n\n\n<p>“The major benefit with tubeless at the moment is the lower pressure ranges that offer better damping on anything that is not perfectly smooth without the risk of pinch flat.</p>\n\n\n\n<p>“Nevertheless, the real change with teams is the industry interest to produce and sell more clincher/tubeless wheels as there is a larger end consumer group – but probably that is not what the wheel industry publishes. What I can say from Continental is, even though one might think tubular sales have gone down drastically the last years, we feel different. A lot of competition has left the playground and we are happy to have a very stable business with tubular. Actually, as with all tires since the COVID crisis, sales have gone up.”</p>\n\n\n\n<h2>Lingering hurdles</h2>\n\n\n\n<p>Even if the trend toward high-end tubeless and tube-type clinchers continues, it’s important to remember that tubulars are still more popular overall in top-tier road racing, even if only for the added security they provide in the event of a puncture.</p>\n\n\n\n<p>There are handful of other persistent advantages that tubulars continue to hold, too.</p>\n\n\n\n<p>High-end tube-type and tubeless clinchers have the advantage over tubulars in terms of rolling resistance, but as Jünger pointed out, sew-ups still have the undisputed edge when it comes to weight. As a result, it’s unlikely we’ll see them completely abandoned any time soon, especially for climbing specialists and events that have an unusual amount (or intensity) of elevation gain. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/The-end-of-tubulars-9-1340x754.jpg\" /><figcaption>As much as tubeless and tube-type clinchers are making inroads in the pro ranks, tubulars are still more popular overall.</figcaption></figure>\n\n\n\n<p>There’s also the fact that tubulars provide a distinctive ride quality, along with the cornering performance afforded by that oh-so-round cross-section.</p>\n\n\n\n<p>For cyclocross, even the best tubeless clinchers can’t come close to the performance of boutique cotton-casing tubulars in those low-traction situations — not to mention the fact tubeless can’t provide nearly the same level of security as tubulars at those sorts of ultra-low pressures. And when it comes to the track, it’s clinchers that are very much the rare beast there, not tubulars. </p>\n\n\n\n<p>Outside of those niche situations, though, it seems pretty clear that tubulars’ days are numbered, and even that day of weight parity may come sooner than later. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/The-end-of-tubulars-10-1340x754.jpg\" /><figcaption>Tubulars are still overwhelmingly preferred for top-tier cyclocross racing, and that seems unlikely to change. Tubeless clinchers just don’t perform as well at the ultra-low pressures required here.</figcaption></figure>\n\n\n\n<p>Wheel weights for tubeless clinchers have already been dropping precipitously, particularly as hookless formats become increasingly popular. Zipp’s new 45 mm-deep <a href=\"https://cyclingtips.com/2021/04/zipp-new-353-nsw-wheelset/\" target=\"_blank\">353 NSW</a> reportedly tips the scales at a scant 1,255 grams for the set, while the 33 mm-deep <a href=\"https://cyclingtips.com/2020/06/roval-ditches-tubeless-with-its-new-rapide-and-alpinist-clx-wheels/\" target=\"_blank\">Roval Alpinist CLX</a> is just 1,248 grams. It wasn’t long ago that we’d only associate numbers like that with rim-brake carbon tubulars, and keep in mind that these aren’t even just clinchers-vs-tubulars we’re talking about, either; both of those are disc-brake wheels, too. If you venture outside of mainstream brands, you can go even lighter yet.</p>\n\n\n\n<p>It was only quite recently that Silca owner <a href=\"https://cyclingtips.com/2019/04/predictions-worldtour-tech-five-years-from-now/\" target=\"_blank\">Josh Poertner predicted</a> that “95% of the teams will have probably moved over to tubeless” by 2024. When he uttered those words in 2019, many naysayers thought he was nuts, but two years later, who’s laughing now? If anything, we may be moving that timeline further forward.</p>\n\n\n\n<p>“The question is pretty challenging as the use of tubeless is influenced by the wheel system as a whole,” said Vittoria product specialist Tommaso Cappella. “Since the tubeless rim is heavier than a tubular one, most of the riders prefer to go tubeless on flat courses or where the elevation is less relevant than the speed. A couple of WorldTour teams aim for going 100% tubeless in the future, but for the time being, in one racing season, I would roughly count one third of races on tubeless. If the wheel weight will drop, we will see the tubeless becoming more common than tubular.</p>\n\n\n\n<p>“Maybe we are not so far off.”</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/04/the-time-of-tubulars-is-coming-to-an-end/\">The time of tubulars is coming to an end</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e192f02cf26d68af1625c5b0e2ac3f2920f760596d700fa65c2a1cdfed3ae843","category":"Cycling"}