{"title":"Rocket Report: Iran launches satellite; Artemis II boosters get train ride","link":"https://arstechnica.com/?p=1972044","date":1695985223000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/MAF_20230921_CS2_4EnginesInstalled_02-2048x1365-1-800x533.jpg\" alt=\"All four RS-25 main engines are now installed the core stage for the Artemis II mission.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/MAF_20230921_CS2_4EnginesInstalled_02-2048x1365-1.jpg\">Enlarge</a> <span>/</span> All four RS-25 main engines are now installed the core stage for the Artemis II mission. </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 6.13 of the Rocket Report! While SpaceX waits for regulatory approval to launch the second full-scale test flight of its Super Heavy booster and Starship rocket, NASA's contractors took two steps forward this week to prepare for the second launch of the government-owned Space Launch System on the Artemis II mission, which will send a team of four astronauts around the far side of the Moon. This launch is still more than a year away. How many Starship test flights will SpaceX launch before Artemis II? Will Blue Origin's New Glenn be flying by then?</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets, as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><b>Iran has launched a small satellite</b>. Iran's Islamic Revolutionary Guard Corps successfully launched a small satellite named Noor 3 into orbit Wednesday, <a href=\"https://www.reuters.com/world/middle-east/iran-says-it-successfully-launched-nour-3-satellite-tasnim-2023-09-27/\">Reuters reported</a>. This military satellite launched aboard a Qased rocket, a small launch vehicle powered by a liquid-fueled booster stage. The Qased, which means \"messenger\" in Persian, is reportedly capable of carrying a payload up to about 100 pounds (45 kilograms) into low-Earth orbit. Publicly available US military tracking data indicated the rocket deployed the Noor 3 satellite into an orbit about 280 miles (450 kilometers) above Earth.</p></div><p><a href=\"https://arstechnica.com/?p=1972044#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1972044&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e19be600726773346c1441c2757162fb9772209a11144beb8616edbbf82cf7a9","category":"Tech"}