{"title":"iPhone 12 vs iPhone 13: Is the latest model worth $100 extra?","link":"https://www.macworld.com/article/538617/iphone-12-vs-iphone-13-design-display-camera-specs.html","date":1632824100000,"content":"<div>\n<section><div></div></section><p>Every year, we test, benchmark, and analyze Apple’s latest phones to complete the following sentence: The iPhone [insert version number here] is the model that is deemed the one for most people, offered in a size that’s popular, with a satisfying feature set, and a price that meets most budgets. </p>\n\n\n\n<p>The iPhone 13 would normally be the phone that sits at that spot. The iPhone 13 offers a great set of features for $799, but the iPhone 12 is still a very good phone for $100 less, particularly if you don’t need the newest features. Let’s take a look at the major components of the iPhone 12 and iPhone 13 and how they compare.</p>\n\n\n\n<h2>iPhone 12 vs iPhone 13: Specs</h2>\n\n\n\n<figure><table><thead><tr><th></th><th>iPhone 12</th><th>iPhone 13</th></tr></thead><tbody><tr><td>Display</td><td>6.1 inch Super Retina XDR OLED<br />2532×1170-pixel resolution at 460 ppi</td><td>6.1 inch Super Retina XDR OLED<br />2532×1170-pixel resolution at 460 ppi</td></tr><tr><td>Dimensions</td><td>5.78 in x 2.82 in x 0.29 in</td><td>5.78 in x 2.82 in x 0.30 in</td></tr><tr><td>Weight</td><td>5.78 oz</td><td>6.14 oz</td></tr><tr><td>Colors</td><td>Black, Blue, Green, Product(RED), Purple, White</td><td>Blue, Midnight, Pink, Product(RED), Starlight</td></tr><tr><td>Processor</td><td>A14 Bionic</td><td>A15 Bionic</td></tr><tr><td>Storage</td><td>64GB/128GB/256GB</td><td>128GB/256GB/512GB</td></tr><tr><td>Rear Camera</td><td>Dual 12MP<br />Wide: ƒ/1.6 aperture<br />Ultra Wide: ƒ/2.4 aperture<br />Optical image stabilization<br />Smart HDR 3 for photos</td><td>Dual 12MP<br />Wide: ƒ/1.6 aperture<br />Ultra Wide: ƒ/2.4 aperture<br />Sensor-shift optical image stabilization<br />Smart HDR 4 for photos</td></tr><tr><td>Front Camera</td><td>12MP TrueDepth<br />f/2.2 aperture<br />Smart HDR 3 for photos</td><td>12MP TrueDepth<br />f/2.2 aperture<br />Cinematic mode for videos<br />Smart HDR 4 for photos</td></tr><tr><td>Video Recording</td><td>4K video recording at 24 fps, 30 fps or 60 fps<br />HDR Dolby Vision up to 30fps</td><td>4K video recording at 24 fps, 30 fps or 60 fps<br />HDR Dolby Vision up to 60fps<br />Cinematic Mode</td></tr><tr><td>Biometric Security</td><td>Face ID</td><td>Face ID</td></tr><tr><td>Connectivity</td><td>Wi-Fi 6<br />5G LTE<br />Bluetooth 5.0<br />Lightning</td><td>Wi-Fi 6<br />5G LTE<br />Bluetooth 5.0<br />Lightning</td></tr><tr><td>Wireless Charging</td><td>MagSafe, Qi</td><td>MagSafe, Qi</td></tr><tr><td>Waterproofing</td><td>IP68</td><td>IP68</td></tr><tr><td>SIM</td><td>Dual SIM (nano and eSim)<br /></td><td>Dual SIM (nano and eSim)<br />Dual eSIM</td></tr><tr><td>Battery Life</td><td>17 hours video playback</td><td>19 hours video playback</td></tr><tr><td>Price</td><td>$699/$749/$849</td><td>$799/$899/$1,099</td></tr></tbody></table></figure><h2>iPhone 12 vs iPhone 13: Design and colors</h2>\n\n\n\n<p>At first glance, you may not be able to tell the difference between the iPhone 12 and iPhone 13. They feature the same flat-edge design and the only difference in dimensions is that the iPhone 13 is a little thicker.</p>\n\n\n\n<p>There are three major differences you will notice:</p>\n\n\n\n<ul><li>The two lenses on the rear camera bump are vertical on the iPhone 12. On the iPhone 13, they’re diagonal.</li><li>The iPhone 13 weighs a smidge heavier (7.2 ounces vs 6.7 ounces).</li><li>The color offerings are different. Even two colors that have the same name on both models—blue and Product(RED)—are different shades.</li></ul><p>You’ll also notice that the buttons on the iPhone 13 are shifted just a tad lower than on the iPhone 12. That might take some getting used to, but more importantly, it means that an iPhone 12 case won’t fit properly on the iPhone 13.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone-12-ipgone-13-colors.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Six colors are available for the iPhone 12 (left group), while the iPhone 13 is available in five.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p><strong>Our pick:</strong> The design differences aren’t much to sway you one way or another. The lens placement is a non-issue, the extra weight on the iPhone 13 isn’t enough to influence a decision. It could come down to what color you prefer and the color palettes for each phone are different—but if you put a case on the iPhone, you may not care about the phone’s color.</p>\n\n\n\n<h2>iPhone 12 vs iPhone 13: Display</h2>\n\n\n\n<p>Both the iPhone 12 and iPhone 13 have a 6.1-inch Super Retina XDR display with a 2532×1170 pixel resolution at 460 ppi, a 2,000,000:1 contrast ratio, True Tone, and P3 color support. One difference is that the iPhone 13 is 28 percent brighter, with a typical max brightness of 800 nits, while the iPhone 12 is rated at 625 nits. Both phones have an HDR maximum brightness of 1,200 nits.</p>\n\n\n\n<p>The biggest visual change is that iPhone 13 has a smaller notch, allowing more screen to be displayed up top. However, since Apple hasn’t taken advantage of this in iOS 15, it’s somewhat dead space and doesn’t really add anything to the iOS experience.</p>\n\n\n\n<p><strong>Our take:</strong> If you are often in a situation where you have difficulty seeing the screen in an environment with bright lights, consider the iPhone 13. While its brighter screen will be easier to see in those situations, the iPhone 12’s screen is still more than adequate for everyday use. And since Apple hasn’t done anything (yet) with iOS and the iPhone 13 to take advantage of the additional screen space created by the smaller notch, you’re not gaining much there either.</p>\n\n\n\n<h2>iPhone 12 vs iPhone 13: Cameras</h2>\n\n\n\n<p>Here is where the iPhone 13 has a few differences that could sway your decision. Users who take their photos and videos very seriously could be persuaded by the new camera features.</p>\n\n\n\n<p>The reason the iPhone 13’s rear camera lenses are now diagonal is so that Apple can fit a sensor-shift optical image stabilization system in there. It improves upon the standard optical image stabilization that is in the iPhone 12. The main specs for the rear camera on the two phones are the same—12MP Wide (ƒ/1.6 aperture) and Ultra Wide (ƒ/2.4 aperture)—but the main camera has a larger sensor for better low-light performance. The front cameras have the same specs (12MP, ƒ/2.2 aperture), but the iPhone 13’s selfie cam has support for the new iPhone 13 features.</p>\n\n\n\n<p>The iPhone 13 now features what Apple calls Photographic Styles, which can change color tones without affecting skin tones. You can apply a style called Rich Contrast, and the shadows in a photo darken and colors become deeper. The Vibrant style makes photos brighter, while the Warm style increases golden tones, and the Cool style emphasizes blue colors.</p>\n\n\n\n<p>A key new video feature is Cinematic mode, which creates a shallow depth of field—the person remains in focus while the background is blurred. You can shift the focus from one person to another, and you can even edit the effect on the iPhone to adjust the blur or change the focus. Cinematic mode works at 1080p at 30 fps.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone-13-cinematic-mode.jpg?quality=50&amp;strip=all\" /><figcaption>The iPhone 13’s Cinematic mode works on video recorded at 1080p at 30 fps.</figcaption></figure><p>Apple</p></div>\n\n\n\n<p><strong>Our pick:</strong> For users who make the cameras the top priority, the iPhone 13 is the way to go. The cameras are better and the new features are great for content creators who want to do more with their photos and videos. However, if your use case is more about snapshots and short video clips, you’ll find a great camera in the iPhone 12.</p>\n\n\n\n<h2>iPhone 12 vs iPhone 13: Battery life</h2>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://app.clickdimensions.com/blob/chemtreccom-aczvc/files/apis_bpisreportupdated20210916.pdf?1631813744835&amp;xcust=1-1-538617-1-0-0&amp;sref=https://www.macworld.com/feed\">information</a> provided by Apple to Chemtrec, the iPhone 13’s battery is listed with a capacity of 12.41 watt hours, compared to the iPhone 12’s 10.78Wh, a 15 percent increase. Apple’s specifications state that the iPhone 13 offers 19 hours of video playback (a 2-hour increase over the iPhone 12), 15 hours of streamed video (4 hours more), and 75 hours of audio playback (10 hours more). In our testing, the iPhone 12 lasted roughly eight and a half hours, a little more than an hour longer than the iPhone 12. In real-world use, it means it’ll easily last a full day and then some—but the iPhone 12 didn’t really struggle in that department.</p>\n\n\n\n<p>Both iPhones are compatible with MagSafe and Qi wireless charging. If you use a 20W or higher charger, both phones can add up to a 50 percent charge in 30 minutes.</p>\n\n\n\n<p><strong>Our pick:</strong> The battery life was already good even before the iPhone 12, and either phone is quite capable of getting you through a day and more. If you make frequent use of the phone as a tool for work or your personal projects, the bigger battery in the iPhone 13 is more reassuring.</p>\n\n\n\n<h2>iPhone 12 vs iPhone 13: Processor</h2>\n\n\n\n<p>Apple did an interesting thing when it talked about the iPhone 13’s processor: it compared the new A15 Bionic’s performance to “the competition” instead of to the iPhone 12’s A14 Bionic. The is probably because it can make greater claims against the competition, while comparisons to the A14 Bionic may not be as significant in Apple’s view. We’ve done <a href=\"https://www.macworld.com/article/358585/a15-processor-iphone-13-ipad-mini-performance-benchmarks.html\">our own testing</a> of the A15 chip in the iPhone 13 and it shows a modest 11 percent boost over the A14 Bionic in the iPhone 12. Our review of the iPhone 13 Pro also shows a small but noticeable boost.</p>\n\n\n\n<p>The A15 Bionic, like the A14 Bionic it replaces, has 6 CPU cores (2 performance cores and 4 efficiency cores), a 4-core GPU, and a 16-core Neural Engine. That’s one less GPU core than in the iPhone 13 Pro, but shouldn’t make much of a difference in anything other than high-end games and apps.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/apple-A15-chip.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The iPhone 13’s A15 Bionic offers a good boost over its predecessor, but you may not notice a difference if you already have an iPhone 12.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p><strong>Our pick:</strong> While the geeks among us nitpick at CPU performance, the truth of the matter is that for several generations now, the iPhone has been more than fast enough to handle everyday use—social media access, camera use, web browsing, instant messaging, video calls, and more. The iPhone 12 is plenty fast for these tasks as well as more heavy-duty tasks, like processing edited video and games. On the other hand, if the iPhone is a key part of your work—professional video, audio, and image production, for example—you can never have enough speed, and the iPhone 13 helps satisfy your needs.</p>\n\n\n\n<h2>iPhone 12 vs iPhone 13: Conclusion</h2>\n\n\n\n<p>With the iPhone 13, the standard-model iPhone is a lot closer to being a pro-level tool than ever before. With new camera features, improved image stabilization, and Cinematic mode, creative users have more to work with and get more avenues of expression. And the battery and CPU are buff enough to handle all that work.</p>\n\n\n\n<p>But the iPhone 12 is still a great phone, and if your use case is more basic, it’s the better fit. Its A14 Bionic is plenty fast, so don’t worry about it being outdated, and if you’re upgrading from a much older iPhone, you’re still getting a significant jump in performance. It’s also $100 to $150 cheaper than the iPhone 13, so you’re getting a truly great deal. Unless you need the very latest—and if so, you’ve probably bought the iPhone 13 Pro already—we think the iPhone 12 is a solid choice.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e19d1dd6873849a208fa26e95c8390cc8842ad450181f339f07b8db03c165941","category":"Apple"}