{"title":"This is what our Milky Way galaxy looks like when viewed with neutrinos","link":"https://arstechnica.com/?p=1950909","date":1688063549000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/cube1CROP-800x535.jpg\" alt=\"An artist’s composition of the Milky Way seen with a neutrino lens (blue).\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/cube1CROP.jpg\">Enlarge</a> <span>/</span> An artist’s composition of the Milky Way seen with a neutrino lens (blue). (credit: IceCube Collaboration/NSF/ESO)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Scientists with the <a href=\"https://icecube.wisc.edu/collaboration/institutions/\">IceCube Neutrino Observatory</a> have unveiled a striking new image of our Milky Way galaxy as seen by ghost-like messenger particles called neutrinos. This new analysis—announced at a Drexel University event today, with <a href=\"http://www.science.org/doi/10.1126/science.adc9818\">a paper</a> being published in the journal Science tomorrow—offers the strongest evidence to date that the Milky Way is a source of high-energy neutrinos, shedding more light on the origin of high-energy cosmic rays.</p>\n<p>\"I remember saying, 'At this point in human history, we're the first ones to see our galaxy in anything other than light,'\" <a href=\"https://new.nsf.gov/science-matters/first-ghost-particle-image-milky-way-galaxy\">said Drexel University physicist and IceCube member Naoko Kurahashi Neilson</a> of the moment she and two graduate students first examined the image. “Observing our own galaxy for the first time using particles instead of light is a huge step. As neutrino astronomy evolves, we will get a new lens with which to observe the universe.”</p>\n<p>As <a href=\"https://arstechnica.com/science/2022/11/squid-galaxy-may-be-a-cosmic-accelerator-for-high-energy-cosmic-rays/\">previously reported</a>, ever since French physicist Pierre Auger proposed <a href=\"https://journals.aps.org/rmp/abstract/10.1103/RevModPhys.11.288\">in 1939</a> that <a href=\"https://en.wikipedia.org/wiki/Cosmic_ray\">cosmic rays</a> must carry incredible amounts of energy, scientists have puzzled over what produces these powerful clusters of protons and neutrons raining down into Earth's atmosphere. One way to identify the sources is to backtrack the paths that high-energy cosmic neutrinos traveled on their way to Earth since they are created by cosmic rays colliding with matter or radiation, producing particles that then decay into neutrinos and gamma rays.</p></div><p><a href=\"https://arstechnica.com/?p=1950909#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1950909&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e1a00a9c4d574bda3b51d8319e4df0c9fdcbbe088e96a9ba4824735fa3546024","category":"Tech"}