{"title":"AWS Week in Review – January 30, 2023","link":"https://aws.amazon.com/blogs/aws/aws-week-in-review-january-30-2023/","date":1675104668000,"content":"<p>This week’s review post comes to you from the road, having just wrapped up sponsorship of NDC London. While there we got to speak to many .NET developers, both new and experienced with AWS, and all eager to learn more. Thanks to everyone who stopped by our expo booth to chat or ask questions to the team!</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/01/29/NDCLondon1.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/01/29/NDCLondon1.png\" alt=\".NET on AWS booth, NDC London 2023\" width=\"400\" height=\"300\" /></a><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/01/29/NDCLondon2.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/01/29/NDCLondon2.png\" alt=\".NET on AWS booth, NDC London 2023\" width=\"225\" height=\"300\" /></a></p> \n<p><span><strong>Last Week’s Launches</strong></span><br />My team will be back on the road to our next events soon, but first, here are just some launches that caught my attention while I was at the expo booth last week:</p> \n<p><strong>General availability of Porting Advisor for Graviton:</strong> <a href=\"https://aws.amazon.com/ec2/graviton/\">AWS Graviton2</a> processors are custom designed, Arm64, processors, that deliver increased price performance over comparable x86-64 processors. They’re suitable for a wide range of compute workloads on <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> including application servers, microservices, high-performance computing (HPC), CPU-based ML inference, gaming, any many more. They’re also available in other AWS services such as <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a>, <a href=\"https://aws.amazon.com/fargate/\">AWS Fargate</a>, to name just a few. <a href=\"https://aws.amazon.com/about-aws/whats-new/2023/01/porting-advisor-graviton/\" target=\"_blank\">The new Porting Advisor for Graviton</a> is a freely available, open-source command line tool for analyzing compatibility of applications you want to run on Graviton-based compute environments. It provides a report that highlights missing or outdated libraries, and code, that you may need to update in order to port your application to run on Graviton processors.</p> \n<p><strong>Runtime management controls for AWS Lambda:</strong> Automated feature updates, performance improvements, and security patches to runtime environments for Lambda functions is popular with many customers. However, some customers have asked for increased visibility into when these updates occur, and control over when they’re applied. The new runtime management controls for Lambda provide optional capabilities for those customers that require more control over runtime changes. The new controls are optional; by default, all your Lambda functions will continue to receive automatic updates. But, if you wish, you can now apply a runtime management configuration with your functions that specifies how you want updates to be applied. <a href=\"https://aws.amazon.com/blogs/compute/introducing-aws-lambda-runtime-management-controls/\" target=\"_blank\">You can find full details on the new runtime management controls in this blog post on the AWS Compute Blog</a>.</p> \n<p><strong>General availability of Amazon OpenSearch Serverless:</strong> <a href=\"https://aws.amazon.com/opensearch-service/features/serverless/\" target=\"_blank\">OpenSearch Serverless</a> was one of the livestream segments in the recent <a href=\"https://aws.amazon.com/developer/community/live-video/aws-on-air/\" target=\"_blank\">AWS on Air</a> re:Invent Recap of previews that were announced at the conference last December. <a href=\"https://aws.amazon.com/about-aws/whats-new/2023/01/amazon-opensearch-serverless-available/\" target=\"_blank\">OpenSearch Serverless is now generally available</a>. As a serverless option for <a href=\"https://aws.amazon.com/opensearch-service/\" target=\"_blank\">Amazon OpenSearch Service</a>, it removes the need to configure, manage, or scale OpenSearch clusters, offering automatic provisioning and scaling of resources to enable fast ingestion and query responses.</p> \n<p><span><strong>Additional connectors for Amazon AppFlow:</strong></span> At <a href=\"https://reinvent.awsevents.com/\">AWS re:Invent</a> 2023, <a href=\"https://aws.amazon.com/blogs/aws/announcing-additional-data-connectors-for-amazon-appflow/\" target=\"_blank\">I blogged about a release of new data connectors</a> enabling data transfer from a variety of Software-as-a-Service (SaaS) applications to <a href=\"https://aws.amazon.com/appflow/\">Amazon AppFlow</a>. An additional set of 10 connectors, enabling connectivity from Asana, Google Calendar, JDBC, PayPal, and more, are also now available. <a href=\"https://aws.amazon.com/about-aws/whats-new/2023/01/amazon-appflow-new-connectors/\" target=\"_blank\">Check out the full list of additional connectors launched this past week in this What’s New post</a>.</p> \n<p><span><strong>AWS open-source news and updates:</strong></span> As usual, there’s a new edition of the weekly open-source newsletter highlighting new open-source projects, tools, and demos from the AWS Community. <a href=\"https://dev.to/aws/aws-open-source-newsletter-143-go7\">Read edition #143 here</a>.</p> \n<a href=\"https://aws.amazon.com/new/\">For a full list of AWS announcements, be sure to keep an eye on the What's New at AWS page.</a> \n<p><span><strong>Upcoming AWS Events</strong></span><br />Check your calendars and sign up for these AWS events:</p> \n<p><strong>AWS Innovate Data and AI/ML edition:</strong> <a href=\"https://aws.amazon.com/events/innovate-online-conference/\" target=\"_blank\">AWS Innovate</a> is a free online event to learn the latest from AWS experts and get step-by-step guidance on using AI/ML to drive fast, efficient, and measurable results.</p> \n<ul> \n <li>AWS Innovate Data and AI/ML edition for Asia Pacific and Japan is taking place on February 22, 2023. <a href=\"https://aws.amazon.com/events/aws-innovate/apj/aiml-data/\" target=\"_blank\">Register here</a>.</li> \n <li>Registrations for AWS Innovate EMEA (March 9, 2023) and the Americas (March 14, 2023) will open soon. Check the <a href=\"https://aws.amazon.com/events/innovate-online-conference/\" target=\"_blank\">AWS Innovate page</a> for updates.</li> \n</ul> \n<p><a href=\"https://aws.amazon.com/events/explore-aws-events\" target=\"_blank\">You can find details on all upcoming events, in-person or virtual, here.</a></p> \n<p>And finally, if you’re a .NET developer, my team will be at <a href=\"https://swetugg.se/sthlm-2023\" target=\"_blank\">Swetugg, in Sweden, February 8-9</a>, and <a href=\"https://www.developerweek.com/\" target=\"_blank\">DeveloperWeek, Oakland, California, February 15-17</a>. If you’re in the vicinity at these events, be sure to stop by and say hello!</p> \n<p>That’s all for this week. Check back next Monday for another Week in Review!</p> \n<a href=\"https://aws.amazon.com/blogs/aws/tag/week-in-review/\">This post is part of our Week in Review series. Check back each week for a quick roundup of interesting news and announcements from AWS!</a>","author":"Steve Roberts","siteTitle":"AWS News Blog","siteHash":"117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"e1aa309d2d3d71bda2eba38e530d3459fa3272b10876c941de8c69","category":"Tech"}