{"title":"166 Effect of silo type on fermentation characteristics of laboratory-scale silage","link":"https://academic.oup.com/jas/article/102/Supplement_1/48/7618010?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Creating ensiled forage on a laboratory-scale is a tedious and cumbersome process. One must ensure an anaerobic environment for the success of the fermentation while also striving to replicate field-scale conditions. The objective of this experiment was to determine the effect of laboratory-scale silo type on nutritive value and fermentation profiles of grass-legume silage. This experiment was conducted as a generalized complete block design. There was one treatment factor (silo type) with 11 levels: field-scale baleage control (CON), miniature wrapped baleage (MINI), large fermentation bucket (6GAL), small fermentation bucket (2GAL), miniature silo (PVC), pint-sized Mason-type jar with “BurpLid” (BURP), pint-sized Mason-type jar with Ball-brand fermentation lid (BALL), pint-sized Mason-type jar with an airlock lid (LOCK), single-layered vacuum-sealed bag using a chamber-style sealer (CHMB), double-layered vacuum-sealed bag using a chamber-style sealer (HCHMB), single-layered vacuum-sealed bag using a suction-style sealer (FOOD), or double-layered vacuum-sealed bag using a suction-style sealer (HFOOD). Harvest served as the random blocking factor. Forage was harvested from a single alfalfa-bermudagrass pastures at the Wiregrass Research and Extension Center in Headland, AL. Forage was cut 24 h before collection and allowed to sun-cure. After allocation to treatment, samples were allowed to ferment for 56 d. Following fermentation, samples were assayed for NDF, ADF, ADL, CP, pH, mold, and yeast. Dunnett’s test revealed a difference (P &lt; 0.05) from CON for NDF, ADF, and pH. Samples from PVC had 26% greater NDF and 45% greater ADF than CON (58 and 37%, respectively). Samples from BALL were 3 units greater and samples from LOCK were 2 units greater in pH than CON (4.8). When comparing alternative treatments exclusive of CON, there were differences (P ≤ 0.01) in NDF, ADF, ADL, pH, and mold counts among treatments. Results are interpreted to mean that BALL and LOCK are not effective representatives of field-scale silage production due to lack of pH drop, while PVC alters the fiber profiles. All other methods showed promise as prospects for laboratory silage procedures.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e1af467f9a45dac8413353a8a478acba8108b8357ccff2c85d992ed9f9731b3d","category":"Environment"}