{"title":"Research on Students&rsquo; Utilization of Artificial Intelligence Based on Random Forest Model and PCA-K-means Algorithm","link":"https://www.preprints.org/manuscript/202407.1477/v1","date":1721285293000,"content":"This study delves into the impact of artificial intelligence on students’ learning.The paper pioneers the use of kmeans classification to reduce the dimensionality of features before the classification process, which minimizes redundant information and computational overhead. This step is not commonly found in prior research.Firstly, a random forest model is established with “whether AI assistance was used to complete the paper” as the output, and various features as inputs. The analysis of the predictive accuracy when changing input features reveals the degree of influence of each feature on using AI to complete the paper. After feature selection, the remaining 6 features can still effectively predict the use of AI to complete the paper, indicating the representativeness of the extracted indicators. Subsequently, the PCA-K-means algorithm is employed to classify the use of artificial intelligence. PCA algorithm is used for dimensionality reduction of the extracted features to better characterize students’ use of AI. Three representative variables are selected, and the contribution of each feature is computed based on the factor loading matrix. Finally, the K-means algorithm is used to classify students based on the three dimensional features, showing that students can be effectively classified into 2 categories. The results indicate that the majority of students support the use of AI technology to enhance their abilities, although some students may only intend to use AI to cope with exams and similar tasks.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e1afd3e8f6de2912d9c9053450fcd348459884a670045339b1c486e614cd78fb","category":"Interdisciplinary"}