{"title":"Grafana Labs, Rancher, Splunk, and Zscaler integrations expand Consul ecosystem","link":"https://www.hashicorp.com/blog/grafana-labs-rancher-splunk-and-zscaler-integrations-expand-consul-ecosystem","date":1678122000000,"content":"<p>The HashiCorp Consul ecosystem expanded with 13 new integrations, helping customers with improved observability, resilience, and security for their applications across any runtime platform and cloud. In March we also announced general availability for <a href=\"https://www.hashicorp.com/blog/consul-1-15-adds-envoy-extensions-and-enhances-access-logging\">Consul 1.15</a> which simplifies user onboarding, enhances troubleshooting workflows, and reduces operational complexity.</p>\n\n<p>In addition this quarter, HashiCorp completed a new <a href=\"https://developer.hashicorp.com/consul/tutorials/kubernetes/kubernetes-gke-google\">Consul Deployment Guide on Google Kubernetes Engine (GKE)</a>. </p>\n<img src=\"https://www.datocms-assets.com/2885/1677876721-consul_q4_logos.png\" alt=\"Consul\" /><p>Top IT industry players showed support for Consul with new integrations across our HCP Consul, Consul Enterprise, and Consul OSS solutions.</p>\n\n<h2>Circonus</h2>\n\n<p>The <a href=\"https://www.hashicorp.com/partners/tech/circonus#consul\">HCP Consul integration</a> with Circonus Observability monitors HCP Consul deployments with a plethora of Consul server, client, and Envoy metrics displayed via out-of-the-box dashboards built by Circonus.</p>\n\n<h2>Grafana Labs</h2>\n\n<p>Grafana Labs completed two integrations:</p>\n\n<p>The <a href=\"https://www.hashicorp.com/partners/tech/grafana-labs#consul\">HCP Consul observability integration with Grafana Cloud</a> decreases service mesh downtime of HCP Consul environments streaming Consul and Envoy environment metrics to Grafana via Prometheus.</p>\n\n<p>The <a href=\"https://www.hashicorp.com/partners/tech/grafana-labs#consul\">Consul observability with Grafana Cloud integration</a> which utilizes Grafana Cloud to monitor Consul and Envoy infrastructure, decreasing service disruption and mean-time-to-resolve (MTTR) via Grafana's Prometheus collector.</p>\n\n<h2>iLert</h2>\n\n<p>The <a href=\"https://www.hashicorp.com/partners/tech/ilert#consul\">HCP Consul integration with iLert</a> leverages HCP Consul's own leadership election and K/V store to provide automatic failover and seamless operation in the case of a consul-alerts node failure and ensures that your notifications are still sent.</p>\n\n<h2>Netdata</h2>\n\n<p>With both an <a href=\"https://www.netdata.cloud/consul-monitoring/\">HCP and Consul Enterprise integration with Netdata Cloud</a>, Consul operators can now quickly build and maintain complex distributed systems while maintaining optimal uptime in Consul service discovery networks.</p>\n\n<h2>Neustar Security Services</h2>\n\n<p>Operations personnel employing Neustar’s UltraDNS can now leverage Consul’s service catalog and two new UltraDNS Consul-Terraform-Sync modules for dynamically updating hosted <a href=\"https://github.com/ultradns/terraform-ultradns-cts\">DNS A, AAAA</a>, and <a href=\"https://github.com/ultradns/terraform-ultradns-cts/tree/master/modules/rd-pool\">RD-Pool records</a> as services within the Consul environment.</p>\n\n<h2>Rancher</h2>\n\n<p>The Consul platform integration with SUSE Rancher has been completed with its certification of the <a href=\"https://github.com/rancher/partner-charts/blob/main-source/charts/hashicorp/consul/README.md\">Consul on Kubernetes Helm chart</a>.</p>\n\n<h2>Splunk</h2>\n\n<p>The <a href=\"https://www.hashicorp.com/partners/tech/splunk#consul\">HCP Consul observability integration with Splunk Cloud</a> leverages Splunk's distribution of OpenTelemetry Collector to monitor HCP Consul environments, minimizing downtime and troubleshooting the cloud service meshes.</p>\n\n<h2>Zscaler</h2>\n\n<p>Zscaler completed three Consul Enterprise integrations:</p>\n\n<p>The <a href=\"https://www.hashicorp.com/partners/tech/zscaler#consul\">Consul-Terraform-Sync and Zscaler Private Access integration</a> leverages the Zscaler Private Access Consul-Terraform-Sync module to create and update application segments dynamically in the ZPA Cloud.</p>\n\n<p>The <a href=\"https://www.hashicorp.com/partners/tech/zscaler#consul\">Consul-Terraform-Sync and Zscaler AppServer Automation integration</a> leverages the Zscaler Private Access Consul-Terraform-Sync module to create and update application servers in the ZPA Cloud.</p>\n\n<p>The <a href=\"https://www.hashicorp.com/partners/tech/zscaler#consul\">Consul-Terraform-Sync and Zscaler Internet Access (ZIA) Cloud Firewall IP Source Group integration</a> leverages the Zscaler Internet Access Consul-Terraform-Sync module to dynamically create and update IP source groups in the ZIA Cloud Firewall.</p>\n\n<h2>HashiCorp Consul Integration Program</h2>\n\n<p>The HashiCorp Consul Integration Program allows our partners to integrate their products to work with Consul OSS, Enterprise, or <a href=\"https://cloud.hashicorp.com/\">HashiCorp Cloud Platform</a> (HCP) Consul. Learn more at<a href=\"https://www.consul.io/docs/integrate/partnerships\"> </a>our <a href=\"https://www.consul.io/docs/integrate/partnerships\">Consul Integration Program page</a>.</p>\n\n<p>As a fully managed service, HCP Consul is the easiest way to deploy managed Consul in Amazon Web Services (AWS) or Microsoft Azure. For more information about HCP Consul and pricing, please visit the <a href=\"https://cloud.hashicorp.com/\">HCP product page</a> or <a href=\"https://portal.cloud.hashicorp.com/sign-up\">sign up</a> through the <a href=\"https://portal.cloud.hashicorp.com\">HCP portal</a>.</p>\n\n<p><strong>More information on earlier Consul integrations:</strong></p>\n\n<ul>\n<li><a href=\"https://www.hashicorp.com/blog/f5-new-relic-and-sophos-among-new-consul-integrations\">F5, New Relic, and Sophos Highlight New Consul Integrations</a></li>\n<li><a href=\"https://www.hashicorp.com/blog/cisco-datadog-fortinet-vmware-others-add-consul-integrations\">Cisco, Datadog, Fortinet, VMware &amp; Others Add Consul Integrations</a></li>\n<li><a href=\"https://www.hashicorp.com/blog/network-security-automation-using-cisco-secure-firewall-and-hashicorp-consul\">Network Security Automation Using Cisco Secure Firewall and HashiCorp Consul</a></li>\n<li><a href=\"https://www.datadoghq.com/blog/monitor-consul-with-datadog-npm/\">Datadog NPM now Supports Consul Networking</a></li>\n<li><a href=\"https://docs.gravitee.io/apim/3.x/apim_service_discovery_consul.html#enable_consul_service_discovery_in_gravitee_io_apim\">Gravitee APIM and Consul Service Discovery Integration</a></li>\n<li><a href=\"https://traefik.io/blog/announcing-traefik-proxy-2-6/\">Traefik Ingress Gateway with HCP Consul</a></li>\n</ul>\n","author":"Nicole Bahr","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"e1b4ebf0acf62b633fc5ef79c386d3af20a5c31836b092f2d6bd4317b2121d1f","category":"Tech"}