{"title":"Be My Eyes แอปช่วยเหลือผู้มีปัญหาการมองเห็น รองรับ GPT-4 เพิ่มผู้ช่วยอัจฉริยะ","link":"https://www.blognone.com/node/133012","date":1678840703000,"content":"<div><div><div><p>Be My Eyes <a href=\"https://www.blognone.com/node/96052\">แอปช่วยเหลือสำหรับผู้มีปัญหาด้านการมองเห็น</a> ซึ่งใช้การวิดีโอคอลขอความช่วยเหลือจากอาสาสมัคร ประกาศเพิ่มความสามารถใหม่โดยใช้<a href=\"https://www.blognone.com/node/133009\">โมเดล GPT-4 ของ OpenAI</a> ที่เพิ่งเปิดตัวไป</p>\n<p>ฟีเจอร์ใหม่ที่เพิ่มมาด้วยความสามารถของ AI นี้ เรียกชื่อว่า <strong>Virtual Volunteer</strong> มีเป้าหมายให้ทำงานได้ในระดับเดียวกับอาสาสมัคร โดยสามารถให้รายละเอียดของภาพที่เห็น พร้อมคำแนะนำเพิ่มเติมที่เกี่ยวเนื่อง ซึ่งเป็นความสามารถใหม่เพิ่มเติมของ GPT-4</p>\n<p>ตัวอย่างที่ Michael Buckley ซีอีโอของ Be My Eyes นำเสนอความสามารถของ Virtual Volunteer เช่น เมื่อให้ข้อมูลภาพของในตู้เย็น นอกจากจะสามารถอธิบายว่ามีของอะไรบ้าง ผู้ช่วย AI ยังสามารถให้ออกไอเดียว่าจะนำของเหล่านี้มาทำเมนูอะไร รวมทั้งให้สูตรการทำ ความสามารถของการให้รายละเอียดในภาพ บวกกับความสามารถในการสร้างบทสนทนา จึงเป็นรูปแบบที่ลงตัวมากสำหรับแอปช่วยเหลืออย่าง Be My Eyes</p>\n<p>ทั้งนี้ระบบผู้ช่วย AI จะไม่ได้นำมาแทนระบบอาสาสมัครทั้งหมด โดยอาสาสมัครจะเข้ามาช่วยเหลือทันทีเมื่อพบว่า AI ไม่สามารถทำงานได้อย่างถูกต้อง</p>\n<p>ความสามารถ Virtual Volunteer ในแอป Be My Eyes ตอนนี้ยังทดสอบเบต้าในกลุ่มผู้ใช้งานแบบจำกัด และจะขยายไปยังผู้ใช้ทุกคนในไม่กี่เดือนข้างหน้า</p>\n<p>ที่มา: <a href=\"https://openai.com/customer-stories/be-my-eyes\">OpenAI</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5012b3cef3150852c8e22e8bdf310636.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/accessibility\">Accessibility</a></div><div><a href=\"/topics/be-my-eyes\">Be My Eyes</a></div><div><a href=\"/topics/openai\">OpenAI</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/computer-vision\">Computer Vision</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e1b779b4f014f5c76499b8539a0218ec9e1bfff3c7f7579f8bb2343dcfe7f740","category":"Thai"}