{"title":"Best cycling apps 2021 | 18 of the best iPhone and Android apps to download","link":"https://www.bikeradar.com/advice/buyers-guides/best-cycling-apps/","date":1622437200000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2019/07/GettyImages-463383589-0624dde-scaled.jpg?quality=45&amp;resize=620,413\" />                                            <p>The best cycling apps will help you plan a route, train effectively, fix your bike, and much more. There’s no shortage of apps aimed at cyclists, with many more being released all the time, so sometimes it can be difficult to sort the wheat from the chaff.</p>\n<p>Fear not – these are 18 of the most useful apps for cycling, as recommended by the BikeRadar team.</p>\n<p>We’ve included a variety of cycling apps for iPhone and Android devices ranging from highly analytical training tools to simpler social apps and useful navigational resources.</p>\n<ul><li><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-phone-holder/\">Best bike phone mounts</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">Best bike computers</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">Best smart trainers</a></li>\n</ul><p>For some apps – Google Maps, for instance – you need to have your device on the handlebar to take full advantage. For others, such as Strava, you can just hit start, put your phone in your jersey pocket or in a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-phone-holder/\">bike phone holder</a>, and go.</p>\n<p>What’s more, with Bluetooth accessories, such as <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-choose-a-heart-rate-monitor/\">heart-rate monitors</a>, speed sensors and <a href=\"https://www.bikeradar.com/features/best-power-meters-9-tested/\">power meters</a> becoming more common, you can get your smartphone’s Bluetooth connection and processor to do the work that used to require a separate computer and, not so long ago, wires.</p>\n<p>Some of the apps featured here are free, some are not, and some are free up front with an option to buy or subscribe for more bells and whistles.</p>\n<p>Fair warning: any GPS cycling app will tax your phone’s battery, so these are generally better suited to shorter rides unless you’re able to charge on the go.</p>\n<p>We’ve also included a couple of our favourite mobile-friendly websites here, and, if you’re looking for a specific rundown for the likes <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a> and <a href=\"https://www.bikeradar.com/reviews/training/training-software/trainerroad-training-software-review/\">TrainerRoad</a>, check out our guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">best indoor training apps</a>.</p>\n<p>And remember, these are our recommendations, so make sure to add your own in the comments.</p>\n<section><div>\n        <h2>The best cycling apps in 2021</h2>\n<ul><li>Strava</li>\n<li>MapMyRide</li>\n<li>Bikemap</li>\n<li>Google Maps</li>\n<li>Komoot</li>\n<li>Ride with GPS</li>\n<li>Wahoo Fitness</li>\n<li>TrainingPeaks</li>\n<li>Cyclemeter</li>\n<li>Zwift</li>\n<li>Rouvy</li>\n<li>Viewranger</li>\n<li>Trailforks</li>\n<li>What3words</li>\n<li>First Aid by British Red Cross</li>\n<li>Relive</li>\n<li>DotWatcher.cc</li>\n<li>MyWindsock</li>\n</ul><p>\n\n    </p></div>\n    </section><h2>Best cycling apps for tracking your rides</h2>\n<p>The best cycling apps for tracking will record your ride and show your speed, distance, route and other metrics, such as elevation.</p>\n<p>These are probably the most popular cycling apps out there, with Strava leading the field (and offering a host of other features, including segments, leaderboards and route planning).</p>\n<h2>Strava</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Strava’s ace in the hole is its social component. Many riders use a GPS computer for recording and uploading rides to Strava — and then use the app for checking out what their friends are up to.</span></figcaption><span> <i>Strava</i></span></div>\n<p>While you can use <a href=\"https://www.bikeradar.com/features/routes-and-rides/strava-tips-20-of-the-best/\">Strava</a> like a cycle computer on your phone, most riders use a separate <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">GPS computer</a> to record and upload their rides and then use the app to see what their friends are up to.</p>\n<p>All rides uploaded to Strava deliver automatic rankings of your times over popular stretches of road and trail – known as ‘segments’ in Strava-speak – along with a GPS map of where you rode.</p>\n<p>The real-time feature, which tells you how fast you are tracking on a selected segment, such as the local hard climb, works on smartphones but also newer Garmin Edge and Wahoo computers, too.</p>\n<p>Strava’s special sauce, which separates it from its competitors, is the slick social component. Much like Facebook, you can follow friends and see where and how hard they’re riding, leave comments and give kudos on their rides, as well as post photos of your own rides.</p>\n<p>Strava pivoted heavily towards a subscriber model in May 2020, <a href=\"https://www.bikeradar.com/news/strava-leaderboards-routes-subscription/\">putting formerly free features such as segment leaderboards and route planning behind a paywall</a>.</p>\n<ul><li><strong>Price:</strong> Free (premium version also available)</li>\n<li><strong>Download: </strong><a href=\"https://itunes.apple.com/us/app/strava-running-cycling-gps/id426826309?mt=8\" target=\"_blank\">Strava for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.strava\" target=\"_blank\">Strava for Android</a></li>\n<li><strong>BikeRadar is on Strava:</strong> <a href=\"http://app.strava.com/clubs/7533\" target=\"_blank\">Join the BikeRadar Strava club</a></li>\n</ul><h2>MapMyRide</h2>\n<div>\n<div>\n    <img /></div><div><figcaption><span><i></i> MapMyRide does exactly what it says.</span></figcaption><span> <i>Map My Ride</i></span></div>\n</div>\n<p>MapMyRide is similar to CycleMeter, but benefits from the parent company’s online history with route-mapping software.</p>\n<p>The app is well-equipped for tracking not only rides but nutrition, weight and more, and can also get you to your destination.</p>\n<p>The premium version includes training plans, more advanced routing options and live tracking that can be shared with family and friends. The premium version also ditches the advertisements you’re stuck with on the free app.</p>\n<ul><li><strong>Price: </strong>Free (premium version also available)</li>\n<li><strong>Download:</strong> <a href=\"https://itunes.apple.com/us/app/map-my-ride-gps-cycling-riding/id292223170?mt=8\" target=\"_blank\">MapMyRide for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.mapmyride.android2\" target=\"_blank\">MapMyRide for Android</a></li>\n</ul><hr /><h2>Best cycling apps for route planning and navigation</h2>\n<p>Cycling apps for route planning and navigation will help you discover more roads and places to ride.</p>\n<p>The best cycling apps aimed at route planning will allow you to plan your own rides as well as discover routes from other riders.</p>\n<p>Some apps will do the heavy lifting and plan a route for you if you enter a destination, which is ideal for on-the-go adventures or cycling around town.</p>\n<h2>Bikemap</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Bikemap is a route planning and navigation app.</span></figcaption><span> <i>Bikemap</i></span></div>\n<p>Bikemap is an iPhone and Android app that offers route planning, navigation, real-time updates and plenty more.</p>\n<p>In our experience, it’s a good alternative to Strava or Komoot for route planning and offers more for free, though both Strava and Komoot also have their own unique features.</p>\n<p>The app’s real-time updates allow you to alert other Bikemap users to problems encountered during a ride. It’s not something we’ve found much use for, but might be more appealing to cyclists riding regularly in an urban environment.</p>\n<p>Other features include an archive of more than seven million user-generated routes, route collections and in-app ride stats.</p>\n<p>Most of Bikemap’s features are free to use but there’s also a Bikemap Premium service, which opens up additional mapping options, including cycling-friendly map layers and 3D views of your planned routes, as well as offline navigation.</p>\n<p>Premium costs £28.90 / $34.99 / €29 a year or there’s the option for a one-off payment of £89 / $99 / €99 for lifetime access.</p>\n<ul><li><strong>Price: </strong>Free (Premium version also available – £28.90 / $34.99 / €29 a year or £89 / $99 / €99 for lifetime access)</li>\n<li><strong>Download:</strong> <a href=\"https://bikemap.page.link/iOSapp\">Bikemap for iOS</a> or <a href=\"https://bikemap.page.link/androidapp\">Bikemap for Android</a></li>\n</ul><h2>Google Maps</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> While you wouldn’t want to use it for a long ride, Google Maps’ combination of Google Search and touchscreen, bike-specific navigation is generally pretty good.</span></figcaption><span> <i>Google</i></span></div>\n<p>Apple has done some amazing things in the world of tech, but it can’t beat Google at mapping.</p>\n<p>Just like you use your phone on the fly to find places, read a few reviews and then go to the one you select, you can use Google Maps to do this too – and get there on bike paths and bike-friendly routes.</p>\n<p>Like any app, it’s not foolproof, but in its category it’s among the best there is. The audio turn-by-turn instructions are nice when riding, too; for riders who choose to ride with headphones, you can have your phone in your pocket and easily get where you need to be.</p>\n<ul><li><strong>Price:</strong> Free</li>\n<li><strong>Download:</strong> <a href=\"https://itunes.apple.com/app/google-maps/id585027354?mt=8\" target=\"_blank\">Google Maps for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.maps&amp;hl=en\" target=\"_blank\">Google Maps for Android</a></li>\n</ul><h2>Komoot</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Komoot app offers lots of information about your route.</span></figcaption><span></span></div>\n<p>While Google Maps is arguably the gold standard for dealing with navigation in general, it can sometimes come up a bit short for bike directions.</p>\n<p>Komoot uses the open-source OpenStreetMap database and allows you to plan road, mountain bike and gravel rides as well as commutes. The big difference over Google Maps is in the routing, where Komoot tries to choose the most efficient route, taking into account how bike-friendly a road or path is, as well as your fitness.</p>\n<p>Using a start and end point, Komoot will tell you the difficulty, fitness required, what road surfaces you’ll come across and an elevation profile to boot.</p>\n<p>Once you’ve started your route, it will give you speed, distance travelled, distance remaining and allows for easy on the fly route changes. You can also check out other route recommendations in your local area.</p>\n<p>Komoot also features curated highlights, as suggested by local riders and Komoot ambassadors. These can be a great way to discover unknown gems in your local area.</p>\n<ul><li><strong>Price:</strong> First map region free, subsequent map regions $3.99</li>\n<li><strong>Download:</strong> <a href=\"https://app.adjust.com/qgth52?adgroup=footer&amp;fallback=https://itunes.apple.com/app/komoot/id447374873\" target=\"_blank\">Komoot for iOS</a> or <a href=\"https://app.adjust.com/qgth52?adgroup=footer&amp;fallback=https://play.google.com/store/apps/details?id=de.komoot.android\" target=\"_blank\">Komoot for Android</a></li>\n</ul><h2>Ride with GPS</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Ride with GPS allows you to plan and navigate rides directly from your smartphone.</span></figcaption><span> <i>Ride with GPS</i></span></div>\n<p>Ride with GPS can plan routes in great detail, navigate and record your ride.</p>\n<p>It’s got a user-friendly interface that allows you to start recording with a single tap, and can even be used to navigate offline, which makes it extremely useful out in the sticks or on long rides where preserving battery power is important.</p>\n<p>The route data provided is particularly helpful, with detailed elevation profiles that you can zoom in and out of, and see exactly where on the route the biggest climbs will be.</p>\n<p>Want to share your rides in real time? The app lets you do just that, and it will even read comments aloud as you pedal. Not a bad thing to have when you need that last motivational push.</p>\n<p>The free version allows you to create routes and record your rides, as well as set yourself goals. There’s a Basic subscription that gives you access to mobile app features like turn-by-turn navigation, live logging and offline mapping. You can also publish ride reports.</p>\n<p>The Premium version gives you all of this, plus advanced route editing, custom cue sheets, stationary bike support and private segments.</p>\n<ul><li><strong>Price: </strong>Free / Basic $6 per month / Premium $10 per month</li>\n<li><strong>Download:</strong> <a href=\"https://apps.apple.com/gb/app/ride-with-gps-bike-computer/id893687399\" target=\"_blank\">Ride with GPS for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.ridewithgps.mobile&amp;hl=en_GB\" target=\"_blank\">Ride with GPS for Android</a></li>\n</ul><hr /><h2>Best cycling apps for fitness</h2>\n<p>The best cycling apps for fitness will help you track your performance over time.</p>\n<p>They work particularly well with other sensors such as heart rate monitors and power meters to provide a whole load of data that will give you a greater insight into your riding. Some, like TrainingPeaks, offer training plans dedicated to different abilities and goals.</p>\n<h2>Wahoo Fitness</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Wahoo Fitness isn’t pretty, but offers a ton of data.</span></figcaption><span> <i>Wahoo</i></span></div>\n<p>Perhaps the biggest draw of the Wahoo Fitness app is that it plays nicely with others.</p>\n<p>It pairs easily with Bluetooth sensors, such as heart-rate monitors, speed sensors and progressive power meters, including Stages. (With a Wahoo Key plugin you can pair with ANT+ sensors, too.)</p>\n<p>In a world where many companies guard your data in their ecosystems, Wahoo Fitness uploads to all the good sites – Strava, MapMyFitness, TrainingPeaks, MyFitnessPal – and, if you like, can push your data in your choice of five file formats via email or Dropbox.</p>\n<p>If you’re a data hound, you’ll love the number-heavy presentation of the app, with eight customisable pages of data on speed, power, heart rate and more. Plus, there’s a GPS map – though it burns through the battery pretty quickly.</p>\n<p>The app can also be used indoors with <a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/wahoo-kickr-smart-trainer-review/\">Wahoo’s indoor smart trainers</a>.</p>\n<ul><li><strong>Price: </strong>Free</li>\n<li><strong>Download:</strong> <a href=\"https://itunes.apple.com/us/app/wahoo-fitness/id391599899?mt=8\" target=\"_blank\">Wahoo Fitness for the iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.wahoofitness.fitness\" target=\"_blank\">Wahoo Fitness for Android</a></li>\n</ul><h2>TrainingPeaks</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> TrainingPeaks offers a deep dive into training plans and metrics for coaches and athletes alike.</span></figcaption><span></span></div>\n<p>If you’ve ever had a cycling coach, you’ve probably used TrainingPeaks. Heck, even if you haven’t had a coach you may have used TrainingPeaks.</p>\n<p>For everyone from coaches and high-performance athletes, to data-hungry office-based crit enthusiasts, TrainingPeaks offers one of the most comprehensive tools for tracking fitness and fatigue.</p>\n<p>However, it is not to be confused with a social network, navigation, or route-planning app, so look elsewhere if that’s what you’re after.</p>\n<p>The app allows you to create and schedule workouts, or choose from a wide selection of training plans crafted by coaches such as Joe Friel and Frank Overton.</p>\n<ul><li><strong>Price:</strong> Free (premium versions $9.92 per month)</li>\n<li><strong>Download:</strong> <a href=\"https://itunes.apple.com/us/app/trainingpeaks/id408047715?mt=8\" target=\"_blank\">TrainingPeaks for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.peaksware.trainingpeaks&amp;hl=en_US\" target=\"_blank\">TrainingPeaks for Android</a></li>\n</ul><h2>Cyclemeter</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Cyclemeter is impressively easy to use considering its breadth of features.</span></figcaption><span> <i>Cyclemeter</i></span></div>\n<p>Cyclemeter turns your smartphone into a great cycling computer – if you’re down with putting your phone on your handlebars, that is.</p>\n<p>It’s similar to Wahoo Fitness in its wealth of customisable options during the ride, but you also get a smorgasbord of post-ride analysis. Plus, you don’t have to log into any site; the data stays on your device.</p>\n<p>You can start/stop rides with your iPhone earphone remote button, too (if you choose to ride with headphones), and integrated Google Maps can assist you in unfamiliar areas.</p>\n<p>Cyclemeter also plays nice with Strava, Facebook, Twitter and more, while importing and exporting routes is also easy.</p>\n<ul><li><strong>Price</strong> Free (in-app upgrades available)</li>\n<li><strong>Download</strong> <a href=\"https://itunes.apple.com/us/app/cyclemeter-gps-cycling-running/id330595774?mt=8\" target=\"_blank\">Cyclemeter for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.abvio.meter.cycle\" target=\"_blank\">Cyclemeter for Android</a></li>\n</ul><hr /><h2>Best cycling apps for indoor training</h2>\n<p>Indoor training apps aim to make sitting on the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">turbo trainer</a> a far more enjoyable experience. They are a great way to avoid bad weather and get riding when the rest of life stops you from cycling outside.</p>\n<p>Some indoor training apps are focused solely on training, with personalised <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-workouts-training-plans-zwift/\">workouts and training plans</a> based on power output and <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">intervals</a>, while others let you race against other riders or simply admire the virtual scenery.</p>\n<p>We’ve got an in-depth round-up of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">best indoor training apps for cyclists</a> but here are some of our favourites.</p>\n<h2>Zwift</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Zwift has totally transformed the world of indoor riding.</span></figcaption><span> <i>Zwift</i></span></div>\n<p>With an internet connection, turbo trainer and device compatible with the app, riders across the world can ride with or race each other inside the world of Zwift.</p>\n<p>As well as being an efficient training tool, thanks to the built-in workouts and training plans, Zwift promotes social interaction and is a great way to break up the tedium of indoor riding.</p>\n<ul><li><strong>Price: </strong>£12.99 / $14.99 per month</li>\n<li><strong>Download: </strong><a href=\"https://itunes.apple.com/us/app/zwift/id1134655040?mt=8\" target=\"_blank\">Zwift for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.zwift.zwiftgame&amp;hl=en_AU\" target=\"_blank\">Zwift for Android</a></li>\n<li><a href=\"https://www.bikeradar.com/us/road/gear/category/accessories/training-software/product/zwift-online-trainer-videogame-49225/\" target=\"_blank\">Zwift review</a></li>\n</ul><h2>Rouvy</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Rouvy uses augmented reality and route films to simulate real roads and elevation data.</span></figcaption><span> <a href=\"http://\"><strong>Rouvy</strong></a></span></div>\n<p>Rouvy is an indoor cycling app that offers a growing number of real-life routes and augmented reality courses for you to ride on.</p>\n<p>Unlike Zwift, which simulates virtual worlds and roads, Rouvy uses video recordings of real roads and combines them with elevation data to provide an interactive riding experience. On certain courses, the app can also generate animated 3D riders.</p>\n<p>Beyond augmented reality, there are also – at the time of writing – approximately 2,036,020km of route films to ‘ride’ on, which should keep you entertained for several lifetimes.</p>\n<p>The app is available for iOS and Android, as well as for PCs, Apple TV and more.</p>\n<ul><li><strong>Price: </strong>$8 / €8 per month</li>\n<li><strong>Download:</strong> <a href=\"https://apps.apple.com/us/app/rouvy-ar/id1478239111#?platform=ipad\">Rouvy for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=eu.virtualtraining.rouvy.android\">Rouvy for Android</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/buyers-guides/rouvy-everything-you-need-to-know/\">Rouvy: everything you need to know</a></li>\n</ul><hr /><h2>Best apps for mountain biking</h2>\n<p>Many cycling apps are focused on road cycling, building on already available technology like Googe Maps. But there are also dedicated mountain biking apps that will help you make the most of the trails.</p>\n<h2>Viewranger</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Viewranger is great for mountain biking.</span></figcaption><span> <i>Viewranger</i></span></div>\n<p>While Google Maps is great for roadies or finding your way to the trails, this mapping app is useful for mountain bikers who enjoy a bit of off-road exploring.</p>\n<p>It’s free to download and comes with a very usable and free OpenCycle base map of the entire world to release yourself from ‘navigational uncertainty’ whenever the need arises.</p>\n<p>In addition, you can buy detailed large-scale topographical mapping for more than 20 countries. The maps are stored on your phone and use your phone’s GPS, so it doesn’t need a signal or data connection to work.</p>\n<p>A cool feature is the Skyline VR, where the app uses your GPS location and phone camera to show you the names of the peaks you’re looking at.</p>\n<p>You can create and share your own routes in the app, download other people’s tracks or just explore the riding around you. There’s even a live tracking ‘Buddy Beacon’ function that allows you to share your ride with your adoring public or just selected friends, as well as seeing who’s around you.</p>\n<ul><li><strong>Price:</strong> Free (premium version also available)</li>\n<li><strong>Download: </strong><a href=\"https://itunes.apple.com/us/app/viewranger-gps-hiking-walking/id404581674?mt=8\" target=\"_blank\">Viewranger for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.augmentra.viewranger.android&amp;hl=en\" target=\"_blank\">Viewranger for Android</a></li>\n</ul><h2>Trailforks</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Trailforks relies on crowd-sourced information to provide up-to-date trail maps and conditions.</span></figcaption><span></span></div>\n<p>You’re riding a new trail network, you’ve been out for a few hours, it’s hot, you’re tired and ready for a rest, when you come to a fork in the trail. You took a picture of the trail map near the car park, but you’re not totally sure where you are, so you make a call and go left because you think the trailhead is in that direction. Turns out, you’ve picked the wrong one, and this trail takes you deeper into the forest – you’re now a bit lost and try and backtrack to get home. It’s in this situation that Trailforks comes to rescue.</p>\n<p>Relying on crowd-sourced information, the app has more than 161,000 trails around the world and includes conditions reports, live tracking, and even points of interest, such as bike shops, in case you need a spare tube.</p>\n<p>The maps are downloaded onto your device for offline use, so no worries if you lose reception.</p>\n<p>The app also has an emergency info function that will generate your exact GPS coordinates and the name of the nearest trail.</p>\n<ul><li><strong>Price:</strong> Free</li>\n<li><strong>Download:</strong> <a href=\"https://itunes.apple.com/us/app/trailforks-mountain-bike-trail/id987986743\" target=\"_blank\">Trailforks for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.pinkbike.trailforks\" target=\"_blank\">Trailforks for Android</a></li>\n</ul><hr /><h2>More of the best cycling apps</h2>\n<p>Bike maintenance, first aid, weather forecasts and just pure entertainment. If you can think of something novel or useful, someone has probably made an app for it.</p>\n<p>Here’s a selection of some of the best cycling apps the team at BikeRadar love to use. They might not fit into the categories we’ve already featured, but in most cases they are simply too useful not to have.</p>\n<h2>What3words</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The What3words app takes a simple and unique approach to locating and navigating to specific places.</span></figcaption><span> <i>What3words</i></span></div>\n<p>What3words takes a unique approach to finding, sharing and navigating to a precise location, having assigned every single 3m x 3m square in the world with a unique combination of three words.</p>\n<p>The app is pitching itself as the new global standard for communicating location, whether it’s for coordinating meeting points with friends, finding your tent at a festival or directing the emergency services to exactly the right spot in a remote place or undefined location.</p>\n<p>It’s compatible with navigation apps such as Google Maps, Apple Maps, Waze and others – just add the three-word address. You can also use voice command.</p>\n<ul><li><strong>Price:</strong> Free</li>\n<li><strong>Download:</strong> <a href=\"https://apps.apple.com/gb/app/what3words/id657878530\" target=\"_blank\">What3words for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.what3words.android&amp;hl=en_GB\" target=\"_blank\">What3words for Android</a></li>\n</ul><h2>First Aid by British Red Cross</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> We hope you never need the Red Cross app, but it’s a handy to be prepared.</span></figcaption><span> <i>British Red Cross</i></span></div>\n<p>If the worst should happen on a ride it pays to be prepared. While it’s hard to beat going on a proper first aid course, this is probably the next best thing.</p>\n<p>Using a range of videos, quizzes and step-by-step advice, the First Aid by British Red Cross app helps you learn how to deal with common first aid emergencies, as well as being an invaluable reference when things go wrong.</p>\n<p>All the information is stored on the phone, so it’ll also work fine when you don’t have a data connection.</p>\n<ul><li><strong>Price:</strong> Free</li>\n<li><strong>Download:</strong> <a href=\"https://itunes.apple.com/gb/app/first-aid-by-british-red-cross/id483408666?mt=8\" target=\"_blank\">First Aid by British Red Cross for iOS</a> or <a href=\"https://play.google.com/store/apps/details?id=com.cube.rca&amp;hl=en\" target=\"_blank\">First Aid by British Red Cross for Android</a></li>\n</ul><h2>Relive</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Relive uses GPS data and satellite images to create a virtual version of your rides.</span></figcaption><span> <i>Courtesy</i></span></div>\n<p>Using ride data from Strava, Garmin Connect, MapMyRide and more, Relive generates a 3D video flyover of your ride, similar to the course previews shown ahead of WorldTour road races.</p>\n<p>The moving map not only shows your progress over the route but also pinpoints where you hit your top speed and the elevation profile, as well as any photos you may have taken along the way.</p>\n<ul><li><strong>Price:</strong> Free</li>\n<li><strong>Download:</strong> <a href=\"https://itunes.apple.com/app/relive-cycling/id1201703657?mt=8\" target=\"_blank\">Relive for iOS</a> or <a href=\"https://itunes.apple.com/app/relive-cycling/id1201703657?mt=8\" target=\"_blank\">Relive for Android</a></li>\n</ul><h2>DotWatcher.cc</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> DotWatcher.cc covers most major long-distance races.</span></figcaption><span> <a href=\"https://jamesrobertson.co.uk\"><strong>James Robertson for The Transcontinental Race</strong></a></span></div>\n<p>If you’re into long-distance racing, DotWatcher is a must-visit.</p>\n<p>Managed and updated by a small team – all of whom are experienced long-distance racers – the site hosts tracking maps, insight and analysis on the majority of major long-distance bicycle races.</p>\n<p>There is no dedicated app available, but the site is very well mobile-optimised, so there’s no reason to stop tracking on the go.</p>\n<p>The web app was also recently updated to include profiles for each rider featured, making following <a href=\"https://www.youtube.com/watch?v=xX67H7wYvSI\">your long-distance heroes that bit easier</a>.</p>\n<ul><li><strong>Price </strong>Free</li>\n<li><strong>Visit </strong><a href=\"https://dotwatcher.cc/\" target=\"_blank\">DotWatcher.cc</a></li>\n</ul><h2>MyWindsock</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> MyWindsock will delight TT nerds.</span></figcaption><span> <i>MyWindsock</i></span></div>\n<p>While not a downloadable app, <a href=\"https://www.bikeradar.com/news/mywindsock-takes-strava-nerdiness-to-the-next-level/\">MyWindsock</a> is a properly nerdy, mobile-compatible web app that will delight KOM/QOM-hunting Strava users the world over.</p>\n<p>The site pulls weather data from the Cloud and overlays a heat map of where you are most likely to encounter head, cross and tailwinds over a Strava segment or ride.</p>\n<p>This allows you to focus your efforts on segments that will have the most advantageous wind, or, if you’re a real TT-freak, alter your setup for a race depending on the conditions. Totally nerdy, totally brilliant.</p>\n<ul><li><strong>Price </strong>Free</li>\n<li><strong>Visit</strong> <a href=\"https://mywindsock.com/\" target=\"_blank\">MyWindsock.com</a></li>\n</ul>","author":"Colin Levitch","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"e1c62ba64ad4c528de131c1147c5f40bf3fd416dd8286467d7cc0d785acd0cc7","category":"Cycling"}