{"title":"Monitoring changes in soil organic carbon using satellite-based variables and machine learning algorithms in arid and semi-arid regions","link":"http://link.springer.com/10.1007/s12665-024-11876-9","date":1728432000000,"content":"<h3>Abstract</h3>\n                    <p>Monitoring the soil organic carbon (SOC) dynamics through temporal environmental controlling covariates could indicate the soil and environment quality status. In this study, we address the main challenge of SOC changes at the landscape scale in dry and semi-arid regions, particularly in West Azarbaijan, Kermanshah, and Hamadan provinces of northwest Iran. Environmental covariates such as remote sensing (RS) data (land use history and vegetation indexes derived from the time series multispectral remote sensing images of Landsat 7), climate variables, soil properties (clay, sand and silt) and digital elevation model attributes employed to develop the prediction model of SOC level. Additionally, the random forest algorithms were applied to estimate SOC change and comprehensively investigated the importance of covariates in modeling to produce SOC maps for 2007 and 2023. The dataset of soil samples represented diverse conditions including arid and semi-arid environments, various soil types, topographies, and land cover classes. Furthermore, we developed a new and accurate historical land use map based on Landsat bands. The modeling performance reached an overall accuracy of 79.0% for detection of SOC status. Results showed that significant SOC loss in 2.42–11.18% of province areas and a gain in 1.92–7.49% of lands. Vegetation is the most important covariate governing the losses in the short term. The outcomes unveiled significant SOC losses, particularly in dryland farming areas and grasslands, underscoring the need for improved farming systems and pasture management practices. These findings offer vital insights for sustainable agriculture policies, natural resource management, and soil fertility preservation, highlighting the potential of remote sensing data for large-scale SOC monitoring.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"e1db71bc3e3e457af7c0970178a7c63b52cf86a385e038e5d30465188c433c39","category":"Environment"}