{"title":"Huawei Adds Dual-Band GPS to New Watch GT 3","link":"https://www.dcrainmaker.com/2021/10/huawei-adds-dual-band-gps-to-new-watch-gt-3.html","date":1634844892000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-44.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-44.png\" /></a></p>\n<p>Huawei announced their latest slate sport-focused watch today, the <a href=\"https://consumer.huawei.com/uk/wearables/watch-gt3/\">Huawei Watch GT 3</a>, available in both 46mm and 42mm configuration. While the watch looks like many other AMOLED display smart watches, it actually has substantially better battery life that you’d expect, with claims of up to 14 days for the 46mm and 7 days for the 42mm.</p>\n<p>But what interested me most was the inclusion of dual-band GNSS to the watch, matching COROS’s recent inclusion on the <a href=\"https://www.dcrainmaker.com/2021/08/coros-vertix-2-in-depth-review.html\">Vertix 2 back in August</a>. Dual-channel or dual-band systems potentially allow for far greater accuracy of tracks by dramatically increasing the number of satellites a watch can connect to. In practice (my real world testing of the Vertix 2), the system hasn’t meaningfully changed day to day accuracy. But it has in some cases improved challenging terrain accuracy (namely around cliffs). However, while the tech today is still evolving, I suspect we’ll see significant software-driven update gains over the next year as companies spend more time with the chipsets and optimize them further. Most GPS chipsets seem to take about 12-18 months worth of updates before we see manufacturers really nailing all the edge cases.</p>\n<p>In any event, back on the GT 3, while I haven’t typically covered Huawei in the past (simply due to low demand from the athletic/sport side I usually float in), I figured some of these tidbits were noteworthy. There’s a slate of interesting items mentioned in the media briefing that at the very least caught my attention, and then perhaps deeper digging down the road with real hands-on usage to see if they meet their claims.</p>\n<h3>Tech Specs:</h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-45.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-45.png\" /></a></p>\n<p>Thus, in no particular order, here’s a slate of things I found interesting from a media briefing call I had about the watches yesterday.</p>\n<p><strong>Dual-Band GNSS:</strong> The GT 3 will support GPS, Galileo, Beidou, GLONASS, and QZSS – all within the dual-channel system. The company says that the “positioning speed” was improved by more than 50%, and that they’ve added “stronger anti-interference performance”. Obviously at this point since you don’t see my own photos in this post, I haven’t had the opportunity to validate these claims.</p>\n<p><strong>New Optical HR Sensor:</strong> The company spent a fair bit of time talking about their new optical HR sensor. Their new TruSeen 5.0 sensor package doubles the number of light signal receivers from 4 to 8, while implementing a curved underside/back of the watch (like all other companies). They also said they added a Fresnel optical film to the back of the sensor, which they say increases both the light output from the sensor, but also the receiving input. The Fresnel lens has effectively the same effect as it does in a lighthouse, to amplify light.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-46.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-46.png\" /></a></p>\n<p>As a result of that, the company says they’ve made a unit more accurate than <a href=\"https://www.dcrainmaker.com/2020/09/apple-watch-series-6-first-run-accuracy-spo2-sensor-data.html\">the Apple Watch Series 6</a>. That’d be a reasonably impressive feat if so, since that’s regarded as one of the most accurate optical HR sensors on the market. I found it slightly funny in their slides that they referred to the “Apple Watch Series 6” as “A Watch 6”. Here’s my data-accurate recreation of that slide:</p>\n<blockquote>\n<p><strong><u>Sprinting (Run):</u></strong><br />Huawei Watch GT3: 94.6%<br />Apple Watch Series 6: 91.2%</p>\n<p><strong><u>Freestyle Swimming:</u></strong><br />Huawei Watch GT3: 93.2%<br />Apple Watch Series 6: 92.2%</p>\n<p><strong><u>Skipping Rope:</u></strong><br />Huawei Watch GT3: 94.4%<br />Apple Watch Series 6: 91.8%</p>\n</blockquote>\n<p>While I’ve never seen skipping rope used in accuracy testing for an optical HR sensor, I’ll give them credit that in theory, that’s one of the more challenging things you could throw at an optical HR sensor due to the heavy cadence-driven pounding from jumping. On the flip side, they noted that all of these were percentages based on being within 5 BPM of the chest strap. 5 BPM isn’t horrible, but it’s also not amazing either. I’d preferred to have seen 1-2 BPM (which is where I usually see the Apple Watch Series 6 and Series 7 at). Which doesn’t mean these results are invalid, but just that we can’t actually see the real charts behind it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-47.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-47.png\" /></a></p>\n<p><strong>No More FirstBeat Metrics:</strong> While not often talked about, Huawei has long used FirstBeat metrics within their platform for a variety of data metrics. These have included VO2Max, Aerobic/Anaerobic Training Effect, Recovery Time, Stress and more. And all of those data pages are still there – except, now Huawei says they’re using their own algorithms and have ditched FirstBeat. I’m skeptical on how the accuracy of these metrics will be maintained, given we’re not just talking a handful of easy to achieve metrics like VO2Max, but also other more complicated metrics like training effect and recovery time. Notably, the user interface remains virtually identical to when they were powered by FirstBeat.</p>\n<p><strong>Battery Life:</strong> The 46mm unit claims 14 days of battery life in typical use, with 8 days if in heavy use. Whereas the 42mm unit claims 7 days in typical use, and 4 days in heavy use. Actually, here, let me make a little table of these claims. I actually really like the way Huawei has clarified this:</p>\n<blockquote>\n<p><strong><u>Huawei Watch GT3 46mm:</u></strong></p>\n<p><strong>Typical Use:</strong> 14 days with 30 mins of BT calling each week, 30 mins of music playing, heart rate 24×7 monitoring, sleep tracking, 90 minutes of GPS workouts each week, and for notifications it’d be 50 texts, 6 calls, and 3 alarms per day. Inclusive of the screen turning on 200 times a day.</p>\n<p><strong>Heavy Use:</strong> 8 days with all the same details above, but with 180 minutes of GPS workouts each week (3 hours)</p>\n<p><strong><u>Huawei Watch GT3 42mm:</u></strong></p>\n<p><strong>Typical Use:</strong> 7 days with 30 mins of BT calling each week, 30 mins of music playing, heart rate 24×7 monitoring, sleep tracking, 90 minutes of GPS workouts each week, and for notifications it’d be 50 texts, 6 calls, and 3 alarms per day. Inclusive of the screen turning on 200 times a day.</p>\n<p><strong>Heavy Use:</strong> 4 days with all the same details above, but with 180 minutes of GPS workouts each week (3 hours)</p>\n</blockquote>\n<p><strong>A Shamrock:</strong> The company is introducing their “Health Living Clover”, which aims to flower to show your full lifestyle potential as you increase your sleep, complete your steps, and complete mindfulness (breathing) activities). In other words, it’s basically marketed as the most healthy Lucky Charms Leprechaun tracking UI you’ve ever seen. The concept is fairly straight forward, and eventually once you’ve fulfilled all your petals then it changes color into a green shamrock.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-48.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-48.png\" /></a></p>\n<p><strong>The Display:</strong> As noted, the GT3 includes an AMOLED display which is 1.32″ (42mm variant) and 1.43″ (46mm variant), both at 466x466px. Note that in the battery life configurations spec’d, those aren’t in always-on display mode. </p>\n<p><strong>Odds and Ends:</strong> Beyond that, the GT  3 contains some 100 sport modes and support for apps. It also has has automatic training plan recommendations in conjunction with their app, recommending specific workouts as part of a broader multi-week plan towards a given event. The unit also has an app store, though, there doesn’t seem to be many apps that you’d know of there. Because this isn’t Wear OS or any of the other big wearable app platforms heavily leveraged by developers, there’s less choice here. Instead, it’s HarmonyOS 2.1. Interestingly, on the GT 3 media briefing slides here as well as the earlier Watch 3 slides this past spring, they included the Komoot logo. Except, that app still isn’t actually available best I can tell.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-49.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-49.png\" /></a></p>\n<p><strong>Pricing:</strong> The 42mm unit starts at £209 and the 46mm at £229. Higher prices basically give you swankier bands or materials. Shipping starts from Nov 10th.</p>\n<h3>Wrap-Up:</h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/10/image-50.png\"><img src=\"https://media.dcrainmaker.com/images/2021/10/image_thumb-50.png\" /></a></p>\n<p>This could be an interesting option in the fitness market if the accuracy is as claimed – both on GPS and heart rate. If accurate, and if combined with the higher battery life for an AMOLED display that’s more than just a couple days – that’s solid in this arena. Of course, the existing Watch 3 already had battery life and displays in those realms, so this isn’t new for Huawei. Though, the dual-channel GPS and new optical HR sensor is new here.</p>\n<p>In some ways though, I think this – along with COROS – server as a bit of a proxy for what we should expect in 2022 from some of the bigger name endurance sports watch companies. Of course, Huawei is a huge brand globally, but not a huge brand in endurance sports. Certainly these type of specs are trying to change that, and they are definitely tempting enough to give it a whirl and see where it fits in the greater sports scene.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"e1e282d6c5e06962d17c3d77aae96a3f6e0f927de478145a75b690774f7ac18e","category":"Cycling"}