{"title":"Apple Vision Pro: Here's Everything You Get in the Box","link":"https://www.macrumors.com/2024/01/09/apple-vision-pro-everything-included-in-box/","date":1704842250000,"content":"Apple has <a href=\"https://www.macrumors.com/2024/01/08/apple-announces-february-2-vision-pro-launch/\">announced</a> the launch date of <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a>, its much-touted spatial computing device. The mixed reality headset starts at $3,499 and will go on sale in the U.S. on Friday, February 2, with availability in Canada and the United Kingdom expected to follow later this year.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/Apple-Vision-Pro-Dual-Loop-Band.jpeg\" width=\"1640\" height=\"1060\" />\r<br />\nApple has not yet revealed all the details about the device's configuration options ahead of pre-orders, which start on Friday, January 19, but we do know what is included in the box with every ‌Apple Vision Pro‌.\r<br />\n\r<br />\n<ul>\r<br />\n    <li><strong>Vision Pro Headset</strong>: The headset is the primary component of the Vision Pro system, featuring advanced eye and hand-tracking technology via cameras, ultra high-resolution displays for each eye, speakers on either side, and an EyeSight front-facing screen. The headset comes with a minimum of 256GB of onboard storage for applications and media.</li>\r<br />\n    <li><strong>Solo Knit Band and Dual Loop Band</strong>: These two types of headband are designed for user comfort and customization. The Solo Knit Band is a single band that wraps around the back of the head, while Apple says the Dual Loop Band features \"a pair of adjustable upper and lower straps for a personalized fit.\"</li>\r<br />\n    <li><strong>Light Seal</strong>: The Light Seal is made of a soft textile and likely comes in a range of shapes and sizes, flexing to conform to the user's face for a precise fit. This accessory helps to block external light, enhancing the immersive experience of the headset.</li>\r<br />\n    <li><strong>Two Light Seal Cushions</strong>: These cushions come supplied in two sizes and provide additional comfort and light-blocking capability, ensuring a snug fit around the face to prevent light leakage.</li>\r<br />\n    <li><strong>Cover for Front Glass</strong>: The cover protects the headset's front glass when not in use, preventing scratches and damage.</li>\r<br />\n    <li><strong>Polishing Cloth</strong>: A soft cloth designed for cleaning the headset's lenses and front glass without causing scratches or damage.</li>\r<br />\n    <li><strong>Battery Pack</strong>: An external power source for the headset, ensuring longer usage times and portability. The battery provides 2 hours of general use and 2.5 hours of 2D video playback on a single charge, according to Apple.</li>\r<br />\n    <li><strong>USB-C Power Adapter</strong>: The adapter is used to charge the headset's battery pack, ensuring the device is always ready for use. It also may enable the Vision Pro to be connected to an external power source for longer periods of use than the portable battery allows, although Apple has yet to confirm this.</li>\r<br />\n    <li><strong>USB-C Charging Cable</strong>: A cable for connecting the headset or the battery pack to the USB-C power adapter for charging.</li>\r<br />\n</ul>\r<br />\n\r<br />\nApple will offer optional optical inserts for users who normally wear glasses, but these are not included in the packaging and will be a separate purchase starting at $99. Apple is partnering with ZEISS to offer the inserts that can be customized to each person's vision requirements. \r<br />\n\r<br />\nThe inserts attach to the Vision Pro lenses magnetically, allowing for precise viewing and eye tracking. Glasses wearers will need a valid prescription to get the inserts, but Apple cautions that not all prescriptions will be supported. Optical inserts will be available to order online on Apple's website.\r<br />\n\r<br />\nApple plans to start offering Vision Pro demonstrations at U.S. Apple retail stores on launch day. Apple says that demo times will be offered through the weekend on a first-come, first-served basis, with signups to take place starting at 8:00 a.m. on February 2.\r<br />\n\r<br />\nFor everything else we know about ‌Apple Vision Pro‌, be sure to check out our <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">dedicated roundup</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/09/apple-vision-pro-everything-included-in-box/\">Apple Vision Pro: Here's Everything You Get in the Box</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-heres-everything-you-get-in-the-box.2415931/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e1e5f562f0bddfbcc20bcd8f3c4fe96080f8a9e60efe90acab27b7b921bdac28","category":"Apple"}