{"title":"Molecular mechanisms of sex determination and differentiation in decapod crustaceans for potential aquaculture applications: An overview","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12924?af=R","date":1716518683000,"content":"<h2>Abstract</h2>\n<p>Crustacean aquaculture, especially monosex culture, requires a comprehensive knowledge of the mechanisms regulating sex determination and differentiation. Decapod crustaceans display either female heterogamety (ZW/ZZ) or male heterogamety (XY/XX) as their mode of genotypic sex determination. However, some decapod species exhibit sexual plasticity via removing the androgenic gland, knockdown insulin receptor transcripts, administrating exogenous sex steroids, and altering environmental factors. Although the master sex-determining gene in decapods remains elusive, various sexual genes, hormones, and neurotransmitter are emerging as important factors in sex differentiation. This review looks into recent advancements in studies related to the genetic sex determination system and factors that trigger sex reversal. Moreover, the elucidation of the role of genetic factors in sex differentiation in both females and males, as well as their underlying interrelated regulatory mechanisms, provides justification for three levels of application: the induction of monosex populations, detection of precocious sex and genotype, and prevention of uncontrolled reproduction. Finally, we proposed future directions of bioinformatics analysis and genome editing coupled with sex control to increase the yield for economic decapods. In conclusion, this review provides a foundation for future research on the reproductive biology and sexual regulation of decapods, with the aim of aiding practitioners in advancing the crustacean aquaculture industry.</p>","author":"Tao Wang, \nYang Yu, \nShihao Li, \nFuhua Li","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"e1f0b97a17d0889fd8daa52055a396a7be01881d9379be3cf15cbb61d2488f0b","category":"Environment"}