{"title":"Results of Tendon Transfers in Radial Nerve Palsies: A New Evaluation Protocol","link":"https://www.preprints.org/manuscript/202406.0804/v1","date":1718177467000,"content":"Radial nerve palsies present a challenging clinical scenario, often leading to substantial functional impairment. This study focuses on evaluating the outcomes of tendon transfer surgeries in patients with post-traumatic radial nerve injuries. The radial nerve, vital for upper limb movements, faces various etiologies such as trauma, compression, or idiopathy. Patients with radial nerve palsy encounter difficulties in daily activities, emphasizing the need for effective management strategies. The research introduces a novel evaluation protocol, aiming to comprehensively assess tendon transfer outcomes. This protocol incorporates functional movements of wrist and finger joints, encompassing both objective and subjective parameters. The retrospective study includes eleven patients treated between 2010 and 2022, with a minimum follow-up of one year post-surgery. Tendon transfers demonstrated positive results. The evaluation protocol covers a wide range of parameters, including wrist and finger mobility, thumb function, grip strength, and patient satisfaction. The results indicate successful restoration of motor function, with an average grip strength of 70% compared to the healthy arm. The proposed evaluation protocol facilitates standardized and reproducible assessment, minimizing subjective errors in clinical evaluations. Despite the study's limitations, such as a relatively small sample size, the findings underscore the effectiveness of tendon transfers in treating radial nerve palsies. The introduced evaluation scheme provides a comprehensive and reproducible approach to assess outcomes, contributing to the global standardization of tendon transfer assessments in radial nerve injuries.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e1f7c3ff500d9edb424efe8e0fe529fa1c92e753d3fe5d484fd26ec5f6ea3a0e","category":"Interdisciplinary"}