{"title":"Enhancing aquaculture disease resistance: Antimicrobial peptides and gene editing","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12845?af=R","date":1702540257000,"content":"<h2>Abstract</h2>\n<p>Previous studies have demonstrated that CRISPR/Cas9-mediated genome editing and transgenesis by integrating vector-engineered antimicrobial peptide genes (AMGs) are effective to modulate the fish's innate immune system. To generalise the knowledge of AMG application in aquaculture, we recruited 544 data entries from a pool of empirical studies, which included 23 studies (two unpublished from our team) spanning 12 diseases. We systematically re-processed and re-analysed these data by harnessing a cross-disease meta-analysis. On aggregate, AMG-genetic engineering aimed at enhancing disease resistance was shown to decrease the number of colony-forming units of bacteria from fish tissues, increase post-infection survival rates, and alter the expression of AMGs and immune-related genes. Further, AMG pathogen-combating activity was triggered within 2 h after infection and lasted 48 h. The overexpression of AMGs was highest in the spleen and skin, followed by the kidney and liver during this period. Typically, regardless of the type of AMGs, the synergistic expression of AMGs with <i>IL</i>-<i>10</i>, <i>IKβ</i>, <i>TGFβ</i>, <i>C3b</i> and <i>TLR</i> genes in AMG-integrated fish contributed to activating inflammatory/immune responses against pathogens. Our findings revealed that the efficiency of transgenic AMGs against pathogens was fish-, pathogen- and AMG-specific. Compared to bacteria, transgenic AMGs were less inhibitory to viruses and parasites. In addition, innovative CRISPR/Cas9-based transgenesis enabling the site-directed knock-in of foreign genes at multiple loci was assessed for the enhancement of disease resistance in combination with other favourable fish-production traits, including fast growth, sterility and enriched fatty-acid content. Altogether, our findings indicated that AMGs as transgenes have substantial promise to modulate the fish's innate immune system and enhance disease resistance.</p>","author":"Jinhai Wang, \nYu Cheng","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"e1fd3aa43ba28e12fd9a9f8c3e89c47222518e6a4c189780abba719a5c5d4a7b","category":"Environment"}