{"title":"PEA-m6A: an ensemble learning framework for accurately predicting N6-methyladenosine modifications in plants","link":"https://academic.oup.com/plphys/article/195/2/1200/7617589?rss=1","date":1709251200000,"content":"<span><div>Abstract</div><span>N</span><sup>6</sup>-methyladenosine (m<sup>6</sup>A), which is the mostly prevalent modification in eukaryotic mRNAs, is involved in gene expression regulation and many RNA metabolism processes. Accurate prediction of m<sup>6</sup>A modification is important for understanding its molecular mechanisms in different biological contexts. However, most existing models have limited range of application and are species-centric. Here we present PEA-m6A, a unified, modularized and parameterized framework that can streamline m<sup>6</sup>A-Seq data analysis for predicting m<sup>6</sup>A-modified regions in plant genomes. The PEA-m6A framework builds ensemble learning-based m<sup>6</sup>A prediction models with statistic-based and deep learning-driven features, achieving superior performance with an improvement of 6.7% to 23.3% in the area under precision-recall curve compared with state-of-the-art regional-scale m<sup>6</sup>A predictor WeakRM in 12 plant species. Especially, PEA-m6A is capable of leveraging knowledge from pretrained models via transfer learning, representing an innovation in that it can improve prediction accuracy of m<sup>6</sup>A modifications under small-sample training tasks. PEA-m6A also has a strong capability for generalization, making it suitable for application in within- and cross-species m<sup>6</sup>A prediction. Overall, this study presents a promising m<sup>6</sup>A prediction tool, PEA-m6A, with outstanding performance in terms of its accuracy, flexibility, transferability, and generalization ability. PEA-m6A has been packaged using Galaxy and Docker technologies for ease of use and is publicly available at <a href=\"https://github.com/cma2015/PEA-m6A\">https://github.com/cma2015/PEA-m6A</a>.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"e200fe5ca2ffbfaa17fee94f918c8992b39237a596bbf89ed01fa8e05190ac19","category":"Environment"}