{"title":"Predictive Understanding of Links Between Vegetation and Soil Burn Severities Using Physics‐Informed Machine Learning","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004873?af=R","date":1723550344000,"content":"<h2>Abstract</h2>\n<p>Burn severity is fundamental to post-fire impact assessment and emergency response. Vegetation Burn Severity (VBS) can be derived from satellite observations. However, Soil Burn Severity (SBS) assessment—critical for mitigating hydrologic and geologic hazards—requires costly and laborious field recalibration of VBS maps. Here, we develop a physics-informed Machine Learning model capable of accurately estimating SBS while revealing the intricate relationships between soil and vegetation burn severities. Our SBS classification model uses VBS, as well as climatological, meteorological, ecological, geological, and topographical wildfire covariates. This model demonstrated an overall accuracy of 89% for out-of-sample test data. The model exhibited scalability with additional data, and was able to extract universal functional relationships between vegetation and soil burn severities across the western US. VBS had the largest control on SBS, followed by weather (e.g., wind, fire danger, temperature), climate (e.g., annual precipitation), topography (e.g., elevation), and soil characteristics (e.g., soil organic carbon content). The relative control of processes on SBS changes across regions. Our model revealed nuanced relationships between VBS and SBS; for example, a similar VBS with lower wind speeds—that is, higher fire residence time—translates to a higher SBS. This transferrable model develops reliable and timely SBS maps using satellite and publicly accessible data, providing science-based insights for managers and diverse stakeholders.</p>","author":"Seyd Teymoor Seydi, \nJohn T. Abatzoglou, \nAmir AghaKouchak, \nYavar Pourmohamad, \nAshok Mishra, \nMojtaba Sadegh","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"e213180f1e23c420c83d9799bd7b3b44459d98091adaac9305a3fdfc2406088c","category":"Environment"}