{"title":"A duel in the sun","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-duel-in-the-sun","date":1690483456000,"content":"\n      <p><span>The Languedoc region was, in medieval times, home to the Cathars, a transnational religious group whose philosophy was based on dualism. Catharism originated in the city of Albi, but spread all over the Mediterranean region, thriving in the 1100s and 1200s.</span></p>\n<div></div>\n<p><span>Dualists, like cyclists, believe that life and existence are built on the tension between eternal and opposite concepts. For the Cathars, the endless struggle was between good and evil, represented by God and by Rex Mundi, the king of the world, one of Satan’s alter egos. (Their heresy was to believe that Rex Mundi created all worldly matter and beings, for which they were persecuted mercilessly and to their eventual disappearance by the Catholic church.) For cyclists, the struggle is more prosaic: Demi Vollering or Annemiek van Vleuten? Campagnolo or Shimano? Disc brakes or rim?</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/demi-vollering-left-confused-by-comical-time-penalty-for-drafting-car-at-tour-de-france-femmes\"><strong><em>Read more: Demi Vollering left confused by 'comical' time penalty for drafting car at Tour de France Femmes</em></strong></a></p>\n<p><span>And, of course, sprint or break? There wasn’t much time for 2023 <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> stage five winner Ricarda Bauernfeind to contemplate the eternal questions of life and existence on her 36km break to Albi. However, she was never very far ahead of the chasing bunch, and race watchers spent those 36km thinking she might make it, and she might not. The eternal and opposite concepts of a solo win and a bunch sprint were held in perfect tension for almost the whole way in.</span></p>\n<p><span>Bauernfeind attacked on a long drag three quarters of the way through this tough stage over the baking and rolling hills of Languedoc. She was initially followed by Claire Steels, but the British rider relented in the face of the German’s hard pace.</span></p>\n<p><span>Bauernfeind’s move looked ambitious – she is a strong time triallist, but against 36 of the strongest riders in the WorldTour, she might not expect to win. However, funny things are happening in the Tour de France Femmes this year. In yesterday’s stage, the break was given 10 minutes’ lead before SD Worx started working to bring it back, though Yara Kastelijn held off their surge to win the stage. In previous stages, SD Worx were held to be smotheringly strong, yet sometimes held back from doing the work of chasing. Nobody seems to know quite what’s going to happen.</span></p>\n<p><span>In Bauernfeind’s favour, that 36-rider group was not at all well constructed for the task of organising a pursuit. There were 20 teams represented, and only FDJ-Suez, with four riders and SD Worx and Movistar, with one fewer, had more than two riders. So nobody wanted particularly to chase. The smaller teams, particularly, did not have the responsibility (or the riders) to chase; Movistar and SD Worx also have GC contenders in Van Vleuten and Vollering. SD Worx might have felt it was worth working for Lotte Kopecky to take another stage, but with only Marlen Reusser spare to do the work, the risk was closing the gap, then being vulnerable to a counterattack. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230727TDFFAZ1054-A.S.O._Charly_Lopez.jpg?v=1690483340\" alt=\"Tour de France Femmes 2023 stage five\" /></div>\n<p><span>In the end, SD Worx opted for Reusser to chase, bringing the gap down from a minute and a half to 40 seconds or so. The Swiss rider ended up chasing so well that she inadvertently pulled Movistar’s Liane Lippert clear on a descent, and the hesitation in the group behind, along with the suddenly changed scenario, might have been the pivotal moment that ensured Bauernfeind’s success. Lippert’s too dangerous a rider to be helped, while SD Worx were out of domestiques in the group, so momentum stalled everywhere except the very front of the race. Reusser became a non-cooperative partner in the two-up move ahead of the bunch, while the bunch didn’t seem in a particular rush to catch them.</span></p>\n<p><span>There are two things you need to know about a group chasing another group, or rider. The first is that it’s easy to tell who has the momentum by keeping an eye on the gap and the km to go; the second is that gaps don’t give all the information you need. They can stubbornly hold for many kilometres, but riders will surge or try to use the course to maximise the impact of their efforts. Escapees tend to ride with a uniform effort, but pursuers do not, especially if the chase is disorganised or there are counterattacks. In this case, Bauernfeind’s lead was initially coming down in a manageable fashion, but Reusser was doing all of the chasing, and eventually ended up riding at the same speed as the German. At 20km to go, the lead was 1:25, so the group needed to ride, on average, around four seconds faster than the German, to catch her. At 15km, the gap was 1:05. Still just over four seconds a kilometre faster. At 10km to go, the gap was 40 seconds. Still four seconds a kilometre. It was looking good for the group. However, the Swiss faltered, and for the next five kilometres, the gap held at just under 40 seconds, meaning that they would now have to ride almost eight seconds a kilometre faster than Bauernfeind to catch her. Lippert’s fresh legs took another 10 seconds off the gap, but with three kilometres to go, and the gap still at 25 seconds, the momentum swung definitively in the German’s favour. </span></p>\n<p><span>Stage five of the 2023 Tour Femmes was one more battle in the eternal struggle between breaks and bunches, but with a much flatter day tomorrow, the dualist cycling fan might expect a different outcome.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e21d5f62589e9f206ca716d14d7aa0b89a406f14f11a067cc5b12903131c9605","category":"Cycling"}