{"title":"Projection-based two-sample inference for sparsely observed multivariate functional data","link":"https://academic.oup.com/biostatistics/article/25/4/1156/7615429?rss=1","date":1708992000000,"content":"<span><div>Summary</div>Modern longitudinal studies collect multiple outcomes as the primary endpoints to understand the complex dynamics of the diseases. Oftentimes, especially in clinical trials, the joint variation among the multidimensional responses plays a significant role in assessing the differential characteristics between two or more groups, rather than drawing inferences based on a single outcome. We develop a projection-based two-sample significance test to identify the population-level difference between the multivariate profiles observed under a sparse longitudinal design. The methodology is built upon widely adopted multivariate functional principal component analysis to reduce the dimension of the infinite-dimensional multi-modal functions while preserving the dynamic correlation between the components. The test applies to a wide class of (non-stationary) covariance structures of the response, and it detects a significant group difference based on a single p-value, thereby overcoming the issue of adjusting for multiple p-values that arise due to comparing the means in each of components separately. Finite-sample numerical studies demonstrate that the test maintains the type-I error, and is powerful to detect significant group differences, compared to the state-of-the-art testing procedures. The test is carried out on two significant longitudinal studies for Alzheimer’s disease and Parkinson’s disease (PD) patients, namely, TOMMORROW study of individuals at high risk of mild cognitive impairment to detect differences in the cognitive test scores between the pioglitazone and the placebo groups, and Azillect study to assess the efficacy of rasagiline as a potential treatment to slow down the progression of PD.</span>","author":"","siteTitle":"Biostatistics Current Issue","siteHash":"d3a47065211a18721436d2ad1f713237ccbb15b7790ebb347bb018c26cfcb04f","entryHash":"e21fe3b8946d585c2bff22ffe876293204d0e9b82d3f61b9674f40653459a71c","category":"Environment"}