{"title":"The riverbank vegetation for mitigating the adverse effects of sediment dredging","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2656?af=R","date":1714382697000,"content":"<h2>Abstract</h2>\n<p>Sediment dredging has been an ever-growing issue, especially in developing nations with high demand for concrete filler material. River systems are adversely affected by sediment mining, resulting in decreased stability of the riverbed and riverbanks. Nature-based solutions for riverbank erosion have been a research topic that has led to the proposal of vegetation on the riverbanks. However, little is known about the extent of riverbank vegetation required to negate the devastating effects of sediment mining because dense vegetation severely affects the flow structure and becomes a waste trap. This experimental study uses sparsely dense, flexible, and bladed vegetation to study the annulment effects of vegetation against the existing mining pit. Near-bed turbulence and sediment transport have increased in the test section in the presence of a mining pit. The increase in near-bed streamwise and transverse Reynolds shear stresses helped us understand the increased sediment movement in streamwise and lateral directions. The morphology of the test section showed increased riverbed erosion at the beginning of the test segment. The entire cross-section was levelled at the end of the test section, and aggradation was downstream of the test segment. In contrast, in the vegetated riverbank case, the initial profile of the bank was almost unchanged for the same discharge of flow and upstream sand pit. The sparse vegetation overperformed the intended negation effects. This study establishes that sparse vegetation would perform better in maintaining the channel morphology, which otherwise in dense vegetation would have faced a high erosion rate in the main channel while giving the same protection to the riverbanks.</p>","author":"Sukhjeet Arora, \nBimlesh Kumar","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"e2228ef6c4f2c66cbf3318246ec8f1278d33c2247ed73b7191bbb48975cfcba5","category":"Environment"}