{"title":"Treating the disease and meeting the person with the illness-patient perspectives of needs during infective endocarditis, a qualitative study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309373","date":1724767200000,"content":"<p>by Helena Lindberg, Johan Vaktnäs, Magnus Rasmussen, Ingrid Larsson</p>\r\nBackground <p>Infective endocarditis (IE) is a rare but severe infectious disease. Patients with IE are treated for weeks in the hospital and have profound impairments to their health. New treatment modalities increase options for outpatient care. Little is known about how patients perceive their disease and hospitalisation. We aimed to explore the needs of patients with IE during hospitalisation and the first few months after discharge.</p> Methods <p>In this qualitative study, 20 patients (45–86 years of age) hospitalised due to IE in Swedish hospitals were interviewed a median of 112 (67–221) days after hospitalisation. Data were analysed with qualitative content analysis, identifying eight subcategories, two categories, and an overall theme.</p> Results <p>The overall theme illuminated a spectrum of needs of patients suffering from IE, between treating the disease and meeting the person with the illness. The needs encompassed eight axes with dual focus on both medical excellence and person-centred care. Medical excellence was needed to optimally treat, supervise, and offer follow-up on this rare and severe disease; patients longed to come home, and there were issues of reliability in the healthcare system. Person-centred care was requested, including individualised information leading to knowledge, reorientation, the beginning of health restoration, and being met as a unique person. Symptoms of fatigue, wasting, and cognitive and mental distress were often neglected by the caregiver.</p> Conclusions <p>This explorative study shows the patient’s needs as important areas in a spectrum between medical excellence and person-centred care. Care in specialised units secure quality. Early discharge is requested by patients. Multiprofessional individualizing outpatient care needs to develop with preserved safety and medical excellence. The disease trajectory after discharge progresses slowly, and the possibility of mitigating its progress is still unclear. Person-centred care, screening for delayed restoration and rehabilitation after endocarditis are important fields for future studies.</p>","author":"Helena Lindberg","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e227efe602c95b90ac3c3eb52a8f443658eb38878d65e4b0874c1ad3b6530142","category":"Interdisciplinary"}