{"title":"Exposed Aquaculture Operations: Strategies for Safety and Fish Welfare","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12964?af=R","date":1724313516000,"content":"<h2>ABSTRACT</h2>\n<p>The expansion of aquaculture production into more exposed harsh and remote ocean environments presents both new opportunities and challenges. To manage the complexities of exposed operations, research into fish welfare, personnel safety, and facilitating technology is thus of key importance. This paper reviews recent research advances in the areas of safety, fish welfare, and technology, while the focus is on the Norwegian salmon farming industry, the results could benefit exposed fish farming internationally. Regarding fish welfare, the study summarizes the current knowledge status of salmon coping abilities and welfare indicators in strong currents and waves. On the safety front, there has been significant progress in operational safety management, accident analysis, and emergency preparedness, all of which are crucial for human personnel in these demanding settings. Human safety and fish welfare also rely on structures and equipment, and recent research results include advances in environmental load analysis, vessel design, simulations of fish farms. Notably, the development of contact-free, autonomous lifting operations, and hole detection methods represents a significant leap in maintaining aquaculture infrastructure. This multidisciplinary study underscores the need for integrated research approaches to address exposed aquaculture, emphasizing that while recent innovations have enhanced safety and robustness, ongoing research and new strategies are critical for safety and fish welfare in exposed aquaculture operations.</p>","author":"Hans Vanhauwaert Bjelland, \nOle Folkedal, \nHeidi Moe Føre, \nEsten Ingar Grøtli, \nIngunn Marie Holmen, \nEivind Lona, \nHans Tobias Slette, \nKristine Vedal Størkersen, \nTrine Thorvaldsen","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"e22ee578dc3a5f5492deaa07871689b25641a820ca8c0be7ebc66eb79832a109","category":"Environment"}