{"title":"Effects of Cover Crops on Nematode Communities in Spinach Production","link":"https://www.preprints.org/manuscript/202410.1936/v1","date":1729782586000,"content":"Agricultural soil environments contain different types of nematodes in all trophic levels that aid in balancing the soil food web. Beneficial free-living nematodes (FLNs) consist of bacterivores, fungivores, predators and omnivores that help in the mineralization of the soil and the top-down control of harmful plant-parasitic nematodes (PPNs). Annually, $125 billion in worldwide crop losses are caused by PPNs, making them a plant pathogen of great concern for growers. Farmers have started to implement the use of cover crops in agricultural systems for the protection and enrichment of soil but research on how different cover crops affect nematode populations is lacking and in demand. This study aims to determine the effects of legume and grass cover crops, Cowpea (Vigna unguiculata) and Pearl Millet (Pennisetum glaucum), as well as their mixture on the abundance and diversity of FLN and PPN populations. Soil samples were collected at the time of cover crop maturity and spinach harvest to analyze nematode communities using both morphological and DNA metabarcoding analysis. Results showed that the application of Cowpea and Pearl Millet as well as their mixture in a spinach agricultural system led to the control of PPNs and proliferation of FLN communities, with each cover crop treatment demonstrating different advantages for the various nematode feeding groups. The choice of cover crop implementation by growers for spinach cultivation should thus be based on specific soil health conditions to promote soil fertility and a healthy nematode community.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e22f88ef3da953fecb2c8ee64dc99f3c825eb2ad9daf57eed04dea6dfc11c08c","category":"Interdisciplinary"}