{"title":"Evaluating the Use of the Penman–Monteith and Priestley–Taylor Algorithms for Modelling Peatland Evapotranspiration Using the Cold Regions Hydrological Model","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2714?af=R","date":1725531030000,"content":"<h2>ABSTRACT</h2>\n<p>Methods used to quantify evapotranspiration (ET) from <i>Sphagnum</i>-dominated peatlands often assume that soil moisture is not a limiting factor; actual ET (AET) equals potential ET (PET). However, soil moisture can become limiting as peatlands dry, lowering AET below PET and necessitating the use of a surface resistance term in AET estimations. Quantifying and calculating surface resistance is a challenge for the non-vascular plant surfaces such as those dominated by <i>Sphagnum</i> moss. This paper explores and quantifies the ecohydrological processes that drive <i>Sphagnum</i> resistance to ET. It is hypothesized that a relationship exists between the <i>Sphagnum</i> moss resistance and the ratio of unsaturated to saturated hydraulic conductivity (K-ratio) for boreal peatlands, where the K-ratio is a proxy for the hydrophysical properties of the porous medium. An empirical relationship between <i>Sphagnum</i> moss resistance and the K-ratio was developed from data collected from a boreal peatland and implemented in the cold regions hydrological model. Empirically modelled resistance values (0–800 s m<sup>−1</sup>) did not match well with estimates from inverting observations and the Penman–Monteith (PM) algorithm (0–5000 s m<sup>−1</sup>). Difficulties in validating resistance values were possibly due to lack of moisture limiting conditions although this is seemingly contradicted by the alpha value being less than 1. Priestley–Taylor (PT) and PM algorithms in CRHM were used to estimate AET and compared with each other and with observations from an onsite eddy covariance (EC) system. The PT algorithm, using a site-specific alpha value (0.75) performed the best with a mean difference of 9.4% (±12.0%) when compared to EC measurements of AET. The PM algorithm consistently overestimated EC measurements with a mean difference of 68.4% (±50.0%), even with a moss resistance incorporated into its use. The performance of PM algorithm is impeded by the uncertainty in quantifying <i>Sphagnum</i> resistance. Reducing this uncertainty should be a focus of future studies, as it does not require the use of a site-specific alpha value.</p>","author":"Brandon Van Huizen, \nRichard M. Petrone, \nXing Fang, \nJohn W. Pomeroy","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"e23c78e8cb6726317a73a8b7a4b8df666779fd3bf78d9b7d976b43358c12b365","category":"Environment"}