{"title":"Is CNS Involvement in AML Patients predictable? Analyzing Risk Factors, Clinical Outcomes, and the Impact of Next-Generation Sequencing","link":"https://www.preprints.org/manuscript/202410.0568/v1","date":1728386590000,"content":"CNS infiltration (CNS+) leads to serious complications in AML. Cytogenetic and Molecular profile is essential in risk stratification, treatment decisions and envisage prognosis. We utilize the NGS data and cytogenetics as a screening tool, for determining the incidences and specific CNS+ risks, in patients eligible for intrathecal chemotherapy. 52 mutations database per NGS was used for the analysis. 435 newly diagnosed patients underwent frontline induction chemotherapy. 259 (59.5%) patients received LP. The most common molecular mutation in the CNS+ patients were MPN1 (48.3%), FLT3 (22.5%), TET2 (25.8%), RAS / KRAS (25.7%), DMNT3 (19.3%), ASXL1 and (16.1%). Of which 31 patients had confirmed CNS+ disease due to the presence of characteristic markers. CNS+ patients have significantly higher bone marrow blast% (76 vs. 53) (p= 0.0202). WBC count ≥ 100x109/L (OR: 5.614 [2.313-13.626] p=0.0001) in the multivariable analysis, and LDH ≥2ULN (OR: 5.512 [2.176-13.965]; p= 0.0003) in the univariate analysis, revealed higher risk for CNS+. Patients exhibited significantly higher NPM1 mutations (48.4% vs 24.6%, p=0.0053) and 11q23 chromosomal abnormality (12.9% vs 2.19%, p= 0.0139). However, FLT3 by NGS did not predict CNS+ (P=0.1226). CNS+ did not contribute significantly toward CIR (p=0.066), and has no bearing on OS (p=0.9063). Patients presented with either neurological symptoms or accompanied by hyperleukocytosis, elevated LDH, NPM1 positivity or 11q23 abnormality are highly suggestive of CNS+. Therefore, LP is needed to rule-out CNS disease at presentation. NGS did not consistently predict CNS+. A large prospective trial is needed to confirm the results.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e246753dc045d6b84a5cbb7b8bf62a7f5b18e677fd4c9c9133269b762f85b414","category":"Interdisciplinary"}