{"title":"Mitigation of Heat Stress in Striped Catfish (Pangasianodon hypophthalmus) by Dietary Allicin: Exploring the Growth Performance, Stress Biomarkers, Antioxidative, and Immune Responses","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/8292007?af=R","date":1681974000000,"content":"<p>Global warming is a challenge facing the aquaculture industry, and mitigating its effects on aquatic animals’ productivity is mandatory. Hence, the present study investigated the alleviation of heat stress impacts on the performances of striped catfish by dietary allicin. For 60 days, striped catfish were fed dietary allicin at 0, 0.5, 1, 2, and 4%, and then the fish were exposed to 35°C. The results indicated that dietary allicin remarkably enhanced the growth performance (FBW, WG, and SGR) and feed utilization (FCR and PER) in striped catfish in a dose-dependent manner. Further, striped catfish fed allicin at 1 and 2% before heat stress, and those fed on 1% after heat stress had the highest lipase, amylase, and protease activities. The intestinal villi of allicin-treated fish showed increased length and branching. Before heat stress, the AST value was not affected by dietary allicin, but after heat stress, the AST was markedly reduced in fish fed on allicin at 1, 2, and 4%. Significantly, T-CHO and triglycerides were higher after heat stress than before with or without allicin. The blood proteins, albumin, and globulin were markedly lower after heat stress than before heat stress. The glucose and cortisol levels were increased after heat stress, either with or without dietary allicin. Heat stress reduced lysozyme activity, and the best activity was seen in fish fed 2% allicin. In addition, the phagocytic activity before and after heat stress was increased by dietary 1, 2, and 4% allicin. The activities of superoxide dismutase, catalase, and glutathione peroxidase were increased by dietary allicin before and after heat stress. The regression analysis illustrated that the best performances of striped catfish could be achieved by using 1.89–2.28% dietary allicin, leading to high resistance to heat stress.</p>","author":"Mohamed A. Mahmoud, \nManal S. Kassab, \nAmr I. Zaineldin, \nAsem A. Amer, \nMahmoud S. Gewaily, \nShawky Darwish, \nMahmoud A. O. Dawood, \nFemi Fawole","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"e24aef9f8fc5ea37dd26ad291728202784ab085f1463440af0c692a633dc756e","category":"Environment"}