{"title":"Characterization of genomic regions escaping epigenetic reprogramming in sheep","link":"https://academic.oup.com/eep/article/doi/10.1093/eep/dvad010/7482908?rss=1","date":1703030400000,"content":"<span><div>Abstract</div>The mammalian genome undergoes two global epigenetic reprogramming events during the establishment of primordial germ cells and in the pre-implantation embryo after fertilization. These events involve the erasure and re-establishment of DNA methylation marks. However, imprinted genes and transposable elements (TEs) maintain their DNA methylation signatures to ensure normal embryonic development and genome stability. Despite extensive research in mice and humans, there is limited knowledge regarding environmentally induced epigenetic marks that escape epigenetic reprogramming in other species. Therefore, the objective of this study was to examine the characteristics and locations of genomic regions that evade epigenetic reprogramming in sheep, as well as to explore the biological functions of the genes within these regions. In a previous study, we identified 107 transgenerationally inherited differentially methylated cytosines (DMCs) in the F1 and F2 generations in response to a paternal methionine–supplemented diet. These DMCs were found in TEs, non-repetitive regions, and imprinted and non-imprinted genes. Our findings suggest that genomic regions, rather than TEs and imprinted genes, have the propensity to escape reprogramming and serve as potential candidates for transgenerational epigenetic inheritance. Notably, 34 transgenerational methylated genes influenced by paternal nutrition escaped reprogramming, impacting growth, development, male fertility, cardiac disorders, and neurodevelopment. Intriguingly, among these genes, 21 have been associated with neural development and brain disorders, such as autism, schizophrenia, bipolar disease, and intellectual disability. This suggests a potential genetic overlap between brain and infertility disorders. Overall, our study supports the concept of transgenerational epigenetic inheritance of environmentally induced marks in mammals.</span>","author":"","siteTitle":"Environmental Epigenetics Current Issue","siteHash":"5549213f473d96cee0cf7ca1db1da1a69239cc267977bfd813fd34781f2cddbb","entryHash":"e255e307acbeff0c09977aa9105ace06b5b6c1ceadb94e1d830dd434972b8988","category":"Environment"}