{"title":"5 Vision Pro features Apple doesn’t want to talk about","link":"https://www.macworld.com/article/1978828/5-vision-pro-features-apple-doesnt-want-to-talk-about.html","date":1688553000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>For a product that isn’t debuting until 2024, Apple has said a lot about the <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Vision Pro</a>, its mixed reality headset. Apple spent nearly an hour in the WWDC keynote discussing it. It has rolled out developer tools for visionOS, which has given us even more clarity about what visionOS can and can’t do.</p>\n\n\n\n<p>And yet I remain firmly convinced that Apple hasn’t told us the whole story. The <a href=\"https://www.macworld.com/article/1942679/wwdc-2023-keynote-macbook-air-m2-ultra-ios-17-macos-14-vision-pro.html\">WWDC keynote</a> was the time to make a first impression–but there’s half a year to go before the final story is told. As a result, Apple emphasized the features of the device that it felt would best represent the device. It emphasized the fact that it’s an augmented-reality product that keeps you connected with people around you as a way to blunt criticism that Apple’s trying to use its technology to wall people off from each other.</p>\n\n\n\n<p>With the Vision Pro, there’s more to come. Here’s where I think Apple will have a much larger story to tell.</p>\n\n\n\n<h2>Yes, it’s really a VR headset</h2>\n\n\n\n<p>By defaulting to a view of the world around you and requiring that the user dial reality out via the Digital Crown, Apple sends the signal that the Vision Pro is an augmented-reality headset. But the truth is, it’s a VR headset that emulates AR, and that emulation can be dropped easily. If you don’t want to work in the very spacious rooms on display in Apple’s demo video, you can just as easily work in a virtual-reality environment.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/apple.jpg?quality=50&amp;strip=all\" alt=\"Apple-vision-pro\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/apple.jpg?quality=50&amp;strip=all 1167w, https://b2c-contenthub.com/wp-content/uploads/2023/06/apple.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/apple.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/apple.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"576\" /><figcaption><p>Apple touted the Vision Pro’s functionality with augmented reality, but</p> that AR is emulated.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>But even more than that, app developers can create entire VR experiences within their apps. While Apple will strongly encourage apps to work in augmented reality–and if you want to walk around objects, it’s required–that won’t stop the ability for apps that do what we think of as “traditional” VR experiences.</p>\n\n\n\n<p>In other words, Apple didn’t talk about VR games, the most popular category of software in existing VR hardware, but VR games will absolutely be a part of the Vision Pro experience. No, we don’t know how good Apple’s hand- and eye-tracking technology will be when it comes to the needs of various VR games. But we will certainly find out.</p>\n\n\n\n<h2>Yes, there will be fitness apps</h2>\n\n\n\n<p>Apple didn’t announce any Vision Pro integration with its Fitness+ service, which I admit was a bit of a surprise. On Meta’s headsets, apps like Supernatural and Beat Saber have gained huge followings as ways to spice up the drudgery of regular workouts.</p>\n\n\n\n<p>I can’t say whether <a href=\"https://www.macworld.com/article/234585/apple-fitness-plus-what-you-need-to-know.html\">Fitness+</a> will appear on Vision Pro at launch–Bloomberg’s Mark Gurman suggests it won’t–but if Apple doesn’t fill the gap, someone else will. Savvy app developers will try to be the next Beat Saber. And no matter how heavy or awkward the Vision Pro might be, no matter how much sweat the Vision Pro’s 3-D-knit headband might soak in, people will try to use VR for workouts. It’s going to happen.</p>\n\n\n<div><figure><img src=\"https://bilder.macwelt.de/4269471_original.jpg?quality=50&amp;strip=all\" alt=\"Fitness Plus\" loading=\"lazy\" /><figcaption><p>Apple Fitness+ seems like a natural fit for the Apple Vision Pro, but the company has yet to reveal any plans for the service.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Yes, there will be Memoji</h2>\n\n\n\n<p>Apple wanted to impress everyone with the Digital Persona, a replica of your face created via an in-depth initial scan that’s animated by Vision Pro sensors looking at your eye, face, and body gestures. I found them creepy, and I definitely wasn’t the only person who used the Vision Pro at WWDC who thought so.</p>\n\n\n\n<p>I’m pretty sure Apple has never intended the Digital Persona to be the only option for users who need a proxy for interaction with other people when wearing the Vision Pro. It’s technology Apple was proud of, so it showed it off as a way to boast–as well as a way of explaining how the EyeSight feature was created.</p>\n\n\n\n<p>But it can’t be the only option. Let’s start with the fact that not everyone will feel comfortable using a representation of themselves as they are if they can help it. There’s a good reason why Apple’s Memoji creation interface lets you choose a wide range of characteristics, including many that don’t even exist in human beings! Or you can choose to be an animated emoji character.</p>\n\n\n\n<p>And really, if we’re being honest, it’s highly likely that the entire Memoji project was an early move in the direction of avatars for the Vision Pro. Do we really think Apple’s going to insist on Digital Personas for everyone, even if they’d rather just be an elephant? Not gonna happen.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/memoji-headwear.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Memoji headwear\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/05/memoji-headwear.jpg?quality=50&amp;strip=all 1300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/memoji-headwear.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/05/memoji-headwear.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/05/memoji-headwear.jpg?resize=1200%2C799&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/05/memoji-headwear.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/05/memoji-headwear.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"799\" /><figcaption><p>Memojis seem like a natural fit with the VIsion Pro.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Yes, Siri will be involved</h2>\n\n\n\n<p>Apple’s film about the Vision Pro shows a user reading out a website address via voice at one point. It’s pretty much the only example of Apple’s voice assistant being shown with the headset. But it’s almost inconceivable that voice control won’t be a major portion of the device’s interface.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://sixcolors.com/post/2023/06/eyes-and-head-on-with-the-apple-vision-pro/&amp;xcust=1-1-1978828-1-0-0&amp;sref=https://www.macworld.com/feed\">When I used the Vision Pro</a>, there were numerous moments when I realized that rather than manipulating a virtual interface via hand gesture, I’d probably be better off just issuing a voice command. But Siri wasn’t active on our demo headsets, probably because it’s just not good enough–and because if Apple leaned into it <em>too</em> much, it would make the rest of the Vision Pro interface work the company has done look a little less special.</p>\n\n\n\n<p>A reliance on voice control by all of those people in solitary environments, sprawled on couches or sitting in chairs, might also reinforce the antisocial nature of these devices–if you’re comfortable constantly interjecting to Siri, that implies that nobody else is within earshot–and that’s very much not the impression Apple wants to give right now.</p>\n\n\n\n<p>But there’s just no way that visionOS is a platform that isn’t strongly linked to voice commands. It just makes too much sense.</p>\n\n\n\n<h2>Your other Apple devices will probably be more involved</h2>\n\n\n\n<p>The Vision Pro appears to be a peer to the iPad and iPhone, capable of running iOS apps itself without any connection to those devices. Still, we didn’t see much direct integration between Apple’s most popular product and the Vision Pro.</p>\n\n\n\n<p>Perhaps it won’t be there on day one, but I have a hard time believing that the iPhone won’t work tightly with Vision Pro. In <a href=\"https://www.macworld.com/article/1670742/macos-14-release-date-features-compatibility-beta.html\">macOS Sonoma</a>, Apple’s introducing the concept of iPhone widgets that are projected right onto your Mac desktop. Why not extend that to Vision Pro? What about launching apps on your iPhone and viewing them right within Vision Pro? Maybe even more than one at a time?</p>\n\n\n\n<p>Sure, you can look down and use your iPhone while using Vision Pro, but that’s always going to be a pretty limited experience. I have to think that Apple is working hard to figure out the best ways to use Continuity features to attach all of its devices to the Vision Pro–but most especially the iPhone.</p>\n\n\n\n<p>The Vision Pro won’t be here for some time yet. We’ve heard Apple’s opening sales pitch, but it isn’t nearly time for the company to close the deal. There’s more to this story than we’ve heard so far. Stay tuned.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e2583e2f4c149ad6454ec13512ece1e2a4d89cdec5e1315cb3634d3091e7e359","category":"Apple"}