{"title":"Enhanced Fault Detection in Satellite Attitude Control Systems Using LSTM-based Deep Learning and Redundant Reaction Wheels","link":"https://www.preprints.org/manuscript/202410.1923/v1","date":1729782850000,"content":"Reliable fault detection in satellite attitude control systems stands as a critical aspect of ensuring the safety and success of space missions. Central to these systems, Reaction Wheels (RWs), despite being the most frequently used actuators, present a vulnerability given their susceptibility to faults - a factor with the potential to precipitate catastrophic failures such as total satellite loss. In light of this, we introduce a fault detection methodology grounded in deep learning techniques specifically designed for satellite attitude control systems. Our proposed method utilizes a Long Short-Term Memory (LSTM) model adept at learning temporal patterns inherent to both healthy and faulty system behaviors. Incorporated into our model is a torque allocation algorithm designed to circumnavigate specific velocities known to induce torque disturbances, a factor known to influence LSTM performance adversely. To bolster the robustness of our fault detection technique, we also incorporate denoising autoencoders within the LSTM framework, thereby enabling the model to identify temporal patterns in healthy and faulty system behavior, even amidst the noise. Extensive evaluation of our proposed method on a simulated satellite attitude control system affirmed its ability to achieve commendable fault detection accuracy, demonstrating high system reliability and robustness to noisy input data. Our research underscores a stride in the evolution of fault detection and control strategies for satellite attitude control systems, holding promise to boost the reliability and efficiency of future space missions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e25b12d138d7e6837c1ba375c6cc5ff23c62ebf126a7acb958a84273ebd955f5","category":"Interdisciplinary"}