{"title":"Oxford ทดลองดึงเวลาวัคซีนเข็ม 2 ไปนานถึง 11 เดือน พบสร้างภูมิได้สูงขึ้น","link":"https://www.blognone.com/node/123479","date":1624946533000,"content":"<div><div><div><p>ทีมวิจัยจากมหาวิทยาลัยออกซ์ฟอร์ดรายงานถึงการทดลองตรวจภูมิในผู้รับวัคซีน ChAdOx1 nCoV-19 หรือวัคซีน Oxford-AstraZeneca ในกรณีที่มีการดึงเวลารับเข็มที่สองเอาไว้ พบว่าการดึงเวลาเอาไว้นานขึ้นแม้จะส่งผลให้ภูมิลดลงในช่วงที่รอเข็มสอง แต่เมื่อกระตุ้นภูมิในเข็มที่สองแล้วกลับมีภูมิสูงกว่าการฉีดตามกำหนดปกติ</p>\n<p>ทีมวิจัยทดสอบโดยแบ่งตัวอย่างออกเป็น 3 กลุ่ม ได้แก่กลุ่มรับเข็มสองภายใน 8-12 สัปดาห์หลังเข็มแรก, กลุ่มรับเข็มสองภายใน 15-25 สัปดาห์หลังเข็มแรก, และกลุ่มรับเข็มสอง 44-45 สัปดาห์หลังเข็มแรก ผลพบว่ายิ่งรอนานภูมิหลังกระตุ้นเข็มสองนั้นยิ่งสูงขึ้น อาจจะเป็นประโยชน์ต่อการป้องกันโรคต่อไป</p>\n<p>งานวิจัยนี้น่าจะเป็นหลักฐานสนับสนุนต่อแนวทางการหน่วงเวลาสำหรับการรับวัคซีนเข็มที่ 2 ในหลายประเทศเนื่องจากไม่สามารถจัดหาวัคซีนได้เพียงพอ</p>\n<p>นอกจากรายงานถึงการหน่วงเวลาเข็มที่สองแล้ว รายงานฉบับนี้ยังแสดงผลการทดสอบฉีดกระตุ้นภูมิในเข็มที่สามหลังได้รับเข็มที่สองไปนาน 6 เดือน พบว่ากระตุ้นแอนตี้บอดีได้ดีเช่นกัน แม้ว่าตอนนี้ยังไม่มีหลักฐานว่าจำเป็นต้องมีการกระตุ้นภูมิตามรอบเวลาหรือไม่  แต่หากในอนาคตจำเป็นต้องกระตุ้นจริง รายงานนี้ก็บ่งชี้ว่าการกระตุ้นเข็มสามสร้างภูมิคุ้มกันเพิ่มขึ้นได้จริง</p>\n<p>รายงาน <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3873839\">\"Tolerability and Immunogenicity After a Late Second Dose or a Third Dose of ChAdOx1 nCoV-19 (AZD1222)\"</a> ยังอยู่ในสถานะ pre-print</p>\n<p>ที่มา - <a href=\"https://www.ox.ac.uk/news/2021-06-28-delayed-second-dose-and-third-doses-oxford-astrazeneca-vaccine-lead-heightened\">Oxford</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d262ee72c8ef00f90546c7cee325a17f.jpg\" /></p>\n<p>กราฟแสดงระดับแอนติบอดีจากวันที่ฉีดวัคซีนเข็มแรก และหลังฉีดวัคซีนเข็มสองแยกตามช่วงเวลาทิ้งระยะระหว่างสองเข็ม</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/oxford-university\">Oxford University</a></div><div><a href=\"/topics/covid-19\">COVID-19</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e25d78646f9833a469f5e2b2f6043167becb98a7cfcab34195d35c3d6ccaceaa","category":"Thai"}