{"title":"Google Maps เพิ่มแผนที่ 3 มิติตลอดเส้นทาง ดูสภาพจำลองเส้นทางล่วงหน้าก่อนขับรถได้","link":"https://www.blognone.com/node/136449","date":1698455703000,"content":"<div><div><div><p>Google Maps ประกาศอัพเดตฟีเจอร์ใหม่ที่สำคัญ 3 อย่างดังนี้</p>\n<p><strong>Immersive View for Routes</strong> <a href=\"https://www.blognone.com/node/133776\">ฟีเจอร์นี้ประกาศไว้ในงาน Google I/O</a> ตอนนี้เปิดให้ใช้งานแล้ว เป็นการแสดงภาพ 3 มิติสมจริง (Immersive Views) กับเส้นทางที่เราจะนำทางไป เพื่อให้เราดูสภาพแวดล้อมของเส้นทางได้ล่วงหน้าก่อนเดินทาง ลักษณะเหมือนบินโดรนชมเส้นทางก่อนขับรถจริงๆ แถมยังสามารถจำลองเส้นทางในช่วงเวลาหรือสภาพอากาศที่ต่างกัน เช่น ตอนเย็น ตอนกลางคืน ตอนฝนตก ได้ด้วย</p>\n<p>ฟีเจอร์นี้ยังรองรับเฉพาะบางเมืองเท่านั้น ที่ระบุชื่อได้แก่ Amsterdam, Barcelona, Dublin, Florence, Las Vegas, London, Los Angeles, Miami, New York, Paris, San Francisco, San Jose, Seattle, Tokyo, Venice</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c6e0c15c2f080c10076272acb96fb5ff.jpg\" /></p>\n<p><strong>Lens in Maps</strong> เป็นการรีแบรนด์<a href=\"https://www.blognone.com/node/111266\">ฟีเจอร์ Live View</a> (ที่เดิมใช้ชื่อ Google Maps AR อีกที) โดยในช่อง Search ด้านบนของ Google Maps จะมีไอคอนใหม่หน้าตาแบบเดียวกับ Google Lens โผล่ขึ้นมา เมื่อกดแล้วจะแสดงโหมด AR ที่เรายกมือถือส่องรอบตัว ดูสถานที่ที่ต้องการไปในทิศที่ตรงกับความเป็นจริงได้</p>\n<p>กูเกิลยังบอกว่าขยายเมืองที่รองรับ Lens in Maps เพิ่มขึ้นอีกมากกว่า 50 เมืองทั่วโลก เช่น Austin, Las Vegas, Rome, São Paulo, Taipei</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/280c44b7a27838a57ccc7bd003d72758.jpg\" /></p>\n<p><strong>Charging Stations</strong> ฟีเจอร์ค้นหาสถานีชาร์จรถยนต์ไฟฟ้า EV มีรายละเอียดเพิ่มขึ้น เช่น แสดงประเภทของหัวชาร์จว่าใช้งานได้กับรถยนต์ของเราหรือไม่, ความเร็วในการชาร์จของแต่ละหัวที่แตกต่างกัน และสถานะล่าสุดของหัวชาร์จนั้น ว่ามีคนใช้งานครั้งสุดท้ายเมื่อไร หากนานเกินไปอาจแปลว่าพังไปแล้ว จะได้ไม่ต้องเสียเวลาเดินทาง เป็นต้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/d6b27e4388625ac729d9c715499a06d4.jpg\" /></p>\n<p>ที่มา - <a href=\"https://blog.google/products/maps/google-maps-october-2023-update/\">Google</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-maps\">Google Maps</a></div><div><a href=\"/topics/google\">Google</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e2622f77736068c1356a2bf72fcf538a20eef7c85e3b080be36e23f649adee6a","category":"Thai"}