{"title":"Navigating intellectual property (IP): A comparative analysis of Australian universities’ IP policies","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304647","date":1717077600000,"content":"<p>by Hamid R. Jamali</p>\r\n\r\nThe push towards research commercialisation at universities has highlighted the importance of intellectual property (IP) policies in fostering innovation and guiding and managing research commercialisation activities. This paper undertakes a content analysis of intellectual property policies of all (37) Australian public universities, focusing on policy objectives, definition of IP, ownership of IP created by different creators, and distribution of net commercialisation revenues. It is found that all universities assert ownership over staff-created IP, particularly when related to employment or utilisation of university resources. For students, policies tend to balance their rights with university interests, with nuanced approaches for different types of student participation, but the focus of most policies was on postgraduate students engaging in research activities. While some policies had clear arrangements for IP created by visitors and affiliates and Indigenous cultural and intellectual property (ICIP), about a quarter of policies did not specify arrangements for these groups. Revenue sharing arrangements vary but generally award something between a third to a half of net revenue to creators, to both acknowledge their contribution and incentivise further innovation. Policies included a broad spectrum of objectives, from protecting and commercialising IP to fostering innovation and societal benefit, reflecting varying strategies across the higher education sector. Policies could benefit from further clarity in certain areas such as the rights of students or other creator groups. Research is needed to assess the effectiveness of these policies and their influence on innovation and commercialisation activities.","author":"Hamid R. Jamali","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e26263e101891c76bed4987e4f2a799c7d568c05d7fce538467540f35df2b489","category":"Interdisciplinary"}