{"title":"Comparison across age groups of causes, circumstances, and consequences of falls among individuals living in Canada: A cross-sectional analysis of participants aged 45 to 85 years from the Canadian Longitudinal Study on Aging","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300026","date":1710424800000,"content":"<p>by Vanina P. M. Dal Bello-Haas, Megan E. O’Connell, Jake Ursenbach</p>\r\n\r\nFalls are a leading cause of injury-related deaths and hospitalizations among Canadians. Falls risk has been reported to be increased in individuals who are older and with certain health conditions. It is unclear whether rurality is a risk factor for falls. This study aimed to investigate: 1) fall profiles by age group e.g., 45 to 54 years, 55 to 64 years, 65 to 74 years, 75 to 85 years; and 2) falls profiles of individuals, by age group, living in rural versus urban areas of Canada. Data (N = 51,338) from the Canadian Longitudinal Study on Aging was used to examine the relationship between falls and age, rurality, chronic conditions, need for medical attention, and fall characteristics (manner, location, injury). Self-reported falls within a twelve-month period occurred in only 4.8% (single fall) and 0.8% (multiple falls) of adults. Falls were not related to rural residence or age, but those with memory impairment, multiple sclerosis, as well as other chronic conditions such as mood disorder, anxiety disorder, and hyperthyroidism not often thought to be associated with falls, were also more likely to fall. Older individuals were more likely to fall indoors or fall while standing or walking. In contrast, middle-aged individuals were more likely to fall outdoors or while exercising. Type of injury was not associated with age, but older individuals were more likely to report hospitalization after a fall. This study shows that falls occur with a similar frequency in individuals regardless of age or urban/rural residence. Age was associated with fall location and activity. A more universally applicable multi-facted approach, rather than one solely based on older age considerations, to screening, primary prevention and management may reduce the personal, social, and economic burden of falls and fall-related injuries.","author":"Vanina P. M. Dal Bello-Haas","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e2649cb335029ea67a8dd455ef2940d859a230f1dc6969e7b94d719302049c64","category":"Interdisciplinary"}