{"title":"Advances in laryngopharyngeal reflux: Etiology, diagnosis, and management","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15242?af=R","date":1729228993000,"content":"<h2>Abstract</h2>\n<p>Laryngopharyngeal reflux (LPR) manifests as a variety of nonspecific upper aerodigestive tract symptoms. Rather than a single disorder, LPR may be conceived of as a spectrum of subtypes with varying clinical presentations. LPR signs and symptoms arise from the direct and/or indirect effects of refluxate, physical and molecular injury of the mucosa, and neurologic responses to esophageal events. Specific constituents of refluxate exert distinct mucosal responses and immediate or delayed effects resulting in transient or persistent symptoms and/or laryngeal hypersensitivity. While the complex etiology of LPR presents challenges to its diagnosis and management, tools that aid the identification of LPR subtypes can provide insight into treatment decision-making. Hypopharyngeal-esophageal multichannel intraluminal impedance-pH monitoring provides detailed analysis of reflux events, enabling the development of individualized treatment plans, yet cost and availability limit its widespread use. Alginates offer temporary symptom relief and antireflux surgery may provide benefit when symptoms are recalcitrant to other approaches. Pepsin inhibitors hold promise as a medical therapy when surgery is not an option. Laryngeal hypersensitivity should be considered as part of a comprehensive therapeutic approach. Promising medical and scientific research continues to yield new insights into the complex etiology of LPR and novel strategies for its diagnosis and management.</p>","author":"Tina L. Samuels, \nJennifer Aoun, \nInna Husain, \nEdgar Figueredo, \nDavid Richards, \nNikki Johnston","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"e2673e12cfb21112e595f198ba03d9c2286e8af7b5b34734616a94914b42dadb","category":"Environment"}