{"title":"What Not to Expect at Apple's 'Scary Fast' October 30 Event","link":"https://www.macrumors.com/guide/what-not-to-expect-apple-october-event/","date":1698483600000,"content":"Apple's <a href=\"https://www.macrumors.com/2023/10/24/apple-october-mac-event-2023/\">upcoming \"Scary Fast\" event</a> takes place on October 30 (or 31, <a href=\"https://www.macrumors.com/how-to/apple-scary-fast-oct-30-event-what-time-watch/\">depending where you are</a>) when it is expected to unveil new 14-inch and 16-inch MacBook Pro models, and a new 24-inch iMac. It may also make some <a href=\"https://www.macrumors.com/2023/10/27/usb-c-magic-mouse-expected-at-apple-event/\">additional new products available</a>, but there are a handful of rumored upcoming devices that we don't expect to make an appearance this month.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/What-Not-to-Expect-at-Apple’s-Scary-Fast-Event-Feature-1.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nTo help set expectations ahead of Apple's October event, we've compiled a list of products that Apple is unlikely to announce during \"Scary Fast,\" but rather next year and beyond.\r<br />\n\r<br />\n<h2>M3 13-inch MacBook Pro</h2>\r<br />\nApple is developing new Macs powered by the company's next-generation M3 chip, which is built on chipmaking partner TSMC's 3nm process, resulting in significant performance and power efficiency improvements over the 5nm-based M2 chip that Apple's most recent Mac models are based on.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/06/13-inch-macbook-pro-2022-banner.jpeg\" width=\"1100\" height=\"619\" />\r<br />\nAccording to <em>Bloomberg</em> reporter Mark Gurman, Apple has M3-based versions of the 14-inch and 16-inch MacBook Pro models ready to go, but a new version of the 13-inch MacBook Pro featuring the M3 chip is looking increasingly less likely to appear alongside them at Apple's \"Scary Fast\" event.\r<br />\n\r<br />\nAs recently as <a href=\"https://www.macrumors.com/2023/10/22/gurman-apple-to-announce-new-macs-this-month/\">last week</a>, Gurman said that supplies of the 13-inch MacBook Pro were running low, indicating that it could be replaced at the end of the month. But he now says that the new machine likely won't appear at Apple's upcoming event. \r<br />\n\r<br />\n\"While the company has been working on a low-end MacBook Pro codenamed J504 with a base version of the M3 chip, that machine likely won't appear Monday,\" Gurman <a href=\"https://www.macrumors.com/2023/10/27/m3-13-inch-macbook-pro-unlikely-to-be-at-event/\">reported for <em>Bloomberg</em> on Friday</a>.\r<br />\n\r<br />\n<h2>M3 13-inch and 15-inch MacBook Air</h2>\r<br />\nApple has not updated the smaller 13-inch ‌MacBook Air‌ so far this year. The current M2-powered model was originally announced in June 2022, so it was hoped that there would be a refresh soon. Indeed, in June 2023‌, Gurman claimed the 13-inch ‌MacBook Air‌ could be one of the first beneficiaries of Apple's new M3 chip. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/13inch-macbook-air-purple.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nHowever, more recently he has said that a 13-inch MacBook Air with the M3 chip has only <a href=\"https://www.macrumors.com/2023/10/16/four-new-macbooks-on-schedule-for-launch-in-2024/\">just reached engineering verification testing (EVT)</a>, an earlier production testing phase on prototype devices. Gurman says this puts the next-generation 13-inch MacBook Air on schedule for launch between the spring and summer of next year at the earliest.\r<br />\n\r<br />\nApple launched the 15-inch MacBook Air in June this year, and so it is not expected to be amongst the first generation of M3-powered Macs.\r<br />\n\r<br />\n<h2>Mac Pro, Mac Studio, Mac Mini</h2>\r<br />\nLikewise, Apple this year has already updated the ‌Mac Pro‌ and ‌Mac Studio‌‌. These updates were also released in June 2023, so there is little chance that they will be superseded by newer models before 2024. Gurman <a href=\"https://www.macrumors.com/2023/10/24/kuo-m3-macbook-pro-october-30/\">maintains</a> that Apple will not refresh the MacBook Air models, Mac Studio, or Mac Pro at this time.\r<br />\n\r<br />\nAs for the ‌Mac mini‌, Apple updated the machine with ‌M2‌ chips in January 2023, while M3-powered models are not expected to emerge until late 2024 at the earliest, according to Gurman.\r<br />\n\r<br />\n<h2>New iPads</h2>\r<br />\nApple sometimes releases new iPads towards the end of the year, but there is increasing skepticism about that happening in 2023. \r<br />\n\r<br />\nApple is widely believed to be working on new <a href=\"https://www.macrumors.com/2023/08/27/new-ipad-pro-and-redesigned-magic-keyboard/\">M3-powered iPad Pro models with OLED displays</a> and a redesigned Magic Keyboard accessory, but these devices are not expected to debut until the spring or early summer of 2024.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/iPad-mini-AND-Air-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe same goes for the iPad mini, which was last updated in September 2021. Apple analyst Ming-Chi Kuo in January said the next model would likely enter mass production in the <a href=\"https://www.macrumors.com/2023/01/30/new-ipad-mini-launching-next-year/\">first quarter of 2024</a>. At the time, he also said there may be no new iPad releases in the following 9-12 months, and he has since <a href=\"https://www.macrumors.com/2023/10/20/no-new-macs-or-ipads-expected-rest-of-2023/\">doubled down</a> on this prediction.\r<br />\n\r<br />\nAccording to Gurman, Apple is also <a href=\"https://www.macrumors.com/2023/07/17/new-ipad-air-reportedly-in-development/\">developing a new iPad Air</a> with improved specs, but he no longer believes it will arrive this year. Apple last updated the iPad Air in March 2022.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/10/10th-Gen-iPad-Feature-Fanned-Pink.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nApple is also working on an 11th-generation entry-level iPad. The 10th-generation iPad was released in October 2022, and Apple has updated the entry-level iPad on an annual basis since 2017, but there are no rumors suggesting it will debut in 2023.\r<br />\n\r<br />\nThe Mac focus of Apple's \"Scary Fast\" event doesn't completely rule out new iPads from Apple this year – Apple could conceivably choose to release new models in November via press release instead, like it did in January 2023 for the 14-inch and 16-inch MacBook Pro and the second-generation HomePod. But neither <a href=\"https://www.macrumors.com/2023/10/20/no-new-macs-or-ipads-expected-rest-of-2023/\">Kuo</a> nor <a href=\"https://www.macrumors.com/2023/10/27/m3-13-inch-macbook-pro-unlikely-to-be-at-event/\">Gurman</a> believe that any iPads are going to arrive before spring 2024 at the earliest.\r<br />\n\r<br />\n<h2>iPhone SE 4</h2>\r<br />\nRumors regarding Apple's plans for the next-generation iPhone SE have been mixed at best, with a <a href=\"https://www.macrumors.com/2023/04/13/iphone-se-4-rumors/\">lot of back and forth</a> on when and indeed if we'll see a fourth-generation iPhone SE.\r<br />\n\r<br />\n<div></div>\r<br />\nThe <a href=\"https://www.macrumors.com/2023/08/13/iphone-se-4-to-feature-action-button-and-more/\">latest rumors suggest</a> the iPhone SE will be similar to the iPhone 14, featuring an all-display design with Face ID instead of Touch ID, a USB-C port, a single rear camera, and an \"Action\" button to replace the mute switch. There's also a possibility that it could include <a href=\"https://www.macrumors.com/2023/08/11/suppliers-bidding-on-iphone-se-4-displays/\">OLED display technology</a>.\r<br />\n\r<br />\nWe are not expecting a new iPhone SE to debut this year or even next year, and it's looking like it will launch in 2025 at the earliest. It could perhaps be one of the first devices to feature an Apple-designed modem chip.\r<br />\n\r<br />\n<h2>Vision Pro Headset</h2>\r<br />\nVision Pro marks the company's first entrance into a new product category since the 2015 Apple Watch, with the so-called \"spatial computing\" device announced at WWDC 2023 in June. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Apple-Vision-Pro-with-battery-Feature-Blue-Magenta.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nAccording to Apple, the Vision Pro will go on sale in early 2024, which likely means January to late April, with an outside chance of it arriving in May.\r<br />\n\r<br />\n<h2>AirPods Lineup</h2>\r<br />\nApple is planning a major overhaul of its AirPods lineup, but that is not expected to start until next year, <a href=\"https://www.macrumors.com/2023/10/25/airpods-lineup-overhaul-2024/\">according to Gurman</a>. The standard AirPods and the AirPods Max will see a refresh in 2024, while the AirPods Pro will be updated in 2025. For the AirPods and ‌AirPods Pro‌, Apple will update the design of the earbuds and the case, while also improving audio quality.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/airpods-school.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThere is no clear word yet on when in 2024 and 2025 we might see AirPod refreshes, but Apple typically introduces new models in the latter half of the year around when new iPhones come out. Gurman says that the AirPods will come out \"later next year\" and the ‌AirPods Max‌ will come out \"around the end of next year.\"\r<br />\n\r<br />\n<h2>HomePod Lineup</h2>\r<br />\nLastly, HomePod. Apple's HomePod mini is now three years old. Gurman was first to highlight Apple's work on a second-generation HomePod mini in <a href=\"https://www.macrumors.com/2022/08/07/new-homepod-mini-and-high-end-homepod/\">August 2022</a>. In February, Apple analyst Ming-Chi Kuo said that Apple will begin mass shipments of the second-generation ‌HomePod mini‌ in the <a href=\"https://www.macrumors.com/2023/02/03/homepod-mini-2-shipping-next-year/\">second half of 2024</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/HomePod-Mini-2-Feature.jpg\" width=\"1600\" height=\"900\" />\r<br />\nIt is also possible that Apple could wait to introduce a new ‌HomePod mini‌ until the debut of a <a href=\"https://www.macrumors.com/2023/10/21/images-show-new-homepod-with-screen/\">third-generation full-size ‌HomePod</a>‌, especially if it includes new features. Apple is said to be developing an updated version of the ‌HomePod‌ that will <a href=\"https://www.macrumors.com/2023/03/10/homepod-with-7-inch-display-to-launch-in-2024/\">feature a 7-inch display</a> and arrive in 2024, according to ‌Ming-Chi Kuo‌. Gurman also believes Apple has a HomePod with a screen in development, but he does not expect it to come out until <a href=\"https://www.macrumors.com/2023/03/20/homepod-with-screen-delayed-next-year/\">next year at the earliest</a>.<br />This article, \"<a href=\"https://www.macrumors.com/guide/what-not-to-expect-apple-october-event/\">What Not to Expect at Apple's 'Scary Fast' October 30 Event</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/what-not-to-expect-at-apples-scary-fast-october-30-event.2408994/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e26b53315887501572129a6cbb441be31bfcf11e70d21510f3cd9b8b19c2085f","category":"Apple"}