{"title":"When is a Porsche 911 not a Porsche 911? When it’s a Ruf","link":"https://arstechnica.com/?p=1767000","date":1621774856000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/IMG_3597-980x735.jpg\" /></div>\n        <p>\n          This looks like a collection of Porsche 911s, but if you checked each car's VIN you'd find they were officially recognized as being made by Ruf.                      [credit:\n                        Ian Wood                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>The Porsche 911 is one of the most instantly recognizable cars in the world. For decades and across multiple generations, Porsche has kept the same basic shape and the same basic format—a flat-six engine mounted behind the rear axle. But some of the most famous 911s don't actually wear the Porsche crest. Instead, they're officially recognized as the products of a company called Ruf, based in Pfaffenhausen, Germany. And there's a new exhibition celebrating them at the Petersen Museum in Los Angeles.</p>\n<p>If you're a car nerd, chances are you already know about Ruf. That might be because of <em>Faszination on the Nürburgring</em>. It's a 20-minute promo video made by Ruf in 1987 and features a bright yellow Ruf CTR, also known as the Yellowbird. Based on the naturally aspirated 911 Carrera 3.2, Ruf seam-welded the chassis, replaced the body panels with lightweight aluminum (or fiberglass for the bumpers), and upgraded the suspension and brakes. Ruf also upgraded the engine, boring it out to 3.4 L and adding a pair of big turbochargers, resulting in at least 463 hp (345 kW) and 408 lb-ft (553 Nm)—well in excess of anything Porsche sold at the time.</p>\n<p></p></div><p><a href=\"https://arstechnica.com/?p=1767000#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1767000&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e26cb27059d4df7baaa05562534d13a35786c71ef395d72ecde6af9ba658c8ce","category":"Tech"}