{"title":"Der European Mining Course – Bergbaulehre international gedacht","link":"http://link.springer.com/10.1007/s00501-024-01515-y","date":1728259200000,"content":"<h3>Zusammenfassung</h3>\n                  <p>Der European Mining Course (EMC) ist ein internationales dreifach‑M.Sc.-Programm, welches Experten für den Bergbau und angrenzende Industrien ausbildet. Der EMC wird von drei international angesehenen Universitäten, der Aalto University aus Finnland, der RWTH Aachen University aus Deutschland und seit 2023 auch der Montanuniversität Leoben (Österreich) ausgerichtet. Die Studierenden durchlaufen im Rahmen des EMCs jeweils ein Semester an den drei Partneruniversitäten, bevor sie im vierten Semester ihre Masterarbeit zumeist in Kooperation mit der Industrie anfertigen. Nach erfolgreichem Abschluss des EMCs erhalten die Studierenden insgesamt drei M.Sc.-Abschlüsse, einen von jeder Partnerhochschule.</p>\n                  <p>Schon seit seiner Gründung 1996 zeichnet sich der EMC durch eine enge Kooperation mit der europäischen Bergbauindustrie aus und stellt so die Relevanz der Ausbildung sicher. Industrievorträge, Exkursionen und Praktika sowie die Möglichkeiten für Abschlussarbeiten bieten praxisnahe Einblicke für die Studierenden. Die Unterstützung der Industriepartner ist zentral durch die Federation of European Mineral Programs (FEMP) organisiert, die als gemeinnützige Stiftung Spenden aus der Industrie einsammelt und verwaltet. Aus den Beiträgen der Industrie werden beispielsweise Stipendien und extra-curriculare Aktivitäten finanziert. Im Gegenzug haben die Unternehmen Zugang zu dem Alumninetzwerk mit mehr als 800 Alumni und die Möglichkeit, sich selbst als attraktiver Arbeitgeber den Studierenden zu präsentieren.</p>\n                  <p>Als zweijähriges internationales Masterprogramm mit der Möglichkeit, in drei verschiedenen europäischen Ländern zu studieren, ist der EMC für Studierende äußerst attraktiv und konnte in den Jahren 2023 und 2024 jeweils Rekordbewerberzahlen verzeichnen. Das internationale, integrierte Curriculum des EMCs baut auf die sich ergänzende Expertise seiner Partneruniversitäten. Der EMC umfasst dabei Fächer zu Gebirgsmechanik, Geologie, Aufbereitungstechnik, Bergbaukunde, Maschinentechnik, Betriebswirtschaftslehre, Projektmanagement und diverse bergbauspezifische Fächer zu Wettertechnik, Abbauplanung und Umweltaspekten.</p>\n                  <p>Die bisherige Erfolgsgeschichte des EMC ist nur mit der Unterstützung aus der Industrie möglich gewesen. Um auch weiterhin hochqualifizierte Bergbauingenieure auszubilden, sind wir auf neue Kooperationen angewiesen.</p>\n                  <p>Weiterführende Informationen unter <a href=\"http://www.emc-master.eu\">www.emc-master.eu</a>,</p>\n                  <p>Möglichkeiten für Kooperationen unter <a href=\"http://www.femp.org\">www.femp.org</a><em>.</em></p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"e2869c6aa05ea5d603f7a0cfad3e0b91e7958a16aa40b0ed78d7bfdd4f8b3dab","category":"Environment"}