{"title":"Beyond the Label: Exploring Consumer Perceptions and Practices of Complementary and Alternative Medicines in Melbourne, Australia","link":"https://www.preprints.org/manuscript/202407.0829/v1","date":1720598427000,"content":"Background: Complementary and alternative medicines (CAM) are widely used, with pharmacies accounting for a significant share of the distribution market. Despite their popularity, many CAMs lack scientific evidence for effectiveness, and some can cause adverse health effects. Limited research exists on CAM-related adverse events and the effectiveness of CAM labels in conveying crucial information. Methods: This cross-sectional study aimed to investigate CAM utilization, consumer perspectives, and the influence of labels on CAM usage in Melbourne, Australia. Data were collected through an online questionnaire and analysed using descriptive statistics, Pearson's correlation, MANOVA, and regression analyses. Results: The study enrolled 125 current CAM users, primarily recruited from pharmacy and supermarket customers (age: predominantly 31-50; gender: 20.8% male, 79.2% female). Participants' perceptions of effectiveness and safety were positively correlated. Label warnings prompted information-seeking, but consultation with healthcare professionals (HCPs), particularly pharmacists, was infrequent (24%). Adverse reactions were reported by 18.5% of participants, with 8.3% experiencing severe reactions. The analysis revealed relationships between CAM usage and demographics. Ordinal logistic regression showed a significant association between calcium consumption and higher age groups (coefficient = 1.658, p = 0.006), while binary logistic regression identified higher iron consumption among females (coefficient = 2.177, p = 0.007). Conclusions: Label warnings significantly prompted consumers to seek more information about CAMs. However, a limited engagement of HCPs, especially pharmacists, suggests an opportunity for improved consumer education and pharmacist involvement in CAMs-related discussions. The findings highlight demographic influences on CAM usage being essential for developing targeted health interventions and policies. Addressing these aspects may lead to safer CAM practices and informed consumer decision-making.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e2939f02ec7fcffd72bdfc0b51f06fc683785af15b969cac05aca0adb8e59086","category":"Interdisciplinary"}