{"title":"<i>Have my back as I get back to work</i>—Experiences of stakeholder support in returning to work after sick leave due to chronic pain: A qualitative interview study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312478","date":1729692000000,"content":"<p>by Åse Lundin, Inger Ekman, Paulin Andréll, Mari Lundberg, Sara Wallström</p>\r\nBackground <p>Chronic pain (pain &gt; 3 months) is a disabling condition affecting around one fifth of the population. Chronic pain significantly affects a person’s psychological and physical health and often interferes with the ability to work. It is one of the most common reasons for extended sick leave and persons with chronic pain often have difficulties returning to work. Interpreting the experiences of currently available is necessary in order to facilitate a return to working life. Therefore, this study aimed to describe and interpret the meaning of support during the return-to-work process for persons on sick leave due to chronic pain.</p> Method <p>A qualitative interview study was conducted with 14 participants (12 women and 2 men) who experienced sick leave due to chronic pain. The participants were recruited through patient organizations focusing on pain or pain-related conditions. Collected data was analyzed using a phenomenological hermeneutical approach.</p> Results <p><i>Have my back as I get back to work</i> was the theme of the analysis, along with six subthemes. Being able to work was important for the participants. However, they often experienced returning to work was a battle for support, dealing with fragmentized backing from the involved stakeholders. Participants with access to collaborative support involving competent care, recognition and the possibility to influence their work felt valuable and capable as persons and workers. Thus, they were provided conditions allowing a successful re-entry into the workplace.</p> Conclusions <p>Our findings contribute to an enhanced understanding of the importance of stakeholder support in persons with chronic pain re-entering the workplace after an extended break due to sick leave. Through an inclusive, collaborative and flexible approach involving all stakeholders working towards the same goal, a person with chronic pain can feel supported in developing and cultivating the capabilities necessary to manage life and work.</p>","author":"Åse Lundin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e2947e819219b7777b2438cb13849ff522b0052a87e8ce01d26a595b40630589","category":"Interdisciplinary"}