{"title":"Top Stories: iOS 17 and watchOS 10 Rumors, When to Expect a New iMac, and More","link":"https://www.macrumors.com/2023/04/08/top-stories-ios-17-watchos-10-rumors/","date":1680958800000,"content":"WWDC is now just two months away, and we're starting to hear a bit more about what we might see with upcoming iOS 17 and watchOS 10 updates that should be unveiled during the keynote.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/top-stories-8apr2023.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nThis week also saw the release of an iOS 16.4.1 bug fix update, another rumor about Apple's timeline for transitioning some of its Mac notebooks to OLED display technology, and a curious Bitcoin-related discovery in macOS, so read on for all the details on these stories and more!\r<br />\n\r<br />\n<h2>iOS 17 Rumored to Feature 'Major' Changes to iPhone's Control Center</h2>\r<br />\niOS 17 will <a href=\"https://www.macrumors.com/2023/04/05/ios-17-control-center-changes-rumor/\">feature \"major\" changes to Control Center on the iPhone</a>, according to a MacRumors Forums member with a proven track record.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/iOS-17-Control-Center-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nControl Center was introduced with iOS 7 nearly a decade ago and has looked largely the same since iOS 11 was released. The menu provides iPhone users with convenient access to controls for Wi-Fi, Bluetooth, display brightness, volume, and many other system functions.\r<br />\n\r<br />\nIt was also claimed that iOS 17 and iPadOS 17 would <a href=\"https://www.macrumors.com/2023/04/04/ios-17-compatible-devices-rumor/\">drop support for the iPhone X, first-generation iPad Pro models</a>, and some other devices, but this rumor was <a href=\"https://www.macrumors.com/2023/04/05/ios-17-to-support-iphone-x-8-plus-claims-leaker/\">later disputed</a>.\r<br />\n\r<br />\n<h2>Is a New iMac Coming in 2023? What We Know So Far</h2>\r<br />\nApple released the <a href=\"https://www.macrumors.com/roundup/imac/\">24-inch iMac with the M1 chip</a> and a colorful ultra-thin design in April 2021. Later this month, it will have been two years since the all-in-one desktop computer was last updated.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/Hello-Tim-Cook-iMac.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nRumors suggest that a new 24-inch iMac with an M3 chip could be released later this year. We've put together a guide <a href=\"https://www.macrumors.com/guide/24-inch-imac/\">covering the latest rumors about the next iMac</a>, including new features and changes to expect.\r<br />\n\r<br />\n<h2>watchOS 10 to Feature 'Notable Changes' for Apple Watch</h2>\r<br />\nThe upcoming watchOS 10 update for the Apple Watch <a href=\"https://www.macrumors.com/2023/04/02/watchos-10-notable-changes-gurman/\">will include \"notable changes\" to the user interface</a>, according to <em>Bloomberg</em>'s Mark Gurman.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/watchOS-16x9.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nApple is expected to announce watchOS 10 during the <a href=\"https://www.macrumors.com/2023/03/29/apple-announces-wwdc-2023/\">WWDC 2023 keynote on June 5</a>, alongside iOS 17, macOS 14, and other new software. On the hardware side of things, Gurman said only modest upgrades are planned for the next Apple Watch models coming later this year.\r<br />\n\r<br />\n<h2>Apple Releases iOS 16.4.1 With Fixes For Siri Response Issues and Other Bugs</h2>\r<br />\nEarlier this week, we learned that <a href=\"https://www.macrumors.com/2023/04/05/apple-testing-ios-16-4-1/\">Apple had an iOS 16.4.1 update in the works</a>, and on Friday <a href=\"https://www.macrumors.com/2023/04/07/apple-releases-ios-16-4-1/\">that update was released to the public</a> with emoji and Siri bug fixes.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/iOS-16.4.1-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nA parallel <a href=\"https://www.macrumors.com/2023/04/07/apple-releases-macos-13-3-1/\">macOS Ventura 13.3.1</a> update with fixes for the emoji issue and a bug with the feature that allows you to automatically unlock your Mac while wearing an Apple Watch. Both the iOS and macOS updates also <a href=\"https://www.macrumors.com/2023/04/07/ios-16-4-1-macos-13-3-1-vulnerability-fixes/\">address a pair of security vulnerabilities</a> that Apple says may have been actively exploited, so be sure to update your devices.\r<br />\n\r<br />\n<h2>Apple Has Included Bitcoin Whitepaper in Every Version of macOS Since 2018</h2>\r<br />\nIn every version of macOS that has shipped since 2018, <a href=\"https://www.macrumors.com/2023/04/06/macos-includes-bitcoin-whitepaper/\">Apple has included the original Bitcoin whitepaper</a> by Satoshi Nakamoto within the filesystem, and no one seems to know why.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/07/apple-bitcoin-hack.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nAnyone with a Mac running macOS Mojave or later can see the PDF for themselves by <a href=\"https://www.macrumors.com/2023/04/06/macos-includes-bitcoin-whitepaper/\">typing this command into Terminal</a>. The document provides an overview of Bitcoin as a peer-to-peer electronic cash system. \r<br />\n\r<br />\n<h2>14-Inch and 16-Inch MacBook Pros Reportedly Not Getting OLED Displays Until 2026</h2>\r<br />\nApple is unlikely to release high-end MacBook Pro models with OLED displays <a href=\"https://www.macrumors.com/2023/04/04/macbook-pro-not-getting-oled-until-2026/\">until 2026</a>, according to display industry analyst Ross Young.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/Oled-MackBook-Pros-23.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nIn the meantime, Young said Apple plans to release a <a href=\"https://www.macrumors.com/2023/03/30/13-4-inch-oled-macbook-air-rumor/\">13.4-inch MacBook Air with an OLED display</a> as early as next year. The switch from LCD to OLED technology would allow for increased brightness, improved contrast ratio, and decreased power consumption for longer battery life.\r<br />\n\r<br />\n<h3>MacRumors Newsletter</h3>\r<br />\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r<br />\n\r<br />\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/apr-6-2023\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/08/top-stories-ios-17-watchos-10-rumors/\">Top Stories: iOS 17 and watchOS 10 Rumors, When to Expect a New iMac, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-ios-17-and-watchos-10-rumors-when-to-expect-a-new-imac-and-more.2386264/\">Discuss this article</a> in our forums<br /><br />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e29800f37aa6af7b92cd01be8dea48c4bbe90539e18b289e602128fbe24d1845","category":"Apple"}