{"title":"DNMT1 regulates hypermethylation and silences hsa_circ_401351 in hydroquinone‐induced malignant TK6 cells","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24089?af=R","date":1709898124000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Benzene and its metabolite hydroquinone (HQ) are widely used in daily life, and long-term exposure to benzene or HQ can induce acute myeloid leukemia (AML). Circular RNAs (circRNAs) are mostly produced by reverse splicing of gene exon mRNA precursors. The modulation of circRNA expression is connected to leukemia progression; however, the molecular mechanism is still unknown.</p>\n<h2>Materials and methods</h2>\n<p>In this study, the cells were divided into four groups: PBS control group (PBS-TK6), TK6 malignantly transformed cells induced by 10.0 μmol/L HQ (HQ-TK6), and HQ-TK6 cells treated with 5 μmol/L 5-AzaC (DNA methyltransferase inhibitor) for 24 h (HQ + 5-AzaC). HQ-TK6 cells were treated with 200 nmol/L TSA (histone deacetylation inhibitor) for 24 h (HQ + TSA). qRT–PCR was used to identify the differential hsa_circ_401351 expression between the four groups. We further determined the hsa_circ_401351 promoter methylation level with methylation-specific PCR. DNMT1 and DNMT3b were knocked down by CRISPR/Cas9 to elucidate the specific molecular mechanism of hsa_circ_401351 in HQ-TK6 cells. CCK-8 and flow cytometry detected cell proliferation and apoptosis, respectively, after hsa_circ_401351 was overexpressed in HQ-TK6 cells.</p>\n<h2>Results</h2>\n<p>Compared with the PBS-TK6 group, the expression of hsa_circ_401351 was found to be lower in the HQ-TK6 group. Nevertheless, treatment with 5-AzaC or TSA increased hsa_circ_401351 expression, with the upregulation being more pronounced in the TSA group. The expression of hsa_circ_401351 in the DNMT1 knockdown group was dramatically increased by 50% compared to that in the control group, and the DNA methylation level of the hsa_circ_401351 promoter region was decreased. When hsa_circ_401351 was overexpressed, HQ-TK6 cell proliferation was significantly slowed after 48 h compared with the control group. Flow cytometry showed that cells were mainly arrested in G1 phase, and apoptosis was significantly enhanced. Similarly, qRT–PCR and Western blot data showed significant reductions in Caspase-3 mRNA and protein production, and Bcl-2 mRNA levels were also elevated.</p>\n<h2>Conclusions</h2>\n<p>Overall, our research showed that elevated DNMT1 expression in HQ-TK6 cells increased methylation levels and decreased expression of the hsa_circ_401351 promoter region, limiting its ability to suppress HQ-TK6 cell growth and enhance apoptosis.</p>","author":"Yali Han, \nJinxue Meng, \nXiaoxuan Ling, \nZhijie Pan, \nHaiqiao Zhang, \nBohuan Zhong, \nShi Chen, \nJing Pang, \nYuliang Ma, \nJialong Chen, \nLinhua Liu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"e29d9867014e709973c04f1b35ef36e327ec39885c6449bbec6d7c6530da3fa8","category":"Environment"}