{"title":"Retinal Hemoperfusion and Vascular Endothelial Function after Pancreatic Transplantation","link":"https://www.preprints.org/manuscript/202408.0147/v1","date":1722693982000,"content":"Introduction: ophthalmological assessment of the retinal circulation and the level of VEGF-A is currently considered a non-invasive and safe diagnostic tool to assess the peripheral microcircu-lation\nObjective: to study retinal hemodynamics and VEGF-A levels in patients with type 1 diabetes mellitus after pancreas transplantation\nSettings and Design:\nA prospective, single-stage, single-center, non-randomized clinical trial\nMethods: 79 patients (158 eyes) with type 1 diabetes mellitus and end-stage diabetic nephropathy participated in the study. Patients were divided into 3 groups: group 1, potential recipients of pancreas and kidney transplant from the waiting list; group 2, patients after kidney transplanta-tion; and group 3, patients after simultaneous pancreas and kidney transplantation. Ophthalmo-logical examination included measuring the macular hemoperfusion density. The level of VEGF-A was examined in the patients' tear by enzyme immunoassay.\nResults: retinal hemoperfusion density and VEGF-A concentration were expected to correlate with the severity of diabetic changes in the fundus of patients. A lower index of retinal hemoperfusion density and a high level of VEGF-A were noted in patients with proliferative ret-inopathy and macular oedema. Group 3 showed the lowest frequency of the active phase of the proliferative retinopathy and retinal macular oedema, characterized by a higher retinal hemoperfusion density in the foveal and the parafoveal zone of the macular region, and low VEGF-A concentration in tear.\nConclusion: measurement of retinal hemoperfusion density and determination of tear VEGF-A concentration are informative objective methods for diagnosing the severity of diabetic changes of the fundus.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e2a78c5176ed0fdc71d8bf9266f03783157e3277d6693fc8b22cbe305880ca74","category":"Interdisciplinary"}