{"title":"Knockout Mouse Studies Show Mitochondrial CLPP Peptidase and CLPX Unfoldase to Act in Matrix Condensates Near IMM, as Fast Stress Response in Protein Assemblies for Transcript Processing, Translation, and Heme Production","link":"https://www.preprints.org/manuscript/202404.1722/v1","date":1714124386000,"content":"LONP1 is the principal AAA+ unfoldase and bulk protease in the mitochondrial matrix, so its deletion causes embryonic lethality. The AAA+ unfoldase CLPX and the peptidase CLPP also act in the matrix, conspicuously during stress periods, but their substrates are poorly defined. Mammalian CLPP deletion triggers infertility, deafness, growth retardation, and cGAS-STING activated cytosolic innate immunity. CLPX mutations impair heme biosynthesis and heavy metal homeostasis. CLPP and CLPX are conserved from bacteria to human, despite their secondary role for proteolysis. Based on recent proteomic-metabolomic evidence from knockout mice and patient cells, we propose that CLPP acts on phase-separated ribonucleoprotein granules, and CLPX on multi-enzyme condensates, near the inner mitochondrial membrane, as first-aid system. Trimming within assemblies, CLPP rescues stalled processes in mitoribosomes, in mitochondrial RNA granules and nucleoids, and in D-foci-mediated degradation of toxic double-stranded mtRNA / mtDNA. Unfolding multi-enzyme condensates, CLPX maximizes PLP-dependent delta-transamination, and rescues malformed nascent peptides. Overall, their actions occur in granules with multivalent or hydrophobic interactions, separated from the aqueous phase. Thus, the role of CLPXP in the matrix is compartment-selective, like peptidases MPP at precursor import pores, m-AAA and i-AAA at either IMM face, PARL within the IMM, and OMA1/HTRA2 in the intermembrane space.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e2af763bfe5d3506e9e7ee39bfb0f60156be5574665dfa65b3703103c6aeeac0","category":"Interdisciplinary"}