{"title":"Waymo expands to San Francisco with public self-driving test","link":"https://arstechnica.com/?p=1789599","date":1629910525000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/SF-800x450.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/SF.png\">Enlarge</a> <span>/</span> Waymo's 5th-generation cars, based on the all-electric Jaguar I-Pace. (credit: Waymo)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Waymo is finally thinking about expanding. The Alphabet self-driving car division has been running an impressive self-driving ride-hailing service for <a href=\"https://arstechnica.com/cars/2020/10/waymo-finally-launches-an-actual-public-driverless-taxi-service/\">almost a year</a> now, but only in a small suburb outside of Phoenix, Arizona. Now, the company is <a href=\"https://blog.waymo.com/2021/08/welcoming-our-first-riders-in-san.html\">expanding</a> commercial service to San Francisco, starting with a \"trusted tester\" rollout. Members of the public willing to sign up for the confidential testing program will soon be able to flag down a Waymo in the city via the app.</p>\n<p>Google says the \"Trusted Tester\" program is \"a confidential research program within Waymo One, where select riders will have access to our autonomous ride-hailing service and can share their experiences directly with our team to help shape the future of autonomous driving.\" During the San Francisco testing program, vehicles will require safety drivers who are ready to intervene if something goes wrong. Metro Phoenix Waymo rides no longer require safety drivers.</p>\n<p>The San Francisco expansion will also mark the commercial rollout of the Jaguar I-Pace Waymo cars. Phoenix uses Chrysler Pacifica minivans for its commercial Waymo service, chosen because they could automatically close the sliding doors. Waymo originally theorized that if someone exited a Waymo vehicle and didn't close the door, the car would be stranded, so the company chose minivans with electric doors. That's apparently not a concern now.</p></div><p><a href=\"https://arstechnica.com/?p=1789599#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1789599&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e2b7c22a8f229be958d81e067cd479bb616f65f32a702363bbb43f017045198b","category":"Tech"}