{"title":"Police say they found mafia fugitive on YouTube, posting cooking tutorials","link":"https://arstechnica.com/?p=1753255","date":1617131442000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/getty-italian-food-800x534.jpg\" alt=\"Bolognese sauce in a pan, next to a bowl of spaghetti.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/getty-italian-food.jpg\" class=\"enlarge-link\" data-height=\"1228\" data-width=\"1840\">Enlarge</a> <span class=\"sep\">/</span> Bolognese sauce and spaghetti. (credit: Getty Images | Westend61)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>An alleged mafia fugitive hiding from Italian police in the Dominican Republic was arrested after being spotted showing off his cooking skills in instructional videos he posted on YouTube, according to news reports.</p>\n<p>Marc Feren Claude Biart, an alleged member of the 'Ndrangheta criminal organization based in southern Italy, reportedly hid his face in the cooking videos but failed to hide his tattoos, leading to his identification. The man had been hiding since law enforcement \"ordered Biart's arrest in 2014 for criminal drug trafficking on behalf of the 'Ndrangheta's Cacciola clan,\" <a href=\"https://www.washingtonpost.com/nation/2021/03/30/mafia-youtube-cooking-tattoos-ndrangheta/\">according to The Washington Post</a>.</p>\n<p>The 53-year-old Biart didn't keep his recipes secret but \"was always careful to hide his face in his Italian cooking tutorials, filming the YouTube videos while laying low from police on a sandy beach in the Caribbean,\" the Post wrote. It's not clear whether the videos are still online, but Biart and his wife \"appeared to have uploaded several cooking tutorials for Italian recipes to YouTube, including ones where Biart's tattoos were visible,\" the Post wrote.</p></div><p><a href=\"https://arstechnica.com/?p=1753255#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1753255&comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e2bad21ff1e6f0b24420466c68d3499accffd693fd8c8430cff353674f2feb1d","category":"Tech"}