{"title":"Google’s I/O Adventure was almost as good as being there","link":"https://arstechnica.com/?p=1766729","date":1621776636000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/3-1-980x661.jpg\" /></div>\n        <p>\n          Virtual Google I/O! It's just like the real thing. Most of those little characters are real people.                       [credit:\n                        Ron Amadeo                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Google I/O was this past week, and while there were still the usual announcements and information dump, the pandemic made the show online-only. Normally, people from across the world descend upon the Shoreline Amphitheater to learn about Google's new products and developer initiatives, swap stories, and network. But none of that could really happen this year, at least not in person.</p>\n<p>Google often tries to \"gamify\" these tech trade shows (I've been known to sometimes <a href=\"https://arstechnica.com/gadgets/2015/03/gallery-google-turns-mobile-world-congress-into-a-big-scavenger-hunt/\">get addicted to</a> them), but this year Google I/O was an <em>actual</em> game, called <em><a href=\"https://events.google.com/io/adventure\">Google I/O Adventure</a></em>. This is Google I/O, with all the booths and information you would expect, but rendered in a 2D, top-down, MMO game that you and everyone else virtually attending can run around in. The game has a rolling chat window for nearby players, and tables in the game world start up a private chat for everyone sitting at them. It was sort like a Google I/O version of <em><a href=\"https://arstechnica.com/tag/second-life/\">Second Life</a></em> or an MMO <a href=\"https://arstechnica.com/tag/animal-crossing/\"><em>Animal Crossing</em></a> that runs in your desktop browser. I/O was only three days long, so most of the hustle and bustle of <em>I/O Adventure</em> is over, but the world will still be online for the next month.</p>\n<p>When you start the game, you first go through character creation and can only pick basics like hair, skin color, and a few options for arms and legs, including wheelchairs and some robot parts. The game is a collect-a-thon though, and scattered across the virtual Google I/O during the convention were all sorts of accessories that fit into various cosmetic items slot. You could stop by the Android booth and get a cool Android hat or get an offline dinosaur doll from the Chrome booth. There are NPCs to talk to and mini-games like golf, fishing, and a few music games. The controls are dead simple: WASD and that's it. If you want to interact with something, walk into it.</p></div><p><a href=\"https://arstechnica.com/?p=1766729#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1766729&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e2ba078179cd9efe1f60c4086fc5a4b5345f7b7a423dec07a0b4a78e47b49a1d","category":"Tech"}