{"title":"Hydrochemical processes and inorganic nitrogen sources of shallow groundwater in the Sanjiang Plain, northeast China","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11121?af=R","date":1726726742000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3623931e-99cb-4c10-94e8-021f678d889b/wer11121-toc-0001-m.png\" alt=\"Hydrochemical processes and inorganic nitrogen sources of shallow groundwater in the Sanjiang Plain, northeast China\" />\n<p>This paper elucidates the hydrochemical process of the Sanjiang Plain in entirety, considering geological conditions that alter significantly from upstream to downstream, and it is concluded that ammonium exceeding standard in groundwater is from natural sources.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This study investigates the chemical characteristics, formation, and sources of inorganic nitrogen (IN) of shallow groundwater across the Sanjiang Plain, aiming to enhance drinking water safety management and pollution control. A total of 167 groundwater and 27 surface water samples were collected for constituents and isotopes (H<sup>2</sup> and O<sup>18</sup>). The hydrogeochemical characteristics showed that the major type is HCO<sub>3</sub>- Ca·Mg, with low total dissolved solids and a neutral to weak alkaline nature. Rock weathering processes govern the hydrochemical composition of groundwater. Hydrogen and oxygen stable isotopes analyses revealed that precipitation serves as the main water source. In alluvial areas, oxidative conditions lead to the enrichment of NO<sub>3</sub>-N concentrations, with sewage, manure, and fertilizers being the primary IN sources. In lacustrine areas, intensive rice cultivation results in reductive conditions and strong denitrification processes, causing the loss of NO<sub>3</sub>-N and leaving NH<sub>4</sub>-N as the dominant IN form. Organic matter mineralization is likely a more significant contributor to NH<sub>4</sub>-N concentrations than ammonium fertilizers. These findings provide valuable information for further research on natural sources and groundwater pollution in areas with similar hydrogeological conditions.</p>\n<h2>Practitioner Points</h2>\n<p>\nRock weathering processes govern the hydrochemical composition of groundwater, and precipitation serves as the main water source.\nIn alluvial areas, oxidative conditions lead to the enrichment of NO<sub>3</sub>-N. In lacustrine areas, intensive rice cultivation results in reductive conditions and strong denitrification processes.\nOrganic matter mineralization is likely a more significant contributor to NH<sub>4</sub>-N concentrations than ammonium fertilizers.\nThese findings provide references for water management and information for further research on natural sources and groundwater pollution in areas with similar hydrogeological conditions.\n</p>","author":"Tingwen Wu, \nZhihong Li, \nHuqun Cui, \nWeipo Liu, \nJiangtao Liu, \nXuxue Cheng, \nMingzhu Liu","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"e2c06f9dc12518568f7d3f6b786ea18eaa55672e9ebd08b104c5ee71bc9f5a96","category":"Environment"}