{"title":"$50 monthly broadband discounts available starting today via 825 ISPs","link":"https://arstechnica.com/?p=1764525","date":1620837378000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/getty-laptop-user-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/getty-laptop-user.jpg\">Enlarge</a> (credit: Getty Images | Oscar Wong)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The Federal Communications Commission today opened enrollment for $50-per-month broadband subsidies for US residents who have low incomes or who lost income during the pandemic. Over 825 Internet service providers across the US are participating in the program, with the full list of ISPs in each state and territory <a href=\"https://www.fcc.gov/emergency-broadband-benefit-providers\">available here</a>. All the biggest ISPs and hundreds of smaller ones are participating, so the subsidies should be available in most areas with home Internet access.</p>\n<p>Cable, fiber-to-the-home, DSL, and fixed wireless ISPs are among the home-Internet services included in the program. The subsidies aren't just for home Internet, as many mobile providers are participating in the program as well. To enroll, go to <a href=\"https://getemergencybroadband.org\">getemergencybroadband.org</a> and click on \"Apply Now.\" I received error messages when clicking the link today, but other people said it was working, so hopefully everyone who needs it will be able to get through without much trouble.</p>\n<p>Congress <a href=\"https://arstechnica.com/tech-policy/2020/12/50-per-month-emergency-broadband-subsidies-approved-in-pandemic-stimulus/\">approved the subsidy program</a> in December, providing $3.2 billion. \"This pandemic-related program will continue until the $3.2 billion in federal funding runs out or six months after the Department of Health and Human Services declares an end to the pandemic,\" the <a href=\"https://www.fcc.gov/document/emergency-broadband-benefit-starts-today\">FCC said today</a>. \"Eligible households will be able to receive on their broadband bill a discount of up to $50 per month, or $75 on qualifying Tribal lands. They will also be eligible for a one-time discount of up to $100 to purchase a laptop, desktop computer, or tablet from participating providers if they contribute more than $10 and less than $50 toward the purchase price.\"</p></div><p><a href=\"https://arstechnica.com/?p=1764525#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1764525&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e2c318e2b8f66d4a1d9ab96122c7609acf20e54b437c4cd85e9b8d6c38c7cc41","category":"Tech"}