{"title":"Neilson Powless and the Garmin that helped him boss the descent","link":"https://cyclingtips.com/2021/07/neilson-powless-and-the-garmin-that-saved-his-race/","date":1627758968000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033356-041-650x433.jpg\" /></div><h2>Neilson Powless and the Garmin that helped him boss the descent</h2><p>\n</p><p>After 223.5 km of racing in the Basque Country, Neilson Powless out-sprinted Matej Mohorič (Bahrain-Victorious) and Mikkel Honoré (Deceuninck-Quickstep) to take his first professional <a href=\"https://cyclingtips.com/2021/07/neilson-powless-wins-the-clasica-san-sebastian/\">victory at Clásica San Sebastián</a>, rewarding the hard work of his team EF Education-Nippo.</p>\n\n\n\n<p>“I can’t even put into words how much this means to me,” Powless said, after fist-bumping half the crowd at the finish. “Our director Juan Manuel [Garate] was so excited for us to come to this race. We didn’t have a favourite for the race, so we tried to ride the race smart. In the end, we played our cards perfectly. I’m so happy.”</p>\n\n\n\n<p>The American’s win was the perfect ending of a great race for the men in pink. Though EF Education-Nippo was without an all-out favourite, their Clásica San Sebastián lineup was stacked with aggressive riders, and it couldn’t have been clearer in the closing stages of the race.</p>\n\n\n\n<p>With the breakaway caught, Simon Carr followed the first attack from the peloton with 45 km to go, and his climbing pace could not be matched by instigator Mikel Landa (Bahrain-Victorious), who fell away within a kilometre. The 22-year-old Brit then led the race solo for around 20 km.</p>\n\n\n\n<p>With his teammate up the road, Powless was able to mark moves from the peloton, and by the descent he had ridden himself into an elite four-man chasing group. By the last 20 km, they’d caught up to Carr, giving EF Education-Nippo two riders in what would become the winning move.</p>\n\n\n\n<p>After putting in a huge effort on the decisive final climb to try and drop his rivals, Powless took on the descent with Mohorič, Honoré and Lorenzo Rota (Intermarché-Wanty). The pace was furious, and in the wet conditions that had plagued the whole race, the descent was particularly dangerous. When the inevitable incident came with 5 km to go, Powless was the only rider to stay upright and unfazed.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CR_3TT-Adny/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CR_3TT-Adny/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Donostiako Klasikoa (@dklasikoa)</a></p></div></blockquote> \n\n\n\n<p>“I was watching the map on my Garmin,” Powless explained. “I think the guys who were in front of me were maybe too focussed on the situation of the race and not so much the road. I could see it was a sharp corner coming up that they ended up crashing in. In the end I was just happy to keep upright, and stay as fresh as possible for the end.”</p>\n\n\n\n<p>This will be an unforgettable victory for Powless, not just for the race’s WorldTour status, nor even it being his first professional win. This one is extra special because Juan Manuel Garate was in the team car, one of the more recognisable sports directors and a former professional rider who came second at the 2007 edition of this very race.</p>\n\n\n\n<p>“My first professional victory,” said Powless, a mixture of delight and disbelief on his face. “I’m just so happy to have taken it here in San Sebastián with a director in the car who’s a local. Every time I’ve raced through the Basque Country it’s been incredible with the fans, so I’m super-happy to win in front of such enthusiastic crowds.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033356-033-1340x893.jpg\" /><figcaption>It was a close sprint for the win at Clásica San Sebastián.</figcaption></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/07/neilson-powless-and-the-garmin-that-saved-his-race/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e2c66241311beae1a60a9a12ea777f905717e6184a193659ae68f1bdca739126","category":"Cycling"}