{"title":"Researcher reveals security hole in Mac App Management","link":"https://www.macworld.com/article/2037255/researcher-reveals-security-hole-in-mac-app-management.html","date":1692632191000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>A software developer has released details about a flaw in App Management, a security feature introduced in <a href=\"https://www.macworld.com/article/678251/macos-13-ventura-features-compatibility-download-install.html\">macOS Ventura</a>. The developer discovered the issue before Ventura was officially released last October, but a fix has never been issued, so the developer has decided to go public with the information.</p>\n\n\n\n<p>App Management is intended to prevent malicious software modifications by keeping an eye out for attempts by software to modify other apps on the Mac. If this happens, App Management blocks the modification and alerts the user, who can allow it if applicable.</p>\n\n\n\n<p>In a blog post, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://lapcatsoftware.com/articles/2023/8/2.html&amp;xcust=1-1-2037255-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Jeff Johnson details</a> how the flaw involves the app sandbox. Sandboxed apps can’t modify other apps without permission, but, Johnson explains, Apple has placed the Applications folder itself within the sandbox. This setup allows non-sandboxed apps to modify other apps and bypass a check by App Management.</p>\n\n\n\n<p>Johnson created an Xcode project that demonstrates the flaw. Johnson actually hinted at this flaw in a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://lapcatsoftware.com/articles/AppManagement.html&amp;xcust=1-1-2037255-1-0-0&amp;sref=https://www.macworld.com/feed\">post back in October 2022</a>, where he explained how App Management works and the five ways an app can get permissions–he noted a sixth way, but did not reveal it at the time because it is this sandbox flaw.</p>\n\n\n\n<p>Johnson said he reported the issue to Apple, who acknowledged receiving the report but has yet to fix it, which led to Johnson revealing the details on his blog. “The standard practice in reporting a security vulnerability is to give the vendor 90 days to address the issue, and I’ve given Apple vastly more time than expected,” Johnson wrote. Apple has not commented on the issue.</p>\n\n\n\n<p>Johnson’s report is a good reminder that users need to be proactive in maintaining a secure Mac. It’s not enough to simply rely on Apple’s security features–as Johnson shows, they’re not perfect. A practice that users should keep in mind is to download software only from trusted sources, such as the App Store (which makes security checks of its software) or directly from the developer. Malware is often disguised as legitimate software and is distributed through email or on the web through forums and software sites that are not vigilant about security.</p>\n\n\n\n<p>Another way to protect yourself is to update to the latest version of macOS whenever possible. Apple releases security patches through OS updates, so it’s important to install them when they are available. When Apple eventually gets around to fixing the App Management flaw, it will be done through a system update.</p>\n\n\n\n<p>Macworld has several guides to help you maintain your security, including a guide on <a href=\"https://www.macworld.com/article/670537/do-macs-need-antivirus.html\">whether or not you need antivirus software</a>, a <a href=\"https://www.macworld.com/article/672879/list-of-mac-viruses-malware-and-security-flaws.html\">list of Mac viruses</a>, malware, and trojans, and a <a href=\"https://www.macworld.com/article/668850/best-mac-antivirus-software.html\">comparison of Mac security software</a>.</p>\n\nMacOS, Security Software and Services</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e2cc592f0c9903ddc7849bbea6331da2c330a284bd492817eb14839e8c73ea93","category":"Apple"}