{"title":"Exhibition of Corallopyronin A an Antibiotic from Different Soil Environments in Egypt","link":"https://www.preprints.org/manuscript/202404.1877/v1","date":1714358968000,"content":"Background: Across the world, antibiotic resistance is a critical challenge. To address such a problem, it has to be done to investigate new antibiotic sources. Aim of the study: Study of the antibacterial activity of Corallopyronin A in preclinical animal testing and randomized human clinical trials stages 1/2, as well as investigating the purification of Corallopyronin A from different soil conditions in Egypt. Type of the study: Screening experimental study. Methodology: Egypt's various soil conditions were tested to develop bacterial isolates that produced the antibiotic compound Corallopyronin A. Reversed phase HPLC was used to purify Myxopyronin A. The broth microdilution method and the paper disc diffusion assay determined the test antibiotic's minimum inhibitory concentration( MIC) and in vitro antibacterial activity. Moreover, in vivo antibacterial spectrum, adverse medication responses, and pharmacokinetics were found in phases 1/2 of randomized clinical studies involving humans and animal models. Results: Corallopyronin A was generated from the culture supernatant of the soil bacterial isolate Corallococcus coralloides M2, cultivated on a Casein yeast peptone( CYP) plate. The test antibiotic prevented the growth of several Gram-ve bacteria, including Escherichia coli, at MICs higher than 100 mcg/ ml; while blocking the development of many Gram +ve bacteria, with MICs ranging from 3 to 15 mcg/ ml. However, eukaryotic cells—such as those found in fungi and humans—were unaffected. A bactericidal consequence of the test antibiotic was detected in the inhibition of prokaryotic DNA-dependent RNA polymerase( RNLP). Conclusion: The synthesis of the bactericidal antibiotic Corallopyronin A from Corallococcus coralloides M2 isolated from different soil settings in Egypt intrigued the current investigation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e2d45a69889f2faa7a90bb27991b654ebd94b9a58387ff9033b615b6ea847a0c","category":"Interdisciplinary"}