{"title":"Use of Direct‐Fed Microbes to Enhance Shrimp Resistance to a Vibrio Parahaemolyticus Strain Causing Early Morality Syndrome (EMS)","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.70002?af=R","date":1728013141000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/a91231b3-ce90-47c3-9e37-eec2335387ee/aff270002-gra-0001-m.png\" alt=\"Use of Direct-Fed Microbes to Enhance Shrimp Resistance to a Vibrio Parahaemolyticus Strain Causing Early Morality Syndrome (EMS)\" />\n<p>\nProbiotics applied at appropriate concentration on feed or in the water column strains can significantly increase survival rates in marine shrimp when exposed to EMS/AHPNS strain of <i>Vibrio parahaemolyticus</i>.\nProbiotic prophylaxis was reliant upon concentration, regardless of the route of application on the feed or in the water column.\nMethods presented in this study can serve as a model for other researchers and producers to evaluate probiotics, prebiotics, or other materials for EMS/AHPNS disease protection.\n</p>\n<br />\n<h2>ABSTRACT</h2>\n<p>Early mortality syndrome (EMS) or acute hepatopancreatic necrosis syndrome (AHPND) is an epizootic bacterial infection of shrimp that has had significant negative impact on the global shrimp aquaculture industry. This disease is largely attributed to pathogenic <i>Vibrio parahaemolyticus</i> EMS strains (VP-EMS). Application of probiotics was examined for control of pathogenic VP-EMS infections in Pacific white shrimp (<i>Litopenaeus vannamei</i>) under laboratory-scale conditions. Two probiotic products, a single strain (O14VRQ) of <i>Bacillus subtilis</i> and a blend (Plus10) of five strains of <i>Bacillus</i> from four different species (<i>Bacillus amyloliquifaciens</i>, <i>Bacillus megaterium</i>, <i>Bacillus brevis</i>, and two distinct strains of <i>Bacillus subtilis</i>), were evaluated at various concentrations as feed additives (applied as a top coat on commercial feed) or dosed directly into the culture water. Two trials were conducted in which shrimp were fed either a control feed (no probiotics) or probiotic-coated feed for 7 days prior to be being challenged with VP-EMS. Shrimp were observed for clinical signs of disease and mortalities during the disease challenge study. These experiments demonstrated that while both <i>Bacillus</i> probiotic products were shown to significantly (<i>p</i> &lt; 0.05) improve shrimp survival, the O14VRQ strain provided the most consistent protection across the trials in top-coated feed. Overall, better efficacy was observed with probiotic-coated feeds. Findings were directly and positively correlated with concentration for top-coated and even more so for direct in-tank applications. Collectively, these findings contribute to our understanding about how probiotic strains could be applied to enhance shrimp health in aquaculture.</p>","author":"David D. Kuhn, \nStephen A. Smith, \nRobert C. Williams, \nÓscar A. Galagarza, \nMeaghan Thompson, \nDavid J. Drahos, \nAnn M. Stevens","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"e2d6bd7e776a05444d29319fd7ab913d214ca449bdf31e4de5750364aaefb0cf","category":"Environment"}