{"title":"Pogačar: We knew Carapaz was bluffing","link":"https://cyclingtips.com/2021/07/pogacar-we-knew-carapaz-was-bluffing/","date":1626287125000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/trio-650x433.jpg\" /></div><h2>Pogačar: We knew Carapaz was bluffing</h2><p>\n</p><p>Richard Carapaz (Ineos Grenadiers) did his best to let his rivals do most of the work in the lead group on the way up the Col du Portet of Wednesday’s <a href=\"https://cyclingtips.com/2021/07/tadej-pogacar-climbs-to-victory-on-stage-17-of-the-tour-de-france/\" target=\"_blank\">stage 17</a> of the <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a>, but Tadej Pogačar (UAE Team Emirates) and Jonas Vingegaard (Jumbo-Visma) both said afterwards that they weren’t fooled into thinking the former Giro d’Italia winner was flagging on the day’s final climb.</p>\n\n\n\n<p>At one point, Pogačar and Vingegaard shared a few words at the front of the group. Then, after hanging at the back of the trio for a several kilometers, Carapaz would put in a stinging attack inside the last 2 km. The move initially dropped Vingegaard, but he would ultimately make his way back to the front. Pogačar took the stage win with Vingegaard nabbing second and Carapaz settling for third.</p>\n\n\n\n<p>After the stage, Pogačar revealed what he and Vingegaard had talked about before Carapaz’s attack.</p>\n\n\n\n<p>“He said to me he thought Carapaz was bluffing, and I knew it also,” Pogačar said of his conversation with Vingegaard. “It was nothing unusual. This is the tactic in cycling, and then he tried to attack. I really had to drive to catch him.”</p>\n\n\n\n<p>Vingegaard shared a similar view in a post-race interview of his own.</p>\n\n\n\n<p>“Even when we were taking it easy he was looking like he was suffering, so I knew he was going to attack,” Vingegaard said.</p>\n\n\n\n<p>On the road, Pogačar did not seem thrilled with Carapaz’s refusal to work as the three leaders distanced other GC hopefuls like Rigoberto Urán (EF Education-Nippo), but in the end, he took the win – his first ever in the yellow jersey – and several seconds anyway, and Vingegaard gained a few seconds on Carapaz too.</p>\n\n\n\n<p>“The three of us went clear but only me and Jonas worked together,” Pogačar said. “I tried a couple of times to go clear. More time is better, but they were really good today. In the end, I just sprinted the last 50 meters, and that was enough.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/pogacar-we-knew-carapaz-was-bluffing/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e2ddd752f1634424b9fab97c19747870fa1a610c78ed21c69d5dfe544ca99bca","category":"Cycling"}