{"title":"Transcriptional control of a stem cell factor nucleostemin in liver regeneration and aging","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310219","date":1726063200000,"content":"<p>by Xiaoqin Liu, Junying Wang, Fang Li, Nikolai Timchenko, Robert Y. L. Tsai</p>\r\n\r\nNucleostemin (NS) plays a role in liver regeneration, and aging reduces its expression in the baseline and regenerating livers following 70% partial hepatectomy (PHx). Here we interrogate the mechanism controlling NS expression during liver regeneration and aging. The NS promoter was analyzed by TRANSFAC. Functional studies were performed using cell-based luciferase assay, endogenous NS expression in Hep3B cells, mouse livers with a gain-of-function mutation of C/EBPα (S193D), and mouse livers with C/EBPα knockdown. We found a CAAT box with four C/EBPα binding sites (-1216 to -735) and a GC box with consensus binding sites for c-Myc, E2F1, and p300-associated protein complex (-633 to -1). Age-related changes in NS expression correlated positively with the expression of c-Myc, E2F1, and p300, and negatively with that of C/EBPα and C/EBPβ. PHx upregulated NS expression at 1d, coinciding with an increase in E2F1 and a decrease in C/EBPα. C/EBPα bound to the consensus sequences found in the NS promoter <i>in vitro</i> and <i>in vivo</i>, inhibited its transactivational activity in a binding site-dependent manner, and decreased the expression of endogenous NS in Hep3B cells. <i>In vivo</i> activation of C/EBPα by the S193D mutation resulted in a 4<sup>th</sup>-day post-PHx reduction of NS, a feature shared by 16-m/o livers. Finally, C/EBPα knockdown increased its expression in aged (24-m/o) livers under both baseline and regeneration conditions. This study reports the C/EBPα suppression of NS expression in aged livers, providing a new perspective on the mechanistic orchestration of tissue homeostasis in aging.","author":"Xiaoqin Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e2e035739af0b4e407556a7df478788336f2bb63c87b132dbcbf8adcaf54760a","category":"Interdisciplinary"}