{"title":"Newegg’s unique NAS configurator is a handy, but limited, shopping tool","link":"https://arstechnica.com/?p=1925650","date":1679430112000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/screenshot-1-800x386.jpg\" alt=\"Newegg’s unique NAS configurator is a handy, but limited, shopping tool\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/screenshot-1-scaled.jpg\">Enlarge</a> (credit: <a href=\"https://www.newegg.com/tools/nas-builder\">Newegg</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Newegg has a quick and dirty way to pick a new NAS device and the drives that'll go in it. Announced today, the <a href=\"https://www.newegg.com/tools/nas-builder\">NAS Builder</a> provides a unique, clean interface for perusing the retailer's available NAS enclosures and picking compatible HDDs or SSDs within the selected NAS device's capabilities. You're limited to Newegg's selection, and not all NAS, HDD, or SSD specs and features are disclosed through the shopping tool. But used with its limits in mind, the builder looks like a helpful starting point for NAS newcomers or even advanced users seeking a basic comparison tool.</p>\n<p>Anyone who has shopped for tech components, be it for NAS, PC building, or a maker's project, knows how tedious, unorganized, and unreliable relevant commerce sites can be. That's why Newegg's NAS Builder initially piqued my interest.</p>\n<p>Opening the website prompts you to pick your total capacity requirements, up to \"144TB &amp; Above,\" and from there, it shows you the relevant NAS devices that Newegg carries. All the expected sorting tools are there, so you can sort by price or for products with the most reviews (on Newegg), for example. Like Newegg's regular site, you can add filters like bay count and RJ-45 specs, but the NAS Builder's appearance is much cleaner with a more stripped-down set of filters than the rest of Newegg, as well as other sites NAS shoppers might frequent. Unlike NAS configurators from NAS vendors, Newegg's is more brand agnostic.</p></div><p><a href=\"https://arstechnica.com/?p=1925650#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1925650&amp;comments=1\">Comments</a></p>","author":"Scharon Harding","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e2e2ef61214b400ef34d7a0a45dd695b3c176040051c45f310c42e88dc7fe54e","category":"Tech"}