{"title":"Advances in the application of stereo vision in aquaculture with emphasis on fish: A review","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12919?af=R","date":1714210742000,"content":"<h2>Abstract</h2>\n<p>The effective implementation of machine vision has played a crucial role in advancing intelligent aquaculture across various domains. Stereo vision, as a branch of machine vision, has become a mainstream technology in aquaculture. Its distinctive capability to conduct comprehensive underwater monitoring from multiple angles, unaffected by object occlusion has propelled it to the forefront of aquaculture applications. This article offers a comprehensive review of the diverse applications of stereo vision in aquaculture spanning from its inception to present. The exploration encompasses its role in crucial areas such as biomass estimation and behavioural analysis, which include fish counting, weight estimation, swimming behaviour, feeding behaviour and abnormal behaviour. Furthermore, the paper delves into the advantages of stereo vision over traditional 2D machine vision approaches, while also acknowledging limitations, and identifying future challenges that must be addressed to fully leverage its potential in aquaculture. The review emphasizes the prospect of advancement in deep learning stereo-matching algorithms specifically designed for underwater environments to catalyse a breakthrough in stereo vision technology. In summary, this review aims to provide researchers and practitioners with a better understanding of the current development of stereo vision in aquaculture, optimizing stereo vision technology and better serving the aquaculture field.</p>","author":"Daoliang Li, \nJiaxuan Yu, \nZhuangzhuang Du, \nWenkai Xu, \nGuangxu Wang, \nShili Zhao, \nYasai Liu, \nAkhter Muhammad","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"e2e66c2393b0630b3aa1c68bf57b57bf0380d13608ebb9f2f7d234338fbcd027","category":"Environment"}