{"title":"Adherence to cardiovascular medications and risk of cardiovascular disease in breast cancer patients: A causal inference approach in the Pathways Heart Study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310531","date":1726754400000,"content":"<p>by Marilyn L. Kwan, Noel Pimentel, Monika Izano, Carlos Iribarren, Jamal S. Rana, Mai Nguyen-Huynh, Richard Cheng, Cecile A. Laurent, Valerie S. Lee, Janise M. Roh, Eileen Rillamas-Sun, Dawn L. Hershman, Lawrence H. Kushi, Heather Greenlee, Romain Neugebauer</p>\r\nPurpose <p>Women with breast cancer (BC) are at high risk of developing cardiovascular disease (CVD). We examined adherence to CVD medications and their association with major CVD events over 14 years of follow-up in the Pathways Heart Study, a prospective study of 4,776 stage I-III BC patients diagnosed from 2005–2013.</p> Methods <p>Eligibility included being alive 6 months post-BC diagnosis, with dyslipidemia, hypertension, or diabetes at diagnosis along with ≥1 prior outpatient order or dispensing for a statin, anti-hypertensive, or diabetes medication, respectively, in the 30 months prior. Medication adherence was measured from pharmacy data to calculate cumulative average adherence (CAA). Incident heart failure (HF), ischemic heart disease (IHD), and stroke were determined via validated diagnosis and procedure codes. Working marginal structural models (MSM) fitted with inverse probability weighting evaluated the effect of adherence regimens on the hazards for each CVD event, while controlling for baseline and time-varying confounders. MSM parameterizations included: 1) CAA&lt;100% versus CAA = 100% (ref), 2) CAA&lt;80% versus CAA≥80% (ref) and 3) CAA&lt;80% versus 80%≤CAA&lt;100% versus CAA = 100%.</p> Results <p>Poor statin adherence (CAA&lt;80%) was associated with higher risk of composite CVD (HR = 2.54; 95% CI: 1.09, 5.94) versus CAA≥80%. Poor statin adherence was also associated with a higher risk of stroke (HR = 8.13; 95% CI: 2.03, 32.51) but not risk of IHD and HF. Further, compared with perfect adherence (CAA = 100%), good adherence (80%≤CAA&lt;100%) was associated with lower risk (HR = 0.35; 95% CI: 0.13, 0.92) while poor adherence (CAA&lt;80%) was associated with higher risk of composite CVD (HR = 2.45; 95% CI: 1.05, 5.70). Levels of adherence to anti-hypertensives and diabetes medications had mixed or null associations with risk of CVD.</p> Conclusions <p>Maintaining good adherence (≥80%) to statins after BC treatment is beneficial for cardiovascular health in patients with dyslipidemia. Future studies should determine factors associated with lower adherence to statins and ways to improve adherence.</p>","author":"Marilyn L. Kwan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e2ecb6bdd4bfbb939c7fd9f0c6dfddc68a6b6373eb2c469132114296fe9cd3a1","category":"Interdisciplinary"}