{"title":"How protected is your Mac without FileVault enabled?","link":"https://www.macworld.com/article/2059452/how-protected-is-your-mac-without-filevault-enabled.html","date":1695891600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple has used the FileVault name to cover full-disk encryption (often abbreviated FDE) since Mac OS X 10.7 Lion back in 2011. For years, FileVault used a read/write intensive encryption method that took a long time to first encrypt your drive and then was a slight drag on performance thereafter, though not very noticeable.</p>\n\n\n\n<p>In exchange, FileVault offered three significant protections against physical access to your computer, up to and including someone running off with your Mac and having all the time in the world to gain access.</p>\n\n\n\n<p>First, at rest (when powered down), your Mac’s drive was completely encrypted. Without having the encryption keys, which are protected by your account password, an attacker could try to break in directly or extract a hard drive (or later, Fusion Drives and SSDs), but they’d be completely locked out.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/enable-filevault-recovery-key-sonoma-bordered-1.png\" alt=\"FileVault Recovery Key\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/enable-filevault-recovery-key-sonoma-bordered-1.png?quality=50&amp;strip=all 1168w, https://b2c-contenthub.com/wp-content/uploads/2023/09/enable-filevault-recovery-key-sonoma-bordered-1.png?resize=300%2C100&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/enable-filevault-recovery-key-sonoma-bordered-1.png?resize=768%2C256&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"342\" /><figcaption><p>Enabling FileVault adds one more strong level of protection to your Mac startup.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Second, macOS wouldn’t unlock your drive for access at startup without a valid account password or an associated Recovery Key. One vector that can still be exploited is that if you use Apple’s option to store your Recovery Key in escrow in your Apple ID account, someone who cracks your Apple ID account could potentially also gain access to the Recovery Key and unlock your Mac’s drive. (Technically, with FileVault active, your Mac starts up using the recoveryOS, the small partition that also helps you reinstall macOS or recover from big problems.)</p>\n\n\n\n<p>[Can’t find your Recovery Key? See “<a href=\"https://www.macworld.com/article/231249/how-to-find-your-filevault-recovery-key-in-macos.html\">How to find your FileVault recovery key in macOS</a>.” Not sure if you have a current copy of the Recovery Key? “<a href=\"https://www.macworld.com/article/340731/is-your-macos-filevault-recovery-key-current-heres-how-to-check.html\">Is your macOS FileVault Recovery Key current? Here’s how to check</a>.”]</p>\n\n\n\n<p>Third, even after successfully unlocking the drive and booting into macOS proper, someone still has the normal Mac security to get through: they need an account password to log in. While exploits have been discovered occasionally that let attackers bypass the login screen, they are typically short-lived—because they’re valuable on the gray market and then discovered and patched by Apple—and can’t be triggered remotely in any case. A ne’er-do-well has to have such an exploit, <em>and</em> your locked but booted into macOS computer in front of them.</p>\n\n\n\n<p>Starting with Intel Macs that featured the T2 Security Chip, Apple built encryption in at the bottom level of macOS: your startup internal volume is <em>always</em> encrypted, and you can’t turn it off. This is the same with all M-series Apple silicon Macs. (If you use an external volume, enabling FileVault also encrypts the volume, which can be quite rapid with a modern SSD.)</p>\n\n\n\n<p>For T2-equipped Intel Macs and all M-series Macs, FileVault adds protection at step two only. With FileVault disabled on those Macs, when you start up your computer, the drive is automatically unlocked and ready for use with a login.</p>\n\n\n\n<p>People have varying security needs. If you never fear that your computer will be stolen by anyone who could employ some high level of hacker skills—including a government agency—then perhaps you don’t need to enable FileVault. FileVault adds a level of risk because if account data is somehow corrupted on the recoveryOS, you must have your Recovery Key to get back into your Mac. (See “<a href=\"https://www.macworld.com/article/352153/how-to-unlock-your-mac-with-recovery-key-filevault.html\">How to unlock your Mac with its Recovery Key and FileVault active</a>.”) I receive emails regularly from people who can’t find their Recovery Key and didn’t use Apple’s iCloud escrow for security reasons.</p>\n\n\n\n<p>However, if you are sure you can maintain good records (or trust the iCloud escrow) and want to be sure that a stolen or accessed Mac will never give up your private data and other secrets, enabling FileVault provides just one more layer of protection.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Derek.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nMac, MacOS, Security Software and Services</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e2f425ddc052a82ab9fac041866fe7789a6f7693033cd4cd64421aef6efdcfd8","category":"Apple"}