{"title":"Mapping the moral foundations of the European Union: Why a lack of moral diversity may undermine perceived EU legitimacy","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae282/7714042?rss=1","date":1724371200000,"content":"<span><div>Abstract</div>The stability and effectiveness of supranational organizations, like the European Union (EU), will improve when citizens perceive them as legitimate. Across three studies, two of which were preregistered, and a preregistered pilot study, we combined EU legal expertise with social psychological theory on morality to understand how perceived EU legitimacy is influenced by a sense of moral alignment with the EU. We propose that, currently, the EU gives more weight to values linked to “individualizing” moral foundations (e.g. compassion, social justice, and equality) than to values linked to “binding” moral foundations (e.g. patriotism, religion, and traditionalism). As this may leave people who endorse binding moral foundations feel unrepresented, we investigated whether the EU could gain legitimacy by appealing to values that resonate with binding moral foundations. In study 1, text analyses revealed that the European Commission President's State of the Union speeches indeed appeal more to individualizing than to binding moral foundations. Study 2 (<span>n</span> = 595) provided correlational evidence that the negative relationship between binding moral foundations and perceived EU legitimacy was mediated by lower moral alignment with EU law. Finally, study 3 (<span>n</span> = 567) showed through an experiment that reframing or rebalancing EU law to better align it with binding moral foundations could increase perceived EU legitimacy among people who endorse these moral foundations. The results illustrate the importance of understanding and attending to moral diversity among EU citizens. More generally, our work shows how a collaboration between social psychology and law contributes to safeguarding the legitimacy of supranational organizations.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"e2fa1e210d19a821465ed0bf4f3fb196edbf949b71eb14d15ac515845a3721d8","category":"Interdisciplinary"}