{"title":"The effects of Capsicum annuum oleoresin, as a dietary carotenoid, on growth, gut microbiome, intestinal histomorphometry, and sensory characteristics of Oncorhynchus mykiss","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13039?af=R","date":1707993399000,"content":"<h2>Abstract</h2>\n<p>This study was designed to explore the dietary effects of <i>Capsicum annuum</i> oleoresin (CAO) on growth, body composition, sensory characteristics, gut microbiome, and intestinal histomorphometry of rainbow trout. Fish (195.13 ± 1.55 g) were fed diets with various CAO levels (0.0-Control, 7.0- g kg <sup>−1</sup> C7, 14.0 g kg <sup>−1</sup> -C14, 21.0 g kg <sup>−1</sup>-C21, and 28.0 g kg <sup>−1</sup>-C28) for a 30-day period. Results revealed that the maximum growth was achieved in C7 and C14 groups. Nevertheless, the growth parameters were similar in other groups compared to the control. Moreover, there were significant increases in dry matter and crude lipid contents in all CAO groups compared with the controls. The mean abundances (%) of the prevalent bacteria at the genus level in the intestinal trout samples presented no significant changes among the test groups. Dietary CAO significantly changed the intestinal histological structure, and was manifested by an increased number of goblet cells in the CAO-supplied groups. However, there were intestinal villus epithelial deformations associated with increasing dietary CAO, and were most prominent in the C28 group. The sensory attributes of cooked trout fillets showed that capsicum's pungent odor and taste was evident in the C14 group and subsequently increased with increasing dietary CAO levels. Accordingly, the results showed, for the first time, that dietary CAO at levels (7–14 g kg<sup>−1</sup>) can enhance the growth of rainbow trout without negative effects on the sensory characters and gut health.</p>","author":"Sevdan Yilmaz, \nEkrem Şanver Çelik, \nSebahattin Ergün, \nMert Gürkan, \nFevziye Işıl Kesbic, \nHany M. R. Abdel‐Latif","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"e2fc8acb12a39979475e8afcfb8ce6a0983fef26a336e81af67fbae012391555","category":"Environment"}