{"title":"Older women’s experience with COVID-19 pandemic: A study of risk perception and coping among culturally and linguistically diverse population in South Australia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301366","date":1711634400000,"content":"<p>by Noore Alam Siddiquee, Mohammad Hamiduzzaman, Helen McLaren, Emi Patmisari</p>\r\nBackground <p>A global catastrophe–the COVID-19 pandemic–appears to have two-dimensional health consequences for older adults: high risk of being infected and psychological distress. There is limited evidence on how the pandemic has impacted the life and coping of older adults who are culturally and linguistically diverse (CALD), women in particular. This study explored the COVID-19 risk perception and coping strategies of older CALD women in South Australia.</p> Methods <p>A mixed-methods research design was employed, involving a 31-items coping and emergency preparation scale for survey and semi-structured interviews with participants. The older CALD women were approached through 11 multicultural NGOs. One hundred and nine women participants from 28 CALD communities completed the online surveys; 25 of them agreed to a telephone interview and provided their contact details. 15 older CALD women ultimately participated in interviews.</p> Results <p>Mean sum-score of dread risk, unknown risk, and fear (M: 43.5; SD: 4.9) indicated that the participants were somewhat anxious and worried. Mean sum-score of coping (M: 79.8; SD: 9.3) reported their compliance with expert advice and disinfection practices but accessing health information (M: 2.8; SD 1.4) and tendency to minimize anxiety (M: 2.1; SD: 1.2) were below neutral. Significant variations were found in coping in terms of age, meaning that the women aged 75 years and older were less likely to cope with the pandemic (<i>P</i> = 0.01). Emergency preparation differed based on the participants’ residence and occupation status. The deductive-inductive thematic analysis of interview data was framed around three priori themes: risks of being affected, emotional and behavioral coping, and emergency preparation and access to services.</p> Conclusions <p>Evidence shows a fear among the older CALD women with an endeavor to cope and prepare for emergency situations. This suggests the requirements for interventions that improve coping and reduce the risk of stress among them.</p>","author":"Noore Alam Siddiquee","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e313d1ed3903518fcacd91f448b17ca8278865684204daa02c369e66c1f0710e","category":"Interdisciplinary"}