{"title":"Apple Secretly Had a 'Double Agent' in the iPhone Leaker Community","link":"https://www.macrumors.com/2021/08/18/apple-double-agent-leaker/","date":1629305634000,"content":"For more than a year, a member of the iPhone leaks and jailbreaking community was actually serving as a \"double agent\" for Apple by secretly providing the company with information about other leakers, according to <em><a href=\"https://www.vice.com/en/article/3aqyz8/apples-double-agent\">Motherboard</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/iphone-13-lineup-dummy-models.jpg\" />\r\n<br />\r\nThe report claims that Andrey Shumeyko, who was known as \"YRH04E\" online, advertised internal Apple information and stolen devices for sale on platforms like Twitter and Discord. However, unbeknownst to other members of the community, the report adds that he was secretly providing Apple's Global Security team with information that could help the company crack down on leaks and the individuals responsible for them.\r\n<br />\r\n\r\n<br />\r\nIn May 2020, after a pre-release version of iOS 14 was leaked online, the report claims ​​Shumeyko provided Apple with information about an individual who allegedly helped \"orchestrate\" the leak by purchasing a stolen iPhone 11. The prototype device was allegedly loaded with an early development build of iOS 14 intended for internal use by Apple employees, prior to the software being announced at WWDC in June 2020.\r\n<br />\r\n\r\n<br />\r\nShumeyko added that, in the summer of 2020, he informed Apple that he had been in contact with an Apple employee in Germany who worked on Apple Maps. The employee was allegedly offering to sell access to an internal Apple account used to access corporate emails and other internal materials on Apple's intraweb. Shumeyko said that he kept in touch with the employee and later learned that he had been fired by Apple.​​\r\n<br />\r\n\r\n<br />\r\nShumeyko said that by serving as an informant for Apple, he hoped he would be able to redeem himself for being a former participant in the iPhone leaks community, and he also hoped there would be a financial incentive for his cooperation. ​​Shumeyko said he repeatedly asked if it would be possible for him to be paid for his information, but Apple was apparently noncommittal, and he is now speaking out after feeling taken advantage of.\r\n<br />\r\n\r\n<br />\r\n\"I just wanted to be heard for once, and the story I tell to be truthful,\" ​​Shumeyko said, according to the report, adding that he does not care what anyone will think of him now that his role as a \"double agent\" has been revealed.  <br />This article, \"<a href=\"https://www.macrumors.com/2021/08/18/apple-double-agent-leaker/\">Apple Secretly Had a 'Double Agent' in the iPhone Leaker Community</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-secretly-had-a-double-agent-in-the-iphone-leaker-community.2307946/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=xBH6wxRdGPQ:mNWFyma0DGk:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=xBH6wxRdGPQ:mNWFyma0DGk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/xBH6wxRdGPQ\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e32518ba1e22de4d7a1b6fd55bcd961fdd054172dcf37119e2f47eff04580f1f","category":"Apple"}