{"title":"Grab a pair of recommended Anker noise-canceling headphones for $68","link":"https://arstechnica.com/?p=1758202","date":1618948680000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/dealmaster042021-800x444.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/dealmaster042021.jpg\">Enlarge</a> (credit: Ars Technica)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Today's Dealmaster is headlined by a nice discount on Anker's Soundcore Life Q30: the wireless noise-canceling headphones are <a href=\"https://amzn.to/3eoJNAS\" target=\"_blank\">currently down to $68 at Amazon</a>. That's $12 off the pair's usual going rate online and less than $5 above the lowest price we've tracked to date.</p>\n<p>We <a href=\"https://arstechnica.com/staff/2021/02/amazon-deal-anker-noise-cancelling-headphones/\" target=\"_blank\">highlighted a similar deal</a> earlier in the year and continue to find the Soundcore Life Q30 to be an impressive value. While the Q30 can't match the build quality or raw noise-canceling strength of a <a href=\"https://arstechnica.com/gadgets/2020/09/home-office-setup-ideas/#h25\" target=\"_blank\">more expensive pair from Sony</a> or Bose, the Q30 provides a cushy and comfortable design, excellent battery life at around 40 hours, USB-C charging, multidevice connectivity, and physical controls. Its sound is deeply heavy on the bass by default and absolutely not for audio purists, but the signature can be tweaked and customized through its companion app. And while its active noise cancellation is far from the strongest we've seen, it's still capable enough for tuning out everyday sounds, especially given its price.</p>\n<p>If you're not in need of a new pair of headphones, though, our deals roundup also has offers on Fitbit activity trackers, indoor security cameras, the latest <em>Call of Duty </em>game, top-notch wireless mice for both gaming and office work, and much more. You can have a look at the full list below.</p></div><p><a href=\"https://arstechnica.com/?p=1758202#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1758202&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e3281c41242f35df8972dc27206822f962301b2478a1edb195093083710e06b6","category":"Tech"}