{"title":"[ลือ] iPhone 15 เริ่มขายวันแรก 22 กันยายนนี้ งานเปิดตัวจัดช่วง 12-13 กันยายน","link":"https://www.blognone.com/node/135150","date":1691367590000,"content":"<div><div><div><p>Mark Gurman แห่ง Bloomberg อัพเดตข้อมูลสินค้าใหม่แอปเปิลผ่านจดหมายข่าว Power On ประจำสัปดาห์ คราวนี้พูดถึง iPhone 15, Mac ชิป M3 และเซสชันของนักพัฒนาสำหรับ Apple Vision Pro</p>\n<p>เริ่มที่ iPhone 15 ข้อมูลจาก Gurman พบว่าแอปเปิลมักมีรอบอัพเกรด iPhone ครั้งใหญ่ทุก 3 ปี ในระยะหลัง (<a href=\"https://www.blognone.com/node/60237\">iPhone 6</a> ปี 2014 มีสองขนาดจอ, <a href=\"https://www.blognone.com/node/95438\">iPhone X</a> ปี 2017 มี FaceID, <a href=\"https://www.blognone.com/node/119003\">iPhone 12</a> ปี 2020 รองรับ 5G) โดยสำหรับ iPhone 15 การเปลี่ยนแปลงสำคัญคือ ขอบหน้าจอที่เล็กลง, ขอบเครื่องไทเทเนียม และพอร์ต USB-C</p>\n<p>เขาบอกว่า iPhone 15 น่าจะเริ่มขายวันแรก ศุกร์ที่ 22 กันยายนนี้ ส่วนอีเวนต์เปิดตัวจะจัด 1 สัปดาห์ก่อนหน้า อยู่ในช่วงวันที่ 12-13 กันยายน และเปิดจองล่วงหน้า 15 กันยายน กรอบเวลานี้มีความสำคัญเพราะทำให้แอปเปิลบันทึกยอดขาย iPhone รุ่นใหม่ เข้ามาในไตรมาสปัจจุบัน หลังจากแอปเปิล<a href=\"https://www.blognone.com/node/135119\">รายงานยอดขาย</a>ที่ลดลงติดต่อกันหลายไตรมาส</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f73e99c7d3c6ab9ee778d5f5ff49185a.png\" alt /></p>\n<p>มาที่ Mac รุ่นชิป M3 ข้อมูลของ Gurman บอกว่าตอนนี้มีการทดสอบใช้งานภายในสำนักงานแอปเปิลแล้ว คาดเปิดตัวเร็วที่สุดในเดือนตุลาคม โดยโมเดลล่าสุดที่นำมาทดสอบมีทั้ง iMac และ MacBook Pro ทำให้ตอนนี้แอปเปิลมี Mac ที่ใช้ M3 เริ่มทดสอบแล้วเกือบครบทุกรุ่นซึ่งรวมทั้ง MacBook Air, Mac mini ไปจนถึงชิป M3 Pro และ M3 Max สำหรับ MacBook Pro ด้วย</p>\n<p>สุดท้ายเป็นอัพเดตของเฮดเซต Vision Pro ซึ่งตอนนี้แอปเปิลเปิดให้นักพัฒนาจองเซสชันแล็บเพื่อลองใช้งานโค้ดที่เขียน แล้วทำงานผ่าน Vision Pro เต็มรูปแบบ ข้อมูลพบว่าความสนใจจากฝั่งนักพัฒนายังไม่มากนัก ซึ่งไม่ใช่เรื่องประหลาดใจเพราะสินค้ามีราคาแพง และนักพัฒนาก็ยังไม่มั่นใจที่จะลงทุนตอนนี้</p>\n<p>นักพัฒนาที่ได้เข้าร่วมเซสชันซึ่งจัดที่สำนักงานใหญ่แอปเปิลเผยว่า คนเข้าร่วมไม่เยอะมาก มีพื้นที่ว่าง และในอเมริกาเซสชันของโซนตะวันออกก็ยกเลิกไปหลายรอบด้วย</p>\n<p>ที่มา: <a href=\"https://www.bloomberg.com/news/newsletters/2023-08-06/apple-iphone-15-comes-amid-us-sales-slowdown-tim-cook-q3-earnings-comments-lkzfs14u\">Bloomberg</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/iphone-15\">iPhone 15</a></div><div><a href=\"/topics/iphone-15-pro\">iPhone 15 Pro</a></div><div><a href=\"/topics/rumors\">Rumors</a></div><div><a href=\"/topics/apple-vision-pro\">Apple Vision Pro</a></div><div><a href=\"/topics/apple-m3\">Apple M3</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e3299676c49196b9dc83ccf2b6c4f2e1ff953ff72a7e09e9ae849013ce613f61","category":"Thai"}