{"title":"Marvel drops first teaser for Shang-Chi and the Legend of Ten Rings","link":"https://arstechnica.com/?p=1757928","date":1618874935000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Simu Liu stars as a martial artist trying to escape his past in <em>Shang-Chi and the Legend of the Ten Rings</em>. </p></div>\n<p>A young man who once trained as an assassin for a Chinese criminal organization discovers just how hard it can be to escape one's past in the first teaser for Marvel Studios' upcoming film, <a href=\"https://en.wikipedia.org/wiki/Shang-Chi_and_the_Legend_of_the_Ten_Rings\"><em>Shang-Chi and the Legend of Ten Rings</em></a>, part of the MCU's Phase Four. Directed by Destin Daniel Cretton, it is the first Marvel film to feature an Asian lead—Simu Liu, best known for his role as Jung Kim on the sitcom <a href=\"https://en.wikipedia.org/wiki/Kim%27s_Convenience\"><em>Kim's Convenience</em></a>—as well as a predominantly Asian/Asian diaspora cast and crew.</p>\n<p>The title character <a href=\"https://en.wikipedia.org/wiki/Shang-Chi\">first appeared</a> in a Marvel comic in 1973, after the company had tried and failed to acquire the comic book rights for the popular 1970s TV show <a href=\"https://en.wikipedia.org/wiki/Kung_Fu_(1972_TV_series)\"><em>Kung Fu</em></a> (starring David Carradine). Modeled in part on Bruce Lee, Shang-Chi was originally the son of Chinese criminal mastermind Dr. Fu Manchu, trained in martial arts since childhood to become an assassin. After Marvel lost the rights to the Fu Manchu character, Shang-Chi's paternity became murkier, but the international crime lord theme was common—although his father was revealed to be an ancient immortal sorcerer in the <em>Secret Avengers</em> storyline.</p>\n<p>Shang-Chi has not traditionally had special superpowers, but his training in multiple styles of martial arts and assorted weaponry makes him a formidable opponent and a useful ally. Plus, he is a master of chi, making him even stronger and faster—fast enough to dodge bullets. When he eventually joins forces with the Avengers in the comics, Tony Stark gives him a pair of bracelets to further focus his chi (as well as some snazzy high-tech nunchaku).</p></div><p><a href=\"https://arstechnica.com/?p=1757928#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1757928&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e32ad63b9dbc133f20cc5f746b9c63c9139c8f8c9b3848f32f75aeacd1d37949","category":"Tech"}