{"title":"T-Mobile Completes Spam Prevention Rollout, Now Authenticates Calls From 98% of Wireless Users","link":"https://www.macrumors.com/2021/03/25/t-mobile-spoofed-call-authentication-complete/","date":1616689899000,"content":"T-Mobile <a href=\"https://www.t-mobile.com/news/network/stir-shaken-all-networks\">today announced</a> that it is the first U.S. wireless provider that has managed to complete deals with all wireless networks to implement full number spoofing and spam call protection for customers.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/07/tmobilescamshield.jpg\" alt=\"\" width=\"2000\" height=\"1356\" class=\"aligncenter size-full wp-image-750565\" />\r\n<br/>\r\nWith these partnerships in place, T-Mobile has completed its implementation of the STIR/SHAKEN standards that are in place to combat illegal caller ID spoofing. T-Mobile is now able to authenticate calls with wireless and network providers that represent 98 percent of wireless customers in the United States.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/07/tmobilescamshield2.jpg\" alt=\"\" width=\"1005\" height=\"1006\" class=\"aligncenter size-full wp-image-750566\" />\r\n<br/>\r\nT-Mobile offers a \"Scam Shield\" Un-carrier feature that susses out and blocks scams and robocalls. The company has been working on improving Scam Shield, and its new partnerships with Spectrum Voice and Charter Communications ensure number verification across almost all providers in the U.S. to authenticate incoming calls for T-Mobile customers.<blockquote>\"T-Mobile was first to implement number verification in 2019 because protecting customers against scammers and spammers is one of the most important things we can do as an industry,\" said Mike Sievert, CEO T-Mobile. \"To date, T-Mobile has protected over 80 million customers from more than 33 billion suspect calls - and counting. With the combination of Number Verification, free Caller ID and the scam blocking tools in Scam Shield, and by working with network providers of all sizes, we are providing the industry's most comprehensive scam and spam protection for free to all our customers and working every day to make scammers jobs impossible.\"</blockquote>The FCC is requiring all carriers in the United States to implement STIR/SHAKEN by June 2021, so other major wireless providers like AT&T and Verizon will need to add the same protections for their customers.\r\n<br/>\r\n\r\n<br/>\r\nT-Mobile's <a href=\"https://www.macrumors.com/2020/07/16/t-mobile-launches-scam-shield/\">Scam Shield</a> is a free Caller ID tool that warns customers when a number calling is likely to be a scammer, and there's an option to block scammers entirely.\r\n<br/>\r\n\r\n<br/>\r\nAT&T and Verizon have similar spam caller prevention tools, but both charge for premium access. AT&T charges &#36;3.99 for features that include Caller ID (though it is included free in the highest tier unlimited plans), while Verizon charges &#36;2.99 per month for Caller ID. Both <a href=\"https://about.att.com/story/2019/call_validation_displays.html\">AT&T</a> and <a href=\"https://www.verizon.com/business/products/contact-center-cx-solutions/voice-security/stir-shaken-caller-id-identification/\">Verizon</a> are working to implement STIR/SHAKEN for identifying spoofed calls.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/t-mobile/\">T-Mobile</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/25/t-mobile-spoofed-call-authentication-complete/\">T-Mobile Completes Spam Prevention Rollout, Now Authenticates Calls From 98% of Wireless Users</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/t-mobile-completes-spam-prevention-rollout-now-authenticates-calls-from-98-of-wireless-users.2289583/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wa170gF1KAM:OJ1g9H5SD3E:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wa170gF1KAM:OJ1g9H5SD3E:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/wa170gF1KAM\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e32b6947482e93b757b4a8447c313011b24528303d61b64b8d74aad8bb642025","category":"Apple"}