{"title":"The past, present and future developments in mariculture in the coastal waters of mainland Tanzania","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.201?af=R","date":1721640190000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/22e6055c-cf6d-4643-957d-fe2835866ca6/aff2201-gra-0001-m.png\" alt=\"The past, present and future developments in mariculture in the coastal waters of mainland Tanzania\" />\n<p>Marine coastal resources are crucial to Tanzania's socio-economic development and are a lifeline for the livelihoods and incomes of coastal communities. By consolidating experiences from past and present mariculture initiatives, this study provides valuable guidance for decision-making toward promoting sustainable mariculture that supports coastal communities while preserving marine biodiversity.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Marine coastal resources are crucial to Tanzania's socio-economic development and are a lifeline for the livelihoods and incomes of coastal communities. This study provides an overview of the coastal development of mariculture in mainland Tanzania and suggests future development strategies. The review article covers extensive reports available through field interviews, government policy documents, library literature searches and field work carried out by the authors. Despite the immense potential of mariculture to improve food security for localcommunities, its development has been uneven. Specifically only seaweed farming has advanced to commercial-scale production. Other mariculture activities, such as finfish farming (e.g. milkfish, silver pompano), shellfish farming (e.g. prawn, mud crab and half-pearl) and sea cucumber farming, are underdeveloped and confined to small-scale operations. Locally consumed finfish, such as milkfish and pompano, have not attracted investors out of fear that the recovery of investment may not be achieved due to the low prices offered in the market. In this context, the sustainable use of coastal resources through mariculture becomes paramount to alleviating poverty and facilitating controlled migration from rural to urban. This comprehensive review explores the historical evolution and current status of mariculture initiatives in the coastal waters of mainland Tanzania, which presents a crucial aspect of the socio-economic development of the nation. With declining global capture fisheries production and a growing demand for fish protein, Tanzania has strategically embraced mariculture as a viable alternative. The article traced the development of mariculture since the 1970s, highlighting past and current initiatives managed by government agencies, non-government organizations and the private sector. Notable successes, such as seaweed culture, are highlighted along with the challenges that hinder the growth of marine farming activities. The review integrates insights from a comprehensive survey in coastal Tanzania, focusing on mariculture activities and collecting information on people who have stopped such practices, elucidating reasons for quitting. By consolidating experiences from past and present mariculture initiatives, this review provides valuable guidance for decision-making towards promoting sustainable mariculture that supports coastal communities while preserving marine biodiversity.</p>","author":"Betina Lukwambe, \nPhilip Bwathondi","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"e32e97a79dee8d73b48650756ba671c485a3725dfba16764310e9bfee74ae7f5","category":"Environment"}