{"title":"Anaesthetic efficacy of eugenol in doctor fish (Garra rufa): Behavioural and cardiovascular responses","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.15049?af=R","date":1668758400000,"content":"<h2>Abstract</h2>\n<p>The effects of eugenol anaesthesia on the behavioural and cardiovascular responses of doctor fish (<i>Garra rufa</i>) (2.0 ± 0.2 g mean weight) were studied. Two experiments were performed. In experiment 1, <i>G. rufa</i> was exposed to eugenol baths at different concentrations (0, 12.5, 25, 50, 75, 100 and 150 μl/L) to record induction and recovery times and fish behavioural responses. Experiment 2 was performed to evaluate the effects of different eugenol concentrations (50, 100 and 150 μl/L) on the electrocardiographic parameters of anaesthetized fish. Induction and recovery times were recorded for each fish separately, and 10 fish were used per eugenol concentration. During the induction stage, video recordings were taken to evaluate fish behaviour. Thereafter, electrocardiographic (ECG) records were taken with the help of electrodes attached to the anaesthetized fish. A strong relationship between eugenol concentrations and induced anaesthesia was verified (<i>R</i>\n<sup>2</sup> = 0.8583), but this relationship decreased slightly during recovery time (<i>R</i>\n<sup>2</sup> = 0.6481). Distance movement, movement duration, swimming speed (velocity) and mobility significantly decreased with an increase in eugenol concentration. ECG results indicated that <i>G. rufa</i> had higher heart rates when anaesthetized with a high concentration of eugenol than with a low concentration (150 μl/L, 94.4 ± 7.3 beats/min; 50 μl/L, 69.0 ± 3.7 beats/min). The QT interval was significantly higher for <i>G. rufa</i> anaesthetized with 100 and 150 μl/L eugenol concentrations. In conclusion, 25 and 50 μl/L eugenol concentrations can be used for general aquaculture procedures in <i>G. rufa</i>, and 75 μl/L is suitable for rapid blood sampling.</p>","author":"Baki Aydın","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"e337535dca29644c021cd8da967dc38a5be5c6e43d369ad5c1c0753fc72f13cd","category":"Environment"}