{"title":"Bacterial biofilm formation in seafood: Mechanisms and inhibition through novel non‐thermal techniques","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12925?af=R","date":1715913837000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/f89e7099-c161-4215-861a-5dfe6b9eae40/raq12925-toc-0001-m.png\" alt=\"Bacterial biofilm formation in seafood: Mechanisms and inhibition through novel non-thermal techniques\" />\n<p>Seafood bacterial biofilm inhibition through novel non-thermal techniques.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Seafoods are susceptible to microbial contamination due to their high moisture, nutrient contents and neutral pH. Among various microorganisms, biofilm-forming bacteria pose a severe threat to the seafood supply chain as well as consumer health. Bacterial biofilm formation in seafood is primarily caused by <i>Aeromonas hydrophila</i>, <i>Vibrio cholerae</i>, <i>V. vulnificus</i>, <i>V. parahaemolyticus</i>, <i>Salmonella</i> spp., <i>and Listeria monocytogenes.</i> Biofilm formation is an important protective mechanism of microorganisms causing spoilage of seafood and disease threats to consumers. The attachment of microbes on the surface of seafood followed by the growth and proliferation of bacterial cells leads to the production of exopolymer compounds and the formation of biofilm. This biofilm is difficult to destroy or inhibit through conventional prevention/destruction techniques. The occurrence of bacterial strains/biofilms with more resistance to different preventive strategies is a big challenge for the seafood processing industry. This review covers the mechanisms of biofilm formation by bacteria and various non-thermal processing approaches to prevent microbial contamination and biofilm formation in seafood products. The aforementioned non-thermal processing techniques for the destruction of biofilm and quality control of seafood products include cold plasma treatment, irradiation, pulsed electric field technology, hydrostatic pressure processing, photosensitisation, natural bioactive compounds and so on. All these techniques effectively inhibit the bacterial biofilm and microbial growth without altering sensorial properties. However, further research validation and applications at the industry level are still required.</p>","author":"Sagar Gautam, \nNirmala Subedi, \nKabita Dhakal, \nPankaj Koirala, \nDev Raj Acharya, \nOm Prakash Malav, \nFahad Al‐Asmari, \nSoottawat Benjakul, \nNilesh Nirmal","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"e347d284b0d980e46578c83483d6c98eb1cab5507a42425ede1cf6b4c93bf42a","category":"Environment"}