{"title":"Mealworm larvae and black soldier fly larvae as novel protein supplements for cattle consuming low-quality forage","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae122/7732322?rss=1","date":1723507200000,"content":"<span><div>Abstract</div>The global population is projected to increase, indicating that there will be greater demand for animal protein to meet the associated food needs. This demand will place additional pressure on livestock systems to increase output while also minimizing natural resource inputs. Insect protein has emerged as a potential alternative to conventional protein feeds, such as soybean meal. Mealworm larvae (MWL; <span>Tenebrio molitor</span>) have been studied in poultry and swine as an alternative protein source; however, there is no research currently evaluating MWL for cattle. Black soldier fly larvae (BSFL; <span>Hermetia illucens</span>) have also received attention for their potential use in livestock feed due to their scalability and nutritional value, but research in cattle is limited. The objective of this study was to evaluate the effects of whole-dried MWL and defatted BSFL as protein supplements for cattle consuming forage. Five ruminally cannulated steers were utilized in a 5 × 5 Latin square experiment to determine how MWL and BSFL supplementations affect forage utilization. Steers consuming ad libitum low-quality forage (76.5% neutral detergent fiber [NDF], 4.2% crude protein) were provided one of the five treatments each period: 1) control with no supplement (CON), 2) soybean meal (CONV), 3) BSFL, 4) MWL, or 5) 50/50 by-weight blend of BSFL and MWL (MIX). All treatments were provided at 100 mg N/kg BW and periods included 8 d for treatment adaptation, 5 d for intake and digestion, and 1 d for ruminal fermentation measures. Protein supplementation stimulated forage organic matter intake (FOMI; <span>P</span> ≤ 0.01) relative to CON (3.28 kg/d). There was a significant difference in FOMI (<span>P</span> ≤ 0.01) between BSFL (4.30 kg/d) and CONV (4.71 kg/d), but not between CONV and MWL (<span>P</span> = 0.06, 4.43 kg/d). Total digestible OM intake (TDOMI) was also stimulated by the provision of protein (<span>P</span> ≤ 0.01), from 1.94 kg/d for CON to an average of 3.24 kg/d across protein supplements. Organic matter digestibility (OMD) and NDF digestibility (NDFD) were not affected by treatment (<span>P</span> ≥ 0.37), for an average OMD of 66.5% and NDFD of 62.7%. There was also no treatment effect on ruminal volatile fatty acid (<span>P</span> = 0.96) or ammonia-N (<span>P</span> = 0.22) concentrations. These data indicate that MWL may stimulate forage utilization by beef cattle to a greater extent than BSFL, but both are viable protein supplements.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"e35b2e43ac63ea80c686b2012b7f6132fd265277c7ecd30f775fddb6d281c8dc","category":"Environment"}