{"title":"Apple’s bold new Vision will finally start to come into focus in 2024","link":"https://www.macworld.com/article/2191168/apple-2024-releases-vision-pro-ipads-iphone-siri-gpt.html","date":1704560065000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Last year was <a href=\"https://www.macworld.com/article/2176509/apple-2023-calm-before-storm.html\">a little quiet</a> for Apple, but 2024 is going to be loud. The launch of the Vision Pro, a new product running a new operating system in a new category (for Apple), more or less guarantees it. But there’s a lot more than the release of the Vision Pro to Apple’s 2024.</p>\n\n\n\n<p>Let’s take a look at what this year will offer through the lens of your longtime Apple-watching columnist and his somewhat cloudy crystal ball. How better to think about the future, after all, than to predict it on a website?</p>\n\n\n\n<h2>iPad clarity</h2>\n\n\n\n<p>After a year where the biggest iPad announcement was a <a href=\"https://www.macworld.com/article/2108888/apple-pencil-usb-c-features-price-comparison-ipad.html\">new (weird) Apple Pencil model</a>, 2024 is a year where Apple will likely refresh every single iPad model. A lot of ink has been spilled about whether the iPad product line is too complex and confusing, and I’m here to tell you that in 2024, things will get less <a href=\"https://www.macworld.com/article/1356953/ipad-pro-mini-air-buying-storage-display-processor.html\">confusing</a>–but only somewhat.</p>\n\n\n\n<p>For a few years now, it’s been unclear where the <a href=\"https://www.macworld.com/article/625135/ipad-air-m1-review.html\">iPad Air</a> fits, since it’s so similar in so many ways to the <a href=\"https://www.macworld.com/article/343706/ipad-pro-2021-faq-price-specs-features-release-date.html\">iPad Pro</a>. In 2024, I think that distinction will become much clearer, which should make the iPad line a lot easier to parse. The iPad Air, which received a new design in 2022, is on course for a minor revision–with the rumor that it’ll be released in both 11- and 12.9-inch models.</p>\n\n\n\n<p>If those sizes sound familiar, it’s because those are the current sizes of the small <em>and large</em> iPad Pro models. Wait, another iPad Air? Isn’t that <em>more</em> confusing?</p>\n\n\n\n<p>I don’t think so. The iPad Air, which uses Touch ID instead of Face ID and will not get the latest and greatest Apple processors, will continue to use the Magic Keyboard introduced in 2020. It will settle in as a product with some mainstream appeal but without the pricier high-end features that will be limited to the iPad Pro.</p>\n\n\n\n<p>In the meantime, the iPad Pro will fully embrace the “Pro” in its name. Both models will get bigger and sport gorgeous OLED displays. With the new sizes will come new accessories–most notably a new keyboard case. This case will feature aluminum elements that will make the resulting iPad feel more like a MacBook than the current model. I’m going to guess it’ll also offer a full function row like Apple’s other keyboards–and backlighting like the company’s laptops.</p>\n\n\n\n<p>The prices will go up, undoubtedly, given the addition of OLED… and that keyboard won’t be cheap, either. But with the iPad Air continuing to be available at a more reasonable price, the iPad Pro will appeal to people who love the modularity and portability of the iPad and have ways to apply it to their professional lives. (If Apple really wanted to make the iPad Pro appeal, it would let users run a virtual copy of macOS on that M3 processor–even I am not enough of a sicko to make that prediction.)</p>\n\n\n<div><figure><img src=\"https://images.techadvisor.com/cmsdata/reviews/3814591/ipad-air-2022.jpg?quality=50&amp;strip=all\" alt=\"iPad Air 2022\" loading=\"lazy\" /><figcaption><p>A bigger version of the iPad Air could debut in 2024.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>In lower-end iPad news, say goodbye to the Home button. The <a href=\"https://www.macworld.com/article/556861/ipad-9th-generation-review.html\">9th generation iPad</a> will die at last, with the 10th generation model taking its place on the price list. A new, slightly boosted 11th-generation model will debut above it. And that janky <a href=\"https://www.macworld.com/article/667441/apple-pencil-2015-review.html\">original Apple Pencil</a>, with its Lightning port and weird Lightning-to-USB adapter, will fade into history.</p>\n\n\n\n<h2>Mac iteration on tap</h2>\n\n\n\n<p>With the M3 processor already out in the world, I suspect that the Mac’s 2024 will be largely devoted to updating existing models to add in the M3. The best-selling Mac of all, the MacBook Air, will certainly get an M3 model. The question is, what happens to the <a href=\"https://www.macworld.com/article/1993834/13-inch-vs-15-inch-macbook-air-which-is-better.html\">existing MacBook Airs</a>? I’m going to predict that the M2 model will be phased out since the M3 model will use that same modern design… but the trusty (and cheap!) <a href=\"https://www.macworld.com/article/234819/macbook-air-m1-review-an-absolutely-stunning-debut-for-apple-silicon-in-a-mac.html\">M1 model</a> will stick around. At some point, Apple will probably need to create a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://sixcolors.com/link/2023/09/about-that-low-cost-macbook-rumor/&amp;xcust=1-1-2191168-1-0-0&amp;sref=https://www.macworld.com/feed\">MacBook SE</a>, but this doesn’t seem like the year.</p>\n\n\n\n<p>Beyond the MacBook Air, I think that all existing Mac models will see M3 updates. Yes, that means not just the <a href=\"https://www.macworld.com/article/1479802/mac-mini-m2-pro-processor-design-memory-design.html\">Mac mini</a> but the <a href=\"https://www.macworld.com/article/1484944/mac-studio-m2-m3-max-ultra-release-date-price-specs.html\">Mac Studio</a> and <a href=\"https://www.macworld.com/article/347010/new-mac-pro-2023.html\">Mac Pro</a>. And just when we least expect it, Apple will <a href=\"https://www.macworld.com/article/2121681/magic-mouse-trackpad-keyboard-lightning-usb-c-charging.html\">update its input devices from Lightning to USB-C</a>… at least a year later than we all hoped they would do it. No new Apple display standalone this year, though. I’ve been burned too many times.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-15-pro-max-hero02.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPhone 15 Pro Max\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-15-pro-max-hero02.jpg?quality=50&amp;strip=all 4793w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-15-pro-max-hero02.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-15-pro-max-hero02.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-15-pro-max-hero02.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-15-pro-max-hero02.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-15-pro-max-hero02.jpg?resize=2048%2C1365&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-15-pro-max-hero02.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-15-pro-max-hero02.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption><p>If the iPhone 15 Pro Max display isn’t big enough for you, your wish may come true later this year.</p></figcaption></figure><p>Jason Cross / Foundry</p></div>\n\n\n\n<h2>Uninspiring iPhone changes</h2>\n\n\n\n<p>Rumor has it that the <a href=\"https://www.macworld.com/article/2007943/iphone-16-release-date-specs-features-rumors.html\">iPhone Pro models will get slightly larger</a> than this year’s models, adding screen real estate at the cost of a slight weight increase. I enjoyed the removal of heavy stainless steel from this year’s models, but there’s room for Apple to experiment, and no smartphone maker has been punished for giving users bigger screens. Seems reasonable.</p>\n\n\n\n<p>I’d imagine that all iPhones will get better at shooting Spatial Video, with the Pro models getting upgraded cameras and the base iPhones gaining that capability for the first time. There might be some minor camera upgrades, but honestly, this feels like a year when iPhone hardware updates will be relatively minor.</p>\n\n\n\n<p>On the software side, though… this feels like the year where Apple will aggressively show off its attempts to integrate more machine-learning-based technology into its devices. Some of that will roll out at WWDC in June, but I wouldn’t be surprised if there are also a raft of ML-specific features that will only be enabled by the pro-level chip on the iPhone 16 Pro models… because software features can be hardware differentiators, too, especially when the hardware isn’t really that different.</p>\n\n\n\n<p>More broadly, yes, I think Siri 2.0 is going to happen, and it’s going to be based on a ChatGPT-like language model–with a lot of guardrails and limitations that make it less useful than other chatbots, but with less chance of hallucination and inaccuracy. And it will probably be labeled as a beta, just in case.</p>\n\n\n\n<h2>Same old Watch and some new TV content</h2>\n\n\n\n<p>Is this the year that the standard Apple Watch gets its first hardware redesign? Those are the <a href=\"https://www.macworld.com/article/2157474/new-apple-watch-2024-release-date.html\">rumors</a>, but I’m not seeing it. While this fall will be the 10th anniversary of the Apple Watch, next year is the actual anniversary of the device shipping. I think a new Apple Watch is on the horizon, but the Apple Watch Ultra just appeared in late 2022. It feels like Apple can wait another year before breaking band compatibility.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/10/Apple-Watch-Series-9-review.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Watch Series 9 review\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/10/Apple-Watch-Series-9-review.jpg?quality=50&amp;strip=all 2600w, https://b2c-contenthub.com/wp-content/uploads/2023/10/Apple-Watch-Series-9-review.jpg?resize=300%2C203&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/10/Apple-Watch-Series-9-review.jpg?resize=768%2C518&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/10/Apple-Watch-Series-9-review.jpg?resize=1200%2C810&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/10/Apple-Watch-Series-9-review.jpg?resize=1536%2C1037&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/10/Apple-Watch-Series-9-review.jpg?resize=2048%2C1382&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"810\" /><figcaption><p>The big update to the Apple Watch will probably not happen until 2025.</p></figcaption></figure><p>David Price / Foundry</p></div>\n\n\n\n<p>On the services side, I predict that Apple will make another deal for sports rights. Maybe the NBA? Maybe something 3-D related for Vision Pro? Something, though. Apple sees sports rights as a powerful opportunity to bring people into its ecosystem, led by some executives (Eddy Cue) who are true sports fans and understand the appeal.</p>\n\n\n\n<p>While a lot of major studios brimming with familiar intellectual property assets will be the subject of discussion–consolidation is coming to Hollywood–I can’t predict that Apple will swoop in and buy part of Paramount Global, for example. Instead, I expect Apple to be rumored as having talks and kicking the tires for various surprising Hollywood deals and used as an extremely deep-pocketed stalking horse. But in the end, I think Apple will shy away from making any such deals. Too much “not invented here” attitude. I think Apple wants to make it on its own, and that means building a catalog from scratch, not writing a check so that they can own Star Trek and Yellowstone.</p>\n\n\n\n<h2>Vision Pro is up in the air</h2>\n\n\n\n<p>It doesn’t take much foresight to predict that Vision Pro will ship because Apple has said as much, and shipping seems imminent. But I don’t think there will be a clear verdict on the device by year’s end. It’s a 1.0 product with a high price, and that’s why most reviews will hail its technical prowess and some of its amazing features while expressing some skepticism about the entire category and warning potential buyers that it’s just too early to spend a large amount of money on a device like this.</p>\n\n\n\n<p>We can read the tea leaves and try to see if Apple is worried or happy, but while the Vision Pro is a pretty wild shot, I don’t think it’s going to instantly flop. It’ll almost certainly sell out, but again, given the limited quantity of devices–estimated at half a million–I don’t think a sell-out tells us much about it being a hit or a miss.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/IMG_3695-2.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Vision Pro WWDC 2023\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/IMG_3695-2.jpg?quality=50&amp;strip=all 3986w, https://b2c-contenthub.com/wp-content/uploads/2023/06/IMG_3695-2.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/IMG_3695-2.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/IMG_3695-2.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/IMG_3695-2.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/06/IMG_3695-2.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/06/IMG_3695-2.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/06/IMG_3695-2.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>Even with an early 2024 release, whether the Vision Pro is a hit or not won’t be known for some time.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>One place to look will be developer adoption. What apps are there at launch? Once developers get their hands on shipping hardware, will there be a bunch of interesting experimental apps in the App Store? Or is the whole device going to feel quiet and barren beyond Apple’s own contributions? My guess is that there will be fewer apps than you’d think but that some developers will get huge publicity for building clever stuff Apple never even thought of. I’ll also predict a visionOS 2 announcement at WWDC with some major new features that didn’t make it into the first version of the product.</p>\n\n\n\n<p>Will we know by the end of the year if Vision Pro is a hit or a miss? I say no. For that answer, you’ll probably need to read next year’s annual prediction column–or maybe even wait for the one after that.</p>\n\nVirtual Reality, Wearables</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e35f2f399f8803bfd3c6d8c0e527aa87e9a10a03870ee27a2cae50ef0d08c5f9","category":"Apple"}