{"title":"Integrating health across the Sustainable Development Goals in the Eastern Mediterranean Region: Assessment of Voluntary National Reviews from 18 countries","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003451","date":1720706400000,"content":"<p>by Ruth M. Mabry, Henry V. Doctor, Mina N. N. Khair, Maha Abdelgalil, Arash Rashidian</p>\r\n\r\nVoluntary National Reviews are the formal mechanism for countries to report on progress and share lessons learned on SDG implementation. We assessed the Voluntary National Reviews submitted by countries in the WHO Eastern Mediterranean Region to note the reported progress on Sustainable Development Goal (SDG) implementation, the review preparation process and how health is positioned and framed to identify priorities for accelerating progress on the health-related SDGs. We extracted quantitative and qualitative data from 26 Voluntary National Reviews from 18 countries submitted during the period 2016 to January 2022. We focused on three areas: SDG implementation, the review preparation process and the positioning of health in the reviews. Three assessors conducted the data extraction based on the agreed framework according to their language of expertise (Arabic, English and French). One assessor supervised the whole process for consistency. If there was a doubt in interpretation, it was discussed and agreed among the assessors. Countries have established a mechanism for SDG implementation under high-level leadership, engaged in multistakeholder consultations, aligned and mainstreamed SDGs to national plans, and created a monitoring and review mechanism. Countries reported use of national participatory approach for the report preparation. The prioritization of both health and well-being (SDG3) and economic growth (SDG8) in the reports is unique compared to other regional and global assessments. Health was often framed around disease and health care provision without linkages to societal inequities and structural challenges. The reports indicated good progress in SDG implementation. Addressing upstream issues and the determinants of health requires the health sector to take a more strategic approach in advocating for health and well-being. Further research is needed to demonstrate how to address synergies and trade-offs of policy choices and identify the co-benefits of addressing health in the context of fiscal instability and widening inequities in the region.","author":"Ruth M. Mabry","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"e365135097468a6bfbdcf4a7a3bd1705efe2d9accb017faadc2aadfb7282228d","category":"Environment"}