{"title":"Incentive mechanism of multiple green innovation behaviors of equipment manufacturing enterprises: A managers, green coordination groups and employees perspective","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300533","date":1710943200000,"content":"<p>by Baohong Li, Shi Yin, Baosheng Zhang</p>\r\n\r\nEmployees play a pivotal role in the implementing of green development strategies and the attainment of dual-carbon objectives within manufacturing enterprises. Effective motivation of employees, fostering consensus on environmental protection, increased engagement in environmental initiatives, and the cultivation of employee cohesion are all vital for fostering green development within these enterprises. This paper seeks to elucidate the roles of general managers, green coordination groups (GCG), and employees in actualizing green behaviors. Furthermore, it advocates for a double incentive model to be employed in the implementing of green strategies within manufacturing enterprises. The research reveals that multiple factors, including incentive intensity, green capability, effort cost, risk aversion, and green variance, significantly influence the formulation of incentive contracts for green behaviors. The motivation level of the general manager directly impacts the efforts of the GCG, the organization’s green climate, the manager’s individual efforts, and indirectly influences the motivation and efforts of employees towards green behaviors. Notably, the influence of the organization’s green climate on employees surpasses than on the manager, underscoring the imperative for collaboration efforts between the general manager and GCG to instill green behaviors among employees. Hence, it is imperative for the general manager and GCG to collaborate not only on critical aspects of green strategy implementation but also in fostering green behaviors among employees. This collaboration will facilitate the development of a multi-layer incentive mechanism aimed at promoting and facilitating the adoption of green behaviors among employees, thus contributing to the advancement of theory regarding employees’ green behaviors and offering practical guidance for effectively realizing dual-carbon targets and achieving high-quality development within enterprises.","author":"Baohong Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e37d46aecce6d26ff6e7cef95cbdf4caddcca3adec94bb9536421fd444c3524b","category":"Interdisciplinary"}