{"title":"Report: Apple is finally upgrading the iPhone’s selfie cam–but not till next year","link":"https://www.macworld.com/article/2192219/iphone-17-major-selfie-camera-upgrade-report.html","date":1704376309000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>A little over a year ago the iPhone saw a dramatic increase in the megapixel count for its rear-facing camera, quadrupling from 12MP on the iPhone 13 Pro to 48MP on the 14 Pro. But it looks like the comparatively neglected front-facing camera is headed for its own upgrade in 2025.</p>\n\n\n\n<p>The prediction comes from Ming-Chi Kuo, a widely respected (albeit <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://appletrack.com/ming-chi-kuo/&amp;xcust=1-1-2192219-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">fallible</a>) analyst who frequently discusses Apple’s plans in terms of their financial effect on third-party suppliers. In a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://medium.com/@mingchikuo/%E7%8E%89%E6%99%B6%E5%85%89%E7%82%BA%E9%AB%98%E9%9A%8E%E9%8F%A1%E9%A0%AD%E5%8D%87%E7%B4%9A%E9%80%B1%E6%9C%9F%E5%86%8D%E8%B5%B7%E7%9A%84%E9%97%9C%E9%8D%B5%E8%B4%8F%E5%AE%B6-iphone-17%E5%89%8D%E7%9B%B8%E6%A9%9F%E5%8D%87%E7%B4%9A-iphone-16-pro%E6%BD%9B%E6%9C%9B%E9%8F%A1%E8%88%87%E8%B6%85%E5%BB%A3%E8%A7%92-vision-pro-%E8%88%87%E8%8F%AF%E7%82%BAp70%E8%B6%85%E5%BB%A3%E8%A7%92-genius-is-a-key-7f125f60d783&amp;xcust=1-1-2192219-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Medium </a>post this week, Kuo claims the iPhone 17 will have a 24MP selfie camera, up from 12MP on every model from the iPhone 11 to, apparently, the iPhone 16.</p>\n\n\n\n<p>“The front camera of the iPhone 17 will be upgraded to 24MP/6P lens (vs. the 12MP/5P lens of iPhone 15 &amp; 16),” Kuo writes, “which will significantly improve the image quality.” The 5P and 6P notations indicate the number of plastic elements in the lens.</p>\n\n\n\n<p>Kuo then goes on to discuss how this change will affect the revenues of the company selected as the primary lens supplier for the handset, a topic of great interest to his report’s intended audience but one that isn’t all that exciting for us. Except for this tidbit: “The unit price of the 6P lens is 100–120% higher than that of the 5P.” Will the iPhone 17 see a price bump to account for this increase in production costs? We will have to see.</p>\n\n\n\n<p>In the more immediate future, this year’s iPhone 16 Pro is expected to get a new periscope lens. This lens, which enables the phone to offer much greater zoom capabilities, arrived on the <a href=\"https://www.macworld.com/article/2081235/iphone-15-pro-max-review.html\">iPhone 15 Pro Max</a> last year, but Apple was reportedly unable to include it in the smaller 15 Pro because of a lack of space. That will no longer be the case in late 2024.</p>\n\n\n\n<p>“[Apple lens supplier] Genius’ progress on the iPhone 16 Pro’s periscope lens is on track. It will start shipping by the end of 2Q24 or early 3Q24,” Kuo writes.</p>\n\n\n\n<p>The 16 Pro will also see an upgrade to the megapixel rating of its ultra-wide camera, from 12MP on the 15-series handsets to a whopping 48MP, thereby matching the main rear-facing lens.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e37f4e6ea422ed3fd3e5b89c4ec18b0277eb7d2546e0418e62ee6aff9ae35285","category":"Apple"}