{"title":"Convection‐Permitting Climate Models Can Support Observations to Generate Rainfall Return Levels","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035159?af=R","date":1712994614000,"content":"<h2>Abstract</h2>\n<p>Information about the frequency and intensity of extreme precipitation is generally derived from fitting extreme value models using point-observations, but the regionalization of these models is challenging. Here we propose using high-resolution convection-permitting climate model output as covariates for the estimation of observation-based spatial rainfall return levels. We apply the Weather and Forecasting Research (WRF) model at a 1.5 km resolution driven by ERA5 reanalysis data over southern Germany, where 1,132 rain gauges provide observations of daily rainfall. For this complex topography, we build three different smooth spatial Generalized Extreme Value (GEV) models: (a) a reference model using latitude, longitude and elevation as covariates; (b) a model adding mean annual precipitation from the WRF; (c) a model adding extreme value statistical model estimates using WRF output. We show that the additional information provided by the WRF model can improve the representation of 10-year and 100-year return levels of daily rainfall by lowering the percentage bias, mean absolute error, and root-mean-square error. Furthermore, we conduct an extensive cross-validation, where only 5%, 10%, 20%, 50%, 80%, 90%, and 95% of all rain gauges are considered when building spatial GEV models. Again, the additional information provided by the WRF model can improve results here. This cross-validation study also highlights the robustness of our approach, showing great potential for use in data-scarce regions.</p>","author":"B. Poschlod, \nJ. Koh","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"e382ad217a761c1144fb31818c64d95d4355b060c87c786346e435e5158fe9d9","category":"Environment"}