{"title":"Mapping pathogenic fungi in decayed Norway spruce stands: Insights from harvester positional data","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14800?af=R","date":1728474550000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/6b68bdc9-8313-4526-baf5-293caaa98ff4/jpe14800-toc-0001-m.png\" alt=\"Mapping pathogenic fungi in decayed Norway spruce stands: Insights from harvester positional data\" />\n<p>Our study demonstrates that Norway spruce stands display a diverse range of spatial patterns of butt rotted trees. We found that higher densities of Norway spruce trees probably facilitate the vegetative spread of pathogenic wood decay fungi, leading to clustering of decay-affected trees. To disrupt the spread of decay fungi between tree generations, precision planting of trees other than Norway spruce around infested stumps of prior generation trees has been recommended by earlier studies. We discussed the potential of using harvester-derived geoposition data for butt-rotted trees upon planning and execution of forest regeneration.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nRoot and butt rot caused by pathogenic fungi in the genera <i>Heterobasidion</i> and <i>Armillaria</i> is a pressing issue in managed Norway spruce forests. The disease results in financial losses for the forest owners and reduces the volume of wood that can be used in long-lived products. Pathogenic wood decay fungi spread either with the aid of airborne spores or via mycelial growth among neighbouring trees, the latter leading to clustering (tendency of decayed trees to be in close proximity relative to their neighbouring trees) of decay-affected trees in forests. Understanding the spatial patterns of the decay-affected trees at the forest stand level is vital for designing management strategies to address this problem.\n\nWe examined decay clustering in 273 clear-cut Norway spruce stands in Norway using harvester-recorded data on spatial occurrence of decayed and healthy Norway spruce trees. We tested clustering using three global-cluster tests that account for population density and distribution, evaluating clustering without identifying specific cluster locations.\n\nThe proportions of clustered and non-clustered stands differed depending on the statistical test used for clustering assessment, resulting in overall agreement of 32.8% for clustered and 36.9% for non-clustered. Clustered stands exhibited a median cluster distance (maximum distance between the decay-affected trees within a cluster) of 12 m (Inter-Quantile Range, IQR, 6–20 m) and a median of 6 (IQR 3–16) nearest neighbour trees (number of decayed trees forming a cluster), estimates comparable with prior studies focused on assessment of trees infected by mycelial spread of the same fungal individual. The decay incidence in the clustered stands was 16.24%, while the non-clustered stands had a butt-rot incidence of 20.97%. In clustered stands the average number of trees per hectare was higher (693) than in non-clustered stands (553).\n\n<i>Synthesis and applications</i>: Our study demonstrates that Norway spruce stands display a diverse range of spatial patterns of butt rotted trees. We found that higher densities of Norway spruce trees probably facilitate the vegetative spread of pathogenic wood decay fungi, leading to clustering of decay-affected trees. To disrupt the spread of decay fungi between tree generations, precision planting of trees other than Norway spruce around infested stumps of prior generation trees has been recommended by earlier studies. We discussed the potential of using harvester-derived geoposition data for butt-rotted trees upon planning and execution of forest regeneration.\n</p>\n<h2>Sammendrag</h2>\n<p>\n\nRot- og stammebaseråte forårsaket av patogene sopper i slektene Heterobasidion og Armillaria er et stort problem i grandominert kulturskog. Sykdommen fører til økonomiske tap for skogeierne og reduserer volumet av trevirke som kan brukes i langlivede produkter. Patogene råtesopper sprer seg enten ved hjelp av luftbårne sporer eller gjennom mycelvekst mellom nabotrær, hvor sistnevnte fører til klyngedannelse (tendensen til at råtne trær finnes i nærhet til hverandre i forhold til omkringliggende trær) av råtepåvirkede trær i skogen. Å forstå de romlige mønstrene av råtepåvirkede trær på bestandsnivå er avgjørende for å utforme forvaltningstiltak for å håndtere dette problemet.\n\nVi undersøkte klyngedannelse av råte-infiserte trær i 273 flatehogde granbestand i Norge ved hjelp av hogstmaskin-registrerte data som viser romlig fordeling av råtepåvirkede og friske grantrær. Vi testet klyngedannelse ved bruk av tre globale klyngetester som tar hensyn til populasjonstetthet og fordeling, og evaluerte klyngeformasjon uten å identifisere spesifikke klyngelokasjoner.\n\nAndelen av bestand som var klynget og ikke-klynget varierte avhengig av hvilken statistisk test som ble brukt for å vurdere klyngedannelse, med en overensstemmelse på 32,8% for klynget, og 36,9% for ikke-klyngede. Klyngete bestand hadde en median klyngeavstand (maksimal avstand mellom råtepåvirkede trær innenfor en klynge) på 12 metre (interkvartil-avstand, IQR, 6–20 metre) og en median på 6 (IQR 3–16) nærmeste nabotrær (antall råtepåvirkede trær som utgjorde en klynge), estimater som er sammenlignbare med tidligere studier som identifiserte trær infisert av mycelspredning fra samme soppindivid. Råtefrekvensen i klyngete bestand var 16,24%, mens de ikke-klyngete bestandene hadde råtefrekvens på 20,97%. I klyngete bestand var det gjennomsnittlige antallet trær per dekar høyere (69) enn i ikke-klyngete bestand (55).\n\n<i>Syntese og anvendelser</i>: Vår studie viser at granbestand har et mangfold av romlige mønstre for trær med råte. Vi fant at høyere tetthet av grantrær trolig fremmer vegetativ spredning av patogene råtesopper, noe som fører til klyngedannelse av råtepåvirkede trær. For å bryte soppens spredning mellom tregenerasjoner har tidligere studier anbefalt planting av andre treslag enn gran rundt infiserte stubber fra forrige tregenerasjon. Vi diskuterte potensialet for å bruke hogstmaskin til å lokalisere råte-infiserte stubber, og bruke slike data som grunnlag for planlegging og gjennomføring av skogforyngelse.\n</p>","author":"Wilson Lara, \nRasmus Astrup, \nAri M. Hietala, \nKobra Maleki, \nHelmer Belbo, \nClara Antón‐Fernández","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"e3823d24285581d7dead8a2fe1f08df63d168488a5bb65e5c674c80a67d84b12","category":"Environment"}