{"title":"Shale Compaction Kinetics: Parameter Sensitivity to a Range of Assumed Deposition Rates","link":"https://www.preprints.org/manuscript/202302.0399/v3","date":1718087896000,"content":"Weathering and erosion transport minerals and organics toward the sea or lake bottoms over geologic time. The finest solids are deposited in lower, less turbulent areas, such as lake bottoms and continental shelves. They sometimes stack up to thicknesses of kilometers, and begin compacting. These sediment sections are called shales, and as initially deposited in water, shales can have porosities up to 50-80{\\%} water, As they are buried, many alteration products from oil to slate are produced due to overburden and temperature increasess, making them important to study. A preceeding paper \\cite{1} showed that pressure solution is the primary mechanism for porosity reduction, with possible mechanical compaction at shallow depths. Without naming the mineral(s) involved, it postulated that the greater the product of the water and pore interfaces, the faster the reaction would proceed. This term is $ \\varphi^{4m/3}(1-\\varphi)^{4n/3}$ , where $\\varphi$ is porosity and m and n are numbers close to unity. The large exponents, {\\em 4/3}, recognize that the reaction occurs at the molecular scale at which the surfaces are rough. A second term, $\\exp^{(-E/RT)}$ , indicates that the reaction is impeded by a quantum energy barrier, E, with diminished impeding power as increased available thermal energy, represented by the absolute temperature, T, becomes available at greater depths in the Earth. These two factors combine to allow porosity $\\varphi$ to reduce with time, or equivalently for the fraction of solids, $(1-\\varphi)$, to increase with time,$\\left. \\frac{\\partial(ln(1-\\varphi) ) }{\\partial t } \\right |_{\\sigma} = (\\varphi )^{4m/3}( 1-\\varphi )^{4n/3}Ae^{-E/(RT)}$. { \\em Here it is shown that this equation can cover quantitatively any actual deposition rates which may have been experienced by the six sections studied, the actual deposition rates being unknown for these cases. Hence a time-depth depositional history for any new shale section, known in detail, would allow determination of the parameters m, n, E and a lumped proportionality constant A. This was accomplished by showing that, for a wide range of depositional rates, r, the range of E for any of the studied sections is small compared to laboratory measurements of quartz solution\\cite{2}, 24+-15kJ/mol. Results were obtained over this range of r's using the previously determined m and n, and porosity and temperature profiles. The presently existing porosity profiles necessarily incorporate any overpressure or underpressure conditions that may have existed in the past or currently, as the net difference between overburden and pore pressure is a primary driving force for pressure solution. $SiO_2$ usually comprises 20-50{\\%} of shales. In conclusion, pressure solution of quartz can account for vertical compaction of shales quantitatively in the studied examples. Separately, a quasi-eqivalent method for discussing reduced porosities in Macron 2 versus Macron 1 as increased vertical stress, rather than additional horizontal stress, is illustrated. Experiments are suggested to clarify the pressure solution mechanism. The role of horizontal forces is discussed. From a global point of view, shale compaction by pressure solution is a quantified step in the cycling of continental rocks, beginning with rifting.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e382a4cf8ba5772f8edbf691646b7a7321fcb0500782c21894b31231494fc68e","category":"Interdisciplinary"}