{"title":"macOS Sonoma adds Game Mode, a new design for desktop widgets, and more","link":"https://arstechnica.com/?p=1944217","date":1685987500000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Screenshot-2023-06-05-at-1.44.57-PM-800x449.jpeg\" alt=\"macOS Sonoma adds Game Mode, a new design for desktop widgets, and more\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Screenshot-2023-06-05-at-1.44.57-PM-scaled.jpeg\">Enlarge</a> (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>CUPERTINO, Calif.—Apple has unveiled the next major release of macOS, dubbed macOS Sonoma. It adds many of the features from <a href=\"https://arstechnica.com/gadgets/2023/06/apples-ios-17-with-focus-on-communication-sharing-and-intelligent-input/\">iOS 17</a>, plus a handful of Mac-specific enhancements over macOS Ventura.</p>\n<p>For anyone who mourned the loss of the old Dashboard feature a few releases ago, Sonoma brings back a redesigned widgets experience that lets you drag widgets out of the Notification Center and onto your desktop. When you have another app open, these widgets will fade into the background to get out of your way. iPhone widgets can also be displayed on your Mac, as long as your iPhone is within close range of your Mac or on the same Wi-Fi network.</p>\n<p>Apple is also continuing in its quest to make gaming on macOS happen with a new \"Game Mode\" that gives games CPU and GPU priority while they're running, not unlike the identically named feature in Windows. Like the Windows version, Game Mode isn't going to make your CPU or GPU hardware more powerful than it is, but it should help improve the smoothness and consistency of game framerates by keeping other running apps from spiking in usage while you're trying to play something.</p></div><p><a href=\"https://arstechnica.com/?p=1944217#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1944217&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e38bbb2eebb8c5592d68d3d295cc3093d7518608d88e3ac9621ed4fac587cf25","category":"Tech"}