{"title":"Influence of crop size and sugar content on bird fruit feeding patterns on two sympatric Miconia (Melastomataceae) species on a continental island in the Brazilian Atlantic Forest domain","link":"http://link.springer.com/10.1007/s43388-024-00202-3","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>Zoochoric fruits generally have physical or chemical characteristics that are attractive to frugivores. We tested the crop size hypothesis (fruit availability as a conspicuous signal of potential rewards for frugivores) in two sympatric congener plants (<em>Miconia calvescens</em> DC. and <em>Miconia prasina</em> (SW) DC., Melastomataceae) in an insular environment and verified whether fruit consumption may be influenced by differences in sugar content between species. As their fruits are broadly similar in both size and color, we predicted that the species with more attractive fruit sets would have higher bird visit richness and fruit removal rates, although these indices would decrease during the overlapping fruiting period. We also predicted that the species with higher fruit sugar content would be consumed more frequently. To test the crop size hypothesis, we estimated the fruiting period and fruit availability and quantified fruit consumption by birds throughout one year, and for carbohydrates, we estimated the levels of glucose, fructose, sucrose, and starch in samples of ripe fruits. The results supported our prediction that the species with the largest crop (<em>M. prasina</em>) would be more attractive to birds during the overlapping fruiting period, which corroborates the crop size hypothesis. The carbohydrate content and sugar concentrations varied considerably between the two species, although it was difficult to determine their exact influence on fruit consumption. To better elucidate the drivers of fruit selection by birds, further studies could focus on the associations between the physical and chemical traits of the fruit and its attractiveness to potential seed dispersers, as we still lack integrative quantitative studies that include the chemical traits of the fruits, such as nutrient content, which may provide reliable indicators of potential rewards for frugivores.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"e3a5cd0d7906cece4799fb4999da7d97d2aa36aee912e56aea292d64c9e784cd","category":"Environment"}