{"title":"Identifying the interplay between protective measures and settings on the SARS-CoV-2 transmission using a Bayesian network","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307041","date":1720706400000,"content":"<p>by Pilar Fuster-Parra, Aina Huguet-Torres, Enrique Castro-Sánchez, Miquel Bennasar-Veny, Aina M. Yañez</p>\r\n\r\nContact tracing played a crucial role in minimizing the onward dissemination of Severe Acute Respiratory Syndrome Coronavirus-2 (SARS-CoV-2) in the recent pandemic. Previous studies had also shown the effectiveness of preventive measures such as mask-wearing, physical distancing, and exposure duration in reducing SARS-CoV-2 transmission. However, there is still a lack of understanding regarding the impact of various exposure settings on the spread of SARS-CoV-2 within the community, as well as the most effective preventive measures, considering the preventive measures adherence in different daily scenarios. We aimed to evaluate the effect of individual protective measures and exposure settings on the community transmission of SARS-CoV-2. Additionally, we aimed to investigate the interaction between different exposure settings and preventive measures in relation to such SARS-CoV-2 transmission. Routine SARS-CoV-2 contact tracing information was supplemented with additional data on individual measures and exposure settings collected from index patients and their close contacts. We used a case-control study design, where <i>close contacts</i> with a positive test for SARS-CoV-2 were classified as <i>cases</i>, and those with negative results classified as <i>controls</i>. We used the data collected from the case-control study to construct a Bayesian network (BN). BNs enable predictions for new scenarios when hypothetical information is introduced, making them particularly valuable in epidemiological studies. Our results showed that ventilation and time of exposure were the main factors for SARS-CoV-2 transmission. In long time exposure, ventilation was the most effective factor in reducing SARS-CoV-2, while masks and physical distance had on the other hand a minimal effect in this ventilation spaces. However, face masks and physical distance did reduce the risk in enclosed and unventilated spaces. Distance did not reduce the risk of infection when close contacts wore a mask. Home exposure presented a higher risk of SARS-CoV-2 transmission, and any preventive measures posed a similar risk across all exposure settings analyzed. Bayesian network analysis can assist decision-makers in refining public health campaigns, prioritizing resources for individuals at higher risk, and offering personalized guidance on specific protective measures tailored to different settings or environments.","author":"Pilar Fuster-Parra","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e3a6d9d58ae65b4483fe864af8f98c8e309a35e56d9db2ec309526581ec15648","category":"Interdisciplinary"}