{"title":"Hands-On With Wahoo’s New SYSTM Training Platform","link":"https://www.dcrainmaker.com/2021/09/hands-on-with-wahoos-new-systm-training-platform.html","date":1632834000000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/09/DSC_6198.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/DSC_6198_thumb.jpg\" /></a></p>\n<p>At first glance, one might just assume that Wahoo’s new SYSTM platform is simply The Sufferfest rebranded (<a href=\"https://www.dcrainmaker.com/2019/07/wahoo-fitness-acquires-the-sufferfest-training-platform-sketches-future-plans.html\">Wahoo acquired The Sufferfest a few years back</a>). And you’d be about 50% correct. The Sufferfest videos are still very much there, but it’s now been demoted to merely being one of a number of different components within the larger Wahoo SYSTM app. But that new app however is re-written, expanded to support most major platforms (now including Android), and with a bunch of new content pillars. And the new content that I tried is very good. Very very good in fact.</p>\n<p>The company has clearly spent considerable money and time planning out the numerous new rides and video types within the platform, all under the guise of keeping you entertained indoors on a bike trainer. The Sufferfest had long ago dispensed with the ‘always suffer’ concept, instead, realizing that like having both ice cream and pie together, you need balance in your (training) diet. These new rides types expand even further that balance across ones that hurt, from ones that are more balanced. Plus – they add new sports like running and swimming training to the mix.</p>\n<p>But instead of keeping the well-recognized Sufferfest branding, Wahoo has gone with…umm…SYSTM as the new name (vowel removed of course, because Wahoo). Which is frankly, about the most bland name I can think of. Like, how do you even explain that to other people in a social setting?</p>\n<p><strong>Them:</strong> Hi, what platform you using?<br />\n<strong>Me:</strong> I’m just using the system.<br />\n<strong>Them:</strong> No, I mean, which trainer platform?<br />\n<strong>Me:</strong> Oh, it’s a Minoura trainer.<br />\n<strong>Them:</strong> Ahh, nice, keeping it quirky! But which software?<br />\n<strong>Me:</strong> Just the system software<br />\n<strong>Them:</strong> Right, but like…what’s the name of the app?<br />\n<strong>Me:</strong> System.<br />\n<strong>Them:</strong> Umm, really mate, what system are you using?<br />\n<strong>Me:</strong> Oh sorry, the new Android system.<br />\n<strong>Them:</strong> Ok…I don’t understand, whatever, I’ve gotta Zwift racing starting in a minute.<br />\n<strong>Me:</strong> Right, I hear everyone talking about that. Apple TV too, huh?</p>\n<p>In any case, if you can get past teasing them for the name, then the actual platform itself is quite cool. So, let’s dig into it.</p>\n<h3><span>What’s New:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-16.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-16.png\" /></a></p>\n<p>As I alluded to earlier, it’s all about expansion of areas. Sufferfest previously had essentially a few core areas of cycling, yoga, strength, and mental training. But most people knew it for its cycling workouts, which up until the last few years leaned heavily on the painful/suffering part. But now Wahoo’s branding this as (exact quote) “The Word’s Most Complete Training App for Endurance Athletes”. That’s probably (definitely) a stretch, but as part of that stretch goal they’ve expanded the sports to also include running and swimming.</p>\n<p>But more notably for cyclists, there’s a boatload of new ride types:</p>\n<p><strong><u>Added ProRides:</u></strong> These 7 rides are filmed in a pro race with a GoPro onboard, however there’s two key distinctions. First, there’s no cuts in the video. It’s straight through from a given starting point, for a duration of 1-2 hours. Second, <strong><em>you mirror the pro riders actual power recorded in that actual</em> race</strong>, except simply scaled to your FTP based on his FTP. It’s super cool, and crazy well executed.</p>\n<p><strong><u>Added ‘A Week With’:</u></strong> These are two set of 6 rides each (a week each, minus one day off), with a given ‘well known’ person around their hometown or regular training grounds, sprinkled with lots of their daily life tidbits during the journey. Some are hard efforts, some are recovery. Wahoo has more week sets planned over the coming months.</p>\n<p><strong><u>Added ‘On Location’:</u></strong> These 8 rides have you accompany Mike Cotty (<a href=\"http://thecolcollective.com/mike-cotty-bio-page\">founder of The Col Collective</a>) through various scenic rides, but he’s giving you lots of tidbits about things that you pass. It’s sorta like watching the Tour de France with the random tidbits about a cathedral or wine region along the way.</p>\n<p><strong><u>Added ‘Inspiration’ films:</u></strong> They’ve licensed 53 different cycling films from the past while (at least decade from what I can tell), and then paired them with specific structured trainer workouts.</p>\n<p><strong><u>Added a podcast, called ‘The Knowledge’:</u> </strong>Ok, this isn’t a ride type. It’s a podcast. But I know you’d be looking at this list, so I figured I’d mention it here. It’s not available in the app, but rather, anywhere you normally find podcasts.</p>\n<p>These four sections are atop the existing rides that The Sufferfest already had, which are:</p>\n<p><strong>– The Sufferfest:</strong> There’s some 64 rides in here, pulled in from the previous app.<br />\n<strong>– GCN Rides:</strong> Theses’ 12 structured workouts here from GCN.<br />\n<strong>– NoVid Rides:</strong> These 114 rides are basically Sufferfest rides without a video to accompany it. In other words, a normal ERG workout.<br />\n<strong>– 4DP Fitness Test:</strong> If you’re new to the Sufferfest, <a href=\"https://www.dcrainmaker.com/2017/10/hands-on-with-the-sufferfests-new-4dp-platform.html\">you’d probably want to do their 4DP test</a>. These two videos take you through that.</p>\n<p>Note that all of these workouts are designed to be done indoors at this time. Wahoo says that they’re hoping to have outdoor variants by the end of the year, but not likely have the actual connectivity to head units until next spring. Though, they did say that connectivity won’t be limited to just Wahoo head units, but they aim to have it device agnostic. However, they noted that likely only Wahoo head units will support 4DP power profiles, which may limit exactly how those workouts enumerate on other hardware platforms.</p>\n<p>As for running, there’s now some 120 running workouts – only three of which have videos (for treadmill use). The rest are meant to be written down, as Wahoo doesn’t support structured workout sync at this time from SYSTM (next spring).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-17.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-17.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/09/image-18.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-18.png\" /></a></p>\n<p>There are also then some 80 swim workouts. None of them require or utilize a waterproof iPad. Which is a shame, because I always see <a href=\"https://amzn.to/3EZD1hd\">these waterproof iPad cases</a> every year at CES sitting in aquariums on the show floor, and always wonder who purchased them. Looks like I still won’t have an excuse to purchase one.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-19.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-19.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/09/image-20.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-20.png\" /></a></p>\n<p>And then rounding home there are now 21 mental training workouts, 52 strength training workouts, and 51 yoga workouts. They noted that Strength training has a complete overhaul, where previously the workouts were all full body. So you had a beginner workout that did upper body, lower body, core, etc… all in one workout. Those are still there (now called ‘Full Body’ in the filters), but now they have specific body area workouts. So you can do a lower body workout, or a core workout, without doing all the other pieces.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-21.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-21.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/09/image-22.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-22.png\" /></a></p>\n<p>Now in terms of platforms, Wahoo supports the following – now notably including Android:</p>\n<p>•    iPhone/iPad: Minimum of iOS 14<br />\n•    MacOS: Minimum MacOS Catalina 10.15 or higher<br />\n•    Windows: Minimum Windows 10 (v1903)<br />\n•    Android: Android 9</p>\n<p>Now unfortunately, there’s no Apple TV support either at the moment, or planned. And while one can piddle about and argue as to whether you personally find that valuable, the simple reality is a crapton of Zwifters do – which is probably a pretty darn good indication that people find it useful. And unfortunately, as you’ll see in my testing in a moment, the act of getting content onto a larger screen leaves much to be desired in SYSTEM.</p>\n<p>But here’s the kicker (or, KICKR) <strong>is if you don’t use the new app for some reason</strong> (such as running on older hardware), your <strong>time with The Sufferfest comes to an end in November</strong>, with Wahoo saying:</p>\n<blockquote><p>“If you’re on a device that can’t upgrade to these services, you can continue running the old app for a few weeks, but we will no longer support it and eventually will turn off the app entirely on November 15, 2021.”</p></blockquote>\n<p>I get the lack of support aspect, sure. Though I’m not sure I understand the burning desire to burn the bridges on your longer-term users with a mere 6 week lead time.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-23.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-23.png\" /></a></p>\n<p>Lastly, there’s <a href=\"https://open.spotify.com/show/6893Hpry2VxKDixkVSN7gy?si=AlAj9MnBQkez_x9GmhG0NA&amp;dl_branch=1\">The Knowledge podcast</a>. This is an obvious counterbalance to TrainerRoad’s well known ‘<a href=\"https://www.trainerroad.com/podcast/\">As a Cycling Coach’ podcast</a>. The difference is The Knowledge aims to be short, about 15-20 minutes, whereas TrainerRoad’s has continued to grow in length over the years, averaging about 2hrs+ most weeks. Of course, for some people you want a long podcast, and others want a short one. However, in their intro trailer, Wahoo certainly seems to be poking at TrainerRoad a bit saying “You’re not going to hear us droning on for hours about some topic and just beating it to death….It’s not going to be a lecture.”</p>\n<p>Setting aside the rivalries, it stays true to its mantra in terms of being short and focused. One episode I listened to focused on how to ‘train with purpose’, and in particular understanding how to balance the trio of power in cycling (or pace in running), heart rate, and perceived effort in terms of determining if the workout is going as intended. And the differences that different people could have especially around heart rate and perceived effort. They touched on how a metric like heart rate can vary purely based on hydration (or specifically lack thereof), even within a ride. And then how to utilize that triangle of data to determine how to make next steps in a longer workout. There was plenty of nuanced tidbits within that where they discussed caveats and things to be aware.</p>\n<p>Overall, for being an earlier episode in a podcast series, it was fairly good. Podcasts often take many episodes to stabilize. In this case, you could tell the episodes were edited a fair bit to keep them crispy and non-wandering. And again, some folks might like that, whereas others might prefer more of the meandering of the TrainerRoad topics. To each their own.</p>\n<h3><span>Trying The Newness:</span></h3>\n<p>Ok, so jumping into things a bit, once you’ve got the app installed you’ll find your calendar front and center, with yesterday/today/tomorrow shown. In my case, I dragged a 14-day trial plan onto my calendar. Which is actually an interesting way of seeing all the newness. I don’t need a 14-day trial of the platform, but rather, this is basically like the greatest highlights reel of the platform in 14 days. Kinda logical.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-24.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-24.png\" /></a></p>\n<p>You can of course create your own plan based on your own specific goals, including for different sports – not just cycling:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-25.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-25.png\" /></a></p>\n<p>The options get pretty detailed, pretty quick:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-26.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-26.png\" /></a></p>\n<p>And then spits out some recommendations as well:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-27.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-27.png\" /></a></p>\n<p>In general, the structure is pretty good for choosing a basic sprint triathlon training plan, though I’d argue probably a bit over the top for a sprint triathlon (since I selected a low-volume plan).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-28.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-28.png\" /></a></p>\n<p>In any case, if you don’t have or want a training plan, there’s no reason to do so. You can simply tap ‘Library’ on the left side and then look at all the workouts types. You can see the sport categories up above.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-29.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-29.png\" /></a></p>\n<p>If we tap ‘Cycling’, we’re then brought to a hellishly useless list of 258 workouts. Look at the below – there’s no small thumbnail of the workout’s video content that Wahoo undoubtedly spent probably a million+ dollars creating, no meaningful description of what a Dog’s Life is (beyond apparently a bland and boring ERG workout), or why a Sunday in Hell is titled such given its only got an IF of .64.</p>\n<p>Look, I love a lot of what Wahoo is doing with SYSTM, so my feedback here is definitely on the constructive side: But c’mon – you just spent all this money on amazing new content to entirely bury it. Look above?</p>\n<p>You’ve relegated the four new sections (ProRides/Inspiration/On Location/A Week With) to tiny icons that nobody is be inspired to actually click on. They look like leftovers. Afterthoughts. Sloppy-seconds. Those should be front and center, full thumbnails, with enticing reasons to click on them. And the same goes for below, each of those should have a thumbnail next to it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-30.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-30.png\" /></a></p>\n<p>In any event, we’ll go back and click on ProRides. Here we’ll see a list of 7 workouts with names and lots of painful-looking graphs. Again, no thumbnails.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-31.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-31.png\" /></a></p>\n<p>In my case, I went with Tour of Norway. Now, it’s worthwhile noting that some of the ProRides are actually from Sufferfest previously. For example, this Norway one I did was from this past January as part of their Norway tour event they did. So that’s more of a lateral move than anything else.</p>\n<p>In any case, in the app we finally get a thumbnail here, as well as the structure of the workout. Now keep in mind that ProRides are you along for a chunk of the race, mirroring the pro riders actual power output. They take his power relative to his FTP, and then you simply get scaled targets that match your FTP. At times during the video, you’ll see both his actual power and your actual power side by side, and yes, it’s scaled appropriately (painfully so). It’s technically done in ERG mode (so that you suffer correctly).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-32.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-32.png\" /></a></p>\n<p>The workout is fast paced but doable. There’s a handful of minutes of warm-up at the beginning, where they set the stage (literally) about how you’ll be riding the last 37km of this particular Tour of Norway stage, ‘with’ rider Carl Fredrik Hagen. He has an onboard camera, and ultimately, you’ll be part of a four-man breakaway mirroring his power through occasionally rolling terrain, with one short 4KM climb.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/vlcsnap-2021-09-28-13h43m41s437.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/vlcsnap-2021-09-28-13h43m41s437_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/09/vlcsnap-2021-09-28-13h44m02s045.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/vlcsnap-2021-09-28-13h44m02s045_thumb.png\" /></a></p>\n<p>Once cooking along, SYSTM uses ERG mode to control your train to a never-ending slate of power targets to match Hagen’s actual output file. To make these reasonable for the trainer (and your brain), the power targets tend to last about 10 seconds before shifting again (sometimes a lot, sometimes a little). Given the majority of this ride you’re working a rotating four-man group doing pulls, it works out. Sometimes the durations are longer (like free-wheeling down a short descent), and sometimes shifting quicker (during an attack).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/vlcsnap-2021-09-28-13h45m25s851.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/vlcsnap-2021-09-28-13h45m25s851_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/09/vlcsnap-2021-09-28-13h46m05s167.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/vlcsnap-2021-09-28-13h46m05s167_thumb.png\" /></a></p>\n<p>The power targets show up at the bottom, along with all your other metrics. Due to an outside bug that they’re working on, the graph is all dorked up, so it’s skewed to one side. The coloring is representative of the 4DP power zone focus areas (which areas each benefits). Though basically, all you need to know is that darker orange/purple hurts more.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/vlcsnap-2021-09-28-13h46m28s915.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/vlcsnap-2021-09-28-13h46m28s915_thumb.png\" /></a></p>\n<p>At times there’s a coach in a team car giving you instructions or a heads up. This is mostly well-acted, except my one visual critique would be that they spent time applying a casual blur to the windows, however, that blur simply hides a static bush out the drivers side window…which never moves or shifts colors/lighting – thus, the illusion of driving with you is kinda lost. Given some video editor went to a lot of trouble to key out all those windows, it would have taken mere seconds to have put the blurred moving sky/ground footage in the window. Effect complete.</p>\n<p>In any event – that minor nit aside, I thought this was one of the best indoor trainer sessions I’ve done in years. Super well executed, super engaging. At the end of it, you’ll get a summary page with details from the workout (with cadence and speed listed down further):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-33.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-33.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/09/image-34.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-34.png\" /></a></p>\n<p>Switching genres entirely, we’ve got one of the ‘On Location’ rides. Essentially these rides pick a location, and then you’ve got a guided tour of it. It’s shot from the riders perspective, with you trailing your guide. Though there are drone shots and such tossed in. The key ‘selling point’ of these rides though are the small tidbits of local info given throughout the ride about things you’re passing.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-35.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-35.png\" /></a></p>\n<p>In my case, I did Dentelles de Montmirail. The workout is done as a structured workout along with Michael Cotty (founder of The Col Collective). So unlike a typical scenic ride on other platforms, the host is actually doing the workout with you out on the road in real-time.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-36.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-36.png\" /></a></p>\n<p>In my case, I did this one on my iPhone, mirrored to a larger screen that was connected to Apple TV. As noted, Wahoo doesn’t have any plans for Apple TV support, and in this case, it really lets the content down. As you can see, on an iPhone the video content is letterboxed (even when you use the expand option within the menus). But it gets worse, because SYSTM doesn’t support proper Airplay, but rather, just your iPhone’s screen mirroring, you end up with two sets of black bars – one on the top/bottom and one on the left/right side. So basically, my actual viewable content is a fraction of the screen’s potential size.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/clip_image001-4.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/clip_image001_thumb-4.jpg\" /></a></p>\n<p>And of course, because it’s screen mirroring and not Airplay, it’s not really designed for perfectly video playback (that’s why Apple has proper Airplay support). So you’d see occasional stutters on the connection to my TV (with a WiFi mesh network node a mere one meter away). And just on the iPhone itself, even with the over-scan option enabled, it’s still only a fraction of the viewable area:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/clip_image001-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/clip_image001_thumb-2.png\" /></a></p>\n<p>Again, they’ve spent so much money making incredible content – only for it to show up in a very non-incredible way.</p>\n<p>In any event, as you’re going along, they add a small picture in picture screen overlay where he talks about various things they’re passing by – such as this winery here.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-37.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-37.png\" /></a></p>\n<p>In a lot of ways, the videos are similar to what Peloton did with their <a href=\"https://www.dcrainmaker.com/2021/05/pelotons-features-detailed.html\">revamped scenic rides this past spring</a>, though, I’d say Wahoo has more attention to detail. For example, Wahoo includes occasional drone cutaway shots as you ride through the ride. In Peloton’s case, they’re mostly using those to transition elsewhere in the ride. But in Wahoo’s case, it’s literally just used as a second camera.</p>\n<p>I can see they’ve taken care to ensure the cut between cameras has the guide (cyclist) at the exact same spot in the pavement. Sure, the lighting is sometimes slightly different, as they were likely taken later in the day on a second go-through – but the continuity is nailed.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-38.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-38.png\" /></a></p>\n<p>Note that these rides don’t have any music with them. Wahoo says that’s so you can fully feel part of the ride, and there’s some truth there. Mike is narrating in real-time from his bike the majority of the time. Not every second, but enough that you focus on the tidbits he has to say.</p>\n<p>Ultimately, I enjoyed this video quite a bit. It was still a solid workout, and in a place where I haven’t been to before, or heard of before (despite having ridden very close to it, at Mt. Ventoux). As with the other rides, you’ll get a summary screen at the end:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-39.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-39.png\" /></a></p>\n<p>Now there are still other types of workouts I haven’t done yet, but I’ll save those for another day.</p>\n<p>Of course, I think it’s fair to say that if you liked The Sufferfest rides before, you’ll probably like these and the variety of newness. But also inversely, if you didn’t like those types of indoor training video workouts before, I’m not sure these are vastly different enough that it’d draw you in or change your mind. It’s similar, but not something entirely different or anymore social than before.</p>\n<p>I’m interested to see how well Wahoo does at keeping these newer types of content fresh. It’s far more expensive to film and produce than creating a simple ERG workout, or even what Peloton does in a studio with instructors effectively expanding the video library daily. Wahoo says they’ve got planned near term ones planned, with four more On Location videos planned to drop in December, and then another set in January. And on the ‘A Week With’ series, they have two more planned, one for November and one for January.</p>\n<h3><span>Coming Soonish:</span></h3>\n<p>Now very briefly, there are a slate of things that didn’t make the cut for launch. None of these have a ton of detail yet, but there are some screenshots and mockups, so, that’s better than nothing.</p>\n<p>At present, there’s no analytics in the platform behind a simple workout summary. But Wahoo says that’ll change. By the end of the year you’ll get basic analytics, and then into 2022 that’s going to be a core focus area for the platform.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-40.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-40.png\" /></a></p>\n<p>As noted earlier, there’s no outside rides today. There are outside runs, yes, but no outside equivalents to any of the workouts. Given it’s designed to be a comprehensive training platform, Wahoo says they understand the need/desire to eventually ride a bike outside. By the end of the year you’ll start to see outside rides within the app (so basically, structured workouts designed for outside).</p>\n<p>But those won’t sync to your bike computer yet. That’ll come by spring 2022 (northern hemisphere). Wahoo says that won’t be limited to the Wahoo bike computers, though might be limited functionality on other units. For example on a Wahoo unit you’ll get 4DP zones, but they said that likely won’t happen on other hardware platforms.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-41.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-41.png\" /></a></p>\n<p>Finally, coming later this year Wahoo hardware owners will be able to setup and manage devices from within SYSTM. This is most notable for the Wahoo KICKR Bike users, where your gearing/shifting preferences will be associated with your account when you login, rather than having to change them in the Wahoo smartphone app.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-42.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-42.png\" /></a></p>\n<p>Though, given that all the workouts in SYSTM today are technically ERG mode, I’m not super sure on where the virtual shifting comes into play. But hey, things to ponder I guess.</p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/image-43.png\"><img src=\"https://media.dcrainmaker.com/images/2021/09/image_thumb-43.png\" /></a></p>\n<p>Ultimately, the content expansion is great here. Not just the expanded ride types like the ProRide’s or On Location rides, but also simply the expanded sport types – including running and swimming. The pricing at $15/month remains the same (cheaper if you do an annual plan), which is positive. Other companies have increased their prices, perhaps justifiably so, but it’s good to see Wahoo maintain the same Sufferfest pricing with SYSTM. As I detailed earlier, I found the new ride types that I tried engaging. I haven’t tried everything – such as the collection of licensed films. For my personal tastes, I’ll probably just watch something else on Netflix/YouTube that I want to watch at that point, but I appreciate the option.</p>\n<p>My main disappointment with SYSTM isn’t the new content – that’s great. Rather, it’s the technical implementation. I know that Wahoo clearly had a lot of work to revamp The Sufferfest app onto new platforms/OS’s. But I feel like for the two core scenarios I tried (desktop and iPhone) to a big screen, that was a let-down. With such good visual content, it’s wasted when only a portion of my screen fills up with that well-shot video. I don’t know why Wahoo elected not to do an Apple TV app, but for this sorta thing: It’s kinda a no-brainer. One only need to look at Zwift’s success there to see that. People want simplicity and a high ‘just works’ factor – and that delivers. And from a development standpoint, most apps will share a single codebase, save platform specific things.</p>\n<p>I think the bigger question might be though, what Wahoo plans to do with ‘SYSTM’ as a product brand. After all, ignoring my side-eye at the name, the word <em>system</em> implies something bigger. Wahoo says they’re working on the training analytics side, seemingly quite aware of what TrainerRoad has done in their move towards making their platform a one-stop-shop for both executing the workout, but also analyzing the workout. Thus for some people, taking a TrainingPeaks or Today’s Plan out of the revenue stream. We’ve already seen Xert execute on this strategy, largely from their incarnation. But one has to wonder, will Wahoo eventually add something that’s more social into their training platform.</p>\n<p>Arguably, there’s no trainer brand that has better social appeal than Wahoo, yet in terms of the actual training – everything in SYSTM is as solo-cup as you get. Like TrainerRoad, for some people that’s what they want. They don’t want the social interaction (or distraction) of Zwift. They just want to be in their own world. Yet for others, they’re motivated by racing or riding with others online. Like many people, I fall in both camps – using both platforms as I see fit throughout the year depending on my mood. One day I want something social or competitive, the next day I want to be left alone. Having a single <em>system</em> to cover both of those would seem like a logical next step.</p>\n<p>Either way, for the meantime there’s plenty of new content on Wahoo’s platform to keep one busy doing new rides for quite some time. And based on the few new rides I’ve done thus far, they’re definitely worth riding.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"e3a78934a97ae2ae2d0cec300b580c8ccda31a90037e2d25765855b9fd71c2f7","category":"Cycling"}