{"title":"DLSS? FSR? Microsoft aims to end the PC gaming upscaling wars with “DirectSR”","link":"https://arstechnica.com/?p=2006879","date":1709225092000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/IMG_1114-800x533.jpeg\" alt=\"Midrange GPUs like AMD's Radeon RX 7600 or Nvidia's GeForce RTX 4060 can benefit a lot from DLSS and FSR upscaling, which can improve image quality and framerates beyond what the hardware can render natively. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/IMG_1114.jpeg\">Enlarge</a> <span>/</span> Midrange GPUs like AMD's Radeon RX 7600 or Nvidia's GeForce RTX 4060 can benefit a lot from DLSS and FSR upscaling, which can improve image quality and framerates beyond what the hardware can render natively.  (credit: Andrew Cunningham)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>One of the most interesting developments in 3D gaming in the last half-decade or so is the advent of advanced upscaling technologies—features like Nvidia's Deep-Learning Super Sampling (DLSS), AMD's FidelityFX Super Resolution (FSR), and Intel's Xe Super Sampling (XeSS). These technologies all aim to provide better, sharper image quality when playing at non-native resolutions, and when they're working well, they can boost frame rates and help squeeze a bit more life out of an older or lower-end GPU.</p>\n<p>The problem has been that game developers need to actually support these technologies in their games, and it's incumbent on developers to support each individual upscaling technology. DLSS usually looks a bit better than FSR, but it requires an Nvidia GPU; FSR works on just about anything but doesn't look quite as good. (Intel's XeSS exists somewhere in the middle, in that it works with any modern GPU but looks best when it can leverage Intel's GPU hardware.)</p>\n<p>Microsoft is stepping in to try to straighten up this muddle of conceptually similar, executionally different technologies with a new API called DirectSR (the SR is for Super Resolution). The new API was announced in <a href=\"https://devblogs.microsoft.com/directx/directx-innovation-on-display-at-gdc-2024/\">a blog post</a> about Microsoft's 2024 Game Developers Conference sessions, and it was developed by Microsoft \"in partnership with GPU hardware vendors.\"</p></div><p><a href=\"https://arstechnica.com/?p=2006879#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2006879&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e3ab4ad4e18ec091cb2ad40b019213bde68a1f104c95e2442c004124deb5bd75","category":"Tech"}