{"title":"iOS 17.3 Beta: All the New Features So Far","link":"https://www.macrumors.com/guide/ios-17-3-beta-features/","date":1702596058000,"content":"Apple started testing the iOS 17.3 and iPadOS 17.3 betas in December, and while we are not expecting these updates to be as feature rich as iOS and iPadOS 17.2, there are some notable features that have been found so far.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/iOS-17.3-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThis guide aggregates everything that is coming in the iOS 17.3 update, and we'll update it throughout the beta testing period.\r<br />\n\r<br />\n<h2>Stolen Device Protection</h2>\r<br />\nEarlier this year, there were news reports about a slate of <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> thefts where the thief spied on a victim to learn the device passcode before stealing the phone, leading to drained bank accounts and an untraceable ‌iPhone‌.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/ios-stolen-device-protection.jpg\" width=\"1600\" height=\"900\" />\r<br />\nAs a solution, Apple introduced Stolen Device Mode in iOS 17.3 to add extra security. If someone should obtain both your ‌iPhone‌ and your passcode, this feature prevents total catastrophe. With Stolen Device Mode enabled, accessing passwords in <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> Keychain, turning off Lost Mode, erasing content, and making purchases in Safari requires biometric authentication with <a href=\"https://www.macrumors.com/guide/mask-face-id/\">Face ID</a> or <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a>.\r<br />\n\r<br />\nCertain actions such as changing an <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a> password require ‌Face ID‌ and have a one-hour security delay. So if you (or someone else) tried to change your ‌Apple ID‌ login, you would need both ‌Face ID‌ authentication and then an hour wait period before the password could be updated. These wait periods are waived when you are in a trusted location like home or work.\r<br />\n\r<br />\nAs outlined in our report on the feature, here are actions that require biometric authentication when the Stolen Device Protection is activated:\r<br />\n<ul>\r<br />\n <li>Viewing/using passwords or passkeys saved in ‌iCloud‌ Keychain</li>\r<br />\n <li>Applying for a new <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a></li>\r<br />\n <li>Viewing an ‌Apple Card‌ virtual card</li>\r<br />\n <li>Turning off Lost Mode</li>\r<br />\n <li>Erasing all content and settings</li>\r<br />\n <li>Taking certain Apple Cash and Savings actions in Wallet</li>\r<br />\n <li>Using payment methods saved in Safari</li>\r<br />\n <li>Using your ‌iPhone‌ to set up a new device</li>\r<br />\n</ul>\r<br />\nNote that these actions do not have a passcode backup, so you can't use a passcode to skirt ‌Face ID‌ or ‌Touch ID‌. Actions that require biometric authentication and have a one-hour security delay include the following:\r<br />\n<ul>\r<br />\n <li>Changing your ‌Apple ID‌ password</li>\r<br />\n <li>Updating select ‌Apple ID‌ account security settings, including adding or removing a trusted device, trusted phone number, Recovery Key, or Recovery Contact</li>\r<br />\n <li>Changing your ‌iPhone‌ passcode</li>\r<br />\n <li>Adding or removing ‌Face ID‌ or ‌Touch ID‌</li>\r<br />\n <li>Turning off <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a></li>\r<br />\n <li>Turning off Stolen Device Protection</li>\r<br />\n</ul>\r<br />\nStolen Device Protection is available on all iPhones that are able to run <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, which includes the ‌iPhone‌ XS and newer. It is an opt-in feature that can be turned on in the Settings app by going to ‌Face ID‌ &amp; Passcode and toggling on Stolen Device Protection.\r<br />\n\r<br />\n<h2>Collaborative Apple Music Playlists</h2>\r<br />\nApple first tested collaborative <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> playlists in iOS 17.2, but the feature was removed before the software was released.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/apple-music-collaborative-playlists.jpg\" width=\"5484\" height=\"3085\" />\r<br />\nCollaborative ‌Apple Music‌ playlists are back in the iOS 17.3 beta, suggesting Apple just needed a little bit more time to work out the kinks.\r<br />\n\r<br />\nIn iOS 17.3, you can take any of your existing playlists or create a new one and then invite others to join in to add songs and listen to the playlist. You can invite friends, family members, and others who share your musical preferences, and there doesn't appear to be a limit on how many people can contribute.\r<br />\n\r<br />\nWe have a <a href=\"https://music.apple.com/us/playlist/pl.u-kaJH7JG97e?a=join&amp;it=zr6IZVEGZ6tVoblq\">MacRumors collaborative music playlist</a> available for those who want to join in and share music with other MacRumors readers.\r<br />\n\r<br />\nTo use the collaboration feature, go to a playlist in the ‌Apple Music‌ app and then tap on the person icon. You will be able to generate a link that you can send to others, and everyone who is invited can access the playlist. There is an option to approve each person that joins, and leaving this off just opens it up to anyone with the link.\r<br />\n\r<br />\nThe person who created the playlist can remove people, remove songs, and turn off collaboration at any time.\r<br />\n\r<br />\nApple in iOS 17.3 added a neat emoji reaction feature that allows listeners to add an emoji to any song that's playing to express their feelings about it. There are standard quick access emoji options like a heart and thumbs up, but with the \"+\" button, any emoji can be added.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/apple-music-collaborative-playlist-emoji.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nWhen you're listening to a song in the playlist that has emoji reactions, those emoji animate as the song begins to play.\r<br />\n\r<br />\n<h2>Release Date</h2>\r<br />\niOS 17.3, iPadOS 17.3, macOS 14.3, tvOS 17.3, and watchOS 10.3 are all expected to see a public release sometime around January. Beta testing will be slightly delayed by the Christmas and New Year's holidays.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ios-17.241\">iOS 17</a>, <a href=\"https://forums.macrumors.com/forums/ipados-17.242\">iPadOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/ios-17-3-beta-features/\">iOS 17.3 Beta: All the New Features So Far</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-3-beta-all-the-new-features-so-far.2413770/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e3ade32c8d9d1fa802acbddc0926efaab1978150374735e87ad7231f41887acb","category":"Apple"}