{"title":"377 Developing visible near-infrared spectroscopy calibration equations to predict the chemical composition of feces and nutrient digestibility based on pig fecal spectra","link":"https://academic.oup.com/jas/article/102/Supplement_3/245/7757304?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Optimizing feed efficiency is an effective way to curb overall pig production costs given the increasing feed prices. Visible near-infrared spectroscopy (NIRS) can be potentially implemented in the swine industry to determine nutrient digestibility, offering the advantages of rapidity, non-destructiveness, and cost-effectiveness. The current study aimed to develop calibration equation models for the chemical composition of feces and the apparent total-tract digestibility (ATTD) of nutrients, including dry matter (DM), crude protein (CP), gross energy (GE), ash, calcium, phosphorus, neutral detergent fiber (NDF), and acid detergent fiber (ADF) to make predictions based on the spectra of oven-dried pig feces. Fecal samples were collected from a total of 1,917 male finishing boars of purebred Large White sire and dam lines with 306 individual samples used for the development of calibration equations. Samples were scanned twice between 400 and 1099.5 nm with increments of 0.5 nm using a Foss FoodScan 2 (FOSS, Hilleroed, Denmark) in transmission visible-NIR. A total of 16 calibration models were generated and developed using FossCalibrator Pro software. The results showed that the coefficient of determination (R<sup>2</sup>) for calibration models of different nutrient content in feces was greater than those from ATTD of the same nutrient. Among that, R<sup>2</sup> values for calibration, cross validation, and validation of DM and CP content all exceeded 0.8. Except for ash and phosphorus, R<sup>2</sup> values of other nutrient contents were greater in calibration than in validation. Different from nutrient contents, the R<sup>2</sup> of ATTD of nutrients, except for phosphorus and NDF, were less in calibration compared with validation. In validation, the residual prediction deviation (RPD) values of DM, CP, ash, and NDF were above 1.5, and the RPD values of ATTD of DM, CP, and GE were also greater than 1.5. The linearity and accuracy of calibration equation models for nutrient content in feces were higher than those for the ATTD of nutrients. The calibration models for CP content in feces and the digestibility of CP exhibited the highest calibration model quality. The external prediction of an independent sample set exhibits a real, abundant, and comprehensive prediction values using above calibration models based on 1,611 fecal samples. Except for DM, the coefficient of variation for the remaining parameters within the external prediction datasets was less than that in the validation datasets. In summary, calibration equations were successfully developed to predict the chemical composition of feces and nutrient digestibility based on oven-dried pig fecal spectra, especially for CP. The next step is to develop calibration equations using wet fecal samples. The application of NIRS technology to predict crude protein digestibility is promising and can be used to assist pig breeding companies in selecting animals with high protein efficiency.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e3bab56a1adf8d3e045785c68dd4128f75d37771ea6ce82f24bb1dad69bca606","category":"Environment"}