{"title":"Prevalence and genome features of lake sinai virus isolated from <i>Apis mellifera</i> in the Republic of Korea","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299558","date":1710856800000,"content":"<p>by Thi-Thu Nguyen, Mi-Sun Yoo, A-Tai Truong, So Youn Youn, Dong-Ho Kim, Se-Ji Lee, Soon-Seek Yoon, Yun Sang Cho</p>\r\n\r\nLake Sinai Virus (LSV) is an emerging pathogen known to affect the honeybee (<i>Apis mellifera</i>). However, its prevalence and genomic characteristics in the Republic of Korea (ROK) remain unexplored. This study aimed to assess the prevalence of and analyze the LSVs by examining 266 honeybee samples from the ROK. Our findings revealed that LSV exhibited the highest infection rate among the pathogens observed in Korean apiaries, particularly during the reported period of severe winter loss (SWL) in <i>A</i>. <i>mellifera</i> apiaries in 2022. Three LSV genotypes– 2, 3, and 4 –were identified using RNA-dependent RNA polymerase gene analysis. Importantly, the infection rates of LSV2 (65.2%) and LSV3 (73.3%) were significantly higher in colonies experiencing SWL than in those experiencing normal winter loss (NWL) (<i>p</i> &lt; 0.03). Furthermore, this study provides the first near-complete genome sequences of the Korean LSV2, LSV3, and LSV4 strains, comprising 5,759, 6,040, and 5,985 nt, respectively. Phylogenetic analysis based on these near-complete genome sequences demonstrated a close relationship between LSVs in the ROK and China. The high LSV infection rate in colonies experiencing a heightened mortality rate during winter suggests that this pathogen might contribute to SWL in ROK. Moreover, the genomic characteristic information on LSVs in this study holds immense potential for epidemiological information and the selection of specific genes suitable for preventing and treating LSV, including the promising utilization of RNA interference medicine in the future.","author":"Thi-Thu Nguyen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e3c87c5c42b2271c0bd39ab393622a868893b784c85a1b80428edbff7ce176cb","category":"Interdisciplinary"}