{"title":"Egg-Clutch Biomechanics Affect Escape-Hatching Behavior and Performance","link":"https://academic.oup.com/iob/article/doi/10.1093/iob/obae006/7628310?rss=1","date":1710288000000,"content":"<span><div>Synopsis</div>Arboreal embryos of phyllomedusine treefrogs hatch prematurely to escape snake predation, cued by vibrations in their egg clutches during attacks. However, escape success varies between species, from ∼77% in <span>Agalychnis callidryas</span> to just ∼9% in <span>A. spurrelli</span> at 1 day premature. Both species begin responding to snake attacks at similar developmental stages, when vestibular mechanosensory function begins, suggesting that sensory ability does not limit the hatching response in <span>A. spurrelli. Agalychnis callidryas</span> clutches are thick and gelatinous, while <span>A. spurrelli</span> clutches are thinner and stiffer. We hypothesized that this structural difference alters the egg motion excited by attacks. Since vibrations excited by snakes must propagate through clutches to reach embryos, we hypothesized that the species difference in attack-induced hatching may reflect effects of clutch biomechanics on the cues available to embryos. Mechanics predicts that thinner, stiffer structures have higher free vibration frequencies, greater spatial attenuation, and faster vibration damping than thicker, more flexible structures. We assessed clutch biomechanics by embedding small accelerometers in clutches of both species and recording vibrations during standardized excitation tests at two distances from the accelerometer. Analyses of recorded vibrations showed that <span>A. spurrelli</span> clutches have higher free vibration frequencies and greater vibration damping than <span>A. callidryas</span> clutches. Higher frequencies elicit less hatching in <span>A. callidryas</span>, and greater damping could reduce the amount of vibration embryos can perceive. To directly test if clutch structure affects escape success in snake attacks, we transplanted <span>A. spurrelli</span> eggs into <span>A. callidryas</span> clutches and compared their escape rates with untransplanted, age-matched conspecific controls. We also performed reciprocal transplantation of eggs between pairs of <span>A. callidryas</span> clutches as a method control. Transplanting <span>A. spurrelli</span> embryos into <span>A. callidryas</span> clutches nearly tripled their escape success (44%) compared to conspecific controls (15%), whereas transplanting <span>A. callidryas</span> embryos into different <span>A. callidryas</span> clutches only increased escape success by 10%. At hatching competence, <span>A. callidryas</span> eggs are no longer jelly-encapsulated, while <span>A. spurrelli</span> eggs retain their jelly coat. Therefore, we compared the hatching response and latency of <span>A. spurrelli</span> in de-jellied eggs and their control, jelly-encapsulated siblings using manual egg-jiggling to simulate predation cues. Embryos in de-jellied eggs were more likely to hatch and hatched faster than control siblings. Together, our results suggest that the properties of parentally produced egg-clutch structures, including their vibration biomechanics, constrain the information available to <span>A. spurrelli</span> embryos and contribute to interspecific differences in hatching responses to predator attacks.</span>","author":"","siteTitle":"Integrative Organismal Biology Current Issue","siteHash":"ad96bcf7a80ab7e3a1a88c34298d761f9695964c0badbbef4e1166baa6580fcc","entryHash":"e3c9d956ef911f24cc08fa5d2b5a8728e0623d69e3016ade49a69a5d3a22cb0d","category":"Environment"}