{"title":"Frequent flight responses, but low escape distance of wild boar to nonlethal human disturbance","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12331?af=R","date":1717036499000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/308b402f-12b6-4291-8cb3-9d6bcb9e6544/eso312331-toc-0001-m.png\" alt=\"Frequent flight responses, but low escape distance of wild boar to nonlethal human disturbance\" />\n<p>Human off-trail activities induced frequent flight responses of wild boar, but escape distances were relatively short, suggesting a limited impact on their movement. Wild boar adjusted their response according to terrain ruggedness, distance from paths and hunting zonation. These insights are valuable for wildlife management and disease control strategies, such as for managing African swine fever outbreaks.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nHuman activities can affect the behaviour and fitness of wildlife. However, the response of animals to nonlethal human activities has not been well-studied in wild boar, <i>Sus scrofa</i>, even though it is a widespread species in Europe and has become of increasing concern because of crop damages and its vector capacity for diseases.\n\nWe study the behavioural responses of GPS-collared wild boar to nonlethal experimental human approaches in the Bohemian Forest Ecosystem along the border between Germany and the Czech Republic. We describe and quantify the flight responses of the animals and assess whether they vary with the distance to recreational paths and the occurrence of hunting in the area.\n\nWe show that wild boar were disturbed and displaced by human approaches on foot in 69% of the trials, but the average flight initiation and escape distances were relatively small (93 and 256 m, respectively). The probability of a flight response decreased with distance from the paths and increased with the ruggedness of the terrain. In the non-hunting zone, the flight initiation distances and flight durations were shorter than in the hunting zone.\n\nOur results suggest a weak effect of nonlethal human disturbances on the movement of wild boar, although the animals were sensitive to the perceived risk in relation to recreation infrastructure and hunting.\n\nFor the management of diseases such as African swine fever, it can be concluded that nonlethal disturbances are unlikely to accelerate the spread of the disease due to far-distance movements. Guidelines for restrictions in case of an outbreak might be adjusted accordingly.\n</p>\n<h2>Zusammenfassung</h2>\n<p>\n\nMenschliche Aktivitäten können das Verhalten und die biologische Fitness von Wildtieren beeinflussen. Die Reaktion von Tieren auf nicht-tödliche menschliche Aktivitäten wurde jedoch bei Wildschweinen (<i>Sus scrofa</i>) nur unzureichend untersucht, obwohl diese Art in Europa weit verbreitet ist und wegen Schäden in der Landwirtschaft und der Übertragung von Krankheiten zunehmend im Fokus steht.\n\nWir untersuchten die Verhaltensreaktionen von mit GPS-Halsbändern ausgestatteten Wildschweinen auf experimentelle menschliche Annäherungen im Böhmerwald-Ökosystem an der Grenze zwischen Deutschland und Tschechien. Wir beschreiben und quantifizieren die Fluchtreaktionen von Wildschweinen und evaluieren, ob diese mit der Entfernung zu Wanderwegen und jagdlichen Aktivitäten in einem Gebiet variieren.\n\nWir konnten zeigen, dass Wildschweine in 69% der Versuche durch menschliche Annäherung zu Fuß gestört und vertrieben wurden, jedoch waren die durchschnittlichen Fluchtinitiationsdistanzen und Fluchtstrecken relativ gering (93 m bzw. 256 m). Die Wahrscheinlichkeit einer Fluchtreaktion nahm mit der Entfernung von Wegen ab und stieg mit der Unebenheit des Geländes an. In der jagdfreien Zone waren die Fluchtinitiationsdistanz und Fluchtdauer kürzer.\n\nUnsere Ergebnisse deuten auf einen schwachen Einfluss nicht-tödlicher menschlicher Störungen auf das Bewegungsverhalten von Wildschweinen hin, zeigen aber auch, dass die Tiere empfindlich auf das wahrgenommene Risiko in Bezug auf Erholungsinfrastruktur und Jagd reagieren.\n\nFür den Umgang mit Krankheiten wie der Afrikanischen Schweinepest kann daraus geschlussfolgert werden, dass eine Beschleunigung der Ausbreitung einer Seuche durch nicht-tödliche Störungen unwahrscheinlich ist. Die Leitlinien für Einschränkungen im Falle eines Ausbruchs könnten entsprechend angepasst werden.\n</p>","author":"Elodie Wielgus, \nMaik Henrich, \nChristian Fiderer, \nAriana Töws, \nJan‐Niklas Michel, \nFranz Kronthaler, \nMarco Heurich","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"e3cebfb3b84c37ff167af57e61d7c6965732f2967e8fe796652c0cb64aa8820f","category":"Environment"}