{"title":"Walnut oil: a promising nutraceutical in reducing oxidative stress and improving cholinergic activity in an in vitro Alzheimer’s disease model","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae097/7701762?rss=1","date":1719792000000,"content":"<span><div>Abstract</div>Improving the quality of life in elderly patients and finding new treatment options for neurological diseases such as Alzheimer’s has become one of the priorities in the scientific world. In recent years, the beneficial effects and therapeutic properties of natural foods on neurological health have become a very remarkable issue. Walnut oil (WO) is a promising nutraceutical, with many phytochemicals and polyunsaturated fatty acids and is thought to be promising in the treatment of many neurological diseases and cognitive deficits, such as Alzheimer’s disease (AD). Polyphenolic compounds found in WO enhance intraneuronal signaling and neurogenesis and improve the sequestration of insoluble toxic protein aggregates. The objective of this study was to investigate the potential protective and therapeutic effects of WO in a model of AD induced by retinoic acid (RA) and brain-derived neurotrophic factor (BDNF). In order to achieve this, the experimental groups were formed as follows: Control group, WO group, Alzheimer’s disease (AD) group, AD + WO applied group (AD + WO). WO supplementation almost significantly reduced oxidative stress in the <span>ad</span> model, providing 2-fold protection against protein oxidation. Additionally, WO showed a significant reduction in tau protein levels (2-fold), increased acetylcholine (ACh) levels (12%), and decreased acetylcholine esterase (AChE) activity (~50%). Since it has been known for centuries that WO does show any adverse effects on human health and has neuroprotective properties, it may be used in the treatment of AD as an additional nutraceutical to drug treatments.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"e3cfd3872847b63b33a15fbad364aeba2cd8732d52529ab65e9590c965c1ee19","category":"Environment"}