{"title":"Facebook ให้ครีเอเตอร์เก็บค่า Subscriptions ได้แบบไม่เสียค่าธรรมเนียม 30% เหมือน Apple","link":"https://www.blognone.com/node/125666","date":1635994318000,"content":"<div><div><div><p>ตั้งแต่เดือน มิ.ย. ปี 2020 Facebook เปิดระบบ Subscriptions ให้ครีเอเตอร์ที่ผ่านเกณฑ์ เก็บเงินจากแฟนๆ รายเดือนเพื่อสร้างรายได้สำหรับสร้างเนื้อหาต่อไปได้ (โมเดลคล้าย Patreon) ล่าสุด Facebook ประกาศความเคลื่อนไหวเพิ่มเติม ครีเอเตอร์ใน 27 ประเทศ รวมไทยด้วย สามารถเปิด Subscriptions ได้ แต่ยังเป็นระบบ invite-only</p>\n<p>ครีเอเตอร์สามารถโปรโมทระบบ Subscriptions ในหน้าโปรไฟล์ของตัวเอง และใช้ระบบชำระเงิน Facebook Pay ได้โดยไม่เสียค่าธรรมเนียม นอกจากนี้ Facebook ยังจ่ายโบนัสให้กับครีเอเตอร์ $5 - $20 ถ้ามีคนมาติดตามเพิ่ม โดยมีวงเงินกำหนดสูงสุด 10,000 เหรียญ ซึ่งเป็นส่วนหนึ่งของเม็ดเงินลงทุน 1,000 ล้านเหรียญเพื่อครีเอเตอร์ที่ Facebook ประกาศมาก่อนหน้านี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/35a49afd32f9f106601f9101bd88a48e.jpg\" /></p>\n<p>Mark Zuckerberg โพสต์ Facebook ว่า ในขณะที่บริษัทสร้าง Metaverse และเน้นการทำงานปลดล็อกโอกาสสำหรับครีเอเตอร์ เพื่อสร้างรายได้จากงานของพวกเขา แต่ค่าธรรมเนียม 30% ที่ Apple เก็บไปทำให้ทำได้ยากขึ้น ดังนั้นเราจึงอัปเดต Subscriptions เพื่อให้ครีเอเตอร์สามารถสร้างรายได้ได้มากขึ้น</p>\n<p>นโยบายไม่เก็บค่าธรรมเนียมของ Facebook จะดำเนินไปจนถึงเดือนมกราคมปี 2023 ในระบบ Subscriptions ครีเอเตอร์สามารถเข้าถึงหน้ารวมข้อมูลสถิติ ภาพรวม และตัวเลขยอดเงินแบบแบ่งให้เห็นชัดเจน (เตรียมเปิดใช้งานในอนาคต) ผ่าน Creator Studio</p>\n<p>ที่มา - <a href=\"https://www.facebook.com/creators/earn-money-with-subscriptions\">Facebook</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/mark-zuckerberg\">Mark Zuckerberg</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e3d175ee22055e1afd94e6cd149caa97c4ba000837bf2ae0e9a4431eb26bb7ae","category":"Thai"}