{"title":"Insights into hospitalization pattern for drug, medicament, and biological substance poisoning, adverse effect, and underdosing in Australia: An ecological study between 1998 and 2019","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309362","date":1724940000000,"content":"<p>by Abdallah Y. Naser</p>\r\nBackground <p>Drug, medicament, and biological substance poisoning, adverse effects, and underdosing are significant public health concerns. Gaining insight into the patterns and trends in hospitalizations caused by these occurrences is essential for the development of preventative initiatives, optimization of treatment regimens, and improvement of patient safety. The aim of this study is to examine the trend of hospitalisation related to poisoning by, adverse effect of and underdosing of drugs, medicaments and biological substances in Australia between 1998 and 2019.</p> Methods <p>This is an ecological descriptive study that examined hospitalisation related to poisoning by, adverse effect of and underdosing of drugs, medicaments and biological substances in Australia between 1998 and 2019. A nationwide hospital admissions database was used for this study.</p> Results <p>Between 1998 and 2019, a total of 683,869 hospital admission episodes were recorded in Australia. The overall annual number of hospital admissions for various reasons increased by 20.5% from 29,854 in 1998 to 35,960 in 2019, representing a decrease in hospital admission rate of 10.6% [from 158.69 (95% CI 156.90–160.49) in 1998 to 141.91 (95% CI 140.44–143.37) in 2019 per 100,000 persons, trend test, p&lt;0.05]. Overnight-stay admissions accounted for 69.2% of the total number of hospital admissions, and 30.8% were same-day admissions. Rates of same-day hospital admission decreased by 13.3% [from 50.55 (95%CI 49.54–51.57) in 1998 to 43.81 (95%CI 43.00–44.63) in 2019 per 100,000 persons]. Rates of overnight-stay hospital admission decreased by 11.1% [from 108.14 (95%CI 106.66–109.63) in 1998 to 96.17 (95%CI 94.96–97.38) in 2019 per 100,000 persons]. Admissions related to antiepileptic, sedative-hypnotic and antiparkinsonism drugs was the most prevalent hospital admissions type accounting for 26.8%. Females were responsible for 418,751 hospital admission episodes, representing 61.5% of the total number of hospital admission.</p> Conclusion <p>This study found that while the overall annual number of admissions increased, the rate of admission decreased over the same period. The most common reasons for admissions were antiepileptic, sedative-hypnotic, and anti-parkinsonism drugs. The study also noted increases in admissions related to anaesthetics, therapeutic gases, hormones, and their synthetic substitutes. These findings suggest a concerning rise in the suboptimal use of these medications. In order to combat the increasing incidence of this type of admissions, it is imperative to strengthen public awareness initiatives on medicine safety and abuse.</p>","author":"Abdallah Y. Naser","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e3d3f94aedb21e1670d43d345e0c20a35e4577876a030d940b114003ef481093","category":"Interdisciplinary"}