{"title":"Impact of Gut Microbiota and SCFAs in PCOS Pathogenesis and Metformin on Therapy","link":"https://www.preprints.org/manuscript/202409.0338/v1","date":1725432169000,"content":"Polycystic ovary syndrome (PCOS) is a complex disorder that impacts both the endocrine and metabolic systems. The gut microbiota plays a crucial role in in metabolism regulation and immune responses through its interaction with the external environment. This article explores the intricate interplay between intestinal flora and the pathogenesis of PCOS, focusing on the pivotal role of microbial metabolites, specifically short-chain fatty acids (SCFAs). SCFA levels in fecal and blood samples from women with PCOS (n=69) and healthy controls (n=18) were analyzed using Gas Chromatography-Mass Spectrometry (GC/MS) for precise measurement. The results revealed that women with PCOS exhibited a significant reduction in beneficial bacteria alongside a notable overgrowth of opportunistic microorganisms. An overproduction of acetic acid (AA) and valeric acid (VA) in fecal samples suggests a link between elevated SCFAs and the development of obesity and PCOS. Interestingly, AA in the bloodstream might offer a protective effect against PCOS by ameliorating key symptoms such as high body mass index (BMI), insulin resistance (IR), and chronic inflammation. This finding points to the potential therapeutic value of maintaining optimal AA levels in the blood. Although serum SCFA levels showed non-significant changes following metformin treatment, the normalization of AA in the gut underscores that metformin exerts a more pronounced effect locally within the gastrointestinal tract. This treatment also led to an increase in beneficial gut bacteria and a reduction in opportunistic pathogens, suggesting a restoration of gut microbial balance. Furthermore, the study identified the most effective model for predicting the success of metformin therapy, based on serum concentrations of butyric acid (BA) and VA, achieving a 91% accuracy rate, 100% sensitivity, and 80% specificity. These promising findings highlight the potential for developing targeted interventions and personalized treatments, ultimately improving clinical outcomes for women with PCOS.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e3d858ebf0fc3cd00bf54bbc42c08512e9959f301346ace975c822047450ee80","category":"Interdisciplinary"}