{"title":"First Qi2 Wireless Chargers Coming Soon","link":"https://www.macrumors.com/2023/11/15/first-qi2-wireless-chargers-coming-soon/","date":1700069264000,"content":"The first wireless chargers that support the new Qi2 charging standard are set to launch in time for the holiday season, according to an announcement shared today by the <a href=\"https://www.businesswire.com/news/home/20231115984149/en\">Wireless Power Consortium</a> (WPC).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/magsafe-blue-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nAnnounced earlier this year, Qi2 is a next-generation Qi charging technology that incorporates a Magnetic Power Profile. Qi2 devices will work like Apple's <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> feature, using magnets for alignment and speedier charging.\r<br />\n\r<br />\nThe <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> models are the first of Apple's smartphones that support the Qi2 standard. More than 100 Qi2 device are in testing, according to the WPC, including chargers <a href=\"https://www.macrumors.com/2023/09/01/mophie-unveils-qi2-accessories/\">from companies like</a> Belkin, Mophie, Anker, and Aircharge.\r<br />\n\r<br />\nThe Magnetic Power Profile was designed based on ‌MagSafe‌ contributions from Apple, and it is being combined with the new Extended Power Profile (EPP) to form what is considered \"Qi2.\"\r<br />\n\r<br />\nQi2 is meant to ensure that phones and other battery-powered mobile products are perfectly aligned with chargers for improved energy efficiency and faster charging. It will allow for new accessories that would not be chargeable wirelessly using existing flat surface-to-flat surface devices.\r<br />\n\r<br />\nQi2 chargers that have already been announced promise to charge devices at up to 15W, but it is not yet clear if Apple's ‌iPhone 15‌ models will support faster wireless charging with Qi2 accessories. Apple's technical specifications page for the ‌iPhone 15‌ says that the devices support Qi wireless charging \"up to 7.5W,\" with no mention of faster charging.\r<br />\n\r<br />\nMagSafe-enabled ‌iPhone 15‌ models charge at 7.5W on the current Qi standard, and 15W when using Apple's ‌MagSafe‌ chargers.<div>Tags: <a href=\"https://www.macrumors.com/guide/magsafe/\">MagSafe</a>, <a href=\"https://www.macrumors.com/guide/qi2/\">Qi2</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/15/first-qi2-wireless-chargers-coming-soon/\">First Qi2 Wireless Chargers Coming Soon</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/first-qi2-wireless-chargers-coming-soon.2411058/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e3eba2d34dda123fdfdb3011217449887a50a96fba02d6d88635dc6819b2b31e","category":"Apple"}