{"title":"Eve Debuts AirPlay 2-Compatible Eve Play and Eve Thermo Control","link":"https://www.macrumors.com/2023/08/31/eve-play-airplay-2/","date":1693486800000,"content":"<a href=\"https://www.evehome.com/en-us\">Eve Systems</a> today announced the upcoming launch of the Eve Play, an audio streaming interface created for <a href=\"https://www.macrumors.com/guide/airplay/\">AirPlay</a> 2. Eve Play adds ‌AirPlay‌ streaming capabilities to existing amplifiers, active speakers, and sound bars, allowing them to be synchronized with other ‌AirPlay‌ 2 speakers for whole-house audio.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/eve-play.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThe Eve Play includes RCA connectors, optical digital outputs, and coaxial digital outputs, along with an Ethernet port and the option to connect to either 2.4 or 5GHz WiFi. According to Eve, the digital-to-analog converter has a signal-to-noise ratio of 112 dB for an \"audiophile sound experience.\"\r<br />\n\r<br />\nWhen used with the Apple Home app and <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a>, the Eve Play can be integrated into automations similar to other ‌AirPlay‌ 2-equipped devices.\r<br />\n\r<br />\nAlongside the Eve Play, Eve today introduced the Eve Thermo Control, a wireless temperature sensor and controller for rooms that are equipped with the Eve Thermo smart radiator valve. The Eve Thermo radiator valve is sold in Europe, so the new temperature sensor is also designed for the European market.\r<br />\n\r<br />\nThe Eve Thermo Control senses the ambient temperature and relays it to the smart radiator valve for more accurate climate control.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/eve-thermo.jpg\" alt width=\"2000\" height=\"1124\" />\r<br />\nIn November, Eve plans to release a Matter update for Eve MotionBlinds roller blind motors and the Eve MotionBlinds Upgrade Kit, adding Adaptive Shading as a free upgrade feature. Adaptive Shading allows the blinds to open and close automatically based on location, date, and time.\r<br />\n\r<br />\nEve Play is priced at $150 and it will be available starting on November 14. The Eve Thermo Control is priced at €79.95 and will also be available on the same day. More information is <a href=\"https://www.evehome.com/en-us\">available on the Eve website</a>. <div>Tag: <a href=\"https://www.macrumors.com/guide/eve/\">Eve</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/31/eve-play-airplay-2/\">Eve Debuts AirPlay 2-Compatible Eve Play and Eve Thermo Control</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/eve-debuts-airplay-2-compatible-eve-play-and-eve-thermo-control.2400130/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e3f0a3e1fc3e2a71c3408735b3bd68f7bd0564cf8bdb99c9872a8fb24d73f61d","category":"Apple"}