{"title":"Exploring the burden on family caregivers in providing care for their mentally ill relatives in the Upper East Region of Ghana","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003075","date":1713276000000,"content":"<p>by Dennis Bomansang Daliri, Agani Afaya, Timothy Tienbia Laari, Nancy Abagye, Gifty Apiung Aninanya</p>\r\n\r\nCaring for the mentally ill involves numerous challenges, including financial difficulties, stigma, and psychosocial issues, among others. Unpaid family caregivers must endure these challenges as they continue their care for their relatives with mental illness. Despite these burdens and their concomitant effects on both the patients and their caregivers, there is no evidence of this burden in the Bolgatanga municipality. This study explored the burden on family caregivers providing care for mentally ill relatives in the Bolgatanga Municipality of the Upper East Region of Ghana. The study employed a phenomenological research design. Fifteen family caregivers were purposively sampled from two secondary-level health facilities. In-depth interviews were conducted, audio-recorded, and transcribed verbatim. NVivo 12 pro software was used for data analysis. Thematic analysis was conducted following Braun and Clarke’s approach. The study identified three themes including social, physical, and psychological burdens. Under social burden, financial challenges and stigma were identified, weight loss was identified as a physical burden, and poor concentration as a psychological burden. These themes represent the challenges encountered by the family caregivers as they provided care for their mentally ill relatives. There is a need to provide support for family caregivers including respite, formation of support groups, and financial support to alleviate family caregivers of the burdens they endure. Additionally, it is imperative to integrate mental health services into the national health insurance scheme to alleviate the financial burden on family caregivers.","author":"Dennis Bomansang Daliri","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"e40c7fc7bf3fb9f32f47562b65f549a916e0059a0632b2b339c8615de7093471","category":"Environment"}