{"title":"PSI-8 Inflammatory cytokine concentrations and gene expression in mature and aging sedentary horses","link":"https://academic.oup.com/jas/article/102/Supplement_3/468/7757705?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Chronic inflammation associated with aging, termed “inflamm-aging” may negatively impact overall animal health. However, the mechanisms of inflamm-aging and, therefore, effective interventions, remain unknown. Nuclear factor erythroid 2-related factor 2 (Nrf2; NFE2L2) is a transcription factor that controls antioxidant gene expression and could be a target for promoting anti-inflammatory pathways. To test the hypothesis that supplementation of nonenzymatic derived antioxidants (Protandim Nrf2 Synergizer, LifeVantage Corporation) would activate Nrf2 and mitigate inflammation, 40 mature, sedentary horses [32 mares, 8 geldings; 15.7 ± 4.9 yr of age, body weight (BW) = 519 ± 46 kg] were stratified by age, sex, and BW and randomly assigned to one of four dietary treatment groups for 56 d: 1) 0 mg (CON); 2) 675 mg (Pro1); 3) 2,025 mg (Pro3); or 4) 4,050 mg (Pro6) Protandim Nrf2 Synergizer per day (n = 10 per group). Blood samples were collected at d 0 (September, 27°C, 61.6% humidity), d 28 (October, 21.6°C, 55.8% humidity), and d 56 (November, 15.1°C, 73.8% humidity) of supplementation prior to the morning feeding. Plasma cytokine concentrations of tumor necrosis factor (TNF)-α, interleukin (IL)-4, IL-6, IL-8, and IL-10 were quantified using custom Meso Scale Discovery U-Plex kits and whole blood gene expression of IL-1β, NFE2L2, and heme oxygenase 1 (HMOX1) were determined using qRT-PCR. Data were analyzed using PROC MIXED in SAS v9.4 with sex, time, treatment, age (under or over 15 yr), and time × treatment as fixed effects and time as a repeated effect with horse(treatment) as the subject. Day 0 was included as a covariate when treatment groups differed at d 0. Relationships between age and cytokine concentrations or mRNA expression were determined using PROC CORR. Plasma IL-4 (r = 0.4054) concentrations as well as whole blood HMOX1 (r = 0.3437) and NFE2L2 (r = 0.3382) expression on d 0 were positively correlated with age (<span>P</span> ≤ 0.04). Regardless of treatment or age, IL-1β and NFE2L2 expression and IL-4 and IL-8 concentrations decreased from d 0 to 28 (<span>P</span> ≤ 0.03) and remained depressed at d 56 (<span>P</span> ≤ 0.02) while IL-10 was not different from d 0 to 28 but decreased from d 0 to 56 (<span>P</span> = 0.02). TNFα concentrations were not different between treatments or over time. These data corroborate increased inflammatory markers with age and suggest a change in inflammatory status over time potentially due to seasonal environmental factors.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e410f29565b4c45f4db18a32cac4915e442fbea891ae056451db4262c1b312f9","category":"Environment"}