{"title":"แบงก์ชาติอังกฤษประกาศ สำรวจโอกาส ความเสี่ยง และความเป็นไปได้ของสกุลเงินดิจิทัล","link":"https://www.blognone.com/node/122261","date":1618906227000,"content":"<div><div><div><p>ธนาคารแห่งอังกฤษ หรือ Bank of England กับกระทรวงการคลัง HM Treasury ร่วมกันเปิดตัวหน่วยงานใหม่เพื่อสำรวจความเสี่ยง ความเป็นไปได้ของสกุลเงินดิจิทัลที่จะออกโดยธนาคารกลาง หรือ  CBDC (Central Bank Digital Currency)</p>\n<p>มุมมองของทางธนาคารเชื่อว่า CBDC จะเป็นเงินดิจิทัลรูปแบบใหม่สำหรับใช้ในครัวเรือนและธุรกิจ และมันจะอยู่ควบคู่ไปกับเงินสดและเงินฝากธนาคาร ไม่ได้มาแทนที่ โดยหน่วยงานใหม่จะสำรวจประเด็นต่างๆ ดังนี้</p>\n<ul>\n<li>สำรวจโอกาสและความเสี่ยงของการใช้งาน CBDC</li>\n<li>ประเมินคุณสมบัติที่ควรจะมีใน CBDC</li>\n<li>ติดตามการพัฒนา CBDC ระหว่างประเทศเพื่อให้แน่ใจว่าสหราชอาณาจักรยังคงอยู่แถวหน้าของนวัตกรรม</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/112648a5271ad3056c5d4c51bad48a7b.jpg\" /><br />\nภาพจาก <a href=\"https://www.facebook.com/bankofengland.co.uk/photos/a.450454868486345/1333592430172580\">Facebook ธนาคารแห่งอังกฤษ</a></p>\n<p>ธนาคารแห่งอังกฤษ ยังเปิดตัวฟอรั่มสองส่วน ส่วนแรกคือการเข้ามามีส่วนร่วมของหลายฝ่าย (CBDC Engagement Forum) ทั้งภาคสถาบันการเงิน, กลุ่มประชาสังคม, ร้านค้า, ผู้ใช้ทางธุรกิจและผู้บริโภค เพื่อสร้างความเข้าใจ หากมีการนำ CBDC ออกมาใช้ รวมทั้งจะพิจารณาผลกระทบต่างๆ ทั้งทางการเงินและความเป็นส่วนตัวของข้อมูล</p>\n<p>ฟอรั่มที่สองเจาะเรื่องเทคโนโลยีโดยเฉพาะ (CBDC Technology Forum) รวบรวมข้อมูลเกี่ยวกับเทคโนโลยีทั้งหมดของ CBDC จากผู้เชี่ยวชาญและมุมมองที่หลากหลาย ให้ธนาคารได้เข้าใจความท้าทายทางเทคโนโลยีของ CBDC</p>\n<p>แนวทางนี้ตรงกับแนวทางของธนาคารกลางหลายชาติที่เริ่มสำรวจความเป็นไปได้ในการออกสกุลเงินดิจิทัลเอง โดยก่อนหน้านี้ <a href=\"https://www.blognone.com/node/122011\">ธนาคารแห่งประเทศไทยก็เคยแถลงถึงแนวทางการพัฒนาสกุลเงินดิจิทัลเช่นกัน</a></p>\n<p>ที่มา - <a href=\"https://www.bankofengland.co.uk/news/2021/april/bank-of-england-statement-on-central-bank-digital-currency\">ธนาคารแห่งอังกฤษ</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/uk\">UK</a></div><div><a href=\"/topics/cryptocurrency\">Cryptocurrency</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e4122de44ae1363603dfaa255ee295d496fa0441b2cb7fb5e9e850b47f14c61c","category":"Thai"}