{"title":"Simultaneous alleviation of verification and reference standard biases in a community-based tuberculosis screening study using Bayesian latent class analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305126","date":1718028000000,"content":"<p>by Alfred Kipyegon Keter, Fiona Vanobberghen, Lutgarde Lynen, Alastair Van Heerden, Jana Fehr, Stephen Olivier, Emily B. Wong, Tracy R. Glass, Klaus Reither, Els Goetghebeur, Bart K. M. Jacobs</p>\r\nBackground <p>Estimation of prevalence and diagnostic test accuracy in tuberculosis (TB) prevalence surveys suffer from reference standard and verification biases. The former is attributed to the imperfect reference test used to bacteriologically confirm TB disease. The latter occurs when only the participants screening positive for any TB-compatible symptom or chest X-ray abnormality are selected for bacteriological testing (verification). Bayesian latent class analysis (LCA) alleviates the reference standard bias but suffers verification bias in TB prevalence surveys. This work aims to identify best-practice approaches to simultaneously alleviate the reference standard and verification biases in the estimates of pulmonary TB prevalence and diagnostic test performance in TB prevalence surveys.</p> Methods <p>We performed a secondary analysis of 9869 participants aged ≥15 years from a community-based multimorbidity screening study in a rural district of KwaZulu-Natal, South Africa (Vukuzazi study). Participants were eligible for bacteriological testing using Xpert Ultra and culture if they reported any cardinal TB symptom or had an abnormal chest X-ray finding. We conducted Bayesian LCA in five ways to handle the unverified individuals: (i) complete-case analysis, (ii) analysis assuming the unverified individuals would be negative if bacteriologically tested, (iii) analysis of multiply-imputed datasets with imputation of the missing bacteriological test results for the unverified individuals using multivariate imputation via chained equations (MICE), and simultaneous imputation of the missing bacteriological test results in the analysis model assuming the missing bacteriological test results were (iv) missing at random (MAR), and (v) missing not at random (MNAR). We compared the results of (i)-(iii) to the analysis based on a composite reference standard (CRS) of Xpert Ultra and culture. Through simulation with an overall true prevalence of 2.0%, we evaluated the ability of the models to alleviate both biases simultaneously.</p> Results <p>Based on simulation, Bayesian LCA with simultaneous imputation of the missing bacteriological test results under the assumption that the missing data are MAR and MNAR alleviate the reference standard and verification biases. CRS-based analysis and Bayesian LCA assuming the unverified are negative for TB alleviate the biases only when the true overall prevalence is &lt;3.0%. Complete-case analysis produced biased estimates. In the Vukuzazi study, Bayesian LCA with simultaneous imputation of the missing bacteriological test results under the MAR and MNAR assumptions produced overall PTB prevalence of 0.9% (95% Credible Interval (CrI): 0.6–1.9) and 0.7% (95% CrI: 0.5–1.1) respectively alongside realistic estimates of overall diagnostic test sensitivity and specificity with substantially overlapping 95% CrI. The CRS-based analysis and Bayesian LCA assuming the unverified were negative for TB produced 0.7% (95% CrI: 0.5–0.9) and 0.7% (95% CrI: 0.5–1.2) overall PTB prevalence respectively with realistic estimates of overall diagnostic test sensitivity and specificity. Unlike CRS-based analysis, Bayesian LCA of multiply-imputed data using MICE mitigates both biases.</p> Conclusion <p>The findings demonstrate the efficacy of these advanced techniques in alleviating the reference standard and verification biases, enhancing the robustness of community-based screening programs. Imputing missing values as negative for bacteriological tests is plausible under realistic assumptions.</p>","author":"Alfred Kipyegon Keter","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e413c219524610dc2f23583cf80be6fe591aa9f4004fdc7bcf8a134ea155021c","category":"Interdisciplinary"}