{"title":"A multilayer microfluidic system for studies of the dynamic responses of cellular proteins to oxygen switches at the single-cell level","link":"https://academic.oup.com/ib/article/doi/10.1093/intbio/zyae011/7696470?rss=1","date":1718841600000,"content":"<span><div>Abstract</div>Oxygen levels vary in the environment. Oxygen availability has a major effect on almost all organisms, and oxygen is far more than a substrate for energy production. However, less is known about related biological processes under hypoxic conditions and about the adaptations to changing oxygen concentrations. The yeast <span>Saccharomyces cerevisiae</span> can adapt its metabolism for growth under different oxygen concentrations and can grow even under anaerobic conditions. Therefore, we developed a microfluidic device that can generate serial, accurately controlled oxygen concentrations for single-cell studies of multiple yeast strains. This device can construct a broad range of oxygen concentrations, [O<sub>2</sub>] through on-chip gas-mixing channels from two gases fed to the inlets. Gas diffusion through thin polydimethylsiloxane (PDMS) can lead to the equilibration of [O<sub>2</sub>] in the medium in the cell culture layer under gas cover regions within 2 min. Here, we established six different and stable [O<sub>2</sub>] varying between ~0.1 and 20.9% in the corresponding layers of the device designed for multiple parallel single-cell culture of four different yeast strains. Using this device, the dynamic responses of different yeast transcription factors and metabolism-related proteins were studied when the [O<sub>2</sub>] decreased from 20.9% to serial hypoxic concentrations. We showed that different hypoxic conditions induced varying degrees of transcription factor responses and changes in respiratory metabolism levels. This device can also be used in studies of the aging and physiology of yeast under different oxygen conditions and can provide new insights into the relationship between oxygen and organisms.<div><strong>Integration, innovation and insight:</strong> Most living cells are sensitive to the oxygen concentration because they depend on oxygen for survival and proper cellular functions. Here, a composite microfluidic device was designed for yeast single-cell studies at a series of accurately controlled oxygen concentrations. Using this device, we studied the dynamic responses of various transcription factors and proteins to changes in the oxygen concentration. This study is the first to examine protein dynamics and temporal behaviors under different hypoxic conditions at the single yeast cell level, which may provide insights into the processes involved in yeast and even mammalian cells. This device also provides a base model that can be extended to oxygen-related biology and can acquire more information about the complex networks of organisms.</div></span>","author":"","siteTitle":"Integrative Biology Current Issue","siteHash":"08ec31a93e0a3f830088f3051f0870206dac7048d685312e4717ea0a4882ca75","entryHash":"e4134c130340bc294480e4e483e7b141406ea353b2525ef6526e84703fedf133","category":"Environment"}