{"title":"Why you shouldn’t skip the iPhone 15","link":"https://www.macworld.com/article/2050327/why-you-shouldnt-skip-iphone-15.html","date":1693564200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>There’s reason to believe that 2024 will be a <a href=\"https://www.macworld.com/article/2030317/2024-apple-biggest-year-ever.html\">make-or-break year</a> for Apple, mainly because of Vision Pro but also partly because of some blossoming plans in the smart-home sector and the Apple Watch’s 10th anniversary. (The anniversary of its original <em>announcement</em>, before you write in.) These are unique circumstances, and in this specific case, it is reasonable to expect something memorable.</p>\n\n\n\n<p>I’ll tell you what I don’t buy, though: The idea that 2024 is going be a groundbreaking year for the iPhone.</p>\n\n\n\n<p>I mean, look, it might. It’s theoretically possible that Apple will choose 2024 to release a folding phone at long last, eliminate the Dynamic Island and go all-screen for the first time, or banish the newly arrived USB-C connector and all other ports and apertures. It’s all <em>possible</em>. It just isn’t very likely.</p>\n\n\n\n<p>What’s more plausible, based on extremely early rumors, is the <a href=\"https://www.macworld.com/article/2007943/iphone-16-release-date-specs-features-rumors.html\">iPhone 16</a> getting a set of appealing but relatively cautious upgrades: a slightly larger screen, improved battery performance, and solid-state buttons. The high-zoom periscope lens expected to feature in the 15 Pro Max could be available on more of the 16-series handsets. And the Dynamic Island might be smaller.</p>\n\n\n\n<p>Now, you can argue that this would represent a bigger overall package of improvements than we saw in the iPhone 14 and expect to see in the 15, and I wouldn’t entirely disagree. I might point out that it’s not a very high bar, however, and you’re not clearing it by much. And more importantly, let’s wait and see how much of this actually comes to pass, shall we? I’ve written elsewhere about the tendency of tech writers to always believe the <a href=\"https://www.macworld.com/article/1917011/iphone-16-rumors-exciting-update-next-year.html\">next-but-one generation</a> will be more interesting than the next one, and part of this is because projects always sound more ambitious and exciting when they’re in the early stages of planning and haven’t yet crashed into the cold hard concrete of supply-chain practicality. The iPhone 15 was <a href=\"https://www.macworld.com/article/1811252/iphone-15-supplier-solid-state-buttons-cancelled.html\">supposed to get solid-state buttons too</a>, remember?</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/01/different_think.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Different Think\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/01/different_think.jpg?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2022/01/different_think.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/01/different_think.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/01/different_think.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/01/different_think.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/01/different_think.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/01/different_think.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>IDG</p></div>\n\n\n\n<h2>Chasing the technological tortoise</h2>\n\n\n\n<p>But regardless of how amazing the iPhone 16 will be, and how not-amazing the iPhone 15 will be, there’s a bigger tech delusion at play here: The fear that your new device will be superseded by the next generation. I’m here to tell you that it absolutely will be, and you shouldn’t care.</p>\n\n\n\n<p>Technology is an odd business when you think about it, for the simple reason that with a few rare exceptions (like the looming AI apocalypse) it really does follow a pattern of ceaseless and uncontroversial progress. When Tim Cook announces “our greatest iPhone yet,” we all laugh, because of course it is. You’ve had an extra year of R&amp;D to make the camera better and the screen bigger and to learn how to beam data from space at an even more insane speed. Yet almost no other area of our lives gets better in such a predictable way.</p>\n\n\n\n<p>The iPhone 16 will be better than the iPhone 15, which will be better in turn than the iPhone 14. That isn’t something we can control, nor is it something we should fear. It’s simply a natural condition of technology. By and large, at any given time the available devices will be superior to those that came before and inferior to those that will come after. That will remain true in 2024 just as it is true now. In seeking a phone that can’t be superseded, you’re <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.britannica.com/topic/Achilles-paradox&amp;xcust=1-1-2050327-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Achilles chasing the tortoise</a>. The goal will always remain just out of your reach.</p>\n\n\n\n<p>When I was a teenager I used to worry about buying games for my SNES console because I thought they might drop in price afterwards. But before long I realized that this way of thinking meant I would never buy anything, and that other people paying less for their game wouldn’t mean I got a bad deal for mine. And that’s roughly how I think about technology purchases to this day.</p>\n\n\n\n<h2>Why you <em>should</em> skip the iPhone 15</h2>\n\n\n\n<p>Before wrapping this up, I want to make it clear that I’m arguing against the idea of skipping a generation of iPhones simply because extremely speculative rumors make the following generation sound more exciting. What I’m <em>not</em> saying is that we all have to buy a new iPhone every year.</p>\n\n\n\n<p>In fact, there are plenty of people who <em>should</em>, in my opinion, strongly consider skipping the iPhone 15 generation for other reasons. I’d give it a miss, for example, if you</p>\n\n\n\n<ul>\n<li>Recently bought an iPhone 14</li>\n\n\n\n<li>Haven’t got much cash to spare</li>\n\n\n\n<li>Are looking for a smaller and cheaper phone and would be better off waiting for the <a href=\"https://www.macworld.com/article/1354114/iphone-se-4-design-specs-features-release-date.html\">next iPhone SE</a></li>\n\n\n\n<li>Are having a perfectly good experience with your current device, no matter what its age or brand</li>\n\n\n\n<li>Just don’t need a new phone right now</li>\n\n\n\n<li>Are paid to promote a rival smartphone company and could get in trouble if seen with an iPhone</li>\n\n\n\n<li>Have a personal vendetta against Tim Cook or another member of Apple’s senior management team</li>\n</ul>\n\n\n\n<p>and there are probably lots of other good reasons. Just don’t get into that loop of skipping a generation because someone told you the next one would be better, because you’ll never end up buying anything.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e423f09d544898be9070eafd91973dfb4464bb80fb269ea982eff94bc45f76e5","category":"Apple"}