{"title":"Apple's Phil Schiller Discusses Risks of Alternative App Stores on iPhone","link":"https://www.macrumors.com/2024/02/03/phil-schiller-on-risks-of-iphone-app-marketplaces/","date":1706972963000,"content":"Starting with iOS 17.4, currently in beta, Apple is <a href=\"https://www.macrumors.com/2024/01/25/ios-17-4-alternative-app-marketplaces-eu/\">allowing alternative app marketplaces on the iPhone in the EU</a>. Apple made this change to comply with new regulations under the EU's Digital Markets Act, which takes full effect next month.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/12/app-store-awards-2022.jpg\" width=\"1600\" height=\"900\" />\r<br />\nIn an <a href=\"https://www.fastcompany.com/91021439/apple-phil-schiller-iphone-app-store-alternative-eu-risk-security\">interview with <em>Fast Company</em></a>'s Michael Grothaus published today, Apple's former marketing chief and current App Store head Phil Schiller said there are privacy and security risks associated with these alternative app marketplaces:<blockquote>\"These new regulations, while they bring new options for developers, also bring new risks. There's no getting around that. So we're doing everything we can to minimize those risks for everyone,\" Schiller told me in a recent discussion about the privacy and security impact of the European Commission's Digital Markets Act.</blockquote>One of these risks is that the App Store's strict rules surrounding objectionable content might not extend to alternative app marketplaces, according to Schiller:<blockquote>\"We have dealt with a lot of input from families, from governments, on things that we need to do to try to either not allow certain kinds of objectionable content on our App Store, or give users control over that experience to decide what’s best for themselves—and we have rules around that,\" Schiller says. \"Those rules will not apply in another marketplace unless they choose to make rules of their own, [with] whatever criteria they come up with. Does that increase the risk of users, and families, running into objectionable content or other experiences? Yes, it does.\"</blockquote>The full interview can be read on <a href=\"https://www.fastcompany.com/91021439/apple-phil-schiller-iphone-app-store-alternative-eu-risk-security\"><em>Fast Company</em>'s website</a>.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/phil-schiller/\">Phil Schiller</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/03/phil-schiller-on-risks-of-iphone-app-marketplaces/\">Apple's Phil Schiller Discusses Risks of Alternative App Stores on iPhone</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-phil-schiller-discusses-risks-of-alternative-app-stores-on-iphone.2418312/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e42e9caa47fc2a29f5db194cac1f43ce520b9e6e6006ee0ce6bea2d63f86652e","category":"Apple"}