{"title":"Are human activities or climate changes the main causes of soil erosion in the South African drylands?: A palaeo‐perspective from three sites in the interior","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3651?af=R","date":1727764661000,"content":"<h2>ABSTRACT</h2>\n<p>Soil erosion across South Africa's drylands occurs widely in the form of gullies and badlands (locally termed dongas) that have developed in colluvium and in valley fills along incised rivers. This erosion has commonly been attributed to land mismanagement, particularly since European settlement, but natural factors such as soil properties, local base level fall and climate change have also been invoked. To disentangle human and natural factors, we use optically stimulated luminescence (OSL) dating, supported by documentary and archaeological evidence, to constrain the timing and causes of donga formation at three widely spaced sites across interior South Africa. At all three sites, the exposed stratigraphy indicates that hillslopes and floodplains underwent net sediment accumulation during most of the late Quaternary, and that present-day deep erosion is of a magnitude unprecedented probably within at least the past 100 ka. OSL ages indicate that the onset of erosion at each site significantly pre-dates European incursion and instead was broadly coincident with abrupt climatic changes that occurred during the Medieval Climatic Anomaly (MCA, ~<span>ad</span> 900–1300) and Little Ice Age (LIA, ~\n<span>ad</span> 1300–1800). Based on correlation with palaeoclimate proxy records, we propose that erosion was triggered by abrupt hydroclimatic oscillations during the MCA, and continued during the LIA in response to climate-driven, large floods. At these sites, soil type and local base level falls exert secondary controls on the specific locations, processes, rates and depths of erosion. In other areas of South Africa, clear links between land mismanagement and soil erosion have been demonstrated, but for sites where detailed investigations have yet to be undertaken, these findings challenge an often default assumption that soil erosion is necessarily attributable to human factors. Our findings have significant implications for soil erosion control strategies and assessment of South African dryland landscape response to future climate changes.</p>","author":"Richard Lyons, \nStephen Tooth, \nGeoff A. T. Duller, \nTerence McCarthy","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"e42e81a0a3eeb0dd03904b038c737f61240af0c5be8e095861e801d5e043e6ee","category":"Environment"}