{"title":"Grazing effects on the relationship between plant functional diversity and soil carbon sequestration regulated by livestock species","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae016/7630976?rss=1","date":1710720000000,"content":"<span><div>Abstract</div>Grazing exerts a profound influence on both the plant diversity and productivity of grasslands, while simultaneously exerting a significant impact on regulating grassland soil carbon sequestration. Moreover, besides altering the taxonomic diversity of plant communities, grazing can also affect their diversity of functional traits. However, we still poorly understand how grazing modifies the relationship between plant functional diversity (FD) and soil carbon sequestration in grassland ecosystems. Here, we conducted a grazing manipulation experiment to investigate the effects of different grazing regimes (no grazing, sheep grazing (SG) and cattle grazing (CG)) on the relationships between plant FD and soil carbon sequestration in meadow and desert steppe. Our findings showed that different livestock species changed the relationships between plant FD and soil organic carbon (SOC) in the meadow steppe. SG decoupled the originally positive relationship between FD and SOC, whereas CG changed the relationship from positive to negative. In the desert steppe, both SG and CG strengthened the positive relationship between FD and SOC. Our study illuminates the considerable impact of livestock species on the intricate mechanisms of soil carbon sequestration, primarily mediated through the modulation of various measures of functional trait diversity. In ungrazed meadows and grazed deserts, maintaining high plant FD is conducive to soil carbon sequestration, whereas in grazed meadows and ungrazed deserts, this relationship may disappear or even reverse. By measuring the traits and controlling the grazing activities, we can accurately predict the carbon sequestration potential in grassland ecosystems.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"e42f231f27b43d71a9233ce09ccddf4928c1c7640fdd9245c7782fd15ee24af6","category":"Environment"}