{"title":"Historical racial redlining and contemporary patterns of income inequality negatively affect birds, their habitat, and people in Los Angeles, California","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duad044/7303192?rss=1","date":1696982400000,"content":"<span><div>Abstract</div>The Home Owners’ Loan Corporation (HOLC) was a U.S. government-sponsored program initiated in the 1930s to evaluate mortgage lending risk. The program resulted in hand-drawn “security risk” maps intended to grade sections of cities where investment should be focused (greenlined areas) or limited (redlined zones). The security maps have since been widely criticized as being inherently racist and have been associated with high levels of segregation and lower levels of green amenities in cities across the country. Our goal was to explore the potential legacy effects of the HOLC grading practice on birds, their habitat, and the people who may experience them throughout a metropolis where the security risk maps were widely applied, Greater Los Angeles, California (L.A.). We used ground-collected, remotely sensed, and census data and descriptive and predictive modeling approaches to address our goal. Patterns of bird habitat and avian communities strongly aligned with the luxury-effect phenomenon, where green amenities were more robust, and bird communities were more diverse and abundant in the wealthiest parts of L.A. Our analysis also revealed potential legacy effects from the HOLC grading practice. Associations between bird habitat features and avian communities in redlined and greenlined zones were generally stronger than in areas of L.A. that did not experience the HOLC grading, in part because redlined zones, which included some of the poorest locations of L.A., had the highest levels of dense urban conditions (e.g., impervious surface cover), whereas greenlined zones, which included some of the wealthiest areas of the city, had the highest levels of green amenities (e.g., tree canopy cover). The White population of L.A., which constitutes the highest percentage of a racial or ethnic group in greenlined areas, was aligned with a considerably greater abundance of birds affiliated with natural habitat features (e.g., trees and shrubs). Conversely, the Hispanic or Latino population, which is dominant in redlined zones, was positively related to a significantly greater abundance of synanthropic birds, which are species associated with dense urban conditions. Our results suggest that historical redlining and contemporary patterns of income inequality are associated with distinct avifaunal communities and their habitat, which potentially influence the human experience of these components of biodiversity throughout L.A. Redlined zones and low-income residential areas that were not graded by the HOLC can particularly benefit from deliberate urban greening and habitat enhancement projects, which would likely carry over to benefit birds and humans.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"e433bf840db6ee9a9789f4da4f288ab7310d49434a194f65be37c0dfbe86b96c","category":"Environment"}