{"title":"Estimating Forest Above-Ground Carbon Stock Combining Landsat 8 OLI and Sentinel-2A Images, Topographic and Climatic Factors","link":"https://www.preprints.org/manuscript/202410.1899/v1","date":1729758439000,"content":"Forest above-ground carbon stock (AGCS) is one of the primary ecological evaluation indicators, so it is crucial to estimate AGCS accurately. In this research, we added the climatic and topographic factors to the estimation process by a remote sensing approach to explore their impacts and to achieve more precise estimations. We model and predict AGCS by Random Forest (RF) based on sixty field sample plots of Pinus densata pure forests in southwest of China and the factors extracted from Landsat 8 OLI images (Source I), Sentinel-2A images (Source II), combined Landsat 8 OLI and Sentinel-2A images (Source III). We added the topographic and climatic factors to establish AGCS estimation model and compare the results. The topographic factors contain elevation, slope and aspect. Climatic factors contain mean annual temperature, annual precipitation, annual potential evapotranspiration and monthly mean potential evapotranspiration. It was found that the model based on Source III was better than Source I and Source II. Among the models without adding factors, the model based on Source III worked the best, with an R2 of 0.87, an RMSE of 10.81 t/ha, an rRMSE of 23.19%, and a P of 79.71%. Among the models that added topographic factors, the model based on Source III worked best after adding elevation, with an R2 of 0.89, an RMSE of 10.01 t/ha, an rRMSE of 21.47%, and a P of 82.17%. Among the models that added climatic factors, the model that was added the annual precipitation factor had the best modeling result, with an R2 of 0.90, an RMSE of 9.53 t/ha, an rRMSE of 20.59%, and a P of 83.00%. The prediction result exhibited that the AGCS of the Pinus densata forest in 2021 was 9,737,487.52 t. The combination of Landsat 8 OLI and sentinel-2A could improve the prediction accuracy of AGCS. The addition of annual precipitation can effectively improve the accuracy of AGCS estimation. Higher resolution of climate data is needed to enhance the modeling in the future work.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e4390b34a22d73dbe2c65809644bb47da7f20341b4f0960beb22c5b26a561980","category":"Interdisciplinary"}