{"title":"Evaluation of CMIP6 model skills in simulating tropical climate extremes over Malawi, Southern Africa","link":"http://link.springer.com/10.1007/s40808-023-01867-3","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Malawi, a developing country in southeast Africa, is one of the most vulnerable countries to climate change and associated impacts. Availability of observed data to inform our knowledge on climate change is however, a key challenge and has led to relatively little research in the subject. Alternative climate data products, such as the Global Climate Models (GCMs) phase6 of Coupled Model Intercomparison Project (CMIP6), accords the chance to bridge this knowledge gap. These products however, need some validation against observed data to ascertain their level of performance. This study therefore, evaluates the ability of nineteen CMIP6 models in simulating both annual and seasonal temperature and precipitation over Malawi from 1980 to 2014. Observed Model performance metrics such as bias, root mean square error (RMSE), spatial correlation coefficient, standard deviation and Percentage Bias (PBIAS) were employed to assess the ability of the individual models. Our quantitative analysis shows that most of the models could simulate both temperature and precipitation over the study area, with correlation coefficient values of over 0.70, RMSE values between 0.9 and 2.0 and PBIAS of <span>\n                      \n                      <span>\\(\\le\\)</span>\n                      \n                    </span> 10%. The results are suggesting better performance of CMIP6 than those reported in previous studies over the study domain using CMIP3 and CMIP5 model datasets. Of all the nineteen models evaluated in this study, no single model performed best compared to observed dataset, because the models are varying in performance from season to season. Hence, climate end users are advised to use simulations of temperature and precipitation over the study area from CMIP6 models with care for decision making on the mitigation and adaptation of climate change.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"e439aa90b05d50df91d7de3969edd24bb95aced5ba58436479222bcc9a63836b","category":"Environment"}