{"title":"Assessing gladiolus varieties for planting time using a phenological model based on agro‐meteorological indices","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12893?af=R","date":1706101107000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/af166fac-a316-4619-a9e1-1cfaf7a1d399/aab12893-toc-0001-m.png\" alt=\"Assessing gladiolus varieties for planting time using a phenological model based on agro-meteorological indices\" />\n<p>Plants of gladiolus varieties under September and October plantings completed their phenological development in less time and accumulated fewer agrometeorological indices because of favourable temperature and short day conditions during these months in sub-tropical conditions. According to the phenological model, based on duration to reach phenostage and accumulated agrometerological indices (GDD, PTU, ENT), it would be advisable to plant Punjab Lemon Delight and Punjab Glance in a timely manner, specifically in September, Punjab Glad 3 and CPG could be planted later, in December and White Prosperity, however, could be planted during the October and November.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Phenological models serve as a potent tool in management practices and determining flowering time in ornamental crops. Schwab's staging system for development of gladiola that relies on easily identifiable visual characteristics was used in the study to describe the detailed developmental stages and requirement of agrometeorological indices for each stage. The study was conducted with five gladiolus varieties planted at four different times to characterize the varieties for planting time. Plants under September and October plantings completed their phenological development in less time and accumulated fewer agrometeorological indices because of favourable temperature and short day conditions. The phenological model revealed that Punjab Lemon Delight and Punjab Glance could be planted in September as their blooming was delayed by 32 and 17 days, respectively and corm harvesting by 48 and 43 days respectively, when planted in December. The delay in blooming was 18 and 15 days respectively for Punjab Glad 3 and CPG and corresponding values for corm harvesting were 30 and 26 days when planting was done in December indicating that these varieties could be suitable for late planting. White Prosperity could be planted in October or November because when comparing planting in these 2 months, the number of days to bloom and the number of days to corm harvesting were similar.</p>","author":"Ravijot Kaur, \nShalini Jhanji","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"e43fc5216bfbbe120df17d2e59ba3cb4f279cff6f22de0753d431f3aacd08c01","category":"Environment"}