{"title":"Canon เตรียมขึ้นสายการผลิตเซนเซอร์รับภาพแบบใหม่ปีหน้า รับภาพสีในที่มืดได้ชัดเจน","link":"https://www.blognone.com/node/126194","date":1638889095000,"content":"<div><div><div><p>Nikkei Asian Review รายงานว่า Canon กำลังพัฒนาเซนเซอร์รับภาพใหม่ที่สามารถถ่ายภาพสีคุณภาพสูงได้แม้กระทั่งในที่มืด โดยคาดว่าจะเริ่มขึ้นสายการผลิตเซนเซอร์รับภาพแบบใหม่ได้ภายในปี 2022</p>\n<p>ปัจจุบัน เซนเซอร์ที่นิยมใช้ในกล้องดิจิทัลเรียกว่า CMOS ซึ่งจะทำการส่งสัญญาณตามโฟตอนที่รับได้ในระยะเวลาหนึ่ง ที่จะมีข้อจำกัดคือเมื่อถ่ายภาพในที่มืดแล้วจะทำให้มีสัญญาณรบกวนจำนวนมาก ส่วนกล้องที่นิยมใช้ถ่ายภาพกลางคืนจะเป็นอินฟราเรดที่จะถ่ายได้เฉพาะภาพขาวดำ</p>\n<p>ชิปแบบใหม่ที่ Canon กำลังพัฒนาเรียกว่า SPAD หรือ Single Photon Avalanche Diode จะขยายโฟตอนที่ได้รับ 1 ตัวที่เข้ามาในเซนเซอร์เป็นอิเล็กตรอนจำนวนมาก ซึ่งจะทำให้ตรวจจับวัตถุได้แม้จะอยู่ในที่แสงน้อยมาก ทั้งยังมีพิกเซลหนาแน่นกว่าเซนเซอร์แบบ CMOS เดิมถึง 3 เท่า สามารถระบุเวลาที่แสงกลับมาได้ในระยะเวลาน้อยกว่า 1 นาโนวินาที ทำให้การตรวจจับวัตถุแม่นยำมากยิ่งขึ้น</p>\n<p>เซนเซอร์แบบ SPAD จะใช้วิธีระบุตำแหน่งของวัตถุตามเวลาที่แสงสะท้อนกลับมา และจับภาพออกมาเป็นสามมิติ ซึ่งจะเป็นประโยชน์มากในเทคโนโลยีอย่าง AR หรือรถยนต์ไร้คนขับ</p>\n<p>ในรายงานระบุว่า Canon จะเริ่มขึ้นสายการผลิตเซนเซอร์แบบใหม่ภายในครึ่งแรกของปีหน้าที่โรงงานในคาวาซากิโดยนำเครื่องมือที่ใช้ผลิต CMOS เดิมมาปรับแต่งเพื่อใช้ผลิตเซนเซอร์แบบใหม่ และ Canon จะเริ่มใช้เซนเซอร์ SPAD งานกับผลิตภัณฑ์กล้องเพื่อความปลอดภัยที่จะเปิดตัวในสิ้นปีหน้า รวมถึงจะผลิตเซนเซอร์นี้เพื่อขายให้บริษัทอื่นที่สนใจนำไปพัฒนาเป็นผลิตภัณฑ์ของตนเองด้วย</p>\n<p>ที่มา - <a href=\"https://asia.nikkei.com/Business/Technology/Canon-breaks-through-with-image-sensor-that-can-see-in-the-dark\">Nikkei Asian Review</a>, <a href=\"https://sea.pcmag.com/cameras-1/47796/canons-new-image-sensor-reportedly-takes-high-quality-color-photos-in-the-dark\">PCMag</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ece82b5538ab3c9817ead3ff3f2a54cf.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/canon\">Canon</a></div><div><a href=\"/topics/camera\">Camera</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e4437a9e43224e706796a857e442e05edae401be32566d0de1207f63a7861b8d","category":"Thai"}