{"title":"Supreme Court Rejects Petitions in Epic v. Apple Antitrust Case, Largely a Win for Apple","link":"https://www.theverge.com/2024/1/16/24039983/supreme-court-epic-apple-antitrust-case-rejected","date":1705422313000,"content":"\n<p>Adi Robertson, reporting for The Verge:</p>\n\n<blockquote>\n  <p>The Supreme Court has denied a request to hear an antitrust \ndispute between Apple and <em>Fortnite</em> publisher Epic Games. It \n<a href=\"https://www.supremecourt.gov/orders/courtorders/011624zor_e1pf.pdf\">rejected two petitions</a>, one from each company, this \nmorning — leaving the case largely, but not entirely, a win for \nApple. [...] </p>\n\n<p>Even so, both rulings found that Apple had acted \nanticompetitively by barring developers from telling users about \nother payment methods. Apple was ordered to let them allow links \nand other “calls to action” that would bypass Apple’s payment \nsystem, discontinuing what are known as anti-steering policies. \nBut the company spent years delaying parts of the change with \nlegal appeals, <a href=\"https://www.theverge.com/2023/8/9/23826043/epic-apple-app-store-supreme-court-petition\">winning a reprieve while</a> the Supreme Court \nconsidered the case. Today’s denial seemingly runs out that \nclock, requiring Apple to reconsider the future of its \nanti-steering rules. </p>\n</blockquote>\n\n<p>Apple’s intransigence on these anti-steering provisions has <a href=\"https://daringfireball.net/2019/01/netflix_itunes_billing\">long baffled me</a>. I’ve consistently argued that the rules should be simple: apps that want to accept in-app payments must use Apple’s IAP system, but apps should be free to inform users that they can sign up and pay on the web, outside the app. In-app: Apple’s platform, Apple’s payments system. Out-app: the open web, and apps should be able to steer customers there. If Apple’s in-app purchasing system is so easy to use, so reasonably priced for its benefits, and so trusted by users, it should be able to compete openly with the web. And I think Apple’s in-app payments <em>do</em> compare favorably to leaving an app to pay on the web, especially for games. But with true competition from web purchases that apps can steer users to, Apple’s commission rates, for apps other than games at least, would probably be lower. I’d argue that it’s unhealthy for a company to grow dependent on unnaturally high commissions protected by fiat policies, rather than set through open competition.</p>\n\n<p>Perhaps Apple’s thinking was that they might as well try to hold the line on these anti-steering provisions for as long as they could, thinking that today’s outcome was the worst case scenario. But I think it’s been a bad look for the company for years, and invited additional regulatory scrutiny. Regardless of whether these anti-steering provisions are <em>legally</em> anticompetitive, they’re undeniably anticompetitive in the plain sense of the word. I genuinely believe the Supreme Court has done Apple a favor letting this ruling stand.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/16/scotus-epic-apple\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"e44b645d1b60a53182515b311b4b32aeaa5d9c9cf5b7396bea88ee8c24578b71","category":"Tech"}