{"title":"Fisheries Traceability, Drivers and Barriers to Its Adoption: A Review","link":"https://www.preprints.org/manuscript/202408.0977/v1","date":1723587963000,"content":"Traceability has been applied in the fisheries, for example in tuna, as a means of verification and validation of the quality of fish meat and its origin. Traceability as a platform in the fisheries remains elusive in many parts of the country due to slow adoption. This study reviewed the existing literature in relation to, “agri-fishery traceability system,” “fishery traceability,” and “food safety” from year 2000-2023. It aimed to elucidate the common drivers and barriers to the adoption of fisheries traceability system. The authors used PRISMA to analyse articles obtained from SCOPUS and WOS (Web of Science), DOAJ (Directory of Open Access Journal), Academia, and PubMed central databases. The results showed that 125 articles were included after the inclusion and exclusion process. There were nine articles included in the year 2000 to 2005, followed by 19 in 2006 to 2010, and 26 from the year 2011 to 2015. A total of 40 articles were recorded from the year 2016 to 2020 and 31 from the year 2021 to 2023. In terms of text data from the authors, “fish”, “supply chain”, “traceability system”, and “food safety” have the highest total link strength. Moreover, food safety, market compliance, consumer protection, product origin, quality, and seafood fraud are driving factors in the implementation of traceability system. Costs, inadequate practices, lack of support from the government, infrastructure, information, and laws and regulations are foreseen barriers to the adoption of a traceability system. Leading countries in fisheries traceability studies include, China, USA, Italy, Indonesia, UK, and Taiwan where the first and corresponding authors originated. While this review endeavored to find fish traceability studies in the Philippines, the lack of comprehensive and relevant literature published in this topic shifted our focus to finding barriers and drivers to adopting a traceability system. We recommend that government agencies that oversee various commodities, should link up with academics and non-government organizations in the implementation and monitoring of their traceability systems.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e44e5511ecf190e348eb458ba1017ef0acad72e34b3e1e705a4d90dfd8b619d1","category":"Interdisciplinary"}