{"title":"Structural and Crystal-Chemical Features of Mg-Rich Minerals of the Glauconite–Illite Series from Upper Proterozoic Deposits in Eastern and Northern Siberia","link":"http://link.springer.com/10.1134/S0024490224700664","date":1727740800000,"content":"<span>\n                      <h3>Abstract</h3>\n                      <p>At the current level of research, a generalization of previously studied and new lithological-mineralogical, structural, and crystal-chemical characteristics of globular layer silicates (GLS) of the Mg-rich glauconite–illite series from Upper Proterozoic sections of eastern and northern Siberia (Uchur–Maya region, Anabar uplift) has been carried out. The classification of glauconite–illite minerals was carried out in accordance with recommendations of the International Nomenclature Committees for Mica and Clay Minerals, as well as based on the available literature and our own data. The Al index, i.e., (<em>K</em><sub>Al</sub> = <sup>VI</sup>Al/[<sup>VI</sup>Fe<sup>3+</sup> + <sup>VI</sup>Al]), in minerals of the glauconite–illite series varies from 0.40 to 0.85; the content of Mg and K cations varies, respectively, from 0.51 to 0.75 and from 0.63 to 0.80 f.u. Application of the X-ray modeling method for diffraction patterns of the oriented and unoriented specimens of Upper Proterozoic GLS made it possible to determine the following properties: the content of swelling layers (4–10%), their types (mica, smectite, chlorite), the nature of the alternation (short-range order factor, <em>R</em> = 0), unit cell parameters <em>c</em> sin β, <em>c</em> cos β/<em>a</em>, and average value of parameter <em>b</em> (9.018–9.074 Å). The conditions of glauconite formation in the Upper Proterozoic basins are considered, and their influence on the structural and crystal-chemical features of Mg presence in hydrocarbons is discussed.</p>\n                    </span>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"e451f4bc4956e041048c73e3e32ce32c190d336c31235b1be4e35f19202d81e2","category":"Environment"}