{"title":"Frozen embryos are “children,” according to Alabama’s Supreme Court","link":"https://arstechnica.com/?p=2004702","date":1708460144000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-1953593706-800x504.jpeg\" alt=\"January 17, 2024, Berlin: In the cell laboratory at the Fertility Center Berlin, an electron microscope is used to fertilize an egg cell.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-1953593706-scaled.jpeg\">Enlarge</a> <span>/</span> January 17, 2024, Berlin: In the cell laboratory at the Fertility Center Berlin, an electron microscope is used to fertilize an egg cell. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/january-2024-berlin-in-the-cell-laboratory-at-the-fertility-news-photo/1953593706?adppopup=true\">Getty | Jens Kalaene</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Alabama Supreme Court on Friday ruled that frozen embryos are \"children,\" entitled to full personhood rights, and anyone who destroys them could be liable in a wrongful death case.</p>\n<p>The first-of-its-kind ruling throws into question the future use of assisted reproductive technology (ART) involving in vitro fertilization for patients in Alabama—and beyond. For this technology, people who want children but face challenges to conceiving can create embryos in clinical settings, which may or may not go on to be implanted in a uterus.</p>\n<p>In the Alabama case, a hospital patient wandered through an unlocked door, removed frozen, preserved embryos from subzero storage and, suffering an ice burn, dropped the embryos, destroying them. Affected IVF patients filed wrongful-death lawsuits against the IVF clinic under the state's Wrongful Death of a Minor Act. The case was initially dismissed in a lower court, which ruled the embryos did not meet the definition of a child. But the Alabama Supreme Court ruled that \"it applies to all children, born and unborn, without limitation.\" In a concurring opinion, Chief Justice Tom Parker cited his religious beliefs and quoted the Bible to support the stance.</p></div><p><a href=\"https://arstechnica.com/?p=2004702#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2004702&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e4553cf81b16a7fa6a2ee769041aabc0a30910199b97bf11bb839ad8eaf82089","category":"Tech"}