{"title":"New myApplications in the AWS Management Console simplifies managing your application resources","link":"https://aws.amazon.com/blogs/aws/new-myapplications-in-the-aws-management-console-simplifies-managing-your-application-resources/","date":1701364802000,"content":"<p>Today, we are announcing the general availability of <strong>myApplications</strong> supporting application operations, a new set of capabilities that help you get started with your applications on AWS, operate them with less effort, and move faster at scale. With myApplication in the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a>, you can more easily manage and monitor the cost, health, security posture, and performance of your applications on AWS.</p> \n<p>The myApplications experience is available in the <strong>Console Home</strong>, where you can access an <strong>Applications</strong> widget that lists the applications in an account. Now, you can create your applications more easily using the <strong>Create application</strong> wizard, connecting resources in your AWS account from one view in the console. The created application will automatically display in myApplications, and you can take action on your applications.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/2023-myapplications-1-console-home.jpg\" width=\"2250\" height=\"1160\" /></p> \n<p>When you choose your application in the Applications widget in the console, you can see an at-a-glance view of key application metrics widgets in the applications dashboard. Here you can find, debug operational issues, and optimize your applications.</p> \n<p>With a single action on the applications dashboard, you can dive deeper to act on specific resources in the relevant services, such as <a href=\"https://aws.amazon.com/cloudwatch\">Amazon CloudWatch</a> for application performance, <a href=\"https://aws.amazon.com/aws-cost-management/aws-cost-explorer/\">AWS Cost Explorer</a> for cost and usage, and <a href=\"https://aws.amazon.com/security-hub/\">AWS Security Hub</a> for security findings.</p> \n<p><strong><u>Getting started with myApplications</u></strong><br /> To get started, on the <a href=\"https://console.aws.amazon.com/\">AWS Management Console Home</a>, choose <strong>Create application</strong> in the <strong>Applications</strong> widget. In the first step, input your application name and description.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/2023-myapplications-2-create-applications.jpg\" width=\"2220\" height=\"1530\" /></p> \n<p>In the next step, you can add your resources. Before you can search and add resources, you should turn on and set up <a href=\"https://aws.amazon.com/resourceexplorer/\">AWS Resource Explorer</a>, a managed capability that simplifies the search and discovery of your AWS resources across AWS Regions.</p> \n<p>Choose <strong>Add resources</strong> and select the resources to add to your applications. You can also search by keyword, tag, or <a href=\"https://aws.amazon.com/cloudformation/\">AWS CloudFormation</a> stack to integrate groups of resources to manage the full lifecycle of your application.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/14/2023-myapplications-2-add-resources.jpg\" width=\"2236\" height=\"1500\" /></p> \n<p>After confirming, your resources are added, new <code>awsApplication</code> tags applied, and the myApplications dashboard will be automatically generated.</p> \n<p>Now, let’s see which widgets can be useful.</p> \n<p>The <strong>Application summary</strong> widget displays the name, description, and tag so you know which application you are working on. The <strong>Cost and usage</strong> widget visualizes your AWS resource costs and usage from <a href=\"https://aws.amazon.com/aws-cost-management/aws-cost-explorer/\">AWS Cost Explorer</a>, including the application’s current and forecasted month-end costs, top five billed services, and a monthly application resource cost trend chart. You can monitor spend, look for anomalies, and click to take action where needed.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/18/2023-myApplications-wiedget-0.png\" width=\"1645\" height=\"683\" /></p> \n<p>The <strong>Compute </strong>widget summarizes of application compute resources, information about which are in alarm, and trend charts from CloudWatch showing basic metrics such as Amazon EC2 instance CPU utilization and AWS Lambda invocations. You also can assess application operations, look for anomalies, and take action.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/18/2023-myApplications-wiedget-1.png\" width=\"1673\" height=\"702\" /></p> \n<p>The <strong>Monitoring and Operations</strong> widget displays alarms and alerts for resources associated with your application, service level objectives (SLOs), and standardized application performance metrics from <a href=\"https://aws.amazon.com/cloudwatch\">CloudWatch Application Signals</a>. You can monitor ongoing issues, assess trends, and quickly identify and drill down on any issues that might impact your application.</p> \n<p>The <strong>Security</strong> widget shows the highest priority security findings identified by <a href=\"https://aws.amazon.com/security-hub/\">AWS Security Hub</a>. Findings are listed by severity and service, so you can monitor their security posture and click to take action where needed.</p> \n<p>The <strong>DevOps</strong> widget summarizes operational insights from <a href=\"https://docs.aws.amazon.com/systems-manager/latest/userguide/application-manager.html\">AWS System Manager Application Manager</a>, such as fleet management, state management, patch management, and configuration management status so you can assess compliance and take action.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/18/2023-myApplications-wiedget-2.png\" width=\"1679\" height=\"1046\" /></p> \n<p>You can also use the <strong>Tagging</strong> widget to assist you in reviewing and applying tags to your application.</p> \n<p><strong><u>Now available</u></strong><br /> You can enjoy this new myApplications capability, a new application-centric experience to easily manage and monitor applications on AWS. myApplications capability is available in the following AWS Regions: US East (Ohio, N. Virginia), US West (N. California, Oregon), South America (São Paulo), Asia Pacific (Hyderabad, Jakarta, Mumbai, Osaka, Seoul, Singapore, Sydney, Tokyo), Europe (Frankfurt, Ireland, London, Paris, Stockholm), Middle East (Bahrain) Regions.</p> \n<p>AWS Premier Tier Services Partners— <a href=\"https://partners.amazonaws.com/partners/001E000000fgUHEIA2/\">Escala24x7</a>, <a href=\"https://partners.amazonaws.com/partners/001E000001IlLnmIAF/IBM\">IBM</a>, <a href=\"https://partners.amazonaws.com/partners/001E000000UfYsqIAF/Tech%20Mahindra\">Tech Mahindra</a>, and <a href=\"https://partners.amazonaws.com/partners/001E000000ekLueIAE/Oblivion\">Xebia</a> will support application operations with complementary features and services.</p> \n<p>Give it a try now in the <a href=\"https://console.aws.amazon.com/\">AWS Management Console</a> and send feedback to <a href=\"https://repost.aws/tags/TAnTglnGsnR_CdJMgsyCH_uA/aws-management-console\">AWS re:Post for AWS Management Console</a>, using the feedback link on the myApplications dashboard, or through your usual AWS Support contacts.</p> \n<p>— <a href=\"https://twitter.com/channyun\">Channy</a></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"e45627b86fba2d2814f03093f14c06f6038447d057bbda10314c6ed588504614","category":"Tech"}