{"title":"Keeping ‘Cross Weird at BikenetiCX’s Halloween Day Cyclocross – Andy Karr","link":"https://theradavist.com/2021/12/bikeneticx-halloween-cyclocross/","date":1639141222000,"content":"<p>Here in the Mid-Atlantic we have a <a href=\"https://www.instagram.com/bikeneticx/?hl=en\" target=\"_blank\">great ‘cross scene</a>. Most races tend to have geat spectator crowds, full fields, interesting and varied courses, and, thanks to the highly variable and mid-atlantic climate, weather that spans from the hot and dusty to absurdly muddy in any given season. There is a lot to like in the Mid-Atlantic if you like cyclocross.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/R1-03812-0022.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>And I do like cyclocross. As a perennial back-of-the-pack B racer I have no aspirations for athletic greatness, but I love the festive atmosphere, the energy of the tightly packed race course, and how inherently silly the whole enterprise is: part steeplechase, part cross country, part road race. When I think about a great day racing cyclocross I think about cowbells, hand ups (dollar bills, beer cups, donuts, you name it just hand it across the course tape!) noise makers (cowbells, vuvuzelas, tom-tom drums) and friendly, non-aggressive heckles. Bringing a friend to a big cyclocross race who has never heard of the sport before is a magical experience. The natural reaction: How could I not have known about a sport that is THIS UNIQUE andTHIS MANY people are THIS ENTHUSIASTIC about? Enthusiasm is infectious at a well attended cyclocross race. But, as with many places across the US, the landscape of cyclocross has been slowly changing here.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/R1-03811-0030.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>With the recent growth of interest in cyclocross/gravel/adventure riding there has been an increase in participant numbers and escalating competitiveness across all fields. It’s really hard to complain about cyclocross getting more popular and races getting more competitive – this is, afterall, competition – but the kookiness that has long been associated with cyclocross (see “single speed cyclocross world championships, for instance…) around here is giving way to an atmosphere at most area races that is a bit more serious and competition focused. Even the single speed fields, long a bastion of the bizarre, tend to be pretty fiercely contested. And don’t get me wrong, I am really not trying to be one of those “the roadies are ruining cyclocross” people.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/R1-03812-0001.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>At its heart cyclocross needs to be both competitive and kooky to be fun. On one hand, cyclocross racing is absurdly hard. When hearing about it for the first time, the uninitiated will likely ask “how long is the race?” to which the cyclocross racer answers “like 5 miles but it’s HARD!” The idea that for 45 minutes you’re giving it all you got is central to the discipline and without the drive of competition all you have is a bunch of people soft pedaling around in a grass field. Borrrrrinnngggg. On the other hand cyclocross is just absurd. This is a sport that requires you to essentially race a road bike on a short track mountain bike course while also having to pick your bike up and carry it over stacked 2x4s twice a lap. It’s kooky to the core.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/R1-03812-0029.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I’m relatively new to the sport myself, having raced my first race in 2015. Cyclocross needs all kinds of people to continue to grow and new racers joining “the scene” from the boring drudgery of road racing is an important part of sustaining the sport. My own team, <a href=\"https://www.instagram.com/greateskape/\" target=\"_blank\">Great Eskape</a>, of which I was a founder and continue to hold near and dear, is a happy hodgepodge of competitive spirit and “just here to party” vibes. The balance of being the kind of team that puts in bulk orders of matching vuvuzelas before cross season (on hold for this year because infectious respiratory plague) while also being the racers willing to turn ourselves inside out to catch that person in front of us (whether that person is in first place or in next to last place) makes our little team what it is.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/R1-03811-0032.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Still, it’s hard to resist joining in with cries to “keep ‘cross weird!” when ‘cross being weird is one of the main draws for me to the sport.</p>\n<p>I am no cyclocross historian, and I do not speak for the mid-atlantic cyclocross scene or even Great Eskape as a whole. My thoughts on racing cyclocross and the scene are mine alone, so when I say it’s important to keep a balance between serious competitiveness and silly fun I mean that it’s important to me. But, with races like BikenetiCX on the mid-atlantic calendar, I do not fear for the future kookiness of cyclocross. <a href=\"https://www.instagram.com/bikeneticx/\" target=\"_blank\">BikenetiCX</a> is a race hosted by <a href=\"https://www.instagram.com/teambikenetic/\" target=\"_blank\">Team Bikenetic</a>, the large and rambunctious community/bike team supported by the beloved local bike shop <a href=\"https://www.bikenetic.com/about/about-bikenetic-pg56.htm\" target=\"_blank\">Bikenetic Full Service Bike Shop</a>.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/R1-03811-0007.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>This race has always been pretty whacky, known for bending the rules on USAC-allowable course obstacles (jump ramps, rollovers, barriers designed to be just short enough to encourage people to bunny hop them who might not otherwise…) and a spectator friendly course set up that has historically included a pirate ship beer garden in the middle of the course (yes you read that right.) Like every other Mid-Atlantic race on the schedule, racers go all out on a course that is often very muddy. Unlike every other race on the schedule you do so surrounded by pirate mannequins and people screaming “send it!!!” every time you approach the barriers. I love it.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/R1-03811-0022.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>This year things have been different for all the obvious reasons related to the pandemic including the outright cancellation of the entire season last year. Many races that had hopped to return this year never made it off the starting grid and were cancelled before registration pages opened. The race calendar shifted around in the weeks before the season kicked off. At the first couple races of the year the environment felt off. There was a mix of people who were having trouble finding the competitive spark after nearly two years of riding just for fun (like me) and folks who were trying to exercise two whole years of bad vibes and anxiety by pouring themselves into their race seasons. It’s hard to put a finger on exactly what and why but things have just felt different this year (and it’s not just the lack of noise from the vuvu’s.)</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/R1-03812-0030.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The BikenetiCX race would also be different this year, moving to a new venue on a new date. To copy exactly from the opening lines of the event notes on the race registration page:</p>\n<p><em>“HALLOWEEN! Sunday 31 October 2021 New venue! CEDAR RUN BREWERY, Nokesville, VA. HALLOWEEN Sunday! Race #3 in the BikeReg CycloCross Super Series! New date, new venue, same party you expect from Team Bikenetic. Taps will be flowing at Cedar Run Brewery, and the course wraps right around the brewery. What could possibly go wrong?</em></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/R1-03811-0002.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>This year my favorite mid-atlantic cyclocross race, BikenetiCX, fell on my favorite holiday, Halloween. That’s right, the mid-atlantic’s zaniest cyclocross race, only now on halloween. You may also have noticed this is race number 3 in a USAC sanctioned series. This was to be a “real race” with “real points” towards a “real series championship.” For the aspirational, this race would promise to provide upgrade points to higher categories, podiums and cash payouts, and a chance to compete with the best athletes the region has. For the rest of us, it would provide a day of entertainment, an unconventional course, an anything goes race featuring tandems and fatbikes, no-holds-barred halloween decorations, and all the kookiness a cyclocross race could muster. Throw in two straight days of soaking rain leading up to the race turning the entire course into a mucky bog and, well… You’ve got yourself a cyclocross race.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/R1-03811-0031.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>So did it deliver? A cyclocross race that’s perfect for the athletic striver, pushing their mind and body to the limit, through mud and grit in pursuit of race day glory? A cyclocross race with enough kookie weirdness to make tracklocross blush? A cyclocross race that doesn’t ask if you are a jock or a kook and just begs you to have fun and try to keep the rubber side down? You can ask the giant creepy clown at the entrance of the singletrack section how he thought it went, or you can check out this set of photos I shot. I can tell you that I, for one, had a blast during my race, and probably because of, rather than despite, the deep mud I got a better than expected result.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/12/R1-03812-0035.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Both before and after my 45 minutes of two wheeled muddin’ I carried my favorite camera, a Minolta X-700 35mm that once belonged to my grandfather, Tootles, around the course with the-greatest-manual-focus-kit-lens-of-all-time, the Rokkor MD 50mm F/1.7, (don’t @ me) a Minolta MD 35-70MM Zoom F/3.5, and pocket full of Ilford HP5 Plus to capture the spooky atmosphere. I figured B&amp;W was the way to go to capture a Halloween race. There was certainly no lack of interesting subjects to work with, so I hope it did justice.</p>\n<p>The post <a href=\"https://theradavist.com/2021/12/bikeneticx-halloween-cyclocross/\">Keeping ‘Cross Weird at BikenetiCX’s Halloween Day Cyclocross</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"Josh Weinberg","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"e45630ca3b619baee4f45e7b825ac3257181cf84107bd29493eabe08cebfe488","category":"Cycling"}