{"title":"PSA: Google Photos Unlimited Storage Ends Next Month, Here's How to Export Your Pictures to iCloud","link":"https://www.macrumors.com/2021/05/13/export-google-photos-to-icloud/","date":1620908789000,"content":"For as long as it's existed, Google Photos has offered free unlimited storage for uploading images at a reduced yet good enough quality for most users. From June 1, 2021, however, all photos and videos uploaded to Google accounts will count against users' cloud storage. If you've been relying on Google to back up your media library, it may be time to move that content elsewhere. This article shows you how.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/google-photos.jpg\" />\r\n<br />\r\n<h3>High Quality vs Original Quality Uploads</h3>\r\n<br />\r\nGoogle Photos has traditionally offered two storage options: \"Original Quality,\" for which photos count against your storage quota, and \"High Quality,\" which is the free and unlimited option, although it shrinks images bigger than 16 megapixels and videos over 1080p.\r\n<br />\r\n\r\n<br />\r\nWhichever option you rely on, from next month both of these options will count against your Google cloud storage allocation. That could present a problem if you rely on the 15GB of free storage that comes with every Google account, or even if you already pay Google for extra storage. \r\n<br />\r\n\r\n<br />\r\n<h3>What Does That Mean for My Existing Uploads?</h3>\r\n<br />\r\nIt's important to note that any \"High Quality\" images already uploaded before June 1 will be exempt from this change and won't count against your storage quota, but anything uploaded after that date will eat up your allowance, so unless you plan on upping your Google storage with a paid plan, it may be time to export your photos and store them elsewhere. If you're already invested in Apple's ecosystem, iCloud is the obvious choice.\r\n<br />\r\n\r\n<br />\r\nGoogle One storage costs $2/month for 100GB, $3/month for 200GB, and $10/month for 2TB, with discounted annual payment options also available. As for <a href=\"https://support.apple.com/en-us/HT201238\">Apple's iCloud</a>, storage options are $1/month for 50GB, $3/month for 200GB, and $10/month for 2TB. <a href=\"https://support.apple.com/en-us/HT211659\">Apple One bundles</a> also include storage allowances alongside other digital services like Apple Music, Apple Arcade, and Apple TV+.\r\n<br />\r\n\r\n<br />\r\n<h3>How to Export Your Google Photos</h3>\r\n<br />\r\nBy using the Share option in the Google Photos app, you can export individual images from Google Photos, but if you're looking for a bulk-export option, the following steps walk through the process.\r\n<br />\r\n<ol><li>Using a desktop browser, navigate to <a href=\"https://takeout.google.com\">takeout.google.com</a> and sign in using your Google account credentials.</li>\r\n<br />\r\n<li>Under \"Create a New Export,\" in the section titled \"Select Data to include,\" click <strong>Deselect all</strong>.\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/export-google-photos1.jpg\" />\r\n<br />\r\n</li><li>Scroll down to <strong>Google Photos</strong> and check the relevant box, then scroll to the bottom and click the <strong>Next step</strong> button.\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/export-google-photos2.jpg\" />\r\n<br />\r\n</li><li>Choose your export file type, frequency, and destination, then click the <strong>Create export</strong> button.\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/export-google-photos3.jpg\" /></li></ol>Once the request has been made, you'll see an \"Export progress\" message. The time it takes for your export to finish depends on the size of your media library, but Google will send an email to let you know when it's ready. Alternately, leave the page open and you'll see a <strong>Download</strong> button when the export is ready.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/icloud-photos-1.jpg\" />\r\n<br />\r\nOnce you've received your exported images, you can drag them into the Photos app on your Mac. To ensure the changes are synced to your Apple devices, check that iCloud Photos is turned on: You can find the switch in he iCloud tab in Photos' preferences (click <strong>Photos -&gt; Preferences</strong> in the menu bar). Note that you can also upload photos via a browser by going to the iCloud Photos section on the <a href=\"https://icloud.com\">icloud.com</a> website.<div>Tags: <a href=\"https://www.macrumors.com/guide/google-photos/\">Google Photos</a>, <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/13/export-google-photos-to-icloud/\">PSA: Google Photos Unlimited Storage Ends Next Month, Here's How to Export Your Pictures to iCloud</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/psa-google-photos-unlimited-storage-ends-next-month-heres-how-to-export-your-pictures-to-icloud.2295995/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ubTAeAzlCs8:PCuoFvPnfaU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ubTAeAzlCs8:PCuoFvPnfaU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ubTAeAzlCs8\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e45d1c436e3b9b440074b7337132fb6291d85f4050ff9c95b4536ce14deb567e","category":"Apple"}