{"title":"Windows 11 มี Windows Subsystem for Android สำหรับรันแอพ Android แบบเนทีฟ","link":"https://www.blognone.com/node/123401","date":1624595175000,"content":"<div><div><div><p>ประเด็น <a href=\"https://www.blognone.com/node/123387\">Windows 11 รองรับแอพ Android</a> ยังมีรายละเอียดตามมาอีกเรื่อยๆ ข้อมูลสำคัญมาจาก Kevin Gallo หัวหน้าฝ่าย Windows Developer Platform อธิบายเรื่องนี้ไว้ในไลฟ์สำหรับนักพัฒนาแอพ</p>\n<p>Gallo บอกว่า Windows 11 มีสิ่งที่เรียกว่า Windows Subsystem for Android ที่ใช้หลักการทำงานเหมือน Windows Subsystem for Linux (WSL) ในปัจจุบัน นั่นคือแปลงคำสั่งของเคอร์เนลลินุกซ์มาเป็นคำสั่งของเคอร์เนลวินโดวส์</p>\n<p>การที่เคอร์เนลของ Android เป็นลินุกซ์อยู่แล้ว ทำให้ไมโครซอฟท์ต่อยอด WSL มาเป็น Windows Subsystem for Android ได้ไม่ยากนัก ตัวแอพ Android จะรันอยู่ใน virtual machine เพื่อความเข้ากันได้กับระบบปฏิบัติการเวอร์ชัน AOSP (ที่ไม่ต้องพึ่งพา Google Play Services)</p>\n<p>ส่วนประเด็นเรื่อง <a href=\"https://www.blognone.com/node/123396\">Intel Bridge Technology</a> จะใช้ต่อเมื่อแอพ Android คอมไพล์มาเป็น ARM เท่านั้น ซึ่ง Gallo ก็แนะนำให้นักพัฒนาทำแอพเป็น Universal Binary ที่รันได้ทั้ง x86/ARM จะทำให้ประสิทธิภาพในการรันบน Windows 11 เต็มประสิทธิภาพมากกว่า</p>\n<p>Gallo ยังไม่ได้แชร์ภาพหรือข้อมูลแผนผังของ Windows Subsystem for Android ยังเป็นการตอบคำถามปากเปล่าเท่านั้น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/49a64be61d0cb0646c181c033ff8e7f3.jpg\" /></p>\n<p>ในคลิปประมาณนาทีที่ 21</p>\n<p>ที่มา - <a href=\"https://www.zdnet.com/article/microsoft-here-comes-the-windows-subsystem-for-android/\">ZDNet</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/windows-11\">Windows 11</a></div><div><a href=\"/topics/android\">Android</a></div><div><a href=\"/topics/operating-system\">Operating System</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e45fd735c45a3a0b23d4418768a5a7ca7b8c35b4ca3704253ba925c67e7a505e","category":"Thai"}