{"title":"Deoxyshikonin triggers apoptosis in cervical cancer cells through p38 MAPK‐mediated caspase activation","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24323?af=R","date":1715169867000,"content":"<h2>Abstract</h2>\n<p>Deoxyshikonin (DSK) is a biological component derived from <i>Lithospermum erythrorhizon</i>. Although DSK possesses potential anticancer activities, whether DSK exerts anticancer effects on cervical cancer cells is incompletely explored. This study was aimed to investigate the anticancer activity of DSK against cervical cancer cells and its molecular mechanisms. Cell viability was evaluated by MTT assay. Level of phosphorylation and protein was determined using Western blot. Involvement of signaling kinases was assessed by specific inhibitors. Our results revealed that DSK reduced viability of human cervical cell in a dose-dependent fashion. Meanwhile, DSK significantly elicited apoptosis of HeLa and SiHa cells. Apoptosis microarray was used to elucidate the involved pathways, and the results showed that DSK dose-dependently diminished cellular inhibitor of apoptosis protein 1 (cIAP1), cIAP2, and XIAP, and induced cleavage of poly(ADP-ribose) polymerase (PARP) and caspase-8/9/3. Furthermore, we observed that DSK significantly triggered activation of ERK, JNK, and p38 MAPK (p38), and only inhibition of p38 diminished the DSK-mediated pro-caspases cleavage. Taken together, our results demonstrate that DSK has anti-cervical cancer effects via the apoptotic cascade elicited by downregulation of IAPs and p38-mediated caspase activation. This suggests that DSK could act as an adjuvant to facilitate cervical cancer management.</p>","author":"Chung‐Yuan Lee, \nPei‐Ni Chen, \nShao‐Hsuan Kao, \nHeng‐Hsiung Wu, \nYi‐Hsuan Hsiao, \nTzu‐Yu Huang, \nPo‐Hui Wang, \nShun‐Fa Yang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"e46208e017b0a3aa938afe1e79af27086ca3125d6de49976372101560565630d","category":"Environment"}