{"title":"Modelling potential distribution of the invasive box tree moth across Asia, Europe, and North America","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302259","date":1714140000000,"content":"<p>by M. Lukas Seehausen, Alex Rimmer, Abigail Wiesner, Marc Kenis, Cynthia Scott-Dupree, Sandy M. Smith</p>\r\n\r\nThe box tree moth <i>Cydalima perspectalis</i> (Walker) (Lepidoptera: Crambidae) (BTM) is a native moth throughout eastern Asia, having recently become invasive in Europe (2007) where it feeds on boxwood (= box tree), <i>Buxus</i> spp. The moth rapidly spread across Europe and the Caucasus causing damage to both ornamental and wild <i>Buxus</i>. In 2018, <i>C</i>. <i>perspectalis</i> was found in Toronto, ON, Canada, and has since spread south into the US. To better predict where the moth will establish and have significant impact on ornamental trade in North America, we used most recent scientific literature and distribution points to update the temperature and diapause indices of an existing ecoclimatic CLIMEX model. The model parameters provided a good fit for the potential distribution of BTM compared to its known distribution across eastern Asia and in Europe. Interestingly, our results suggest that the current native distribution in Asia is incomplete and that further expansion is also possible in its introduced range, especially in northern Europe, along the Mediterranean coast of Africa, and eastward to central Russia. In North America, the model predicts that most of North America should be climatically suitable for the moth’s establishment, with the exception of Alaska and the northern territories of Canada, as well as higher elevations in the Rocky Mountains and southern hot and dry areas. Our study highlights the importance of the CLIMEX model to assess the risk of BTM spreading in its newly invaded areas, especially North America, and its use to help make decisions in terms of regulatory dispersal restrictions and choice of management options.","author":"M. Lukas Seehausen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e46cd563b7284a96615b1275155ef8319295d047ee31dd1c755600d6e2efcf1e","category":"Interdisciplinary"}