{"title":"WhatsApp Gets 'HD Photos' Option for Sending High-Res Images","link":"https://www.macrumors.com/2023/08/18/whatsapp-hd-photos-send-high-res-images/","date":1692364496000,"content":"WhatsApp has released an update allowing iPhone and Android users to send photos over the messaging platform in high resolution, finally addressing the service's low quality image sharing limitation.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/whatsapp-hd-photos.jpg\" alt width=\"990\" height=\"557\" />\r<br />\nPreviously, WhatsApp users sending photos would see the images automatically compressed and the resolution reduced to 920 x 1280 to save storage space and keep image-sharing fast over low bandwidth data connections. \r<br />\n\r<br />\nAfter updating, they'll have the option to send images to friends and family in \"HD quality,\" which equates to 3024 x 4032 resolution. The rollout of the feature was announced by Meta CEO Mark Zuckerberg via a <a href=\"https://www.facebook.com/4/videos/2577125352453919/\">Facebook post</a>.\r<br />\n\r<br />\nVersion 23.16.0 of the app adds a \"HD\" button at the top of the photo sharing screen, next to the other image editing tools. Tapping the HD button brings up a pop-up allowing users to switch from the default Standard Quality to HD Quality. \r<br />\n\r<br />\nRecipients of HD photos will see a HD label in the corner of the image, indicating that they have received a higher quality version, and all high resolution images are protected under WhatsApp's end-to-end encryption. \r<br />\n\r<br />\nAccording to Meta, if a user's internet connection is low bandwidth, they will receive photos in Standard Quality, and will be able to choose to keep the standard version or upgrade it to HD where available.\r<br />\n\r<br />\nThe new feature is rolling out globally over the next few weeks, and Meta says the ability to send high resolution videos over WhatsApp is set to follow soon.<div>Tag: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/18/whatsapp-hd-photos-send-high-res-images/\">WhatsApp Gets 'HD Photos' Option for Sending High-Res Images</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/whatsapp-gets-hd-photos-option-for-sending-high-res-images.2398991/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e46c28f5098997b6e3d646275554cb5931fc3b3ef566ce622d9fe6791ef071ad","category":"Apple"}