{"title":"Validity of different scoring systems in prediction of intensive care unit admission and mortality in acute organophosphate poisoning","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae107/7714054?rss=1","date":1721088000000,"content":"<span><div>Abstract</div><div>Background</div>Organophosphate compounds (OPCs) pose significant health risks, especially in developing countries with limited resources. Predicting outcomes in OPCs poisoning is crucial for guiding clinical management and reducing mortality rates. The aim of this study to evaluate the validity of different scoring systems Rapid Emergency Medicine Score, Multiple Organ Dysfunction Score, Acute Physiology and Chronic Health Evaluation Score, and Poison Severity Score in prediction of intensive care unit (ICU) admission and mortality of acute OPCs poisoning patients.<div>Methods</div>A cross-sectional study was conducted on 103 patients admitted to Xx Poison Control Center between May 2022 and June 2023. Scoring systems were applied at admission, and their performance in predicting the need for ICU admission and mortality was evaluated using receiver operating characteristic (ROC) curve analysis.<div>Results</div>Most patients survived (92.2%). Only 13.6% of the patients required ICU admission. Significant differences in median scores were observed between survivors and non-survivors and between patients requiring ICU admission and those who did not. Multiple Organ Dysfunction Score exhibited the highest discriminatory power for predicting both ICU admission (AUC = 0.983) and mortality (AUC = 0.999).<div>Conclusion</div>The findings highlight the importance of utilizing scoring systems, particularly Multiple organ dysfunction score, for prediction of poor outcomes of acute OPCs poisoning.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"e470835fda062ad2e6d00e0d413d21ad300cdca6e8ad5023807d00977ecb6e28","category":"Environment"}