{"title":"Current Advances in the Black Tiger Shrimp Penaeus monodon Culture: A Review","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12958?af=R","date":1725322450000,"content":"<h2>ABSTRACT</h2>\n<p>The increasing high-end market demand for the black tiger shrimp <i>Penaeus monodon</i> has brought tremendous industry opportunities. Although the industry has tried its best to increase production, according to the report data from the Food and Agriculture Organization (FAO), annual global production has shown no significant upward trend over the past decade. Besides that, newly implemented policies such as seafood safety and food security negatively impacted the industry and reduced production. However, <i>P. monodon</i> cultivation is still promising due to its larger body size and higher market acceptance as a premium product. Over the years, numerous studies have been conducted to increase the production of <i>P. monodon</i> by optimizing its culture conditions, implementing new culture system, increasing disease resistance to disease such as WSSV, AHPND, WFD, implementation of pre- and probiotics in feed, and selective breeding programs to increase genetic diversity and population of <i>P. monodon</i> broodstock. This review provides an overview of the current advances in <i>P. monodon</i> broodstock cultivation, thereby providing an essential baseline for <i>P. monodon</i> aquaculture. Areas needing urgent research focus are also highlighted. Future research should take great strides and take into account the impact of future climate change scenario during <i>P. monodon</i> culture and optimization, and increase biosecurity measures to prevent its introduction as an alien species in wild settings.</p>","author":"Khor Waiho, \nYang Ling, \nMhd Ikhwanuddin, \nAlexander Chong Shu‐Chien, \nNor Afiqah‐Aleng, \nYouji Wang, \nMenghong Hu, \nHonjung Liew, \nNor Azman Kasan, \nJia Hui Peh, \nHanafiah Fazhan","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"e47183647bd3d30c9644ede8074bcd14cd7d775d2fc1d24123bcc2076faa67c3","category":"Environment"}