{"title":"Understanding the influencing factors of energy consumption in China: A dual perspective of geographical space and economic “new normal”","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12483?af=R","date":1717152928000,"content":"<h2>Abstract</h2>\n<p>China's economy has transtioned into the “new normal”, which demands higher standards for energy utilization efficiency. Meanwhile, the spatial distribution of China's energy consumption and economic development exhibits a significant imbalance, complicating efforts to achieve Pareto optimization of regional energy allocation efficiency. Addressing this issue, this study explores the heterogeneity of the factors influencing energy consumption in China from the dual perspectives of economic “new normal” and geographic space, using an exponential decomposition model. The results of the study show that: (1) the inhibitory effect of the energy intensity effect on the growth of regional energy consumption is differentiated, with stronger inhibitory effects in Guangdong, Jiangsu and other provinces, and weaker inhibitory effects in Hainan, Qinghai, and other provinces. Living standard effect on the regional energy consumption growth of the promotion of the effect also has differences, Jiangsu, Shandong and other provinces of the promotion of the effect is stronger, while Hainan, Qinghai, and other provinces of the promotion of the effect is weaker. (2) Population size effect on regional energy consumption growth is not consistent in the direction of the role of Guangdong, Zhejiang, and other provinces have a promotional effect and the role of the effect of the stronger, on the contrary, the provinces of Heilongjiang, Jilin, and Gansu has an inhibitory effect. (3) In the late stage of the economic “new normal”, the effects of energy intensity effect, living standard effect and population size effect on the growth of energy consumption in the four regions show a weakening trend, and this weakening trend is more obvious in the northeast region. This study expands theoretical research on factors affecting energy consumption and offers practical guidance for China's government to coordinate regional energy allocation under the economic “new normal” and geographical considerations.</p>","author":"Jun Nie, \nTangyang Jiang, \nYang Yu","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"e4721002c742b41522680835f0cd24aa13830e2c9f248ba29be3b683833d8e45","category":"Environment"}