{"title":"Netflix ไตรมาส 1/2023 รายได้โต 3.7% - เลื่อนใช้ระบบป้องกันหารบัญชีเป็นภายในไตรมาส 2","link":"https://www.blognone.com/node/133475","date":1681856385000,"content":"<div><div><div><p>Netflix รายงานผลประกอบการประจำไตรมาสที่ 1 ปี 2023 รายได้รวมเพิ่มขึ้น 3.7% จากช่วงเดียวกันในปีก่อนเป็น 8,162 ล้านดอลลาร์ และมีกำไรสุทธิ 1,305 ล้านดอลลาร์ จำนวนสมาชิกเพิ่มขึ้นอีก 1.75 ล้านราย รวมเป็น 232.50 ล้านราย</p>\n<p>ก่อนหน้านี้ Netflix ประกาศแผนเปิดใช้ระบบป้องกันการหารบัญชี โดยบอกจะ<a href=\"https://www.blognone.com/node/132395\">มีผลทั่วโลกภายในเดือนมีนาคม</a> แต่ผู้ใช้งานหลายประเทศ รวมทั้งในไทยก็คงเห็นว่ายังไม่ได้เริ่มมีผล ซึ่ง Netflix ก็บอกว่าในไตรมาสที่ผ่านมาได้ขยายไปอีก 4 ประเทศ ได้แก่ แคนาดา นิวซีแลนด์ สเปน และโปรตุเกส ส่วนแผนขยายประเทศเพิ่มเติมรวมทั้งอเมริกา จะเกิดขึ้นในไตรมาส 2 หรือไตรมาสปัจจุบัน</p>\n<p>Netflix บอกว่าสิ่งที่พบในประเทศที่ขยายระบบป้องกันหารบัญชีช่วงที่ผ่านมา คืออัตรายกเลิกสมาชิกเพิ่มสูงทันทีช่วงแรกที่มีผล แต่หลังจากนั้นไม่นาน มีการสมาชิกแบบพ่วงบัญชีหลักเพิ่มเติมขึ้นมามาก กรณีแคนาดา ตอนนี้มีฐานจำนวนสมาชิกก็เพิ่มขึ้นมากกว่าก่อนใช้ระบบหารบัญชีแล้ว ทำให้ Netflix ตัดสินใจชะลอการบังคับใช้ออกไป เพื่อปรับหาแนวทางที่เหมาะสมขึ้นจากสิ่งที่ได้เรียนรู้มา</p>\n<p>Netflix พูดถึง<a href=\"https://www.blognone.com/node/130925\">แพ็คเกจแบบมีโฆษณา</a>ซึ่งเพิ่มเป็นทางเลือกในบางประเทศ บอกว่าได้รับผลตอบรับที่ดี และจะปรับปรุงให้รองรับความละเอียดเป็น 1080p จากเดิมสูงสุด 720p</p>\n<p>คอนเทนต์เด่นในไตรมาสที่ผ่านมาได้แก่ The Night Agent ซึ่งตอนนี้เป็นรายการโทรทัศน์ยอดนิยมตลอดกาลอันดับ 6 ของแพลตฟอร์มแล้ว ส่วน The Glory ก็เป็นรายการโทรทัศน์ที่ไม่ใช่ภาษาอังกฤษยอดนิยมตลอดกาลอันดับ 5</p>\n<p>ที่มา: <a href=\"https://s22.q4cdn.com/959853165/files/doc_financials/2023/q1/Final-Q1-23-Shareholder-Letter.pdf\">Netflix</a> (pdf)</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/17bd93f291bbc2dc709041c24e41489f.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e47cfed02ad71d957923c65fc13f374dbb37036dd8b6875d40324b4168f19d75","category":"Thai"}