{"title":"Volunteer for HashiCorp Certified: Vault Operations Professional Beta Exam","link":"https://www.hashicorp.com/blog/volunteer-for-hashicorp-certified-vault-operations-professional-beta-exam","date":1635177600000,"content":"<p>HashiCorp is looking for Vault professionals to take and review a new three-hour hands-on Vault Operations exam. This exam and the certification it’s attached to represent a new level in our certification track, above the Vault Associate level. This beta testing period will allow you to participate in shaping the final version of this exam and improving the overall quality of the Vault Professional certification process.</p>\n<p>The biggest benefit for beta participants is that they will get to take the exam for free. A passing score will make you one of the first practitioners certified at the Vault Professional level and earn you one of the first digital badges for this exam, plus an exclusive physical badge sticker.</p><p><a href=\"https://hashi.co/vault-ops-pro-exam-beta\">Fill out this form</a> by Friday, October 29th, to volunteer. If you are chosen as a volunteer, you will receive a notification by Monday, November 8th, along with instructions for next steps. Spots are limited, so be sure to volunteer early.</p><img src=\"https://www.datocms-assets.com/2885/1635176699-vault-pro-badge.png\" /><h2><a href=\"#prerequisites-for-the-vault-ops-professional-exam\">»</a><a></a>Prerequisites for the Vault Ops Professional Exam</h2>\n<p>HashiCorp's existing <strong><a href=\"https://www.hashicorp.com/certification\">Associate-level multiple choice exams</a></strong> are meant for users in the early stages of using our cloud automation tools. The HashiCorp Certified: Vault Operations Professional exam will be for more experienced cloud engineers who have set up and used Vault in production. Instead of just multiple choice questions, the pro exam is primarily hands-on; exam-takers will be given a lab environment and a list of tasks to perform.</p>\n<p>The <a href=\"https://www.hashicorp.com/certification/vault-associate\">Vault Associate</a> exam is a recommended prerequisite, but is not required. HashiCorp trusts that you know what level exam you are ready to take. <strong>If you have deployed, configured, managed, and monitored HashiCorp Vault in production, then you are ready to try the pro exam.</strong></p>\n<h2><a href=\"#how-will-the-exam-be-conducted\">»</a><a></a>How Will the Exam be Conducted?</h2>\n<p>The beta exam will be taken online with a proctor, just like HashiCorp’s other released exams. The live proctor verifies the exam-taker’s identity, walks them through rules and procedures, and watches them take the exam. After the exam, there will be a required post-exam survey. As a beta-tester, your feedback is crucial to improving the exam, so be sure to fill this in with anything you think we should know about your experience. Participants will receive their exam results a few weeks after the exam.</p>\n<h2><a href=\"#how-to-prepare\">»</a><a></a>How to Prepare</h2>\n<p>Visit the <a href=\"https://www.hashicorp.com/certification/vault-operations-professional\">Vault Operations Professional</a> page to see a draft-list of exam objectives. You can start studying now with the <a href=\"https://learn.hashicorp.com/collections/vault/ops-pro-cert\">basic review guide</a> we've published on HashiCorp Learn. We will publish more robust study materials in the near future.</p>","author":"Lisa Szpunar","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"e4801ce12940ef667017f4c19da0f8ceeef8ece9017b9865d3e2ff6580faace8","category":"Tech"}