{"title":"Use natural language to explore and prepare data with a new capability of Amazon SageMaker Canvas","link":"https://aws.amazon.com/blogs/aws/use-natural-language-to-explore-and-prepare-data-with-a-new-capability-of-amazon-sagemaker-canvas/","date":1701285281000,"content":"<p>Today, I’m happy to introduce the ability to use natural language instructions in <a href=\"https://aws.amazon.com/sagemaker/canvas/\">Amazon SageMaker Canvas</a> to explore, visualize, and transform data for machine learning (ML).</p> \n<p>SageMaker Canvas now supports using foundation model-(FM) powered natural language instructions to complement its comprehensive data preparation capabilities for data exploration, analysis, visualization, and transformation. Using natural language instructions, you can now explore and transform your data to build highly accurate ML models. This new capability is powered by Amazon Bedrock.</p> \n<p>Data is the foundation for effective machine learning, and transforming raw data to make it suitable for ML model building and generating predictions is key to better insights. Analyzing, transforming, and preparing data to build ML models is often the most time-consuming part of the ML workflow. With SageMaker Canvas, data preparation for ML is seamless and fast with 300+ built-in transforms, analyses, and an in-depth data quality insights report without writing any code. Starting today, the process of data exploration and preparation is faster and simpler in SageMaker Canvas using natural language instructions for exploring, visualizing, and transforming data.</p> \n<p>Data preparation tasks are now accelerated through a natural language experience using queries and responses. You can quickly get started with contextual, guided prompts to understand and explore your data.</p> \n<p>Say I want to build an ML model to predict house prices Using SageMaker Canvas. First, I need to prepare my housing dataset to build an accurate model. To get started with the new natural language instructions, I open the SageMaker Canvas application, and in the left navigation pane, I choose <strong>Data Wrangler</strong>. Under the <strong>Data</strong> tab and from the list of available datasets, I select the <strong>canvas-housing-sample.csv</strong> as the dataset, then select <strong>Create a data flow </strong>and choose <strong>Create</strong>. I see the tabular view of my dataset and an introduction to the new <strong>Chat for data prep</strong> capability.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/13/data-flow.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/13/data-flow-1024x587.png\" alt=\"data-flow\" width=\"1024\" height=\"587\" /></a></p> \n<p>I select <strong>Chat for data prep, </strong>and it displays the chat interface with a set of guided prompts relevant to my dataset. I can use any of these prompts or query the data for something else.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/15/chat-interface.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/15/chat-interface-1024x586.png\" alt=\"chat-interface\" width=\"1024\" height=\"586\" /></a></p> \n<p>First, I want to understand the quality of my dataset to identify any outliers or anomalies. I ask SageMaker Canvas to generate a data quality report to accomplish this task.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/15/data-quality.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/15/data-quality-1024x745.png\" alt=\"data-quality\" width=\"1024\" height=\"745\" /></a></p> \n<p>I see there are no major issues with my data. I would now like to visualize the distribution of a couple of features in the data. I ask SageMaker Canvas to plot a chart.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/15/query.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/15/query-1024x593.png\" alt=\"query\" width=\"1024\" height=\"593\" /></a></p> \n<p>I now want to filter certain rows to transform my data. I ask SageMaker Canvas to remove rows where the population is less than 1,000. Canvas removes those rows, shows me a preview of the transformed data, and also gives me the option to view and update the code that generated the transform.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/15/code-view.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/15/code-view-1024x593.png\" alt=\"code-view\" width=\"1024\" height=\"593\" /></a></p> \n<p>I am happy with the preview and add the transformed data to my list of data transform steps on the right. SageMaker Canvas adds the step along with the code.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/15/transform.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/15/transform-1024x571.png\" alt=\"transform\" width=\"1024\" height=\"571\" /></a></p> \n<p>Now that my data is transformed, I can go on to build my ML model to predict house prices and even deploy the model into production using the same visual interface of SageMaker Canvas, without writing a single line of code.</p> \n<p>Data preparation has never been easier for ML!</p> \n<p><span><strong>Availability</strong></span><br /> The new capability in Amazon SageMaker Canvas to explore and transform data using natural language queries is available in all AWS Regions where Amazon SageMaker Canvas and Amazon Bedrock are supported.</p> \n<p><span><strong>Learn more</strong></span><br /> <a href=\"https://aws.amazon.com/sagemaker/canvas/\">Amazon SageMaker Canvas</a> product page</p> \n<p>Go build!</p> \n<p>— Irshad</p>","author":"Irshad Buchh","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"e484638b888c4706d3d4aea84ba88070baa4f2cf09c86561457737c9b81a179e","category":"Tech"}