{"title":"Minimally Invasive Lumbar Disc Hernia Surgery: Mapping the Landscape of Techniques and Outcomes through Bibliometric Analysis of Current Meta-analyses","link":"https://www.preprints.org/manuscript/202407.0729/v1","date":1720520312000,"content":"Introduction:Lumbar radiculopathy, frequently triggered by disc herniation, affects around one in 50 young adults (30-55 ages), leading to significant impacts on quality of life. When conservative treatments fail to alleviate symptoms, surgical intervention such as discectomy is often pursued. Technological advancements have led to various minimally invasive techniques, promising improved outcomes. Our aim was to compare clinical outcomes of different techniques.Methods:We conducted a systematic search in PubMed using \"lumbar disc hernia\" and the meta-analysis filter. Inclusion criteria comprised meta-analyses focusing on lumbar disc herniation treatments, published in English. A rigorous selection process adhering to PRISMA guidelines ensured high-quality evidence extraction.Results:From 28,171 initial records, 31 meta-analyses involving 87,852 patients were included. Heterogeneity across the literature presented challenges, notably in study populations, surgical techniques, and research designs. Among the techniques evaluated, full-endoscopic lumbar discectomy (FELD) emerged as superior in various perioperative parameters, including Visual Analog Scale (VAS) scores, Oswestry Disability Index (ODI), operation time, and complications. Conversely, automated percutaneous discectomy (AUTD) consistently exhibited poorer outcomes, suggesting limited effectiveness compared to other techniques. Conclusion:Despite advancements, the heterogeneity observed in the literature underscores the need for standardized approaches in minimally invasive spinal surgery research. FELD stands out as a preferred technique, offering favorable outcomes across multiple parameters. Conversely, techniques like AUTD raise concerns regarding efficacy. Future research should aim for uniformity in methodologies to facilitate accurate comparisons and guide clinical decision-making.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e49378e24c1a80bef113ec21034d87282509afa4e74c64653130d38a218e75ad","category":"Interdisciplinary"}