{"title":"Folding Bikes, Weird Sights, and Crashing Eurobike Part 01 – Petor Georgallou","link":"https://theradavist.com/eurobike-2023-recap-gallery-01/","date":1689159645000,"content":"<p><em><a href=\"https://theradavist.com/tag/eurobike/\" target=\"_blank\">Eurobike</a> is a massive convention that takes place annually in Frankfurt, Germany, and is described as “the central platform for the bike and future mobility world.” <a href=\"https://www.instagram.com/dear_susan_/?hl=en\" target=\"_blank\">Petor Georgallou</a> was on the ground at this year’s event and, below, uncovers the latest and greatest from the longest-travel downhill bikes to the smallest-wheeled folding bikes. But, first, he had to get in…</em></p>\n<p><span></span></p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1285\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=1024,658&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=768,493&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=1800,1157&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=1335,858&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=700,450&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=1536,987&amp;quality=75 1536w\" /></p>\n<p>The year was 2017, the mood was louche, and somewhere in Bristol the first international convention of bike show security guards met to discuss their core values. Identified at this meeting of the meat heads as a key to a successful show, was to never—under any circumstances—allow me to enter a bike show. From that point onwards, all security guards at all bike shows all over the world were issued with a postcard, with a picture of my face, accompanied by strict instructions not to let me in, however many legitimate tickets and passes I present. The first time was at BESPOKED in 2017, when a swollen gammon of a man with a sore-looking face, glistening with greasy sweat, locked me out halfway through the show set up for not having my exhibitors pass, which was due to be collected inside the show.</p>\n<p>Even having collected the pass, the same guard refused me entry every time I exited and re-entered the show for the whole weekend, and so the game began. I’d set him up with an accomplice who’d distract him with questions, or little strips of bacon attached to a length of fishing wire, then I’d sneak up as close to the door as possible until he saw me, and then run into the show, amalgamating myself with the crowd until he gave up the chase. Since then getting into bike shows has been problematic, and this year’s Eurobike was no different.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1460\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-7.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-7.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-7.jpg?resize=1024,748&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-7.jpg?resize=768,561&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-7.jpg?resize=1800,1314&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-7.jpg?resize=1335,975&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-7.jpg?resize=700,511&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-7.jpg?resize=1536,1121&amp;quality=75 1536w\" /></p>\n<p>I had a press pass to collect from the press room, which was a good 20-minute walk from the main entrance, however, I wasn’t allowed to go in and collect it because I had a Brompton with me.</p>\n<p><em>It’s okay! It’s a Brompton, I can just fold it up.</em></p>\n<p>I pleaded with a man who repeated the mantra that he’d learned at the great bike show security guards meeting of 2017.</p>\n<p>“I’m sorry sir, I can’t let you in. It’s not allowed”</p>\n<p><em>Okay… what if I fold it into a case so you can’t see that it’s a bike?</em></p>\n<p>“I’m sorry sir, I can’t let you in. It’s not allowed.”</p>\n<p><em>But what about these guys all coming in here with their wheeley suitcases? What if they have tiny bicycles in there? It’s not like you’re stopping everyone and checking for tiny bicycles in their luggage. Also, I can’t be sure for certain, but I think there are probably quite a lot of bicycles in there already?</em></p>\n<p>“I’m sorry sir, I can’t let you in. It’s not allowed.”</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-14.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-14.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-14.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-14.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-14.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-14.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-14.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-14.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>At this point, I knew the drill and what I’d need to do to get into the show. So I unfolded my Brompton, rammed in a pair of AirPods, and began my warm-up lap of the show’s perimeter. I rode round to the service entrance where vans go in to load and unload. I knew where it was because I’d used it as a photo spot for the previous year’s show, and I also knew that there were short, moveable barriers with a little gap for bicycles on the end. I’d hoped that the guards would just be in their little hut eating donuts and watching cat videos on their phones, but to my chagrin they were out actually guarding the entrance.</p>\n<p>I rode at them as fast as I could on the pavement, spinning out, doing my best aero tuck behind my Brompton’s front basket, brimming with camera gear. I couldn’t believe they were actually willing to put themselves in harm’s way to stop me from entering a bike show! In the last seconds, I faked a left further onto the pavement, they followed my queue before I swerved a hard right, half hopping, half falling down the curb, and squeezing past the other side of the barrier.</p>\n<p>I kept my pace into the test track where I couldn’t have been more at odds with all the funny little electric cars slowly and carefully negotiating the hairpins. I slowed down and let the adrenaline settle before locking my bike to a bin by the Amerikan hotdog stand and entering the air-conditioned glass monstrosity that is Messe-Friedrichshafen.</p>\n<p>I was in.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-33.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-33.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-33.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-33.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-33.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-33.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-33.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-33.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p><em>The partitioning of the show is almost uncanny in how it reflects brands statuses in cycling culture, and their reasons for exhibiting.</em></p>\n<p>On the first day, I covered hall 12 (the hall where most well-known brands live) which orbits a massive SRAM booth in the center. Hall 11 is a little weirder, half of the ground floor is an expanse of Shimano, and another third is a sea of low-grade to middling bikes, cheaply made in factories under the brand Bulls. The floor above is home to high-grade parts and accessories. Hall 9 is perhaps the least visitor friendly, with China and Taiwan each taking huge spaces, divided into a number of tiny booths for factories to exhibit on.</p>\n<p>The ceilings are lower in hall 9 to squeeze 3 floors into the footprint of 2 and it feels more like a marketplace for offshoring rather than an exhibition. It’s also the only place in the cycling industry I’ve seen women employed to dress up as “sexy nurses” and hand out test tube shots which feels like an extremely dated “marketing” tactic. Hall 8 is perhaps my favorite: it only has one floor and includes the “startups area” as well as a number of ambiguous categories centering around future mobility, so it’s kind of the area where anything could happen, which makes it the most fun.</p>\n<p>I ditched my bags with lovely, friendly Schwalbe whose booth had been put together from entirely reusable materials, giving a nod to their global re-brand, centered around circular economies, and recycling tires. How to implement genuine sustainability practices into infrastructure and supply chains was a big theme at this year’s show; I was excited that it felt like brands were doing the hard work to put complex new systems in place and genuinely reduce the industry’s environmental impact rather than hollow greenwashing that has become so ubiquitous.</p>\n<p>The first booth I photographed was Gates, who had almost too much great stuff on display. Everything was well chosen to show the scope of benefits that the carbon belt drive has to offer. Everyone in the Gates booth seemed to be named Martin, so I knew that it was Martin who had been responsible for both last year’s awesome selection as well as this year’s selection of bikes.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1432\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-123.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-123.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-123.jpg?resize=1024,733&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-123.jpg?resize=768,550&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-123.jpg?resize=1800,1289&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-123.jpg?resize=1335,956&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-123.jpg?resize=700,501&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-123.jpg?resize=1536,1100&amp;quality=75 1536w\" /></p>\n<h3>The Gates Carbon Drive Lavo Concept Bike</h3>\n<p>There was a concept bike! Not a pre-production prototype, or even a show bike but an actual concept bike! A 1:1-sized model bike made from wood and bits and bobs of foam and plastic and a smattering of actual bike parts for realism, is used to illustrate a possible future. It was fantastically weird and amazing to see. I thought that these kinds of 1:1 models only really happened in the world of cars. It was displayed on a gently rotating platform and cordoned off with a sign saying do not touch, mirroring the exact visual language of a car show which is an appropriate way to address Eurobike.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-126.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-126.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-126.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-126.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-126.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-126.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-126.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-126.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>By making a concept bike, Gates could display a machine that (while not currently achievable) is a visual representation of their aspirations for future cargo bikes that are unrestricted by the availability or even feasibility of certain parts. Part super sensible construction, part spacey constructivist design, and if I’m cynical part exercise bike, it succeeded in making me genuinely excited about an elevated chainstay, carbon drive electric cargo bike.</p>\n<p>How are those wheels made? I imagine they might be made with continuous carbon fibre filaments that run through the spokes hubs and rims like Lightweight wheels, but are even stronger due to the smaller diameter and massively fat spokes. But what about that cylinder in the back? Is that just a battery or is it some kind of hydrogen cylinder? I love the lights built into the tubes and the adjustment that can be made on the front and rear by presumably moving the top part over that thinner black section that separates it from the bottom.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-131.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-131.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-131.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-131.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-131.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-131.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-131.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-131.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>So spacey and cool! I want (a real, working) one! What would I carry? My kids, wearing those cool 3D printed Pettit Pli space suits to their Mandarin class, in a glass pyramid full of citrus trees at the center of a well-kept municipal park. The mutants never attack during the day but should a rogue raider surface and evade the authority bots to try and harvest my organs, I can easily outpace them without getting sweaty because it’s hydrogen-powered! While we’re in the future, let’s say it’s self-riding for additional safety, too! Concept vehicles are the best because they represent a utopia.</p>\n<p>That’s where I’d like to live.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1384\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-140.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-140.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-140.jpg?resize=1024,709&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-140.jpg?resize=768,531&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-140.jpg?resize=1800,1246&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-140.jpg?resize=1335,924&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-140.jpg?resize=700,484&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-140.jpg?resize=1536,1063&amp;quality=75 1536w\" /></p>\n<h3>The Very Real Gamux</h3>\n<p>The Martins of Gates also selected this Gamux downhill race bike, which I tried to pry away from the Hays stand the previous year to photograph to no avail. This year there were three of the available four Gamux bikes on display at different booths, all showing in various degrees of filth. I chose the Gates bike to photograph because Martin offered me some currywurst in the meeting room. What a bike! Lower slung than last year’s bike, and anodized black, the frame is constructed from a single CNC milled billet, with truss-filled I-beams replacing tubes.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-149.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-149.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-149.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-149.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-149.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-149.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-149.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-149.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>This year’s bike was also adorned with some black gaffer tape, which I speculate exists to cover secret carbon fiber box sections that fill the I beam to tune flex and twist. It’s a pretty cool construction method that would, in theory, allow for a few different scenarios. It could allow riders to fine-tune the flex in the front triangle to suit different courses, or to make the bike handle differently, or perhaps even to keep a similar degree of flex for more than one rider. The rear triangle was also machined from a single billet, which was very impressive bearing in mind its thickness.</p>\n<p>The belt bent back on itself over a pulley wheel, which wasn’t advised a few years ago, but following some testing is now very much on the cards and opens up a whole load of design options for use with a belt drive. I also noticed the funny little belt retaining shelf bracket bolted onto the rear axle which, given the recommended belt tension shows, how hard these bikes are designed to get ridden.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-161.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-161.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-161.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-161.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-161.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-161.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-161.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-161.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>Every bike on the Gates booth was rad in its own way and I could have just covered Gates for the whole article, but instead, I chose to cover five more marathons worth of ground for the next four days to really dig into Eurobike’s weirdness. Because to truly cover Eurobike, you must become the Eurobike.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1353\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-188.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-188.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-188.jpg?resize=1024,693&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-188.jpg?resize=768,520&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-188.jpg?resize=1800,1218&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-188.jpg?resize=1335,903&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-188.jpg?resize=700,474&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-188.jpg?resize=1536,1039&amp;quality=75 1536w\" /></p>\n<h3>The Brompton T Line</h3>\n<p>Down a floor or up a floor? At this point it’s all a big Esher drawing, so who knows? Wherever I was, I bumped into Kristine, a new friend from <a href=\"https://theradavist.com/brother-in-the-wild-dorset-2023-done/\" target=\"_blank\">Brother In The Wild Dorset</a> a few weeks earlier, working at the Brompton stand.</p>\n<p><em>What’s the best thing you’ve seen so far?</em></p>\n<p>I asked as we walked across the hall for coffee at SRAM.</p>\n<p>In response, Kristine wanted to know what was the weirdest thing I’d seen thus far.</p>\n<p>I didn’t really have a great answer because I’d barely landed and launched myself straight into the most mainstream hall Eurobike has to offer. It was a great question though, which I borrowed for the rest of the show.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1463\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-212.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-212.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-212.jpg?resize=1024,749&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-212.jpg?resize=768,562&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-212.jpg?resize=1800,1317&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-212.jpg?resize=1335,977&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-212.jpg?resize=700,512&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-212.jpg?resize=1536,1124&amp;quality=75 1536w\" /></p>\n<p>Back at the Brompton booth, I found myself getting excited about the new <a href=\"https://www.brompton.com/p/821/t-line-one-23\" target=\"_blank\">T Line</a>, especially in the context of an urban mobility show. I travel with a Brompton when I fly because it JUST fits within the hand luggage specified sizes (unless you fly from London City Airport where the scanners have been changed to just not accommodate a Brompton). It means if the airline decides that you can’t take it abroad as hand luggage for some reason, they usually check it for free. It means that when I travel, I have a bike to get around town, and sure, it’s not as nice to ride as an ordinary bike, but it’s a hell of a lot better than any city-hire bike.</p>\n<p>My Brompton is cobbled together out of bits of broken Bromptons from various bike shops I worked at, and it’s been going strong for 15 years, as the bike that I use when I need to duck into London, or even when I’m going out and planning to stay out, and I don’t want to leave a bike locked outside all night. Before that, when I lived on a boat in London and didn’t have any space; it was just my bike and I loved it.</p>\n<p>Sure, it rides like a funny little bike with small wheels and not enough front center or trail, but in town that’s actually pretty fun; the front carrying block and the available luggage for it are super useful and work well. It’s probably the best solution to urban mobility I’ve ever seen, at least in London, because of how seamlessly it integrates into existing systems of public transport and pokey little London flats. It’s far better designed than almost any other weird vehicle at the show under the ambiguous banner of urban mobility.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1420\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-203.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-203.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-203.jpg?resize=1024,727&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-203.jpg?resize=768,545&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-203.jpg?resize=1800,1278&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-203.jpg?resize=1335,948&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-203.jpg?resize=700,497&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-203.jpg?resize=1536,1091&amp;quality=75 1536w\" /></p>\n<p>The T Line is the first major redesign in a while. It’s much lighter, with not only a titanium main frame made in Sheffield but also a new carbon fork, cranks, stem, joints, Twizzlers, shifter, mech, elastomers, foldy wheels, bars, pedals, and pretty much everything. I took it for a little ride around, and beyond being lighter, it also felt more positive and together than my janky sticker-bombed Frankenbrompton. It feels like a genuinely excellent tool for urban mobility. Cites would be better places if every child was given one on their 14th birthday to get around on. That feels more manageable, and more realistic than everyone whizzing around on mismatched, and tricky/expensive-to-maintain lightweight electric vehicles.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1450\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-72.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-72.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-72.jpg?resize=1024,742&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-72.jpg?resize=768,557&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-72.jpg?resize=1800,1305&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-72.jpg?resize=1335,968&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-72.jpg?resize=700,508&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-72.jpg?resize=1536,1114&amp;quality=75 1536w\" /></p>\n<p>Go Go Gadget Gary!</p>\n<p>Waiting for flat white number five at the SRAM booth which was the epicenter of Thursday, I bumped into Gary Fisher.</p>\n<p><em>What’s the be…. No…… What’s the weirdest thing you’ve seen so far?</em></p>\n<p>He opened his weird little business cowboy hard plastic briefcase and got out a little 3D printed (everything at Eurobike is printed) plastic wind turbine, which looked to me like it was going to be a light or a horn or something.</p>\n<p><em>What is it?</em></p>\n<p>“I’m their first customer! I’m an early adopter!”</p>\n<p><em>What is it?</em></p>\n<p>“It’s a draughting sensor, so you can measure how good you are at draughting.”</p>\n<p><em>Okay…?</em></p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-17.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-17.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-17.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-17.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-17.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-17.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-17.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-17.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>It was actually kind of cool. There’s part of me that really enjoys the obsession with cycling data and the newly democratized science of dialing in, but another part of me that sees that as a separate hobby that can distract, and detract from actual cycling. I want to hate it but I’d also actually kind of love one to play with and try and measure my own drag, and to see what parts and positions I can use to reduce it. It was a fun toy, but on my rounds, I didn’t see the vendor despite knowing which hall they were in and making an effort.</p>\n<p>We talked about a bunch of things. Our mutual interest in lighting, and that Gary’s partner is weirdly from the same tiny tiny village on a tiny tiny island as my parents, which probably means that we’re low-key related in some way. I’ve met Gary a few times, and never had the chance to tell him that he was responsible for one of my all-time favorite bike parts… the “all work and no play is no good at all” top cap, so I took the opportunity…</p>\n<p>“Oh no, that wasn’t me.”</p>\n<p><em>What? I’ve bought two old Gary Fisher, full bikes JUST FOR THOSE TOP CAPS!</em></p>\n<p>“Yeah they’re great but I didn’t design them, that was Rick Valencenti. He used to work for me. He was great. He designed those. You have to give credit where credit’s due and that wasn’t me, that was him.”</p>\n<p>I struggled to make eye contact after that. I’d been lied to my whole life. It was a crushing blow to my ideas of who Gary Fisher was, and ultimately his contribution to cycling culture from my highly skewed point of view. We parted ways and I headed to the Fahrstil press party.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-24.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-24.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-24.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-24.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-24.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-24.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-24.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-24.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>20’s Plenty</h3>\n<p>Fahrstil is a German cycling culture magazine run by David Koßmann who I’d met the year before. Each year they put on a kind of themed party featuring a load of bikes that fit within an idea. This year’s iteration was centered around bicycles with 20” wheels. There was a pretty fun custom Saeco Cannondale Hooligan, a stainless Moulton, and my personal favorite, a custom Eerder Explorer, 20” wheeled Brompton. It’s a weird bike in a lot of ways because it comes partly made from an original Brompton, but with a new fork, a Pacenti crown that clears a 20” wheel and runs a disc brake, and a new rear triangle running the same as well as being wider to accommodate a regular rear hub with a cassette and derailleur. It folds down to not much bigger than a normal Brompton, (enough not to be airplane hand luggage size anymore) and has additional carrying capacity with steel bag mounts rather than the nylon Brompton ones.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-76.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-76.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-76.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-76.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-76.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-76.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-76.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-76.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>I left the show with Andrew, formerly of <a href=\"https://theradavist.com/tag/the-bicycle-academy/\" target=\"_blank\">The Bicycle Academy</a>, for dinner with the Two Tone and Cranked! communication crew which was lovely as always, before trying to check into my hotel. It was an exceptionally crappy hotel, the cheapest I could find, and therefore it was not unexpected for the check-in to be via a weird vending machine, which demanded that I type in an absurd amount of personal details, using a touch screen keyboard that didn’t work very well and was not laid out as a standard qwerty. After a significant period of bashing in letters and numbers, it tried to print a little paper access card key, but the task seemed insurmountable and after a few minutes it gave up. I called the emergency number taped to the inside of the glass door, but to my terror the emergency number was linked to a bike show security guard, moonlighting as an emergency hotel check-in guy. The funny little vending machine must have had a camera in it because somehow he knew who I was and therefore what he had to do. So the circles began…</p>\n<p>“You have to check in online”</p>\n<p><em>The online check-in says error and does not work.</em></p>\n<p>“Then check in using the machine to your left.”</p>\n<p><em>The machine says error and does not work.</em></p>\n<p>“Well then you’ll have to use the online check-in.”</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-73.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-73.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-73.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-73.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-73.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-73.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-73.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-73.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Some dweeb leaving the hotel left the door open enough for us to get in and charge our phones in the corridor, and call the booking agent who after some time told us to book another hotel. By this point it was about 2:30 in the morning and leaving arguably one of the grottiest hotels I’ve ever been in, in search of anywhere else to sleep, I became aware for the first time that Frankfurt has a red light district. Once all of the normal restaurants and bars in the area shut, Frankfurt’s red light district is more or less the city’s attempt at zoning crime. It’s one of the few places in Europe I’ve been genuinely afraid of walking around at night. With a huge needle exchange in its center surrounded by late-night off licenses and brothels, the streets are lined with bodies of people passed out, or waiting for one of the ambulances that would occasionally scream past to come and pick them up.</p>\n<p>We walked through the red light district looking for a hotel until about 4am when some harrowing con man let us sleep in his mediocre establishment for 480 euros before telling us that he’d inflated the price because of Eurobike and that normally it would be more like 200 euros. Aside from the padded door leading to the adjoining room, it was a normal hotel with a normal bed which was what I needed.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-48.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-48.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-48.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-48.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-48.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-48.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-48.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-48.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Trickstuff</h3>\n<p>Four hours later, after decimating the complimentary breakfast bar and stealing their entire basket of little pots of orange blossom honey to try and claw back some of the additional 280 euros I’d been charged, I cycled back through town for my second day of the show. On my way there, I realized that running around all day between meetings and trying to see the show, I’d forgotten to collect my press pass the previous day, and would have to re-enter the show in the same kind of slippery Lucas Brunelle way that I’d managed to get in the day before. The plan went smoothly. I arrived late and sweaty to my first meeting, but not as late as the person I was there to meet.</p>\n<p>At Eurobike everyone is late.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1352\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-51.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-51.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-51.jpg?resize=1024,692&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-51.jpg?resize=768,519&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-51.jpg?resize=1800,1217&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-51.jpg?resize=1335,902&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-51.jpg?resize=700,473&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-51.jpg?resize=1536,1038&amp;quality=75 1536w\" /></p>\n<h3>Myotragus Dorothea Enduro</h3>\n<p>The first booth I spent time at was the Trickstuff/Trumpf booth. Despite not really having any new products the Trickstuff booth seemed pretty packed for the entire show. There were a number of very very cool bikes and the first one I picked up was this Myotragus Dorothea downhill/enduro bike from Mallorca. The frame was completely raw with seemingly zero finishing, which I initially thought was something that they’d brought for the show, or a prototype or something, but as it turns out it’s actually just a finished bike.</p>\n<p>It caught my eye because it was aluminum, the least trendy material, which I enjoyed especially because it was on a booth with Trumpf, who makes printing machines, which seem to be the most in-vogue thing at the moment. With mismatched wheel sizes, a Pinion running a chain, and complex eccentric linkages, it’s a Spanish-built aluminum downhill bike that comes in custom geometries which I think is probably as niche as exists in cycling.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1378\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-104.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-104.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-104.jpg?resize=1024,706&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-104.jpg?resize=768,529&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-104.jpg?resize=1800,1240&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-104.jpg?resize=1335,920&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-104.jpg?resize=700,482&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-104.jpg?resize=1536,1058&amp;quality=75 1536w\" /></p>\n<p>Also on the Trickstuff Trumpf booth was Gustav’s (aka <a href=\"https://www.instagram.com/dangerholm/?hl=en\" target=\"_blank\">Dangerholm</a>) Scott Scale RC, built up fully rigid for him to use as a 90’s mountain bike. Essentially a flat bar gravel bike with big rubber, which is a lot of fun! The paint scheme is based on a 90s Porsche. Mounted to a subtly anodized Sturdy crank was his new DangerDward titanium chainring made in collaboration with Dward Design in the UK, to have the same pattern as a Porsche alloy wheel. Other standouts of the build were the integration of the Moonlight front light made in Gustav’s native Norway, with a cable running through the frame to a modified water bottle housing the battery, Sturdy printed disc lockrings, and the insanely lightweight Syncros wheelset, that featured very similar construction to Lightweight wheels.</p>\n<p>Dangerholm wearing tiny cutoffs and showing a super lightweight bike is part of the course of Eurobike but what I especially enjoyed about photographing this bike, is not really needing to be shown around, which kind of left us both with a bit of downtime. I’ve met Gustav a few times but only at shows and stuff, Having finished the bike in the early hours of the morning before the show he hadn’t really had any time to look at the finished bike until now.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-92.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-92.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-92.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-92.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-92.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-92.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-92.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-92.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>It’s like when the bride and groom go with the photographer to take photos at a wedding, it’s often the only time they actually get to spend together.</p>\n<p>“It’s really the first time I’ve seen it outside completely finished.”</p>\n<p><em>Okay, now could you gaze lovingly into each other’s eyes for me?….. I’m kidding.</em></p>\n<p>We talked about real stuff. About Eurobike being the hardest and most physical endurance event of each of our years. About having other interests besides just cycling, about slowly becoming bike guys rather than cyclists, and about mourning the loss of freedom to just ride bikes for fun on any given Monday morning or a Wednesday afternoon.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-86.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-86.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-86.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-86.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-86.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-86.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-86.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-86.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>Although they are not the kind of handmade bikes I usually focus on, in that the frames are pretty much just popped out of a mold in Taiwan, the level of detail and enthusiasm that Gustav puts into each build is something I really appreciate. The consistency of enthusiast-level focus on details, coupled with actual means and ability to do each part to an incredibly high standard. Consistently building “dream builds”—which are tastefully relevant and work together in showing a house style—is a rare combination that deserves to be celebrated.</p>\n<p>Look beyond the short shorts and there’s a pretty nerdy and super nice Norwegian guy, assembling bikes outside of the established genres of purpose and style, with all the care and attention of a sculptor, that strives to encapsulate a utopia that adds color to the collective consciousness of “the bike industry.”</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1350\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-105.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-105.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-105.jpg?resize=1024,691&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-105.jpg?resize=768,518&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-105.jpg?resize=1800,1215&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-105.jpg?resize=1335,901&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-105.jpg?resize=700,473&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-105.jpg?resize=1536,1037&amp;quality=75 1536w\" /></p>\n<p>Walking back into hall 12, I was stopped in my tracks by two guys sitting outside on a cast concrete bench smoking. Time stood still and Josh Weinberg’s words echoed in my head as if they were delivered by the force ghost of Han Solo*.</p>\n<p>“Show us all the weird stuff Petor…… show us all the weird stuff…….. The weird stuff….. weeeeeeeeird”</p>\n<p>Weinberg’s force ghost, for some reason 2D, spiraled up into the sky and became invisible as it echoed the final.</p>\n<p>“Weeeeeeird”</p>\n<p>I left Gustav with his bike, mid-sentence.</p>\n<p>“It’s okay I can take this back. I’ll see you later. Do you want me to take your cup back?”</p>\n<p>(That’s right, Dangerholm is actually so nice, that he made a detour to take my coffee cup back to the DT Swiss booth so that I could stay outside and photograph some strange vehicle that defies logic or proportion.)</p>\n<p><em>(*Han Solo is not a force ghost. When Kylo talks to him he says “You are just a memory.” The Han talking to Kylo is Kylo’s imagination, of the last time they interacted. The last time Josh and I interacted he asked for the weird stuff. It was via Instagram messenger so I didn’t physically see him, so in some ways, the real Weinberg is a ghost in the ether.)</em></p>\n<p>Stick with me, I promise this is relevant: Remember when Vice used to be a small free magazine that you used to pick up from an awkward-looking guy, as you leave a party, as part of a goody bag full of tat? Before they were wholesale media merchants before all of the stories on Vice TV were “middle-class white guy in south London goes to the supermarket….. But on acid” or “girl with tattooed eyeballs visits an old tattoo guy and has zero hot takes on that.” If you’re age’d enough to remember the first and fun iterations of the magazine, you’ll remember the only part of it I ever read, the centerfold. Consisting of a number of black and white photos of people wearing weird outfits at parties, and then a comedy two or three-sentence critique of those outfits.</p>\n<p>So, when Josh told me to find the weird stuff, I desperately wanted this article to be that. The reality of that is, however, having spent a lot of time making the weird stuff, I know the dedication that goes into making it. Even if it comes out of a low-grade factory in Korea, there are people making this stuff and the work that goes into it is considerably more than the work that goes into planning an outfit for a party, so I can’t in good conscience be Vice-cruel about it.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-108.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-108.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-108.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-108.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-108.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-108.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-108.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-108.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<h3>Komobike EH9</h3>\n<p>However…. Oh lord, what was this thing? It’s like the design brief was “subvert bicycle to the most extreme degree possible, without using AI or changing the number of wheels.” Holy hell. When I look at it, all I see is the landfill of the near future, and by near I mean by the time this article is published. As a starting point, hubless wheels are bad. Just objectively a terrible idea, as evidenced by the fact that pretty much every wheel on every wheeled vehicle of any kind uses a hub. It means that the rims weigh significantly more than needed, have way more parts, cost more and are less reliable, and trickier to service. I really struggle to see the benefit.</p>\n<p>The front wheel is attached to a modified all (mild) steel low travel suspension fork, adorned with an ornamental pressed mild steel brake caliper and a little fold-out plastic mudguard. The main frame was made from a generic aluminum extrusion which could have housed the battery but didn’t. The extrusion was bolted to a couple of proprietary cast alloy parts which had seemingly no regard for engineering, holding a bottom bracket motor, designed to be interchangeable with a Pinion gearbox (for when you need to downgrade your Pinion-equipped bike to a single-speed with an electric motor?) and a massive pivot for the rear suspension. The pointlessly large diameter pivot point also had a centerless design, preventing the use of available cartridge bearings which isn’t really a problem seeing as this bike will never be serviced, and that the rear suspension is prevented from actuating by the seatpost being rammed into the motor housing…</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-112.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-112.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-112.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-112.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-112.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-112.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-112.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-112.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>But what I really wanted to know was: does it fold.</p>\n<p>“No.”</p>\n<p>And why would it? I especially enjoyed the upside-down acrylic display plaques taped to the second battery on the rear rack. As if this thing was designed to last longer than the mileage provided by one battery, or is suitable for carrying anything. I also enjoyed watching the bike’s chaperone struggling to lift it up and down the tall curb to the spot I’d picked for photos. I could have helped. I <em>should</em> have helped, but I’m no Dangerholm. Almost the scariest thing about the Komobike eh9 is that having photographed this one, I saw another two on different booths around the show…</p>\n<p><em>Stay tuned for Part 02 of Petor’s Eurobike coverage tomorrow where we’ll see more bikes that look like bikes, Petor’s speculations on the future of mobility, and—of course—more of the Weird Stuff! </em></p>\n<p>The post <a href=\"https://theradavist.com/eurobike-2023-recap-gallery-01/\">Folding Bikes, Weird Sights, and Crashing Eurobike Part 01</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"e4952a3a8ebed13fdcd0943f240d32e06578714d8183da31fcabe230c9c470db","category":"Cycling"}