{"title":"Reversal of Autism among Dizygotic Twins through a Personalized Lifestyle and Environmental Modification Approach: A Case Report and Review of the Literature","link":"https://www.preprints.org/manuscript/202405.0091/v1","date":1714644275000,"content":"The prevalence of autism has been increasing at an alarming rate. Even accounting for the expansion of autism spectrum disorder diagnostic (ASD) criteria throughout the 1990’s, there has been an over 300% increase in ASD prevalence since the year 2000. The often debilitating personal, familial, and societal sequelae of autism are generally believed to be lifelong. However, there have been several encouraging case reports demonstrating reversal of autism diagnoses with a therapeutic focus on addressing the environmental and modifiable lifestyle factors believed to be largely underlying the condition. This case report describes the reversal of autism among dizygotic, female twin toddlers and provides a review of related literature describing associations between modifiable lifestyle factors, environmental exposures, and various clinical approaches to treating autism. The twins were diagnosed with Level 3 severity ASD “requiring very substantial support” at approximately 20 months of age following concerns of limited verbal and non-verbal communication, repetitive behaviors, rigidity around transitions, and extensive gastrointestinal symptoms, among other common symptoms. A parent-driven, multidisciplinary, therapeutic intervention involving a variety of licensed clinicians focusing primarily on addressing environmental and modifiable lifestyle factors was personalized to each of the twin’s symptoms, labs, and other outcome measures. Dramatic improvements were noted within several months in most domains of the twins’ symptoms, which was manifested in reductions of Autism Treatment Evaluation Checklist (ATEC) scores from 76 to 32 in one of the twins and from 43 to 4 in the other twin. The improvement in symptoms and ATEC scores has remained relatively stable for six months at last assessment. While prospective studies are required, this case offers further encouraging evidence of ASD reversal through a personalized, multidisciplinary approach focusing predominantly on addressing environmental and lifestyle risk factors.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e49a0807e3494820d100caea9f9de56221dad949d4f1eabaf1464ed5fa869841","category":"Interdisciplinary"}