{"title":"Velo Orange Utility Bar and Rack Review – Nic Morales","link":"https://theradavist.com/velo-orange-utility-bar-and-rack-review/","date":1699890664000,"content":"<p><em>The Velo Orange <a href=\"https://velo-orange.com/products/riser-utility-bar?_pos=3&amp;_sid=7fb2ba9f5&amp;_ss=r\" target=\"_blank\">Utility Bar</a> and <a href=\"https://velo-orange.com/products/utility-rack\" target=\"_blank\">Utility Rack</a> are companion products where the rack component mounts directly to either a flat or riser handlebar. In his review of the Utility combo, <a href=\"https://www.instagram.com/morajez/?hl=en\" target=\"_blank\">Nic Morales</a> writes about the refreshingly simple nature of the design, and his impressions of the setup for bikepacking, commuting, and even on a mini-velo.<span></span></em></p>\n<p>It’s easy to get stuck in the cycling bubble. Imagining the average person has experience with, or even cares about, different handlebar setups is evidence of that myopia. Assuming that “drop bar” is a universally understood descriptor is a further sign of being endemic to a specific side of cycling culture. In all probability, most cyclists understand the act of riding a bike through the comfort and familiarity of a flat bar. From kiddo cruisers to beater commuters, e-bikes, and mountain bikes, the flat bar seems to be a far more popular component than its droopy-ended cousin when you think about the full spectrum of bike designs. The <em>why</em> behind that reality might be a more complicated question than I’m prepared to answer, but if the idea is to get more folks on bikes, cyclists and the purveyors of their increasingly complex products have to understand where most users are coming from.</p>\n<p>Enter the <a href=\"https://velo-orange.com/products/utility-rack\">Utility Bar and Rack</a>. Like many effective designs, it doesn’t necessarily call attention to itself at first glance. Made from cromoly steel, the Utility Bar, from Velo Orange, comes in two iterations– flat and riser. Both are a modest 780 mm wide, combine 15° of back sweep with 2° of rise, and come in a black or silver finish. For the purpose of this review, I installed the riser option, with the companion rack, on a Velo Orange Pass Hunter.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/utility-rack-5-1.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/utility-rack-5-1.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/utility-rack-5-1.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/utility-rack-5-1.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/utility-rack-5-1.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/utility-rack-5-1.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/utility-rack-5-1.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/utility-rack-5-1.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Setup</h3>\n<p>The Utility Riser Bar and Utility Rack are both simple. Where the brilliance sits is between. The rack component mounts directly to either companion flat or riser bar with commonly used M5 bolts (aka the same ones used on the vast majority, if not all, water bottle cage mounts), in two distinct mounting configurations. No fork crown or strut fiddling is required. Once secured, the Utility Bar and Rack combo becomes an easy-to-use, out-of-the-way option for most of the bikes in existence. The bars feature a stem clamp diameter of 31.8, and a grip diameter of 22.2,  making it consistent with most modern offerings. The bar and rack weigh a combined 1245 grams, at 699 g and 546 g respectively.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/utility-rack-7-1.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/utility-rack-7-1.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/utility-rack-7-1.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/utility-rack-7-1.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/utility-rack-7-1.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/utility-rack-7-1.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/utility-rack-7-1.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/utility-rack-7-1.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Use</h3>\n<p>As someone who’s spent a fair bit of time strapping things to their bike, I know the equation can be more complicated than it appears. On my<a href=\"https://velo-orange.com/blogs/theveloorangeblog/southern-peaks-bike-tour\" target=\"_blank\"> Southern Peaks Tour</a>, for example, I wanted to run my Swift Zeitgeist bag off the front, ideally rack-less (the thinking here being the less added to the bike, the less that can go wrong). However, it didn’t quite clear the front tire given how aggressively I tend to run my stem. The obvious solution was to run a small support rack bolted through the fork– easy, right? In theory, sure. In practice, not so much. A while back, I’d opted for Rodeo Labs’ Carbon Spork to shed some weight. While it’s a great fork and one of the only carbon offerings rated to actually support a modest rack, you never really know with carbon. That sense of anxiety on a self-supported, solo endeavor through the rural South didn’t sit well. In addition, I planned to use the bolts on the fork blades for water storage given my inner triangle was taken up by a full frame bag.</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/utility-rack-2-1.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/utility-rack-2-1.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/utility-rack-2-1.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/utility-rack-2-1.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/utility-rack-2-1.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/utility-rack-2-1.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/utility-rack-2-1.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/utility-rack-2-1.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>You see what I’m getting at. The calculus of putting things on your bike can range from simple arithmetic to quantum mechanics based on the bike, its size, your intention, etc. Not only does the Utility combo simplify that by integrating the rack into its design, but it’s also one of the few racks on the market that doesn’t require a formal initiation into the world of bikes. With an L-shaped cradle-like design that can be used in two different mounting positions, how one might store things on the rack is self-evident. In either position, the rack is rated to support up to fifteen pounds when using all four mounting points. Having two distinct mounting positions isn’t just a minor tweak, either. It’s a quick and easy change that can make all the difference as to whether whatever you’ve decided to throw on makes it home in one piece.</p>\n<p>Rando racks and newer options from the likes of Tailfin and Old Man Mountain, for example, are, by all accounts, fantastic. They offer relatively niche solutions to experienced cyclists who know exactly what they need for their bikepacking and bike storage-related needs. More than likely, they have the bags, and straps, and buy said products with a preconceived notion as to how they’re going to use them. The Utility Rack doesn’t make such assumptions. With a six-dollar cargo net I nabbed from my local outdoor store, I’ve been able to haul loads of unorthodox items.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/utility-rack-6.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/utility-rack-6.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/utility-rack-6.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/utility-rack-6.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/utility-rack-6.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/utility-rack-6.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/utility-rack-6.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/utility-rack-6.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Fit and Feel</h3>\n<p>While the Utility Bar and Rack combo seems to violate the golden rule often espoused by experienced bikepackers, (i.e. your heaviest items should sit near the bottom of the bike) my experience with the system seems to offer some wiggle room. While it wouldn’t be my first choice on a singletrack-heavy tour, a fully loaded front rack doesn’t make its use a drag. My initial experience with the system was with the <a href=\"https://theradavist.com/velo-oranges-neutrino-a-minivelo-with-big-capabilities/\" target=\"_blank\">Velo Orange Neutrino</a>– what I’d argue is the ideal use case. Because mini-velos tend to have twitchier, squirrlier handling, the weight of even a light front load mellowed out the bike in all the best ways.</p>\n<p>Since my time on the Neutrino, I’ve migrated the parts over to a commuter build stemming from their Pass Hunter frame. With the aforementioned carbon Spork, the handling isn’t significantly affected until I surpass the 10+ pound weight mark, but, even then, because the load sits toward the center of the steering axis, the handling is largely slowed– not unwieldy.</p>\n<p>The most significant critique I can level at the rack is with regard to lighting. Because the bars angle toward the center, attaching generic Garmin-style mounted lights is awkward and sometimes entirely impractical with a bag in the way. The “bottom” and “top” of the rack each have a mounting spot for a dynamo-specific lighting system, but you’ll need to get creative with your standard lights in order to fit it here.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/utility-rack-4-1.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/utility-rack-4-1.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/utility-rack-4-1.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/utility-rack-4-1.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/utility-rack-4-1.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/utility-rack-4-1.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/utility-rack-4-1.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/utility-rack-4-1.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>While bikepacking is perhaps an all-too-obvious idea for this bar and rack system, where I feel it really shines is in the world of commuting. And that’s the crux of it. I’m grateful for all the acquired knowledge the alt-cycling, adventure / bikepacking community has bestowed upon me, but it’s great when a product can be used without much in the way of tangible experience. As clear of an idea as many of us have of what a cyclist is, the reality is that anyone who has ever ridden a bike is in some way a cyclist.</p>\n<p>Despite my best efforts, I can’t help but be romantic about bikes and their components. When I see a product like this one, I don’t just see it as a tool a relatively privileged person like myself can use. I see it twenty years down the line. I see it in Craigslist ads and Facebook marketplace listings, attached to old Rockhoppers and bikes of the day. Flowing down the river of well-made, thoughtful cycling products whose use shines through long after their marketing campaigns have been lost to the sands of time. Every time I see someone perilously balancing their belongings in old grocery bags on either end of their bars, it makes me think of how much a simple tool like this could help them and perhaps ease their journey toward bikes as tools for good.</p>\n<p>While the combo isn’t necessarily priced for all, its scope of use appears almost universal, be it on an entry-level commuter from Canyon, or something found at a local bike shop. And, not having to play the game of expensive musical chairs some bike shops are more than happy to entertain in switching between drop and flat bar controls, along with unorthodox adjustments, is what the Utility combo allows for.</p>\n<p><img loading=\"lazy\" width=\"1999\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/utility-rack-3-1.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/utility-rack-3-1.jpg?w=1999&amp;quality=75 1999w, https://media.theradavist.com/uploads/2023/11/utility-rack-3-1.jpg?resize=1024,683&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/utility-rack-3-1.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/utility-rack-3-1.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/utility-rack-3-1.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/utility-rack-3-1.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/utility-rack-3-1.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>A relatively common use case is for those with smaller bikes. Extra-Small, Small, and sometimes even Medium framesets will often lack the appropriate clearance/frame space for modern racks and bags to fit comfortably. The inherent benefit of a flat bar is it breaks free of the bag width limitations often imposed by drop bars. Add on the mounted rack and almost any bike can run the Carradice-style bags we’ve seen come back in vogue. Perhaps all too idealistically, I think about the possibilities of what this could achieve if, for example, this rack came standard on an entry-level build. Whether the first owner uses it as intended, or the bar and rack combo finds its way to someone who sees its function in their life, more practicality in bikes is a way to ensure a widening of the cycling diaspora.</p>\n<p>Ultimately, I think of people who have asked me what bike they should get. I think about my mom. I think about someone who can’t or doesn’t want to spend hundreds of dollars on a bike-specific bag. Make no mistake, there are a myriad of small-time makers with fantastic products that solve so many problems irrespective of cycling experience. However, they often exist as part of the culture of cycling. And that’s good. I would like to live in a world where I never find a Fab’s Chest at Walmart. But the Utility Rack and Bar offer a little better bang for your buck simply by making bikes of virtually any make or model more practical. The more people there are using bikes, the closer we are to a better world. It might be far-fetched to suggest this rack and bar combo can change the world, but it might do well to carry forth that lofty expectation.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/utility-rack-1-1.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/utility-rack-1-1.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/utility-rack-1-1.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/utility-rack-1-1.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/utility-rack-1-1.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/utility-rack-1-1.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/utility-rack-1-1.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/utility-rack-1-1.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Pros</h3>\n<ul>\n<li>Comes in flat or riser variants</li>\n<li>Simple install</li>\n<li>Easy to use without bike-specific equipment</li>\n<li>(pretty much) Universal fit</li>\n</ul>\n<h3>Cons</h3>\n<ul>\n<li>More expensive than just a rack</li>\n<li>Mounting lights can prove tricky</li>\n<li>Not cheap</li>\n</ul>\n<p>The post <a href=\"https://theradavist.com/velo-orange-utility-bar-and-rack-review/\">Velo Orange Utility Bar and Rack Review</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"e4a2c8afe08d49fea4d50efdeeb7441b7bccbf887c8580641a22ddf7e2293c21","category":"Cycling"}