{"title":"Laparoscopic Placement Of Peritoneal Dialysis Catheter – A Decade Of A Tertiary Single Center Experience","link":"https://www.preprints.org/manuscript/202405.1846/v1","date":1716890457000,"content":"Abstract:. Background/Objectives: Peritoneal dialysis as a form of renal function sub-stitution is not as widespread as hemodialysis. \nHowever, it has recognized advantages such as preservation of the residual renal func-tion, no need for vascular access , can be performed at home, but requires a proper in-sertion of a peritoneal dialysis (PD) catheter and maintaining its patency.\nMethods: We presented a 10-year retrospective study  on a group of 133 patients hos-pitalized for peritoneal dialysis catheter insertion/replacement.\nWe routinely implant the catheter laparoscopically, but there were cases in which the insertion was performed open route.\nWe analyzed the patient group by age and gender criteria, number of complications and time when they appeared, duration of surgical intervention and the surgical technique used (126 were performed laparoscopically and 7 were inserted via open route). The open technique was performed mainly in patients with contraindications of general anesthesia.\n Results: We encountered a number of 23 complications in 18 patients, in only 1 case the patient was switched to permanent hemodialysis (at his own wish).\nWe highlighted in the study the indisputable advantages of laparoscopy, supported by the results obtained: correct placement of the catheter, the possibility of adhesiolysis, preservation of the peritoneal surface through minor op-erative trauma, low number of complications(bleeding, migration, hernia 0,8%,  leakage 4%, lower than those found in the literature). Even if infection was the most frequent complication  (peritonitis 35%, catheter exit site infection 30.4%), only 1 case appered in the pretraining period. \n All complications were managed by medical treatment or by temporary cessation of peritoneal lavage, except of two cases that required reimplantation of the catheter. \nConclusions: Laparoscopic catheter insertion for PD is a safe method, with reduced post-procedural complications, thus ensuring a long duration of the functionality of the catheter.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e4a93be5810cb735d8170e15ab40f4a59e167308512e85e3e8d297deab969f1e","category":"Interdisciplinary"}