{"title":"Cutaneous Anthrax: A Case Report from Al-Muthanna Governorate, Iraq","link":"https://www.preprints.org/manuscript/202407.2448/v1","date":1722328125000,"content":"Anthrax is a severe acute zoonotic disease of herbivores caused by Gram-positive, anaerobic, spore-forming bacteria. It is transmitted via direct contact with sick farm animals or those who have died of Anthrax. This study intends to present a cutaneous form of Anthrax in a 36-year-old woman suffered from a painless ulcer on her thumb five days after handling a head of sheep. The lesion started as a small papule that developed as a painless vesicular blister on the dorsal exterior surface of the right thumb. However, upon clinical investigation, the patient showed an absence of fever, lethargy, and pain. Swabs were collected and examined according to conventional microbiological tests. Direct smear revealed a Gram-positive bacilli that showed spore formation resembling B. anthracis. Nutrient agar, 5% sheep blood agar, and PLET agar were streaked by the swab. Other swabs were inoculated into the peptone water. All cultured media were inoculated at 37 oC for 24 hours. The morphology of growing colonies was examined, while the biochemical tests were done to identify the isolated bacteria, including a motility test and antibiotic sensitivity. The results of this study approved the existence of Bacillus anthracis by microbiological analyses. Accordingly, cutaneous form of anthrax was diagnosed, and specific systematic and local treatments were provided for the patient. In conclusion, this study confirmed the diagnosis of cutaneous Anthrax, a highly contagious disease that needed early detection and more attention and awareness should be taken when handling animal products.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e4b30aa9ee1d53b68e658c2b14c1cad1844792df4d99ff3f91cf74cfa1e150d5","category":"Interdisciplinary"}