{"title":"Dietary Supplementation of Pistacia lentiscus L.,: An Hepato-protective Potential Against 7,12-dimethylbenz(a)anthracene Carcinogen in C57BL/6 Mice, Alongside In Vitro Anti-Cancer Efficacy","link":"https://www.preprints.org/manuscript/202409.1480/v1","date":1726739323000,"content":"The pervasive presence of atmospheric pollution, particularly polycyclic aromatic hydrocarbons such as 7,12-dimethylbenz(a)anthracene, instigates aberrant cellular and tissue conditions, precipitating oxidative damage and inflammatory cascades conducive to the onset of cancer, notably mammary cancer. Given the hepatic metabolism of 7,12-dimethylbenz(a)anthracene, liver damage can be found and the imperative of employing natural antioxidants becomes apparent. In this study, we first showed that 7,12-dimethylbenz(a)anthracene-intoxication escalates body weight, disrupts lipid profiles, and incites serum oxidative damage. Concurrently, hepatic and renal oxidative stress ensue, accompanied by heightened antioxidant enzyme activity in the 7,12-dimethylbenz(a)anthracene-exposed group compared to controls (p&amp;lt;0.05). Interestingly, P.lentiscus co-administration rectifies biochemical imbalances, significantly attenuates oxidative stress aberrations, and augments antioxidant enzyme responses (p&amp;lt;0.05). Importantly, histological analysis evinces P.lentiscus's shielding effect against 7,12-dimethylbenz(a)anthracene induced hepatocyte injury and steatosis. Furthermore, our investigations unveil P.lentiscus’s anti-proliferative efficacy against different human breast cancer cell lines. Thus, our findings underscore P.lentiscus‘s robust anti-proliferative, antioxidant, and hepato-protective capacities, mitigating metabolic disturbances, oxidative stress propagation in liver and kidney functions, and potential histological alterations, thereby impeding 7,12-dimethylbenz(a)anthracene induced mammary cancer initiation. We posit that P.lentiscus may serve as a prophylactic agent against breast cancer and liver oxidative damage instigated by this carcinogen.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e4b80a76df16d212f0ea25f26f26f6de193f6703a2739ffb85389551d1c88b95","category":"Interdisciplinary"}