{"title":"Climate-induced reduction in metabolically suitable habitat for U.S. northeast shelf marine species","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000357","date":1714053600000,"content":"<p>by Emily Slesinger, Hubert du Pontavice, Brad Seibel, Vincent S. Saba, Josh Kohut, Grace K. Saba</p>\r\n\r\nThe U.S. northeast shelf (USNES) has been experiencing rapid ocean warming, which is changing the thermal environment that marine species inhabit. To determine the effect of current and future ocean warming on the distribution of five important USNES fish species (Atlantic cod [<i>Gadus morhua</i>], black sea bass [<i>Centropristis striata</i>], cunner [<i>Tautogolabrus adspersus</i>], spiny dogfish [<i>Squalus acanthias</i>], summer flounder [<i>Paralichthys dentatus</i>]), we applied species-specific physiological parameters from laboratory studies to calculate the Metabolic Index (MI). The MI for each species was calculated across a historical (1972–2019) and contemporary (2010–2019) climatology for each season. Broadly, the oceanic conditions in the winter and spring seasons did not limit metabolically suitable habitat for all five species, while portions of the USNES in the summer and fall seasons were metabolically unsuitable for the cold water species (Atlantic cod, cunner, spiny dogfish). The warmer water species (black sea bass, summer flounder) experienced little metabolically suitable habitat loss, which was restricted to the most southern portion of the distribution. Under a doubling of atmospheric CO<sub>2</sub>, metabolically suitable habitat is projected to decrease substantially for Atlantic cod, restricting them to the Gulf of Maine. Cunner are projected to experience similar habitat loss as Atlantic cod, with some refugia in the New York Bight, and spiny dogfish may experience habitat loss in the Southern Shelf and portions of Georges Bank. In contrast, black sea bass and summer flounder are projected to experience minimal habitat loss restricted to the southern inshore portion of the USNES. The utility of using MI for co-occurring fish species in the USNES differed, likely driven by species-specific physiology and whether the southern edge of a population occurred within the USNES.","author":"Emily Slesinger","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"e4ba079ecefa71b35d9084751b8e2d315b452268ea1cf739a8aa6d1223e16d1f","category":"Environment"}