{"title":"Effects of Icon Grouping based on Familiartity on Search Times and Eye Movements","link":"https://www.preprints.org/manuscript/202408.0152/v1","date":1722588302000,"content":"This study investigated the effects of icon familiarity on visual search performance. An equal number of familiar and unfamiliar icons were selected as background icons. These background icons were randomly arranged, and a visual search experiment was conducted to locate the target icon. The results showed no significant difference in the time required to find the target icon, regardless of whether the target icon was familiar or unfamiliar. This finding contrasts with previous studies that have suggested a positive effect of target icon familiarity on visual search performance, indicating that the influence of target icon familiarity may not always be consistent and could depend on the characteristics of the background icons. However, when background icons were grouped based on their familiarity, the time taken to locate the target icon was significantly reduced compared to when the icons were randomly arranged. To understand the underlying mechanism of this effect, participants' gaze fixation times were observed. The results revealed that participants spent more time fixating on areas where the target icon was located, rather than on areas without the target icon, suggesting a more efficient visual search process. Moreover, the shorter the visual search time, the higher the proportion of time spent fixating on the area containing the target icon. Additionally, this study examined the contrast ratio between the color of the background space and the dominant color of the target icon, comparing it with the visual search time. The findings indicated that as the contrast ratio increased, the visual search time decreased.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e4bb913e10753cc11e05261546eaf8f3491811ebd7a449767039850ca498aac8","category":"Interdisciplinary"}