{"title":"Comparative Study for DC-DC Converter Output Bank&rsquo;s Reliability Evaluation using Prediction Standards MIL-HDBK-217F vs. TelcordiaSR-332","link":"https://www.preprints.org/manuscript/202406.1814/v1","date":1719382801000,"content":"In the last decade, a higher level of reliability became a compulsory demand when it comes to modern DC-DC converters. This work addresses the main reliability metrics: the failure rate λλ and MTBF of an output capacitor bank used within a high current low voltage buck converter due to many studies have shown that the output capacitor bank was demonstrated being the most critical component within the converter. Many authors treated this issue, usually by doing reliability predictions. The majority of the papers use only one specific Standard Prediction to solve the problem. Herein calculation was done using both the older standard MIL-HDBK-217 and the latest one Telcordia SR-332, providing a benchmark comparison between the two which is a helpful tool for the output capacitor selection in the early stage design. Military standard was well accepted for decades in order to reliability prediction even on industrial electronics and is still used today under a critical manner because no more update after the latest version MIL-HDBK-217F - Notice 2 released in 1995. Since then, newer prediction standards had appeared in the electronics reliability market. Over time, this standard was mostly used but it does not accurately model the reliability because lack of taking account of mission profile. The above-mentioned newer standard – i.e., Telcordia SR-332 is trying to compensate also the lack of the newest component technology in the older standard (which is the first standard released on the market) supplying useful design data for design engineers who use the so-called “design with the reliability in mind” concept. Within the paper were established the environmental condition for the passive components by means of a PoL (Point of load) buck converter that is used for both calculation methods. The influence of temperature and several specific concepts like reference conditions, operating conditions, ripple, and internal self-heating were taking account in order to display the results. The temperature for the capacitor’s capsule needed in πT stress factor calculation was derived by PSPICE simulation. High fidelity and dedicated SPICE models provided by the manufacturer were used for MOSFETs, polymer electrolytic, and MLCC capacitors that compose the converter.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e4be6ba9fb21a859eaf3524b20813aa075fe2d07c5baa83b340a4b7c9fe4c994","category":"Interdisciplinary"}