{"title":"CarPlay Not Working for Some iPhone 15 Users, Possibly Because of USB-C Cables","link":"https://www.macrumors.com/2023/09/29/iphone-15-carplay-issues/","date":1696022852000,"content":"<a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a> is not working as expected for some <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> users, an issue that is likely linked to the transition to USB-C. There are multiple complaints <a href=\"https://forums.macrumors.com/threads/iphone-15-not-working-with-wired-carplay.2404203/\">from <em>MacRumors</em> readers</a> and Reddit users who are unable to get ‌CarPlay‌ to work with their new devices.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/CarPlay-SharePlay.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nCable type and available port options are a common theme in the ‌CarPlay‌ reports, with many of the functionality problems linked to USB-A to USB-C cables. Many cars, even some that are more recent, have only USB-A ports and not USB-C ports, so a USB-A to USB-C cable is required.\r<br />\n\r<br />\nUnfortunately, it appears that not all USB-A to USB-C cables on the market will work, and some that work in certain vehicles will not work in others. A Reddit user explains:<blockquote>I got in my car this morning and plugged my phone in with a USB-A to USB-C cord in order to use Carplay, and found it does not connect. It charges, but no Carplay. In my Carplay settings on my phone, it says the name of my car as if it were connected, but nothing shows up on the screen.\r<br />\n\r<br />\nI work at a dealership so I tried it in a bunch of different cars and nothing worked. My car doesn't have any USB-C ports, so I tried the Apple-supplied C to C cable in a 2023 model and it worked no problem. So it seems that either USB-A to USB-C does not allow Carplay, or it simply does not work anymore with non-Apple chargers.</blockquote>Other ‌CarPlay‌ users chimed in and mentioned having the same problems, though some were able to get ‌CarPlay‌ to work with USB-A to USB-C cables like those from Belkin. Several people had success getting ‌CarPlay‌ working with a USB-A port using <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2FBelkin-Charge-Type-C-Note10-Nintendo%2Fdp%2FB08557ZVLV\">Belkin's BoostCharge USB-A to USB-C cable</a>, but others had no luck.<blockquote>Having tried 2 good quality cables I called Apple Support about this. They proceeded through various potential remedies which didn't work. The call ended with me agreeing to try the cable supplied with the phone, after getting a suitable adaptor. When I got home I tried 4 more cables. 3 of them worked, these being ones from Sony, Samsung and Nintendo (I think). Today I tried the Apple cable + adaptor and that works as well. The good quality cables (3 of) all previously gave me no problems, mainly charging but also a high speed PC to VR headset connection. iPhone to Windows PC connection worked fine with one of them (I could connect to my phone in iTunes). I suspect that there is a specification point that the 3 \"good quality\" cables have missed. If so, I don't know if it is the car or the iPhone that is particular about this spec. point!</blockquote>Trying a variety of cables, specifically those from known brands and with data transfer support, seems to be the best way to get ‌CarPlay‌ to work, but it is worth noting that some people have not been able to get ‌iPhone 15‌ ‌CarPlay‌ to work <a href=\"https://www.reddit.com/r/CarPlay/comments/16qk5hr/iphone_15_carplay_not_working/\">even with</a> Apple's adapters and cables. From Reddit:<blockquote>I have the exact same problem. Have tried (and bought) several different high quality cables, nothing works. Been through all the troubleshooting scripts and AppleCare+. Seems like either an iPhone 15 or an iOS 17 problem.</blockquote>One <em>MacRumors</em> reader that contacted us said that the issue had been reported to Apple and that Apple is working on a fix for the problem. Apple could perhaps implement a software update that improves compatibility with some cables, or the company could better explain which USB-C cables will work with the new iPhones.\r<br />\n\r<br />\nWhile most of the complaints have been from car owners who are limited to USB-A connection ports, there <a href=\"https://forums.macrumors.com/threads/iphone-15-not-working-with-wired-carplay.2404203/?post=32553705#post-32553705\">are also reports</a> from some who have vehicles with USB-C ports and even some complaints about wireless ‌CarPlay‌. One <em>MacRumors</em> thread suggests that VPNs <a href=\"https://forums.macrumors.com/threads/iphone-15-not-working-with-wired-carplay.2404203/post-32556747\">may be responsible</a> for some recent connection issues, though turning off a VPN did not work for all users.<blockquote>Oy, I just went to my car to check and am having the same issue. If a VPN is activated when the car starts, the car will not pick up CarPlay at all. If the VPN is disabled, CarPlay starts, then if I turn the VPN back on CarPlay crashes.</blockquote>With the wide range of reports, there appear to be multiple ‌CarPlay‌ issues at the current time. ‌CarPlay‌ users may need to transition to different cables, but Apple may need to release a software update to solve some of the ‌CarPlay‌ problems.\r<br />\n\r<br />\nIf you've had issues with ‌CarPlay‌ on the ‌iPhone 15‌, let us know in the comments below.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a>, <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a>, <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPhone-15\">iPhone 15 (Buy Now)</a>, <a href=\"https://buyersguide.macrumors.com/#iPhone-15-Pro\">iPhone 15 Pro (Buy Now)</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/homepod-homekit-carplay-home-auto-technology.193\">HomePod, HomeKit, CarPlay, Home &amp; Auto Technology</a>, <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/29/iphone-15-carplay-issues/\">CarPlay Not Working for Some iPhone 15 Users, Possibly Because of USB-C Cables</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/carplay-not-working-for-some-iphone-15-users-possibly-because-of-usb-c-cables.2405572/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e4bf4acd44a21e10e46dfac3ed7cb6c744c9380f1d9fe36d1d69b53f4fa474e8","category":"Apple"}