{"title":"Downscaling future precipitation with shared socioeconomic pathway (SSP) scenarios using machine learning models in the North-Western Himalayan region","link":"http://link.springer.com/10.1007/s40808-024-02113-0","date":1727740800000,"content":"<h3>Abstract</h3>\n                    <p>The Himalayan region is characterized by its heterogeneous topography and diverse land use/land cover types that significantly influence the weather and climatic patterns in the Indian sub-continent. Predicting future precipitation is crucial for understanding and mitigating the impacts of climate change on water resources, land degradation including soil erosion by water as well as sustainability of the natural resources. The study aimed to downscale future precipitation with Shared Socioeconomic Pathway (SSP) scenarios using machine learning methods in the Tehri Dam catchment area, located in the North-Western Himalayas, India. The study compared the performance of multiple linear regression (MLR), artificial neural network (ANN), and random forest (RF) models for statistical downscaling. During the training and testing phases, RF and ANN demonstrated reasonably satisfactory results in comparison to MLR. In general, models performed best on a monthly time scale compared to daily and yearly scales where RF model performed quite well. Therefore, the RF model was used to generate future climate scenarios for the near (2015–2040), mid (2041–2070), and far (2071–2100) future periods under the shared socioeconomic pathway (SSP) scenarios. An increasing trend in precipitation was observed across the area (grids), with varying magnitudes. The SSP1-2.6 scenario was projected the least change, ranging from 1.4 to 3.3%, while the SSP2-4.5 scenario indicated an average increase of 3.7 to 14.0%. The highest emission scenario (SSP5-8.5) predicted an increase of 8.4 to 27.5% in precipitation during the twenty-first century. In general, the increase in precipitation was higher in the far future compared to the mid and near future period. This projected increase in the precipitation may have the serious implications on food security, hydrological behaviour, land degradation, and accelerated sedimentation in the Himalayan region.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"e4c3cd431fe1c1f199986814c759f774ad5c1845245c654ec6a6ca7239f90d44","category":"Environment"}