{"title":"Top 7 Best-Selling Smartphones Last Year Were All iPhones","link":"https://www.macrumors.com/2024/02/21/iphones-top-7-best-selling-smartphones-2023/","date":1708522366000,"content":"Apple's <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> models dominated the top 10 best-selling smartphones in 2023, with only Samsung's mid-range devices making the list, according to Counterpoint Research's <a href=\"https://www.counterpointresearch.com/insights/apple-captures-top-7-spots-in-global-top-10-best-selling-smartphones/\">Global Monthly Handset Model Sales Tracker</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/Share-of-Global-Top-10-Best-selling-Smartphones-2023.jpg\" width=\"3330\" height=\"2226\" />\r<br />\nApple took all top seven positions – a first for the company. <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a> models made up the top three for the series to become the best-selling smartphone of 2023, with the US and China making up half of its sales. The model contributed 19% of the total ‌iPhone‌ sales for 2023.\r<br />\n\r<br />\nThe <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> came fourth largely thanks to popularity in Japan and India, while <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> models took the fifth, sixth, and seventh slots, with the <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> Max the best-selling model in Apple's newest lineup, despite its relatively late launch in September last year. From the tracker report:\r<br />\n<blockquote>Apple's total sales remained flat in 2023 even as major competitors declined. This stability was partly due to a significant boost from emerging markets like India and the Middle East and Africa (MEA). In 2023, India became the fifth smartphone market to exceed 10 million iPhone unit sales in a single year, highlighting the market's growing importance for Apple. These factors contributed to the iPhone 15 series sales matching the performance of the iPhone 14 series in 2022.</blockquote>Samsung's budget A series devices filled eighth, ninth, and tenth positions, thanks to their strong value proposition, but none of the Korean company's flagship premium Galaxy phones even made the list. \r<br />\n\r<br />\nCounterpoint's research backs up previous data from <a href=\"https://www.macrumors.com/2024/01/16/apple-top-spot-global-smartphone-shipments/\">market research firm IDC</a>, which showed Apple overtook Samsung as the top global smartphone manufacturer in 2023, shipping more phones annually than Samsung for the first time. <div>Tag: <a href=\"https://www.macrumors.com/guide/counterpoint/\">Counterpoint</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/21/iphones-top-7-best-selling-smartphones-2023/\">Top 7 Best-Selling Smartphones Last Year Were All iPhones</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-7-best-selling-smartphones-last-year-were-all-iphones.2420048/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e4c52feab237a4939eb16da9f084090a950a76617af9309adabf56f1829fd868","category":"Apple"}