{"title":"Tour de France 2021 Stage 8 Preview - The Arrival of the Mountains","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-stage-8-preview-the-arrival-of-the-mountains","date":1625161079000,"content":"\n      <p><span>The second weekend of the 2021 Tour de France is here, but there will be no time off for the racers, as they arrive at the first true mountains of the Tour. The riders will climb over 3,500 metres, taking in three first-category climbs along the way. </span></p>\n<p><span>The final kilometres, featuring the Col de Romme and Col de la Colombière before a descent into the finish in Le Grand-Bornand, mirror stage 10 of the 2018 Tour de France. That stage was won by Julian Alaphilippe.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b><i>Tour de France 2021 Guide</i></b></a></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_PROFILS_ETAPES_SANS_RAVITO_ETP08_1024x1024.jpg?v=1625157475\" />Stage 8 profile</span></i></p>\n<p><span>The stage begins on the foot of the </span><span>Forêt d'Échallon, a 5km climb which averages 6.6%. The climb is uncategorised so there are no KOM points available at the top, though this speaks volumes of the more challenging climbs to come. However, the climb provides a platform for the breakaway to form, so any breakaway candidates must be ready to attack from the off.</span></p>\n<p><span>An intermediate sprint occurs in Frangy at kilometre 45. With a difficult start to the stage, Peter Sagan, Michael Matthews and Sonny Colbrelli may see this as an opportunity to join the breakaway to gain ground in the green jersey competition.</span></p>\n<p><span>The first categorised ascent arrives shortly after in the Côte de Copponex, and the Côte de Menthonnex-en-Bornes swiftly follows. The two ascents are third and fourth category respectively and act as a warm-up for the punishing climbs that follow.</span></p>\n<p><span>The Côte de Mont-Saxonnex begins with just over 50km of the stage remaining. The ascent is the first first category climb of the 2021 Tour de France. Although it is only 5.7km — not long for a first category — it averages a leg-sapping 8.3%.</span></p>\n<p><span>The riders will then descend directly into the foot of the Col de Romme, which at 8.8km is the longest climb of the Tour so far. The ascent averages 8.9%. At these percentages, the climb cannot be underestimated by any of the GC favourites. With another first category ascent to follow immediately, any overall contenders that are dropped here will lose the Tour de France.</span></p>\n<p><span>The Col de la Colombière follows — an ascent which is synonymous with the Tour de France. The Colombière has been used eight times since 2000, most recently in 2018. At 7.5km and 8.5% on average, it isn’t the most strenuous climb of the day on paper. However, with little respite between the two aforementioned first category climbs, the riders' legs will be burning at the foot of the <span>Colombière</span>, let alone the top.</span></p>\n<p><span>Once the Col de la Colombière is crested, 14.7km remain until the stage finish in Le Grand-Bornand. The riders will descend into the ski resort and enter the north side of town. The road kicks uphill in the final kilometre as the riders navigate their way through town, crossing the river before the stage finish.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-standings\">Current Tour de France standings</a></strong></em></p>\n<h4><b>Contenders</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1233750245-min_1024x1024.jpg?v=1625156983\" /></b><em>Image credit: PHILIPPE LOPEZ/AFP via Getty Images</em></p>\n<p><b>Julian Alaphilippe</b><span> will have fond memories of Le Grand-Bornand after he won his first Tour de France stage there in 2018. Alaphilippe joined the breakaway that day and attacked with around 30 kilometres remaining, crossing the Col de Romme solo before navigating the ascent of the Col de la Colombière and the descent into Le Grand-Bornand alone too. Alaphilippe could perhaps challenge for the stage again this year, though sitting just 48 seconds down and fourth place in the GC, he won’t be allowed in the breakaway which makes things more challenging for him.</span></p>\n<p><span>Another rider that joined Alaphilippe in the breakaway was Greg Van Avermaet, who held the yellow jersey at the time. The Belgian saw joining the breakaway as his only opportunity to hold the yellow jersey and he successfully defended yellow on that occasion. </span></p>\n<p><span>The question arises: will</span><b> Matheu van der Poel</b> employ the same tactic<span>? The Alpecin-Fenix rider isn’t an overall contender, so may be allowed some leeway in the breakaway. He joined a Tour de Suisse breakaway whilst leading the race just a few weeks ago too. Even if he does join the breakaway, the challenging Col de Romme and Col de la Colombière may put pay to his stage victory chances. However, after MvDP delivered a sublime time-trial on stage 5 to protect the yellow jersey, we aren’t willing to put anything past him.</span></p>\n<p><span>The mid-length, steep mountains suit </span><b>Primož Roglič</b><span> more than many of the GC contenders. Roglič crashed on stage three of the Tour which has set him back, but although he dubbed himself the mummy, his stage 5 time-trial showed he’s not out of this race just yet. The downhill finish may deter GC attacks in general, but Roglič is already one minute and 40 seconds behind his countryman Tadej <span>Pogačar </span>and must take every opportunity to snatch time back. </span></p>\n<p><span>An alternate, more conservative approach for Jumbo-Visma would be to attack with </span><b>Jonas Vingegaard</b><span>, who displayed fine form to finish second at the Itzulia Basque Country Tour earlier this season. The Dane was third in the time-trial a few days ago which shows he’s in fine form. If Jumbo-Visma are to defeat <span>Pogačar</span>, which they did at the Basque Country Tour, they must attack him from all angles. Attacking with Vingegaard would do just that.</span></p>\n<p><b>Tadej <span>Pogačar </span></b><span>is likely to be one of the strongest on the climbs and is also one of the quickest finishers among the GC favourites. If the GC riders enter Le Grand Bornand together, he could win it in a sprint. </span></p>\n<p><span>Other riders to watch from the GC favourites group include </span><b>David Gaudu, Pierre Latour </b><span>and </span><b>Wilco Kelderman. </b></p>\n<p><em>Cover image: ASO/ Charly Lopez</em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e4c71db41c2b9738f5a66a95cdf156f7507e52d3bb84286d70c431933e39ded2","category":"Cycling"}