{"title":"A bitter pill: Amazon calls on rival SpaceX to launch Internet satellites","link":"https://arstechnica.com/?p=1987967","date":1701471549000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/f9preflight21-800x533.jpeg\" alt=\"A SpaceX Falcon 9 rocket with a reused booster stage and payload fairing  is seen rolling out to its launch pad in Florida before a mission last month.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/f9preflight21-scaled.jpeg\">Enlarge</a> <span>/</span> A SpaceX Falcon 9 rocket with a reused booster stage and payload fairing  is seen rolling out to its launch pad in Florida before a mission last month. (credit: <a href=\"https://twitter.com/SES_Satellites/status/1723851810320920670/photo/2\">SpaceX</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Amazon announced Friday that it has purchased three Falcon 9 rocket launches from SpaceX beginning in mid-2025 to help deploy the retail giant's network of Kuiper Internet satellites.</p>\n<p>In a statement, Amazon said the SpaceX launches will provide \"additional capacity\" to \"supplement existing launch contracts to support Project Kuiper’s satellite deployment schedule.\" SpaceX has its own broadband satellite fleet, with more than 5,100 Starlink spacecraft currently in orbit, making it a competitor with Amazon.</p>\n<p>Last year, Amazon bought up most of the Western world's excess launch capacity from everyone but SpaceX, securing 68 rocket flights from United Launch Alliance, Arianespace, and Blue Origin to deploy thousands of satellites for the Kuiper broadband network. Amazon previously contracted with ULA for nine Atlas V launches to support the initial series of Kuiper launches, the first of which <a href=\"https://arstechnica.com/space/2023/10/first-two-satellites-for-amazons-broadband-megaconstellation-launch-today/\">lifted off in October</a> with Amazon's first two Kuiper prototype satellites. More Atlas Vs will start launching operational Kuiper satellites next year.</p></div><p><a href=\"https://arstechnica.com/?p=1987967#p3\">Read 20 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1987967&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e4f1ac110b60a9dbde2d45dfff7d108820229a11ba2c471478f5054836f5cc5b","category":"Tech"}