{"title":"PSLBI-7 Coating extruded kibble with increasing levels of free fatty acids does not decrease palatability or impact e-nose odor profiles","link":"https://academic.oup.com/jas/article/102/Supplement_3/631/7757553?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Complete uncoated extruded kibble was coated with 5% by weight premium poultry fat (5,000 ppm Naturox, 0.57% FFA; Tyson, Springdale, AR) spiked with 0, 5, 10, 15, or 20 percent free fatty acids (Oleic acid, Millipore Sigma. Burlington, MA), and 3% liquid chicken-based palatant (Tyson, Springdale, AR). Kibbles were then utilized in oral palatability (n = 20 dogs; 10 male, 10 female), aromatic palatability (n = 20 dogs; 10 male, 10 female), and apparent total tract digestibility (ATTG; n = 36 dogs; 18 male, 18 female). Kibble odors were by ultra-fast gas chromatography e-nose (AlphaMOS, Toulouse, France), and SPME GC-MS (MUMC, Columbia, MO). In the aromatic palatability trials, there were no significant differences in first approach (<span>P</span> ≥ 0.21), percent interaction time (<span>P</span> ≥ 0.16), or interaction ratio (<span>P</span> ≥ 0.94). In the oral palatability trials, there were no significant differences in first approach (<span>P</span> ≥ 0.26), first bite (<span>P</span> ≥ 0.50), percent consumed (<span>P</span> ≥ 0.15), or intake ratio (<span>P</span> ≥ 0.59). There was a significant increase in fat digestibility among diets coated with 20% FFA compared with the uncoated diet (<span>P</span> = 0.02), with intermediate diets showing a slight numerical increase but no significant difference. However, there was no significant difference in protein, carbohydrate, or dry matter digestibility (<span>P</span> ≥ 0.06). Principle component analysis of e-nose peaks showed minimal odor changes between samples (DI = -3). SPME GC-MS analysis identified 16 compounds correlated with FFA percentage (r<sup>2</sup> ≥ 0.50). When used to coat kibble, poultry fat with up to 20% FFA did not appear to negatively impact palatability or overall odor profile, though it did modify specific volatile compounds.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e4f192d8756a496603feffc7ee8c46621bc6d25ed67c7a980ee2a5cde36146ae","category":"Environment"}