{"title":"Tri‐frequency simultaneous ultrasound pickling for the acceleration of the NaCl content and quality improvement of pork (longissimus dorsi)","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13448?af=R","date":1718692178000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The pickling process with NaCl is an essential step for pork preservation. This study aimed to investigate the effect of different ultrasonic intensities of tri-frequency simultaneous ultrasound (TSIU) pickling on the NaCl content and quality of pork (<i>longissimus dorsi</i>). After 30 min pickling, the NaCl content, moisture content, pickling yield, cooking loss, textural properties, color, pH, moisture migration and distribution as well as microstructure of pork were assessed.</p>\n<h2>RESULTS</h2>\n<p>Results showed that among all the ultrasonic treatment intensities (85–150 W L<sup>−1</sup>), the NaCl content of the sample pickled by an intensity of 101.3 W L<sup>−1</sup> was higher than that of other intensities. TSIU 101.3 W L<sup>−1</sup> showed 59.95% higher NaCl content than the control sample. In addition, the sample treated with TSIU of 101.3 W L<sup>−1</sup> had higher pickling yield and moisture content, better textural properties of pork (including hardness and chewiness), and less cooking loss. The results of the low-field nuclear magnetic resonance showed that, compared with the control group, the relaxation time <i>T</i>\n<sub>21</sub> of the ultrasound-assisted pickling samples increased, while the proportion of <i>T</i>\n<sub>22</sub> (<i>A</i>\n<sub>22</sub>) reduction ranged from 175.0% to 379.9%. The microstructure designated that the ultrasonic treatment could facilitate changes in meat texture.</p>\n<h2>CONCLUSION</h2>\n<p>Ultrasound marination of different intensities promoted the diffusion of NaCl and affected the quality of pork tenderloins. The TSIU at 101.3 W L<sup>−1</sup> could better accelerate NaCl transport and homogeneous distribution on meat, thereby improving the sample quality. © 2024 Society of Chemical Industry.</p>","author":"Xinyan Zhang, \nLina Guo, \nZhongyuan Chen, \nHaile Ma","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"e4f27ac714f2df1f0e562e62ecff2dabae1fa84def59c6407396936be6c2c16f","category":"Environment"}