{"title":"Close to the edge: Spatial variation in plant diversity, biomass and floral resources in conventional and agri‐environment cereal fields","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2664.14737?af=R","date":1722236866000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/5bdd7128-0272-413e-8ef7-d5ebd22fdbdc/jpe14737-toc-0001-m.png\" alt=\"Close to the edge: Spatial variation in plant diversity, biomass and floral resources in conventional and agri-environment cereal fields\" />\n<p>The strong edge effects we found in conventional cultivation support the premise that reducing field sizes could play a role in promoting in-crop biodiversity. However, incorporating extensive field margins as an AEM would be more efficient at maximising the diversity of generalists whilst maintaining high yields.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nNon-crop (segetal) plants in arable systems are commonly perceived simply as ‘weeds’, that is, harmful at worst and undesirable at best. The increase in management intensity in European arable systems has vastly reduced the populations of all but the most disturbance-tolerant plant species, negatively impacting the whole agricultural food web. In recent years, efforts have been made to promote agricultural biodiversity through measures such as flower strips and unsprayed field margins. However, studies of their impacts on the arable flora have rarely considered their spatial variation within the crop field.\n\nWe investigated the spatial distribution of vascular plant species richness and their contribution to the food web via biomass and flower units in conventional and agri-environment cereal fields in six regions of Germany. We studied two types of in-crop measures (extensive cereals without pesticides or fertiliser, and with or without intercropping with flowering species) and one adjacent measure (neighbouring flower strip), recording at 1-m intervals from the field edge to the interior. These results were then extrapolated to illustrate the effects of these measures on resource provision at the field scale.\n\nSpecies richness and plant biomass dropped off sharply after the first metre in the conventional treatments, regardless of the adjacent habitat. The ‘extensive’ treatments maintained a much higher level of diversity and resource provision in the field interior. At the field level, this can mean more than a 60-fold difference in the provision of flowering resources between conventional management (1900 flower units/ha) and agri-environment measures (AEMs) (127,000 units/ha for extensive cereals).\n\n<i>Synthesis and applications</i>. The strong edge effects we found in conventional cultivation support the premise that reducing field sizes could play a role in promoting in-crop biodiversity. However, incorporating extensive field margins as an AEM would be more efficient at maximising the diversity of generalists whilst maintaining high yields.\n</p>\n<h2>Zusammenfassung</h2>\n<p>\n\nAckerwildkräuter (sogenannte Segetalpflanzen) werden häufig einfach als ‘Unkraut’ wahrgenommen, d. h. schlimmstenfalls als schädlich und bestenfalls als unerwünscht. Die zunehmende Bewirtschaftungsintensität in europäischen Ackerbausystemen hat die Populationen aller Ackerwildkräuter mit Ausnahme der störungsresistentesten stark reduziert, was sich negativ auf das gesamte landwirtschaftliche Nahrungsnetz auswirkt. In den letzten Jahren wurden Anstrengungen unternommen, die biologische Vielfalt in der Landwirtschaft durch Maßnahmen wie Blühstreifen und ungespritzte Feldränder zu fördern. Bei der Untersuchung ihrer Auswirkungen auf die Ackerflora wurde jedoch nur selten ihre räumliche Variation innerhalb des Ackers berücksichtigt.\n\nWir haben die räumliche Verteilung der Ackerwildkrautdiversität sowie deren Biomasse und die Anzahl von Blüteneinheiten in konventionellen und agrarumweltgerechten Getreidefeldern in sechs Regionen Deutschlands studiert. Wir untersuchten zwei Maßnahmen in der Kultur (Extensivgetreide mit oder ohne blühende Untersaat) und eine angrenzende Maßnahme (benachbarter Blühstreifen) und platzierten Aufnahmen in Abständen von 1 m vom Feldrand bis ins Feldinneren. Diese Ergebnisse wurden dann extrapoliert, um die Auswirkungen dieser Maßnahmen auf die Ressourcenbereitstellung auf der Feldskala zu veranschaulichen.\n\nDer Artenreichtum und die Pflanzenbiomasse nahmen im konventionellen Getreide nach dem ersten Meter stark ab, unabhängig vom angrenzenden Vegetationstyp. Diese Abnahme war im Extensivgetreide viel schwächer ausgeprägt. Auf der Feldebene kann dies einen mehr als sechzigfachen Unterschied in der Bereitstellung von Blütenressourcen zwischen der konventionellen Bewirtschaftung (1900 Blüteneinheiten/ha) und dem Extensivgetreide (127.000 Einheiten/ha) bedeuten.\n\n<i>Synthese und Anwendung in der Praxis</i>. Die starken Randeffekte, die wir bei der konventionellen Bewirtschaftung feststellten, unterstützen die Annahme, dass die Verringerung der Feldgröße eine Rolle bei der Förderung der biologischen Vielfalt spielen dürfte. Die Anlage von Extensivgetreidestreifen am Feldrand als Agrarumweltmaßnahme wäre jedoch ein effizienterer Weg, um die Vielfalt der Generalisten zu erhöhen und gleichzeitig hohe Erträge zu erhalten.\n</p>","author":"Laura M. E. Sutcliffe, \nJenny Schellenberg, \nStefan Meyer, \nChristoph Leuschner","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"e4f3555ea5886a3c1a28dc496b006be3731654d00162e43c307eea6fc2207c0c","category":"Environment"}