{"title":"Older adults using social support to improve self-care (OASIS): Adaptation, implementation and feasibility of peer support for older adults with T2D in appalachia: A feasibility study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300196","date":1710770400000,"content":"<p>by Brittany L. Smalls, Aaron Kruse-Diehr, Courtney L. Ortz, Key Douthitt, Christopher McLouth, Rachel Shelton, Zoe Taylor, Edith Williams</p>\r\nIntroduction <p>The prevalence of type 2 diabetes (T2D) is 17% higher in rural dwellers compared to their urban counterparts, and it increases with age, with an estimated 25% of older adults (≥ 65 years) diagnosed. Appropriate self-care is necessary for optimal clinical outcomes. Overall, T2D self-care is consistently poor among the general population but is even worse in rural-dwellers and older adults. In rural Kentucky, up to 23% of adults in Appalachian communities have been diagnosed with T2D and, of those, 26.8% are older adults. To attain optimal clinical outcomes, social environmental factors, including social support, are vital when promoting T2D self-care. Specifically, peer support has shown to be efficacious in improving T2D self-care behaviors and clinical and psychosocial outcomes related to T2D; however, literature also suggests self-selected social support can be obstructive when engaging in healthful activities. Currently available evidence-based interventions (EBIs) using peer support have not been used to prioritize older adults, especially those living in rural communities.</p> Method <p>To address this gap, we conducted formative research with stakeholders, and collaboratively identified an acceptable and feasible peer support EBI—peer health coaching (PHC)—that has resulted in improved clinical and psychosocial T2D-related outcomes among participants who did not reside in rural communities nor were ≥65 years. The goal of the proposed study is to use a 2x2 factorial design to test the adapted PHC components and determine their preliminary effectiveness to promote self-care behaviors and improve glycemic control among older adults living in Appalachian Kentucky. Testing the PHC components of the peer support intervention will be instrumental in promoting care for older adults in Appalachia, as it will allow for a larger scale intervention, which if effective, could be disseminated to community partners in Appalachia.</p> Trial registration <p>This study was registered at www.clinicaltrials.gov (NCT06003634) in August 2023.</p>","author":"Brittany L. Smalls","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e4fc93a242ff9ef81b4243ec18164512a2cb8bb68df2213c6911dfb7ba6778f6","category":"Interdisciplinary"}