{"title":"Apple Outlines How It Will Notify Users Who Have Been Targeted by State-Sponsored Spyware Attacks","link":"https://www.macrumors.com/2021/11/23/apple-state-sponsored-spyware-threat-notifications/","date":1637727343000,"content":"Earlier today, Apple <a href=\"https://www.macrumors.com/2021/11/23/apple-sues-nso-group/\">announced that it had filed suit against NSO Group</a>, the firm responsible for the Pegasus spyware that has been used in state-sponsored surveillance campaigns in a number of countries. NSO Group seeks to take advantage of vulnerabilities in iOS and other platforms to infiltrate the devices of targeted users such as journalists, activists, dissidents, academics, and government officials.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/apple-security-banner.jpeg\" />\r\n<br />\r\nAs part of its announcement, Apple revealed that it is notifying the \"small number of users\" who have been targeted via the FORCEDENTRY exploit for a now-patched vulnerability that allowed Pegasus to be installed on their devices. Apple also said that it will continue to notify users it believes have been targeted by state-sponsored spyware attacks \"in accordance with industry best practices,\" and the company has now <a href=\"https://support.apple.com/en-us/HT212960\">shared a new support document</a> outlining how it will notify those users.\r\n<br />\r\n\r\n<br />\r\nNotifications will be delivered to affected users via email and iMessage notifications to the addresses and phone numbers associated with the users' Apple IDs, with the notifications providing additional steps users can take to protect their devices. A prominent \"Threat Notification\" banner will also be displayed at the top of the page when affected users log into their accounts on the <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a> web portal.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/apple-id-threat-notification.png\" />\r\n<br />\r\nUsers will never be asked to click links or install apps via the email and iMessage notifications, so users receiving notifications should always log into their ‌Apple ID‌ accounts on the web to verify that threat notifications have been issued for their accounts and to learn what to do next.\r\n<br />\r\n\r\n<br />\r\nApple acknowledges that there may be some false alarms with its notifications and that some attacks may go undetected, as it is facing constantly evolving tactics from state-sponsored attackers. Apple's threat-detection methods will similarly evolve, and so the company will not be sharing information on its methods to hinder efforts by attackers to evade detection.\r\n<br />\r\n\r\n<br />\r\nRegardless of whether or not you receive a threat notification from Apple, the company advises all users to take the following steps to secure their devices:\r\n<br />\r\n<ul><li>Update devices to the latest software, as that includes the latest security fixes</li>\r\n<br />\r\n<li>Protect devices with a passcode</li>\r\n<br />\r\n<li>Use two-factor authentication and a strong password for ‌Apple ID‌</li>\r\n<br />\r\n<li>Install apps from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a></li>\r\n<br />\r\n<li>Use strong and unique passwords online</li>\r\n<br />\r\n<li>Don’t click on links or attachments from unknown senders</li></ul>Finally, Apple shares a <a href=\"https://securityplanner.consumerreports.org/tool/emergency-resources\">list of emergency resources</a> at the Consumer Reports Security Planner website for those users who have not received an Apple threat notification but believe they may have been targeted by state-sponsored attackers to obtain expert assistance.<div>Tag: <a href=\"https://www.macrumors.com/guide/security/\">security</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/11/23/apple-state-sponsored-spyware-threat-notifications/\">Apple Outlines How It Will Notify Users Who Have Been Targeted by State-Sponsored Spyware Attacks</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-outlines-how-it-will-notify-users-who-have-been-targeted-by-state-sponsored-spyware-attacks.2324694/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=S7Mgy2ehJU0:yh3FqARq_pA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=S7Mgy2ehJU0:yh3FqARq_pA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e501506c34e1d5fd9ea21d576b7273154ae7c15989e33dbc6031dbe5e9de72fa","category":"Apple"}