{"title":"ToRCH Pathogen-Induced Histopathological Changes in Placental Tissues and Associated Post Obstetric Complications in Pakistani Women","link":"https://www.preprints.org/manuscript/202405.0871/v1","date":1715603818000,"content":"Abstract: The mortality rate of women during the gestation period or after delivery is very high worldwide. ToRCH pathogens [Toxoplasma gondii (T.gondii), Rubella Virus (RV), Cytomegalovirus (CMV), and Herpes Simplex Virus (HSV)] are transmitted vertically and are associated with mortality and complications both in the mother and the fetus or children. Therefore, this study is designed to investigate the ToRCH pathogen-induced histopathological changes in placental tissues and associated post-obstetric complications in Pakistani women.\nWomen (N = 68) included in this study were divided into Group A (women with current abortion and bad obstetric history-BOH) and Group B (women with normal delivery and BOH). The venous blood collected was analyzed for ToRCH antibodies through ELISA. A small piece of placenta tissue taken after delivery or abortion was subjected to nucleic acid (NA) detection through PCR using ToRCH pathogen-specific primers. The placental tissue was analyzed for histopathological changes under a microscope. The data obtained were analyzed using percentages and the Chi square test.\nOverall ToRCH antibody positivity was 64.70% (44/68). Of these, IgM (Immunoglobulin M) was found in 17.65% (12/68), IgG (Immunoglobulin G) in 45.59% (31/68), and one case (1.47%) was seropositive for both IgM and IgG. The NA was detected in 66.18% (45/68) of the placental tissues of the study population.\nThe higher prevalence of antibodies for T.gondii and RV (23.53% each) and NA for RV, CMV, and HSV (17.99% each) was observed in the study population. The ToRCH infection (antibodies and NA) with BOH complications was statistically found to be non-significant (p&gt; 0.05). Overall discrepancies in ToRCH antibodies and NA positivity were found in 86.76% (59/68) of cases, especially for RV (26.47%). Chorionic villitis (CV) in placental tissues was observed in 20.59% (14/68), i.e., 13.23% of Group A and 7.35% of Group B. Of the total, four women with T.gondii, six with RV, and three each with CMV and HSV infection were found with CV. The most common BOH complications observed were recurrent spontaneous abortions (RSAs) (47.05%, 32/68), stillbirth (22.05%, 15/68), congenital abnormalities (14.70%, 10/68), etc. It was observed that RSAs were associated with CV (10.29%) in the study population. The BOH complication and CV were found to be statistically non-significant (p&gt; 0.05).\nIt is concluded that ToRCH pathogens are prevalent in the study population, and CV was the only histopathological change found and associated with BOH complications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e50cd5881c8c4380bca1410d633cb6a2b2d0fbc82da115dd4f89d41fc5292d35","category":"Interdisciplinary"}