{"title":"Getting software to “hallucinate” reasonable protein structures","link":"https://arstechnica.com/?p=1817388","date":1638445526000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/Screen-Shot-2021-12-01-at-7.16.27-PM.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/Screen-Shot-2021-12-01-at-7.16.27-PM.jpg\">Enlarge</a> <span>/</span> Top row: the hallucination and actual structure. Bottom row: the two structures superimposed. (credit: Anishchenko et. al.)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Chemically, proteins are just a long string of amino acids. Their amazing properties come about because that chain can fold up into a complex, three-dimensional shape. So understanding the rules that govern this folding could not only give us insights into the proteins that life uses but could potentially help us design new proteins with novel chemical abilities.</p>\n<p>There's been <a href=\"https://arstechnica.com/science/2021/07/google-turns-alphafold-loose-on-the-entire-human-genome/\">remarkable progress</a> on the <a href=\"https://arstechnica.com/science/2021/07/google-details-its-protein-folding-software-academics-offer-an-alternative/\">first half of that problem</a> recently: researchers have tuned AIs to sort through the evolutionary relationships among proteins and relate common features to structures. As of yet, however, those algorithms aren't any help for designing new proteins from scratch. But that may change, thanks to the methods described in a paper released on Wednesday.</p>\n<p>In it, a large team of researchers describes what it terms protein \"hallucinations.\" These are the products of a process that resembles a game of hotter/colder with an algorithm, starting with a random sequence of amino acids, making a change, and asking, \"Does this look more or less like a structured protein?\" Several of the results were tested and do, in fact, fold up like they were predicted to.</p></div><p><a href=\"https://arstechnica.com/?p=1817388#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1817388&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e50e23c20fa1f1d865f8ab020c523ba8b0df2169748bd889bfb7af63458851c8","category":"Tech"}