{"title":"“Chrome Memories”—an early look at Google’s UI update to History","link":"https://arstechnica.com/?p=1757969","date":1618851539000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/chrome-memories-enabled-980x613.png\" /></div>\n        <p>\n          You'll need Chrome Canary to check out Memories—and you'll need to enable an optional flag as well.                      [credit:\n                        Jim Salter                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Google seems to be working on a UI revamp for the traditional browser history interface, which it's calling \"Memories.\" The new feature is only available in Chrome <a href=\"https://www.google.com/chrome/canary/\">Canary</a>, and it's hidden even there behind a developer flag that defaults to \"off.\"</p>\n<p>If you have a copy of Canary installed and want to check out Memories, the first place you need to go is <a>chrome://flags/#memories</a>. Once you've enabled the Memories flag, you'll be prompted to relaunch Canary, after which you can see the actual interface at <a>chrome://memories/</a>.</p>\n<p>The new interface is clearly still in an alpha state, with a non-functional hamburger menu on individual entries, broken thumbnails, and so forth. But it's functional enough to give us a general idea of what it's all about—basically, replacing History's simple row-based, item-by-item log view with a card-based interface that groups activities by time blocks. This design also collapses repeated activity on a single page in a short time frame into single entries.</p></div><p><a href=\"https://arstechnica.com/?p=1757969#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1757969&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e50eb30824f1ee2d5e8a3eaf42b59ef16567ac483d3ce4251a72cd7fddd8bb02","category":"Tech"}