{"title":"Characterizing anthropogenic litter pollutants in African freshwater ecosystems: A case study of Dunga Beach in Lake Victoria, Kenya","link":"https://onlinelibrary.wiley.com/doi/10.1111/lre.12454?af=R","date":1710827099000,"content":"<h2>Abstract</h2>\n<p>Anthropogenic litter (AL) in world's aquatic ecosystems presents critical ecological threats to environmental quality, aquatic biodiversity and human welfare. However, most studies on AL have been conducted in marine ecosystems with very little focus being given to freshwater systems like Lake Victoria. This study characterized AL pollutants in Dunga beach in Lake Victoria, Kenya, where sampling was done in the beach, riparian and benthic zones along a 100 m reach for 6 days. Across the sampled reaches, the AL associated with packaging, consumer products, building and construction, transport, electronic wastes, textile, fishery and medical materials were collected, counted, sun-dried and weighed. AL were more abundant in the beach and riparian zone than in the benthic reaches with plastics being the dominant litter in all reaches. Based on Kruskal–Wallis rank sum test the density of AL associated with packaging and consumer products was significantly higher than other AL in all the reaches. Plastics, polystyrene and glass wastes dominated the beach zone at 31.19%, 12.14% and 11.14%, respectively. In the benthic area, the dominant wastes were plastics, fishery and polystyrene items at 22.14%, 16.34% and 12.14%, respectively. The top 10 AL pollutants in Dunga beach were as follows: bags/food wrappers, bottle caps, diapers, plastic and glass beverage bottles, plastic plates, forks, knives, spoons, straws and e-wastes. Based on data from literature, several clear patterns emerged when comparing relative AL abundance across other aquatic habitats. In the Lake Michigan Beach, the AL were dominated by plastics (41.2%) followed by cigarettes at 29.3%. In contrast, Chicago River Beach contained more glass wastes (42.1%) while Chicago River Riparian had more plastics (57.8%). At the South Sea of Korea, fishing gear wastes were the majority AL (61.1%). AL consisting of fishing items was restricted to benthic and riparian settings, in which the benthic zone had the most items recorded. It is therefore evident that a large amount of AL waste accumulates at Dunga, Hippo point and other beaches in the world, thus justifying the need for beach cleaning and maintenance strategies. This study presents baseline data that is useful to environmental ecologists, aquatic scientists and management authorities to formulate policies, evaluate guidelines and recommend beach management strategies to conserve aquatic biodiversity, human health and aesthetic value of the freshwater habitats.</p>","author":"Erick O. Ogello, \nMwaruwa M. Mbodze, \nNicholas O. Outa, \nMigeni Z. Ajode, \nWycliffe Ojwando","siteTitle":"Wiley: Lakes & Reservoirs: Science, Policy and Management for Sustainable Use: Table of Contents","siteHash":"0c37a2f8fab2f38bae7a8df98c682fefad0ef1d621f3013d69fd39589935ccea","entryHash":"e521122f1cf0ce136d5c8f9227ccff69f2abac5519c22f8b03f104328d4f8ad7","category":"Environment"}