{"title":"The Google Assistant is now a Google messaging service","link":"https://arstechnica.com/?p=1763075","date":1620323951000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/9-980x735.jpg\" /></div>\n        <p>\n          Receiving a Google Assistant Broadcast on a phone. On the left is a notification. On the right is an individual message.                       [credit:\n                        Google                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>The Google Assistant's \"Broadcast\" feature has long existed as a way to blast a message to every Google smart speaker in the house. Instead of hunting down every individual family member at dinner time, put those smart speakers to work by saying, \"Hey Google, broadcast 'It's dinner time!'\"</p>\n<p>In <a href=\"https://blog.google/products/assistant/plan-perfect-weekend-new-google-assistant-features/\">a new blog post</a>, Google called Broadcast \"one of our most popular Assistant features\" and announced that the feature is expanding to show messages on phones, too, even when they're outside the home Wi-Fi network. That means Broadcast is basically turning into a new Google messaging service.</p>\n<p>Broadcast will now be able to send and receive messages on the Google Home and Nest smart speakers, the Google Home Hub and Nest Hub smart displays, any Android phone, and iPhones running the Google Assistant app. Phones will get a notification when new messages arrive, and group chat members include both individual people (presumably with personal devices like a phone) and more public home devices. Just like any other messaging service, opening the notification will show a scrolling list of broadcast messages. The one big limitation is that the messaging only happens within a <a href=\"https://families.google.com/families\">Google Family Group</a>. If you want to include an outsider, you'll have to awkwardly switch group messaging services.</p></div><p><a href=\"https://arstechnica.com/?p=1763075#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1763075&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e5223a98c1fa2b60bc3afaf12ab0f7d86e2165d33b3f0acecbda4f2d1693b171","category":"Tech"}