{"title":"Hydrochemical and Isotopic Characterisation of Groundwater in the Nakivale Sub-catchment of the Transboundary Lake Victoria Basin, Uganda","link":"https://www.preprints.org/manuscript/202410.1651/v1","date":1729582721000,"content":"This study characterized groundwater resources for the Nakivale sub-catchment of the transboundary Victoria basin in Uganda using classical hydrochemical and stable isotopic approaches. Groundwater in the study area is essential for domestic, agricultural, and industrial uses. As a sub-domain of the larger Victoria Basin, it also plays a crucial role in shaping the hydrological characteristics of this vital transboundary basin, both in terms of quality and quantity fronts. This makes its sustainable management and development vital. The predominant groundwater type is Ca-SO4, with other types including Ca-HCO3, Na-Cl, Na-HCO3, and Ca-Mg-SO4-Cl. Hydrochemical facies analysis highlights the importance of rock-water interactions in controlling groundwater chemistry, mainly through incongruent chemical weathering of Ca-rich plagioclase feldspars and the oxidation of sulfide minerals, such as pyrite which are prevalent in the study area. Ground-water recharge is primarily influenced by the area’s topography, with recharge zones characterized by lineament networks, located in elevated areas. Stable isotope analyses indicate that groundwater mainly originates from local precipitation, while tritium data suggests the presence of both recent and older groundwater (likely over 20 years old). The study’s comprehensive approach and findings contribute significantly to the understanding of the region's groundwater systems, thus providing valuable insights for policymakers and stakeholders involved in water resource management and development strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e5261bab2c3e751f1aab49093d37155b7e2260893285600a5653dc6051306944","category":"Interdisciplinary"}