{"title":"Forty-two years impact of chemical fertilization on soil phosphorus partition and distribution under rice-based cropping systems","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305097","date":1718028000000,"content":"<p>by C. Biswas, J. Ferdous, R. R. Sarker, K. R. Islam, M. M. R. Jahangir</p>\r\n\r\nUnderstanding of soil phosphorus (P) transformation is crucial to minimize its edge-of-field loss associated with ecosystem disservices. A sequential chemical extraction procedure was used to assess the impact (42 years) of organic and chemical fertilizations on soil P partition and distribution under subtropical rice based cropping systems. Experimental treatments were control, N, NP, NK, NS, NZn, NPK<sub>,</sub> NSZn, NPKSZn, and N+FYM (farmyard manure). Composite soils were collected from 0–5, 20–25 and 40–45 cm depths, extracted, and analyzed for soluble P, NaHCO<sub>3</sub>-P (inorganic and organic), NaOH-P (inorganic and organic), acid soluble (H<sub>2</sub>SO<sub>4</sub>), and residual P fractions. The NPKSZn significantly increased the concentration of soil inorganic P compared to other treatments. When FYM was applied together with N fertilizer, the organic P concentration increased, which was statistically identical to NPKSZn and NPK treatments. While the labile (NaHCO<sub>3</sub>-Pi, NaOH-Po), residual, and total P concentrations were stratified at 0–5 cm depth, the concentration of NaHCO<sub>3</sub>-Po, NaOH-Pi, and acidic P fractions increased with soil depth. The soluble, NaHCO<sub>3</sub> (Pi and Po), NaOH-Pi and NaOH-Po, acidic, and residual P fractions constituted about 0.4, 6.6, 1.7, 21.3, 37.7, and 8.3%, respectively, of the total P. A higher concentration of the labile P at the surface soil indicated that the impact of chemical fertilization stratified the available P for plant uptake or susceptible to edge-of-field loss. The NPKSZn and N+FYM both had higher NaHCO<sub>3</sub>-Po and NaOH-Po concentrations within 40–45 cm and 0–25 cm depths, suggesting that N+FYM could promote the transformation of non-labile P into labile P pool, by reducing P fixation by soil and transport them at 20–45 cm depth. It is concluded that long-term fertilization increased the concentration of P pools especially labile P by saturating the soil adsorption sites especially in surface soil.","author":"C. Biswas","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e537598caad581e3a4bea4a6eb5b38d5e370888afa7dc12a012d5af974ac6c0e","category":"Interdisciplinary"}