{"title":"Biomonitoring in a fish farm in the Legal Amazon revealed physiological alterations in Caenorhabditis elegans","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16081?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>The aim of this study was to characterize the limnological parameters and analyse the biological effects of different ponds in a commercial fish farm in the Pará State, Brazil. One pond is designated for fingerling production (N) while the other is for fattening and termination (F). The other three ponds are named supply tanks, from which the water from the Parauapebas River is collected to fill N and F tanks. For the physical–chemical analysis, samples from N and F ponds were collected at a depth of 50 cm close to the water's outlets of the ponds, with the aid of a commercial kit for water analysis. <i>Caenorhabditis elegans</i> nematodes were used for water quality biomonitoring and exposed for 24 h to samples from all five tanks collected during three different days, being assessed through physiological endpoints. During the study, values of transparency and pH were higher in N, both with significant differences between the ponds. The other parameters did not show any differences among them in the different days and times analysed. The results showed that the water quality of N and F ponds is in accordance with the current legislation in the country. Despite being in accordance with legislation and with acceptable metal levels, samples caused toxicity to worms, which indicate that for fish production, a continuous supervision is essential for the success of the activity. Therefore, the limnological variables in relation to biomonitoring should be constantly assessed in fish farm enterprises in order to maintain a more efficient and sustainable productive system.</p>","author":"Leandro de Lima Sousa, \nNatalia Bianca Caires Medeiros, \nJeremias Silva dos Santos, \nMarcos Rodrigues, \nEugênia Carla Kuhn, \nVitoria Hagemann Cauduro, \nEdson Irineu Müller, \nDaiana Silva Ávila, \nMarília Danyelle Nunes‐Rodrigues","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"e5426d3b713fb3390f96824702c0e2134fb2a1faad065ed24312bb96205450fe","category":"Environment"}