{"title":"Facebook extends Trump ban, ends exemptions for politicians’ posts [Updated]","link":"https://arstechnica.com/?p=1769852","date":1622818402000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/06/Facebook.accounts-800x535.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/06/Facebook.accounts.jpg\">Enlarge</a> (credit: Chris Ratcliffe/Bloomberg via Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p><strong>Update, 12:54 pm EDT:</strong> Facebook <a href=\"https://about.fb.com/news/2021/06/facebook-response-to-oversight-board-recommendations-trump/\">announced</a> today that Donald Trump will remain banned from the company's platforms through January 7, 2023. On that day, Facebook will evaluate current events and ask experts \"to assess whether the risk to public safety has receded,\" wrote Facebook Vice President of Global Affairs Nick Clegg. Factors Facebook will consider include \"instances of violence, restrictions on peaceful assembly, and other markers of civil unrest.\"</p>\n<p>If the company still thinks there's a risk, it will extend Trump's ban. \"When the suspension is eventually lifted, there will be a strict set of rapidly escalating sanctions that will be triggered if Mr. Trump commits further violations in future, up to and including permanent removal of his pages and accounts,\" Clegg wrote.</p>\n<p><strong>Original story:</strong> Facebook has given politicians extreme leeway with what they can post, essentially treating them as a special class of user. Now, that policy will reportedly change, perhaps as early as today.</p></div><p><a href=\"https://arstechnica.com/?p=1769852#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1769852&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e54b95c4b4fe7a25d9af744e7b3a8d59f952dabb6936fe11caef133d32cd166c","category":"Tech"}