{"title":"Secondary Envelopment of Human Cytomegalovirus Is a Fast Process Utilizing the Endocytic Compartment as a Major Membrane Source","link":"https://www.preprints.org/manuscript/202408.1752/v1","date":1724418266000,"content":"Secondary envelopment of the human cytomegalovirus (HCMV) is a critical but not well-understood process that takes place at the cytoplasmic viral assembly complex (cVAC) where nucleocapsids acquire their envelope by budding into cellular membranes containing viral glycoproteins. Previous studies presented controversial results regarding the composition of the viral envelope, suggesting trans-Golgi and endosomal origins, as well as intersections with the exosomal and endocytic pathways.\nHere, we investigated the role of endocytic membranes for the secondary envelopment of HCMV by using wheat germ agglutinin (WGA) pulse labelling to label glycoproteins at the plasma membrane and to follow their trafficking during HCMV infection by light microscopy and transmission electron microscopy (TEM). \nWGA labelled different membrane compartments within the cVAC, including early endosomes, multivesicular bodies, trans-Golgi, and recycling endosomes. Furthermore, TEM analysis showed that almost 90% of capsids undergoing secondary envelopment and 50% of enveloped capsids were WGA-positive within 90 minutes.\nOur data reveal extensive remodeling of the endocytic compartment in the late stage of HCMV infection, where the endocytic compartment provides an optimized environment for virion morphogenesis and serves as the primary membrane source for secondary envelopment. Furthermore, we show that secondary envelopment is a rapid process in which endocytosed membranes are transported from the plasma membrane to the cVAC within minutes to be utilized by capsids for envelopment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e553a9d86720cf33ce50013b8dcc79660368cff62342a5a63f186eeb00ea1401","category":"Interdisciplinary"}