{"title":"The Galaxy S23 Ultra’s “15 W” wireless charging is 33% slower than last year","link":"https://arstechnica.com/?p=1930900","date":1681251927000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/02/Galaxy_S23_Series_02-1-800x533.jpg\" alt=\"The S23 Series. Everything has a similar camera design this year. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/02/Galaxy_S23_Series_02-1.jpg\">Enlarge</a> <span>/</span> The S23 Series. Everything has a similar camera design this year.  (credit: Samsung)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Samsung's already-slow charging speeds have again been caught <a href=\"https://arstechnica.com/gadgets/2022/02/the-galaxy-s22s-45-w-charging-doesnt-actually-improve-charge-times/\">not meeting</a> people's expectations. This time it is the wireless charging on the Galaxy S23 series, which is slower than older Galaxy S22 phones, according to new tests from <a href=\"https://www.phonearena.com/news/galaxy-s23-series-wireless-charging-comparison_id146527\">PhoneArena</a>. The site compared wireless charging for all three models—the base, Plus, and Ultra S22s and S23—and came away with the conclusion that \"All three new members of the Galaxy S23 series charge way slower than the Galaxy S22 series as per our tests.\"</p>\n<p>The worst model to make it out of the test is the flagship Galaxy S23 Ultra. The S23 Ultra and S22 Ultra have 5000 mAh batteries and 15 W wireless charging, but even with the official chargers, the new phone came out way slower. The S22 Ultra took 1 hour and 58 minutes to charge to full via the wireless charger, while the S23 took 33 percent longer: 2 hours and 37 minutes. It's not just charging to full that adds an extra 39 minutes, either; the phone shows an across-the-board reduction in charging rate that was never reflected in Samsung's spec sheet.</p>\n<p>The base and Plus model changes year over year are less relevant since they also came with increased battery capacities, so naturally, the new models will take longer to charge. For the record, the two cheaper S23 models added 200 mAh of battery capacity and 15 more minutes of wireless charge time. That is not the same huge decline that the S23 Ultra experienced.</p></div><p><a href=\"https://arstechnica.com/?p=1930900#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1930900&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e5572eceae50537a1bf415dcf625a478fa8664d69b4baf6d52dc17b7e28bcf80","category":"Tech"}