{"title":"Research Claiming Android Collects 20x More User Data Than iOS 'Off By An Order of Magnitude,' Says Google","link":"https://www.macrumors.com/2021/03/31/android-collects-more-data-than-ios-research/","date":1617178088000,"content":"Google and Apple both collect data from their users on their respective mobile operating systems, even when users are simply browsing the settings page or inserting a SIM card. Android, however, collects 20x more data from users compared to iOS, according to newly published research.\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2019/11/iPhone-12-v-Android-2020.jpg\" alt=\"\" width=\"1600\" height=\"900\" class=\"aligncenter size-full wp-image-768238\" />\r\n<br/>\r\n<a href=\"https://www.scss.tcd.ie/doug.leith/apple_google.pdf\">A study</a> from Douglas Leith at Trinity College, reported by <em><a href= \"https://arstechnica.com/gadgets/2021/03/android-sends-20x-more-data-to-google-than-ios-sends-to-apple-study-says/\">Ars Technica</a></em>, says that while both OSes collect data from their users regularly, Android fair exceeded the amount collected compared to Apple's iOS. \r\n<br/>\r\n\r\n<br/>\r\nSpecifically, Leith says that, for example, on device startup, Android sends around 1MB of user data back to Google, while iOS only transmits about 42KB. Sitting idle, Android sends around 1MB of user data to Google every 12 hours, compared to Apple only receiving around 52KB over the same 12 hour period.\r\n<br/>\r\n<blockquote>Where Android stands out, Leith said, is in the amount of data it collects. At startup, an Android device sends Google about 1MB of data, compared with iOS sending Apple around 42KB. When idle, Android sends roughly 1MB of data to Google every 12 hours, compared with iOS sending Apple about 52KB over the same period. In the US alone, Android collectively gathers about 1.3TB of data every 12 hours. During the same period, iOS collects about 5.8GB.</blockquote>While the research clearly shows that Android collects more data from users, there are significant caveats. Leith says he used a jailbroken <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> 8 running iOS 13.6.1 for the study, meaning the data is based on an iOS version <a href=\"https://www.macrumors.com/2021/02/26/ios-adoption-numbers-february-2021/\">that most iPhone and iPad users are no longer currently running</a>. On Android, Leith used a Google Pixel 2, running Android 10, released last year.\r\n<br/>\r\n\r\n<br/>\r\nIn a statement, Google calls the researched flawed, stating that the notion that Android collects more user data compared to iOS is \"off by an order of magnitude.\"\r\n<br/>\r\n<blockquote>We identified flaws in the researcher's methodology for measuring data volume and disagree with the paper's claims that an Android device shares 20 times more data than an &zwnj;iPhone&zwnj;. According to our research, these findings are off by an order of magnitude, and we shared our methodology concerns with the researcher before publication.\r\n<br/>\r\n\r\n<br/>\r\nThis research largely outlines how smartphones work. Modern cars regularly send basic data about vehicle components, their safety status and service schedules to car manufacturers, and mobile phones work in very similar ways. This report details those communications, which help ensure that iOS or Android software is up to date, services are working as intended, and that the phone is secure and running efficiently</blockquote>\r\n<br/>\r\nApple told <em>Ars Technica</em> that it \"provides transparency and control for personal information it collects\" and that the research \"gets things wrong.\" The research is available as a <a href=\"https://www.scss.tcd.ie/doug.leith/apple_google.pdf\">PDF</a> for those interested in learning more. <div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/android/\">Android</a>, <a href=\"https://www.macrumors.com/guide/privacy/\">privacy</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/31/android-collects-more-data-than-ios-research/\">Research Claiming Android Collects 20x More User Data Than iOS &#039;Off By An Order of Magnitude,&#039; Says Google</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/research-claiming-android-collects-20x-more-user-data-than-ios-off-by-an-order-of-magnitude-says-google.2290178/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=jzakB4cPQqE:yv_s8km_jcU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=jzakB4cPQqE:yv_s8km_jcU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/jzakB4cPQqE\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e5616ba898eca14e4b7641fb51e31597df5950e299cdeeb8ea5a679f781c3a03","category":"Apple"}