{"title":"Revealing the Hidden Impacts: Insights into Biological Aging and Long-Term Effects in Pauci- and Asymptomatic COVID-19 Healthcare Workers","link":"https://www.preprints.org/manuscript/202407.0377/v1","date":1720077527000,"content":"This study explores the role of inflammation and oxidative stress, hallmarks of COVID-19, in accelerating cellular biological aging. We investigated early molecular markers—DNA methylation age (DNAmAge) and telomere length (TL)—in blood leukocytes, nasal cells (NC), and induced sputum (IS) one-year post-infection in pauci- and asymptomatic healthcare workers (HCWs) infected during the first pandemic wave (February-May 2020), compared to COPD patients, model for \"aged lung\". Data by questionnaires, Work Ability Index (WAI), blood analyses, autonomic cardiac balance assessments, heart rate variability (HRV), and pulmonary function tests were collected. Elevated leukocyte DNAmAge significantly correlated with advancing age, male gender, daytime work, and an aged phenotype characterized by chronic diseases, elevated LDL and glycemia levels, medications affecting HRV, and declines in lung function, WAI, lymphocyte count, hemoglobin levels, and HRV (p&amp;lt;0.05). Increasing age, LDL levels, job positions involving intensive patient contact, and higher leukocyte counts collectively contributed to shortened leukocyte TL (p&amp;lt;0.05). Notably, HCWs exhibited accelerated biological aging in IS cells compared to both blood leukocytes (p≤0.05) and NC (p&amp;lt;0.001), and were biologically older than COPD patients (p&amp;lt;0.05). These findings suggest the need for monitoring aging in pauci- and asymptomatic COVID-19 survivors, who represent the majority of the general population.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e5643860f03ea9574a41c7a41d205ac24b871bf138b8117ec3465698b9d33857","category":"Interdisciplinary"}