{"title":"Early prediction of the impact of public health policies on obesity and lifetime risk of type 2 diabetes: A modelling approach","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301463","date":1711634400000,"content":"<p>by Pierre Bauvin, Claire Delacôte, Line Carolle Ntandja Wandji, Guillaume Lassailly, Violeta Raverdy, François Pattou, Sylvie Deuffic-Burban, Philippe Mathurin</p>\r\nObjective <p>Help public health decision-making requires a better understanding of the dynamics of obesity and type 2 diabetes and an assessement of different strategies to decrease their burdens.</p> Methods <p>Based on 97,848 individual data, collected in the French Health, Health Care and Insurance Survey over 1998–2014, a Markov model was developed to describe the progression of being overweight to obesity, and the onset of type 2 diabetes. This model traces and predicts 2022–2027 burdens of obesity and type 2 diabetes, and lifetime risk of diabetes, according to different scenarios aiming at minimum to stabilize obesity at 5 years.</p> Results <p>Estimated risks of type 2 diabetes increase from 0.09% (normal weight) to 1.56% (obesity II-III). Compared to the before 1995 period, progression risks are estimated to have nearly doubled for obesity and tripled for type 2 diabetes. Consequently, over 2022–2027, the prevalence of obesity and type 2 diabetes will continue to increase from 17.3% to 18.2% and from 7.3% to 8.1%, respectively. Scenarios statibilizing obesity would require a 22%-decrease in the probability of move up (scenario 1) or a 33%-increase in the probability of move down (scenario 2) one BMI class. However, this stabilization will not affect the increase of diabetes prevalence whereas lifetime risk of diabetes would decrease (30.9% to 27.0%). Combining both scenarios would decrease obesity by 9.9%. Only the prevalence of obesity III shows early change able to predict the outcome of a strategy: for example, 6.7%-decrease at one year, 13.3%-decrease at two years with scenario 1 stabilizing obesity at 5 years.</p> Conclusions <p>Prevalences of obesity and type 2 diabetes will still increase over the next 5 years. Stabilizing obesity may decrease lifetime risks of type 2 diabetes without affecting its short-term prevalence. Our study highlights that, to early assess the effectiveness of their program, public health policy makers should rely on the change in prevalence of obesity III.</p>","author":"Pierre Bauvin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e56639ffb3adc96c194291c0ec8f79599aea00026fa88bbeba4e728bc69c41fd","category":"Interdisciplinary"}