{"title":"Incidence and survival of second primary non-Hodgkin lymphoma: A Surveillance, Epidemiology, and End Results-based cohort study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300330","date":1710165600000,"content":"<p>by Nasha Yu, Weiming Zhang, Xing Zhong, Xiangxiang Song, Wuping Li</p>\r\nBackground <p>The aim of this study was to investigate patient survival and factors associated with survival in second primary non-Hodgkin lymphoma (NHL) compared with the first primary NHL.</p> Methods <p>The retrospective cohort study used data from the Surveillance, Epidemiology, and End Results (SEER) database between 2000 and 2014. Demographic characteristics, histological types, Ann Arbor stage, and treatment information were collected. Cox proportional hazard models were used to estimate hazard ratios (HRs) and 95% confidence intervals (CIs) for factors associated with overall survival (OS) and cancer-specific survival (CSS) in the first and second primary NHLs.</p> Results <p>Of 318,168 cases followed for 5 years, 299,248 patients developed the first primary NHL and 18,920 patients developed the second primary NHL. This study identified a rising incidence of first and second primary NHL from 2000 to 2014. For the second primary NHL, the OS risk was higher when compared to the first primary NHL (HR: 1.13, 95% CI: 1.11 to 1.15, <i>P</i> &lt;0.001). Risk factors that negatively affected OS in the first primary NHL included being male, over 40 years of age, certain marital statuses, specific histological types, and advanced disease stages. In contrast, being of White race and having histological types such as Follicular Lymphoma (FL), Marginal Zone Lymphoma (MZL), and mantle B-cell NHL were associated with better OS outcomes. Treatments like surgery, radiation therapy, and chemotherapy were associated with a lower risk of OS and CSS in the first primary NHL. For the second primary NHL, the detrimental risk factors were similar but also included being over the age of 60. Certain histological types showed a lower OS risk relative to diffuse Large B-cell Lymphoma (DLBCL). While surgery and chemotherapy were beneficial for OS, radiation therapy did not improve survival in second primary NHL cases. Notably, undergoing chemotherapy for the first primary cancer increased the OS risk in the second primary NHL, whereas surgery and radiation seemed to offer a protective effect against OS risk in the second primary NHL (all <i>P</i> &lt;0.05).</p> Conclusion <p>Our findings emphasize the need for tailored strategies in managing the second primary NHL, given the distinct survival patterns and risk factor profiles compared to the first primary NHL. Future research should aim to further elucidate these differences to improve prognosis and treatment approaches for second primary NHL patients.</p>","author":"Nasha Yu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e56bb548011fbec3802d69e98169b1d9265ae5f449f2c35e918ece5aa3120063","category":"Interdisciplinary"}