{"title":"Feedbacks From Young Permafrost Carbon Remobilization to the Deglacial Methane Rise","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024GB008164?af=R","date":1729597132000,"content":"<h2>Abstract</h2>\n<p>The abrupt warming events punctuating the Termination 1 (about 11.7–18 ka Before Present, BP) were marked by sharp rises in the concentration of atmospheric methane (CH<sub>4</sub>). The role of permafrost organic carbon (OC) in these rises is still debated, with studies based on top-down measurements of radiocarbon (<sup>14</sup>C) content of CH<sub>4</sub> trapped in ice cores suggesting minimum contributions from old and strongly <sup>14</sup>C-depleted permafrost OC. However, organic matter from permafrost can exhibit a continuum of <sup>14</sup>C ages (contemporaneous to &gt;50 ky). Here, we investigate the large-scale permafrost remobilization at the Younger Dryas-Preboreal transition (ca. 11.6 ka BP) using the sedimentary record deposited at the Lena River paleo-outlet (Arctic Ocean) to reflect permafrost destabilization in this vast drainage basin. Terrestrial OC was isolated from sediments and characterized geochemically measuring δ<sup>13</sup>C, Δ<sup>14</sup>C, and lignin phenol molecular fossils. Results indicate massive remobilization of relatively young (about 2,600 years) permafrost OC from inland Siberia after abrupt warming triggered severe active layer deepening. Methane emissions from this young fraction of permafrost OC contributed to the deglacial CH<sub>4</sub> rise. This study stresses that underestimating permafrost complexities may affect our comprehension of the deglacial permafrost OC-climate feedback and helps understand how modern permafrost systems may react to rapid warming events, including enhanced CH<sub>4</sub> emissions that would amplify anthropogenic climate change.</p>","author":"M. Sabino, \nÖ. Gustafsson, \nB. Wild, \nI. P. Semiletov, \nO. V. Dudarev, \nG. Ingrosso, \nT. Tesi","siteTitle":"Wiley: Global Biogeochemical Cycles: Table of Contents","siteHash":"a2d4e750daa5e386ca7dda0c54cc50454a723cbd123b964bfed1d56a4712b632","entryHash":"e57fc03495cf409d249f9a44785ba274dfd211235f1302f2602e7a2a618d071b","category":"Environment"}