{"title":"PSI-2 Daily thermoregulatory performance patterns of Duroc boars with or without electronically controlled floor cooling pads during the peak summer heat stress period","link":"https://academic.oup.com/jas/article/102/Supplement_2/350/7664881?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of the study was to evaluate the daily thermoregulatory pattern of Duroc boars with and without electronically controlled floor cooling pads (ECP) during the summer season in a boar stud at Scottsville, Kentucky. Thirty boars were placed in two rows of pens (2.06 x 0.66 m) of a 350 head tunnel ventilated barn and were randomly assigned to either CONTROL (n = 15; no ECP) or PAD (n = 15; 4.25 L cold water flushed when sensors reached 27°C or every 4 min, whichever occurred first, through a group of 5 pads connected to each other) treatments. Boars experienced natural seasonal heat stress (daily mean temperature = 25.7°C; hourly high temperature = 28.8°C, corresponding relative humidity = 85.4%, corresponding dew point = 26°C) during the period of 4 d wherein the ECP remained on, and flushing based on the setpoints mentioned above. Rectal temperature (RT) and respiration rate (RR) were taken at 600, 830, 1100 1330, 1600, 1830 and 2100 h daily for all 4 d. Two statistical analyses were conducted. The first was a mixed model including the fixed effects of ECP, day, time of measurement and their interactions with boar included as a random effect. Secondly, mixed model periodic regressions were fitted to the RR and RT data. Both RT and RR were impacted by ECP, day, time, and all two and three factor interactions (<span>P</span> &lt; 0.001). The final periodic regression model for RR included the random effect of boar, main effect of ECP, interaction of ECP and day, single phase sine/cosine and 2-phase cosine variables, the interaction with the single 2 and 3 phase sine/cosine variables with day (<span>P</span> &lt; 0.001). The periodic regression results indicate that the response of the ECP to reduce RR were consistent relative to the time of the day (mean of 57.5 breaths/min versus 18.9 breaths/min, <span>P</span> &lt; 0.001) but the overall response in RR relative to time of day was variable for the four days. The final model for RT using periodic regression included the random effect of boar, ECP, single-phase sine and cosine and three-phase sine variables (<span>P</span> &lt; 0.001) and interaction of single-phase sine by ECP (<span>P</span> = 0.001) and interaction of the three-phase sine with day. The interaction of the ECP by single phase sine interaction was due to an increase in temperature from 600 to 1330 for control boars (0.21°C) versus no change for boars on the ECP. The ECP reduced RT at all measurement times, a lesser extent from 600 to 1100 (0.31°C to 0.37°C) and greater extent from 1330 (0.59°C) and 1600 h (0.63°C) and 2100 (0.67°C). The impact of the ECP to reduce RR and RT varied from day to day with greater effects on the days with higher barn temperatures.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e581036cf003bb8b5f463dfb52fc6d6687b309219f56f365c529112217205ee9","category":"Environment"}