{"title":"X-ray imaging of The Night Watch reveals previously unknown lead layer","link":"https://arstechnica.com/?p=1990394","date":1702666832000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/nightwatch5CROP-800x534.jpg\" alt=\"The Nightwatch, or Militia Company of District II under the Command of Captain Frans Banninck Cocq (1642)\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/nightwatch5CROP.jpg\">Enlarge</a> <span>/</span> Rembrandt's <em>The Night Watch</em> underwent many chemical and mechanical alterations over the last 400 years. (credit: Public domain)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Rembrandt's <em>The Night Watch</em>, painted in 1642, is the Dutch master's largest surviving painting, known particularly for its <a href=\"https://arstechnica.com/science/2019/02/scientists-solve-the-mystery-of-rembrandts-impasto-paint-recipe/\">exquisite use</a> of light and shadow. A new X-ray imaging analysis of the masterpiece has revealed an unexpected lead layer, perhaps applied as a protective measure while preparing the canvas, according to a <a href=\"http://www.science.org/doi/10.1126/sciadv.adj9394\">new paper</a> published in the journal Science Advances. The work was part of the Rijksmuseum's ongoing <a href=\"https://www.rijksmuseum.nl/en/stories/operation-night-watch\">Operation Night Watch</a>, the largest multidisciplinary research and conservation project for Rembrandt's famous painting, devoted to its long-term preservation.</p>\n<p>The famous scene depicted in <em>The Night Watch</em>—officially called <em>Militia Company of District II under the Command of Captain Frans Banninck Cocq</em>—was not meant to have taken place at night. Rather, the dark appearance is the result of the accumulation of dirt and varnish over four centuries, as the painting was subject to various kinds of chemical and mechanical alternations.</p>\n<p>For instance, in 1715, <em>The Night Watch</em> was moved to Amsterdam’s City Hall (now the Royal Palace on Dam Square). It was too large for the new location, so the painting was trimmed on all four sides, and the trimmed pieces were never found (although <a href=\"https://hyperallergic.com/658816/artificial-intelligence-helps-reconstruct-the-night-watch-rembrandt/\">in 2021</a>, AI was used to re-create the original full painting). The objective of Operation Night Watch is to employ a wide variety of imaging and analytical techniques to better understand the materials Rembrandt used to create his masterpiece and how those materials have changed over time.</p></div><p><a href=\"https://arstechnica.com/?p=1990394#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1990394&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e585688f755e38e3a67a4b9bc64f58c541e9416cc29747f79c04e98e54928245","category":"Tech"}