{"title":"Sean Gallagher and an AI expert talk about our crazy machine-learning adventure","link":"https://arstechnica.com/?p=1783029","date":1627483700000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Recorded on July 28, 2021. <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GMT20210728-170055_Recording_avo_1920x1080.pdf\">Click here for transcript</a>. </p></div>\n<p>We've spent the past few weeks burning copious amounts of AWS compute time <a href=\"https://arstechnica.com/feature-series/is-our-machine-learning/\">trying to invent an algorithm to parse Ars' front-page story headlines</a> to predict which ones will win an A/B test—and we learned a lot. One of the lessons is that we—and by \"we,\" I mainly mean \"me,\" since this odyssey was more or less my idea—should probably have picked a less, shall we say, <em>ambitious</em> project for our initial outing into the machine-learning wilderness. Now, a little older and a little wiser, it's time to reflect on the project and discuss what went right, what went somewhat less than right, and how we'd do this differently next time.</p>\n<p>Our readers had tons of incredibly useful comments, too, especially as we got into <a href=\"https://arstechnica.com/information-technology/2021/07/our-ai-experiment-continues-did-we-break-the-machine/\">the meaty part</a> of the project—comments that we'd love to get into as we discuss the way things shook out. The vagaries of the edit cycle meant that the stories were being posted quite a bit after they were written, so we didn't have a chance to incorporate a lot of reader feedback as we went, but it's pretty clear that Ars has some top-shelf AI/ML experts reading our stories (and probably groaning out loud every time we went down a bit of a blind alley). This is a great opportunity for you to jump into the conversation and help us understand how we can improve for next time—or, even better, to help us pick smarter projects if we do an experiment like this again!</p>\n<p>Our chat was held on July 28, at 1:00 pm Eastern Time (that's 10:00 am Pacific Time and 17:00 UTC). Our three-person panel will consisted of Ars Infosec Editor Emeritus <a href=\"https://arstechnica.com/author/sean-gallagher/\">Sean Gallagher</a> and <a href=\"https://arstechnica.com/author/lee-hutchinson/\">me</a>, along with Amazon Senior Principal Technical Evangelist (and AWS expert) Julien Simon. To watch, use the player embedded at the top of this story.</p></div><p><a href=\"https://arstechnica.com/?p=1783029\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1783029&amp;comments=1\">Comments</a></p>","author":"Lee Hutchinson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e5885bd51f13cb5c45b03a1d5b27f28d5a96a8f4f616986fe70b7e2e2215a9e7","category":"Tech"}