{"title":"Modified POM Analysis of Substituted 8-Hydroxyquinolines as Perspective Antibacterial Agents In Silico and Their In Vitro Antibacterial Activity Screening","link":"https://www.preprints.org/manuscript/202407.1665/v1","date":1721620205000,"content":"The collection of forty-nine 8-hydroxyquinoline derivatives, substituted at C5, C6 or C7, was designed and studied by computational methods of modified POM analysis, using SwissADME, Osiris and Molinspiration tool. POM analysis (Petra/Osiris/Molinspiration) and its modified version using SwissADME instead of Petra software are indisputably tools of modern chemoinformatics, often published in the professional literature as well as in the field of research of new antibacterial active compounds, developed to replace existing antibiotics that fail due to increased resistance of bacteria. NitroxolineTM and the group of 8-hydroxyquinoline derivatives with their broad antibacterial effect and the possibility of extensive derivatization of the skeleton, represent a promising direction in the research of new antibacterial active substances. Twenty 8-hydroxyquinoline derivatives were also evaluated on their antibacterial activity against eight selected G+ and G- bacterial strains with a defined resistance mechanism. All structures were in accordance with Lipinski's criteria, twenty-one structures were interesting from the point of view of individual or average value of the bioactivity prediction score and fourteen structures showed one or more mechanisms of toxicity prediction. Furthermore, eleven structures showed a low rate of GI absorption or the inability to cross the BBB barrier, fourteen substances showed a BRENK or PAIN warning, eleven substances are an undesirable substrate of P-glycoprotein and all structures predicted the same level of bioavailability and a relatively low rate of metabolism in the liver. Five structures were selected by the intersection of the POM criteria. The virtual structures 17, 25, 35 and 43 can be favored for the continuity of next study. The resulting scores of bioactivity can indicate the potential of studied structures to be used for the design and development of new active antibacterial agents.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e59560513eab0d7941aef4f179664b50918cb57e3e89fa425733a18ba6bcfaa7","category":"Interdisciplinary"}