{"title":"A new empirical framework to quantify the hydraulic effects of soil and atmospheric drivers on plant water status","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17222?af=R","date":1709798400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/83aedeec-d340-403e-b6cf-76cd44ce03f3/gcb17222-toc-0001-m.png\" alt=\"A new empirical framework to quantify the hydraulic effects of soil and atmospheric drivers on plant water status\" />\n<p>We developed a novel method to quantify how much plants regulate their internal water status in response to soil and atmospheric drought. This is useful to interpret laboratory, field and remote sensing information related to plant water status. The metric presented here generalizes existing metrics and expands them to include atmospheric drought, a phenomenon that is currently increasing globally as a result of climatic changes.</p>\n<br />\n<h2>Abstract</h2>\n<p>Metrics to quantify regulation of plant water status at the daily as opposed to the seasonal scale do not presently exist. This gap is significant since plants are hypothesised to regulate their water potential not only with respect to slowly changing soil drought but also with respect to faster changes in air vapour pressure deficit (VPD), a variable whose importance for plant physiology is expected to grow because of higher temperatures in the coming decades. We present a metric, the stringency of water potential regulation, that can be employed at the daily scale and quantifies the effects exerted on plants by the separate and combined effect of soil and atmospheric drought. We test our theory using datasets from two experiments where air temperature and VPD were experimentally manipulated. In contrast to existing metrics based on soil drought that can only be applied at the seasonal scale, our metric successfully detects the impact of atmospheric warming on the regulation of plant water status. We show that the thermodynamic effect of VPD on plant water status can be isolated and compared against that exerted by soil drought and the covariation between VPD and soil drought. Furthermore, in three of three cases, VPD accounted for more than 5 MPa of potential effect on leaf water potential. We explore the significance of our findings in the context of potential future applications of this metric from plant to ecosystem scale.</p>","author":"Maurizio Mencuccini, \nWilliam R. L. Anderegg, \nOliver Binks, \nThorsten Knipfer, \nAlexandra G. Konings, \nKim Novick, \nRafael Poyatos, \nJordi Martínez‐Vilalta","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"e59ceeb11b36b4a39cb34372397c41a458a6363975697c4bcf0e49198a95eddf","category":"Environment"}