{"title":"The Rest Day Jersey Debrief","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-rest-day-jersey-debrief","date":1625500834000,"content":"\n      <p><span>Some are already engraving Tadej <span>Pogačar</span>’s name into the history books as the winner of the 2021 Tour de France. But at the first rest day, the Tour is yet to reach the halfway point and there is plenty of racing left. </span></p>\n<p><span>As c<span>liché as it may be, </span>anything could still happen. We review the race so far in the four individual jerseys at the 2021 Tour de France.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b><i>Tour de France 2021 Guide</i></b></a></p>\n<div></div>\n<h4><b>Yellow Jersey</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1326963858-min_1024x1024.jpg?v=1625492176\" />Image credit: Chris Graythen/Getty Images</span></i></p>\n<p><span>Julian Alaphilippe began in the yellow jersey before handing it over to Mathieu van der Poel. The Dutchman retained yellow for six stages, surpassing expectations with a fine time-trial on stage 5. </span></p>\n<p><span>However, the GC battle has been about one man: Tadej <span>Pogačar</span>. After <span>Pogačar </span>narrowly defeated <span>Primož Roglič</span> at the Tour de France last season, many expected a rematch between <span>Pogačar </span>and his compatriot. However, <span>Roglič </span>crashed on stage 3 and although he showed promising signs on the stage 5 time trial, he has since abandoned the Tour de France. This is the first time in <span>Roglič</span>’s career where he has failed to win a stage at a Grand Tour.</span></p>\n<p><span>With <span>Roglič </span>out of contention, <span>Pogačar </span>has built a commanding lead. The 22-year-old attacked on the Col de Romme and in doing so put his rivals to the sword. He gained the yellow jersey after gaining over three minutes on all the others contending for GC, claiming the yellow jersey in the process.</span></p>\n<p><span>Ben O’Connor finds himself in a very promising second position. The Australian’s GC bid didn’t get off to a good start — he lost almost two minutes on the <span>Mûr-de-Bretagne</span>. However, O’Connor joined the mega breakaway on stage 9, and won the stage by over five minutes, dropping Nairo Quintana and Sergio Higuita in the process. Now, with multiple minutes to those behind, O’Connor is a genuine contender to finish on the podium in Paris. </span></p>\n<p><span>Rigoberto <span>Urán</span>, Richard Carapaz and Jonas Vingegaard are perhaps the three riders that look most likely to compete for a podium position. Wilco Kelderman, David Gaudu and Enric Mas are still in contention too.</span></p>\n<h4><b>Polka-Dot Jersey</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210704TDF1052-A.S.O._Pauline_Ballet-min_1024x1024.jpg?v=1625492194\" />Image credit: </span></i><i><span>A.S.O./Pauline Ballet</span></i></p>\n<p><span>The polka-dot jersey has been hotly contested at the 2021 Tour de France so far. Ide Schelling gained the jersey with a solo attack on stage 1 and fended off Anthony Perez of Cofidis valiantly on stage 2. The Dutch Tour debutant was able to hold the jersey until stage 7, where alongside stage victory, Matej <span>Mohorič</span>’s colossal attack enabled him to gain the polka-dot jersey too.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/polka-dot-duel-ide-schelling-s-impressive-start-to-le-tour\"><em><strong>Related – Ide Schelling's sublime Tour debut</strong></em></a></p>\n<p><span>However, the major KOM points were awarded in the Alps on stages 8 and 9. Wout Poels was aggressive on stage 8 which meant <span>Mohorič </span>would hand the polka-dot jersey to his team-mate. However, Nairo Quintana was among the most offensive on stage 9 and although he has serious competition in Mike Woods and previous jersey holder Wout Poels, Quintana enters the first rest day leading the competition.</span></p>\n<p><span>The Colombian won the polka-dot jersey in 2013 and has said it is one of his major objectives at the Tour de France this year. This looks to be between Quintana, Woods and Poels. </span></p>\n<h4><b>Green Jersey</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210701TDF1030-A.S.O._Pauline_Ballet-min_1024x1024.jpg?v=1625492276\" />Image credit: </span></i><i><span>A.S.O./Pauline Ballet</span></i></p>\n<p><span>Julian Alaphilippe held the green jersey early on after winning the first stage of the 2021 Tour de France. However, Alaphilippe would pass green to his team-mate Mark Cavendish after the Manx Missile won his first Tour de France stage in four years in Fougères. Cavendish doubled up with another win in Châteauroux on stage 6 which means he is the rider to beat in the points classification.</span></p>\n<p><span>Peter Sagan has won the green jersey seven times in his career but is struggling to pose a challenge this season. The Slovakian Champion is currently eighth in the standings with 72 points, almost 100 down on Cavendish’s total of 168. </span></p>\n<p><span>Instead, Sonny Colbrelli and Michael Matthews are Cavendish’s closest rivals. Both are much better climbers than Cavendish, which Colbrelli displayed when climbing to finish third on stage 9 to Tignes. Matthews and Colbrelli can reach intermediate sprints located beyond difficult climbs, something that Cavendish cannot. This means that if Cav is to win the second green jersey of his career — ten years after his first and only green jersey — he must continue to dominate the mass sprints and remain within the time limit in the high mountains.</span></p>\n<h4><b>White Jersey</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210701TDF1008-A.S.O._Pauline_Ballet-min_1024x1024.jpg?v=1625492292\" />Image credit: </span></i><i><span>A.S.O./Pauline Ballet</span></i></p>\n<p><span>When the leader of the yellow jersey happens to be 22 years old, the white jersey becomes a bit of a procession. <span>Pogačar</span> boasts a handsome lead in the white-jersey on the first rest day — he leads Jonas Vingegaard by over five and a half minutes. The Slovenian is the only rider to have worn the jersey after gaining it on stage 1. The last rider to hold the jersey for every stage of the Tour de France was Jan Ullrich in 1997.</span></p>\n<p><span>Behind Vingegaard, David Gaudu is <span>Pogačar</span>’s next challenger, but he is already seven and a half minutes back.</span></p>\n<p><i><span>Cover image: A.S.O./Charly Lopez</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e59e08100b25e7ef0594fde5115c93b110cfc7a4db36a9ccc74a79c4ba8d1e50","category":"Cycling"}