{"title":"276 Effects of a phytogenic feed additive fed during lactation on sow and litter performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/172/7665037?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The purpose of this study was to investigate the impact of a phytogenic feed additive on sow and litter performance. Six cohort groups of sows (n = 250) were used in this experiment. Dietary treatments were: 1) a corn-soybean meal diet (Control); 2) Control containing 150 ppm of a phytogenic feed additive (Low); and 3) Control + 200 ppm of a phytogenic feed additive (High). The feed additive contained a proprietary formulation of turmeric, capsicum, and black pepper oleoresins (Fytera Care, Selko USA, Indianapolis, IN). Sows were moved to a farrowing room and housed in individual farrowing stalls at 109 d of gestation. Diets were formulated to meet or exceed nutrient requirements for lactating sows, as outlined by NRC (2012). During lactation, sows were allowed ad libitum access to feed and water. Piglets were cross-fostered within dietary treatments within 24 h of birth to equalize suckling intensity as much as possible. Piglet mortalities were recorded daily. Statistical analyses included a one-way ANOVA with repeated measurements in time when appropriate. The statistical model included the fixed effect of dietary treatment, and the random effect of cohort group with parity as a covariate. We observed no significant interactions between dietary treatment and time for any measured response variable. Average daily feed intake of sows, sow body weight, wean-to-estrus interval, and the proportion of sows expressing estrus by d 14 postweaning were not significantly different across treatments (Table). We observed a tendency (<span>P</span> = 0.074) for increased loss of backfat depth during lactation for sows fed Low and High compared with sows fed Control diet. Dietary treatments did not affect litter size, litter weight, or litter weight gain. Percentage of piglet mortality before cross-fostering tended to be less (<span>P</span> = 0.056) for High-fed sows compared with Control sows. However, piglet mortality after cross-fostering was not affected by diet. In conclusion, under the conditions of this experiment, feeding 150 or 200 ppm of the phytogenic feed additive to lactating sows did not substantially improve sow or litter performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e59ed1d431cb58376944a743e780671e36baafc4cfec8ca9ee668b99c897139f","category":"Environment"}