{"title":"Racial disparities in maternal blood transfusion in the United States by mode of delivery","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312110","date":1729519200000,"content":"<p>by Parnian Hossein-Pour, Maya Rajasingham, Michelle P. Zeller, Giulia M. Muraca</p>\r\nBackground <p>Despite well-documented racial disparities in maternal health in the United States, gaps remain in characterizing the distribution of these disparities in maternal blood transfusion.</p> Objective <p>To assess racial disparities in maternal blood transfusion using detailed, self-identified racial groupings in the United States overall and stratified by mode of delivery.</p> Study design <p>We performed a population-based, retrospective cohort study of full term, live births (2016–2021) using the National Vital Statistics System’s Natality Files. Regression models were constructed to estimate adjusted odds ratios (aORs) and 95% confidence intervals (CIs) of maternal blood transfusion by self-identified maternal race in the total population, and among subgroups stratified by mode of delivery. Models were adjusted for maternal and obstetric practice factors.</p> Results <p>The study included 17,905,699 deliveries; maternal blood transfusion occurred in 3.4 per 1,000 deliveries. Compared with individuals who identified as White (3.3 per 1,000 transfusion rate), higher odds of transfusion were found among those who identified as American Indian and Alaska Native (AIAN; aOR 2.36, 95% CI 2.23–2.49), Black (aOR 1.15, 95% CI 1.12–1.17), Filipino (aOR 1.33, 95% CI 1.22–1.44), Korean (aOR 1.25, 95% CI 1.10–1.42), and Pacific Islander (aOR 1.63, 95% CI 1.45–1.83). The frequency of transfusion and racial disparities in transfusion varied substantially by mode of delivery. Lower rates of transfusion in Black vs White patients were observed in the spontaneous vaginal delivery (2.2 vs 2.3 per 1000; aOR 0.95, 95% CI 0.92–0.99), forceps (6.8 vs 8.9 per 1000; aOR 0.77, 95% CI 0.60–0.99), vacuum (4.2 vs 5.0 per 1000; aOR 0.85, 95% CI 0.74–0.97, and cesarean delivery with trial of labour (8.8 vs 8.9 per 1000; aOR 0.95, 95% CI 0.91–1.00) groups, while a higher rate was shown among cesarean deliveries without trial of labour (6.8 vs 4.3 per 1000; aOR 1.45, 95% CI 1.40–1.51).</p> Conclusion <p>Racial disparities in maternal blood transfusion persist after adjustment for several confounders, particularly for AIAN and Pacific Islander individuals, and vary by mode of delivery.</p>","author":"Parnian Hossein-Pour","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e5a1d4b243510cef9a204f2213e57f57a162a27ced2899b42a060738cc773d21","category":"Interdisciplinary"}