{"title":"Have Specific Composition Diets Been Shown to Be Effective in Reducing Symptoms of Immune-Mediated Inflammatory Diseases in Adulthood, and Could the Comparison Between Them Be Improved? Rapid Review","link":"https://www.preprints.org/manuscript/202409.2450/v1","date":1727708920000,"content":"Diet is considered a possible cofactor that affects the immune system and potentially could cause dysregulation of intestinal homeostasis and inflammation. This study aimed to review the evidence on specific diet composition effects on some immune-mediated inflammatory diseases (IMID) -rheumatoid arthritis (RA), psoriatic arthritis, spondyloarthritis, multiple sclerosis (MS), Inflammatory bowel disease (IBD) [remission maintenance of Crohn´s disease and ulcerative colitis] and psoriasis- symptoms in adult patients. We conducted a rapid review of meta-analyses and Cochrane systematic reviews using PubMed, EMBASE, from inception to September 2024, and Google Scholar. The methodological quality of meta-analyses was assessed using AMSTAR 2 rating. Three COCHRANE systematic reviews and eight meta-analyses \nSome specific composition diets have been shown to reduce symptoms in RA, IBD, and MS; and improve some activity parameters in IBD and RA; with critically low, or low levels of evidence. The reduction in inflammatory biomarker levels is unclear. This review updates the global dietary evidence to improve IMID symptoms, discusses the influences of dietary mechanisms, clarifies the weaknesses of clinical trials and dietary meta-analyses, with critically low, or low levels of evidence, and shows the need to use indexes such as DII, that allow diets to be classified for their content of pro-inflammatory or anti-inflammatory foods, to better compare diet groups in clinical trials. The difficulty in obtaining high-level evidence in dietary studies is apparent, which may delay the application of the results.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e5b81a3d73eac33ffef3a0c19dc64cd3398977bc97419845438982f2ceee9d5d","category":"Interdisciplinary"}