{"title":"How to safely store your COVID vaccine card on your iPhone","link":"https://www.macworld.com/article/353620/iphone-covid-vaccine-passport-app.html","date":1629455700000,"content":"<div>\n<section><div></div></section><p>As we enter another surge of COVID-19 infections here in the U.S., it’s becoming increasingly likely that you may need to show proof of vaccination. Restaurants, large event venues, some airlines, even some workplaces are requiring proof of vaccination in order to use their services. Unfortunately, your vaccine card probably came in the form of a small piece of un-laminated paper that is just slightly too big to fit in a standard wallet.</p>\n\n\n\n<p>Your iPhone to the rescue! There are several potential ways to use your iPhone as a way to store and validate your vaccination status. The simplest is to simply take a photo of your vaccination card, or scan it into a secure note in Notes. There are digital vaccine record apps, too, which might be a little more trustworthy—most will verify your ID and status—and can be quickly scanned to prove vaccination status without revealing any other personal information.</p>\n\n\n\n<p>Whatever you do, don’t rely on carrying around that flimsy paper card! At the very least, consider using your iPhone to create a digital backup for what is increasingly becoming a very important health record.</p>\n\n\n\n<h2>iOS 15 Health app improvements</h2>\n\n\n\n<p><a href=\"https://www.macworld.com/article/350966/ios-15-super-guide-features-tips-tricks-updates-safari-facetime-focus-notification-summary.html\">Coming this fall with iOS 15</a> is a new feature for the Health app that should make it easier to store and share vaccination records. If your health care provider already syncs your health records with the Health app, you may already find your vaccination records there. But not all providers do, and in the case of COVID-19 vaccines, there are lots of places to get them. With iOS 15, heath providers can offer a way to put your immunization and test results in the Health app even if they haven’t fully integrated health records. </p>\n\n\n\n<p>For example, say you get a flu shot or a COVID-19 vaccine from a chain drug store. That drug store chain can provide a secure site or QR code that lets you add a record of the immunization directly into your Health app, even though it doesn’t support fully integrated health records.</p>\n\n\n\n<p>Once that data is in your Health app, other apps (vaccine passport apps, airline apps, and so on) could request it specifically so they can verify your immunization status without obtaining any other personal details.</p>\n\n\n\n<h2>Back up your vaccine card in Photos or Notes</h2>\n\n\n\n<p>There are two easy ways to back up your vaccine card with your iPhone. The simplest (but less secure) way is to simply snap a photo of your card so you can find it in Photos. Make sure the card is centered, well-lit, and if possible try to place it on a dark background. If it’s rotated the wrong way, tap Edit on the photo, then select the crop tool, then rotate the image. If you want to make this image or other important records easier to find, consider creating an Album. In the Photos app, choose <em>Albums</em>, then tap the “+” at the top of the screen and choose <em>New Album</em>. Give it a name like “Documents” or “Records” if you plan to store other important stuff there. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/iphone-covid-scan-card2.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Scanning your card into Notes can offer better security.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>A more secure method is to scan your card in a secure note. </p>\n\n\n\n<ul><li>Open the Notes app and create a new note. </li><li>Give it a name like “COVID-19 vaccine” or whatever will make it easy for you to find later.</li><li>Tap the camera button and select <em>Scan Documents</em>.</li><li>Hold your camera over the front of the card and keep it steady. The camera will focus and a yellow box will cover the card. </li><li>If your iPhone doesn’t automatically capture the image, tap the shutter button to scan.</li><li>Tap <em>Save</em>, and you’ll see the scan in your note. You may have to tap the image and rotate it.</li><li>If you want to secure the note, tap the three-dots menu in the upper right, then choose <em>Lock</em>. You’ll be asked to supply a password, verify it, and give a password hint. You can enable Face ID or Touch ID to unlock the note if you want. </li></ul><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/iphone-covid-locked-note.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>A locked note is end-to-end encrypted and quite secure, but don’t lose the password!</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>This is a good habit to get into for many of your important documents! Consider scanning your passport, driver’s license, important medical records, important home and insurance records, pet vaccination records, and anything else you don’t want to lose. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/guide/security/secure-features-in-the-notes-app-sec1782bcab1/web&amp;xcust=1-1-353620-1-0-0&amp;sref=https://www.macworld.com/feed?\">Notes that are locked with a passphrase are end-to-end encrypted</a> and stored in the cloud separately from your other unencrypted notes. Whatever you do, don’t lose the password! </p>\n\n\n\n<h2>Using a vaccine passport app or service</h2>\n\n\n\n<p>Of course, the business, event, or company you’re dealing with may not simply accept a photo or scan of a vaccine card as proof. It’s a good backup, but that’s easy to fake. There are numerous apps and services offering digital vaccine verification, most of which provide something like a QR code that businesses can quickly scan to verify your status without accessing your personal info.</p>\n\n\n\n<p>You should start with your state’s own digital vaccine records service if it has one. Arizona, Louisiana, Maryland, Mississippi, North Dakota, Washington, West Virginia, and Washington D.C. all use the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://myirmobile.com/&amp;xcust=1-1-353620-1-0-0&amp;sref=https://www.macworld.com/feed?\">MyIR service</a>. California has <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://myvaccinerecord.cdph.ca.gov/&amp;xcust=1-1-353620-1-0-0&amp;sref=https://www.macworld.com/feed?\">myvaccinerecord.cdph.ca.gov</a>, a verification site that shows your status and gives you a QR code you can scan to add your record to your Health app. New York has the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://epass.ny.gov/&amp;xcust=1-1-353620-1-0-0&amp;sref=https://www.macworld.com/feed?\">Excelsior Pass</a>, which is a full vaccine passport app.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/ios-covid-passport-wallet.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Dedicated passport apps can put your vaccine verification right in your Apple Wallet.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>If your state doesn’t have its own vaccine passport app or verification service, or if you’d just rather use something a little more generalized, consider these apps:</p>\n\n\n\n<p>The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/clear-fast-touchless-access/id1436333504&amp;xcust=1-1-353620-1-0-0&amp;sref=https://www.macworld.com/feed?\">Clear app</a> is made to allow you to breeze through security at airports and sports stadiums, but its new Health Pass feature provides a verified vaccine ID you can use anywhere. Clear has partnered with Walgreens to make verification faster and easier for those who got vaccinated there. </p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://gogetdoc.com/vaxyes&amp;xcust=1-1-353620-1-0-0&amp;sref=https://www.macworld.com/feed?\">VaxYes</a> is a free service from GoGetDoc that offers verified digital passports that you can add right to your iPhone Wallet. It’s a good choice for iPhone users that don’t want to download another app.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/commonpass/id1548682047&amp;xcust=1-1-353620-1-0-0&amp;sref=https://www.macworld.com/feed?\">CommonPass</a> is made by The Commons Project and the World Economic Forum and is used by several airlines. It can store both vaccine and test status.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/verifly-fast-digital-identity/id1522957424&amp;xcust=1-1-353620-1-0-0&amp;sref=https://www.macworld.com/feed?\">VeriFly</a> is similar to CommonPass in that it can verify vaccine and test status, and is primarily focused on international travel. It’s the preferred app for several different airlines.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e5be848c3a6c8bff1709ce53a34b1cf55aff74fe60b00dd119f1af029183db7b","category":"Apple"}