{"title":"Zebra_K, a Kinematic Analysis Automated Platform for Assessing Sensitivity, Habituation and Prepulse Inhibition of the Acoustic Startle Response in Adult Zebrafish","link":"https://www.preprints.org/manuscript/202409.0525/v1","date":1725617370000,"content":"The acoustic startle response (ASR) is an explosive motor response leaded by a sudden and intense acoustic stimulus. ASR has several clinically relevant forms of plasticity, including habituation and sensorimotor gating. Although ASR and its plasticity have been intensively studied in different animal models, including zebrafish (Danio rerio) larvae, information in adult zebrafish is still very scarce. In this manuscript we present Zebra_K, a new automated high-content kinematic analysis platform for assessing ASR, its habituation and prepulse inhibition (PPI), a quantitative measure of sensorimotor gating, in adult zebrafish. The analysis of the kinematic parameters in 1,875 ASR in adult zebrafish has shown a single response wave consistent with the short-latency C-bend described in zebrafish larvae. Moreover, protocols have been designed and validated in Zebra_K for the analysis of sensitivity, habituation and PPI of this response. Then, this platform has been used to determine the effect of pharmacological and physiological modulators of ASR plasticity. As described in other animal models, the NMDA-receptor antagonist ketamine increased the responsiveness to the acoustic stimuli, decreasing habituation and leading to complete abolition of PPI. Moreover, the effect of the gender on zebrafish ASR plasticity has been analyzed for the first time. Females exhibited higher responsiveness and a lower habituation and PPI than males, a result consistent with the gender effect described in other animal models and in humans. These results enhance the interest of using adult zebrafish to assess the potential effect of chemicals or genetic manipulations on ASR plasticity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e5c0cbc1c508e4eed7038af56ac2d7ab8566304c720a74fa4223da53fe2de63c","category":"Interdisciplinary"}