{"title":"Research on MODIS Satellite Three-Dimensional Cloud Structure Retrieval and Fusion Technology","link":"https://www.preprints.org/manuscript/202403.1321/v1","date":1711030720000,"content":"This study extends the CGAN-based MODIS cloud vertical-profile (64×64-scene, about 70km width×15km height) retrieval technique developed by Leinonen et al. (2019) [1] to construct seamless 3D cloud fields for the MODIS granules [2]. Firstly, the accuracy and spatial continuity of the Leinonen et al. [1] retrievals are statistically evaluated. Then, according to the characteristics of the retrieval error, a spatially overlapping-scene ensemble generation method and a bi-directional Ensemble Binning Probability Fusion (CGAN-BEBPF) technique are developed, which improves the CGAN retrieval accuracy and support to construct seamless 3D clouds. The CGAN-BEBPF technique involves three steps: cloud masking, intensity scaling, and optimal value selection. It ensures adequate coverage of the low reflectivity areas while preserving the high reflectivity cloud cores. The technique is applied to retrieve the 3D cloud fields of Typhoon Chaba and a multi-cell convective system. The cloud structures of the CGAN-BEBPF results are highly consistent with the ground-based radar observations. It can retrieve weak clouds at the top levels of convective storms and hurricanes that were missed by ground-based radars and fill the gaps of the ground-based radar lower-level PPI scan. Overall, CGAN-BEBPF can be automated to retrieve the rich informative 3D structures of typhoons and severe convective systems over the oceans along the MODIS swath, which certainly presents great value for improving maritime and near-shore typhoons and convection prediction and other cloud-sensitive applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e5c59d46d7bddf5198cd15a01dacee55f9dcdfa50cdccd47b9e6b8ca45ea64b4","category":"Interdisciplinary"}