{"title":"Mechanisms of Water Pollutant Degradation under Electric Discharge Generated in a Cavitating Flow","link":"https://www.preprints.org/manuscript/202409.0329/v1","date":1725505017000,"content":"With the aim of developing an innovative water treatment approach for developing countries in the Global South, we have applied the method of treating a cavitating water stream with a plasma discharge under real conditions. To this end, we have optimised the approach after investigating the effects that occur in the treated medium during such a treatment. Based on the obtained light absorption curves of treated model solutions of titanium oxysulphate and potassium bichromate, it was found that inside the reactor the main role in the destruction of chemical contaminants is played by hydroxide ions, while outside the reactor the main chemical interaction takes place with hydrogen peroxide. The plasma treatment unit was tested in the biological wastewater treatment plants of a health resort on the territory of the Russian Federation (Almetyevsk, Republic of Tatarstan). Water samples taken directly from the tertiary decantation tank were used as real wastewater samples instead of adding chemical reagents for disinfection. It was found that with different modes of operation of the plasma treatment plant, the concentration levels of coliform bacteria, coliphages and Escherichia coli decrease significantly and fall below the limit of permissible concentrations for wastewater discharge. At the same time, the possible effect of the plasma on persistent inorganic compounds was investigated. It was shown that the plasma discharge in the flow of the incoming liquid can almost completely destroy compounds that are difficult to remove, such as hydrogen sulphide and chlorides. In the course of the study, the optimum frequency of the electrical pulses of 68 kHz was selected, which ensures the lowest consumption of electrical energy while maintaining the required efficiency.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e5c9a81a781585aa9616100474e3081ad73fa75e2df8e6961d3bb946f6fdee52","category":"Interdisciplinary"}