{"title":"Vertical trophic structure and niche partitioning of gelatinous predators in a pelagic food web: Insights from stable isotopes of siphonophores","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12536?af=R","date":1709958576000,"content":"<h2>Abstract</h2>\n<p>Gelatinous zooplankton are increasingly recognized as key components of pelagic ecosystems, and there have been many recent insights into their ecology and roles in food webs. To examine the trophic ecology of siphonophores (Cnidaria, Hydrozoa), we used bulk (carbon and nitrogen) and compound-specific (nitrogen) isotope analysis of individual amino acids (CSIA-AA). We collected samples of 15 siphonophore genera using blue-water diving, midwater trawls, and remotely operated vehicles in the California Current Ecosystem, from 0 to 3000 m. We examined the basal resources supporting siphonophore nutrition by comparing their isotope values to those of contemporaneously collected sinking and suspended particles (0–500 m). Stable isotope values provided novel insights into siphonophore trophic ecology, indicating considerable niche overlap between calycophoran and physonect siphonophores. However, there were clear relationships between siphonophore trophic positions and phylogeny, and the highest siphonophore trophic positions were restricted to physonects. Bulk and source amino acid nitrogen isotope (δ<sup>15</sup>N) values of siphonophores and suspended particles all increased significantly with increasing collection depth. In contrast, siphonophore trophic positions did not increase with increasing collection depth. This suggests that microbially reworked, deep, suspended particles with higher δ<sup>15</sup>N values than surface particles, likely indirectly support deep-pelagic siphonophores. Siphonophores feed upon a range of prey, from small crustaceans to fishes, and we show that their measured trophic positions reflect this trophic diversity, spanning 1.5 trophic levels (range 2.4–4.0). Further, we demonstrate that CSIA-AA can elucidate the feeding ecology of gelatinous zooplankton and distinguish between nutritional resources across vertical habitats. These findings improve our understanding of the functional roles of gelatinous zooplankton and energy flow through pelagic food webs.</p>","author":"Elizabeth D. Hetherington, \nHilary G. Close, \nSteven H. D. Haddock, \nAlejandro Damian‐Serrano, \nCasey W. Dunn, \nNatalie J. Wallsgrove, \nShannon C. Doherty, \nC. Anela Choy","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"e5d6b6e536eaa25ba11bb211ffb7c64fd540e23715c59e52e893ad27f9e8a307","category":"Environment"}