{"title":"The Clinical Utilisation and Duration on Treatment with HER2-Directed Therapies in HER2-Positive Recurrent or Metastatic Salivary Gland Cancers","link":"https://www.preprints.org/manuscript/202409.0382/v1","date":1725458704000,"content":"Salivary gland cancers (SGC) are rare tumours with limited availability of systemic therapies. Some SGC subtypes overexpress HER2 and this represents a potential therapeutic target, but the evidence base is limited. This study sought to analyse real-world data on efficacy of HER2-directed therapies in SGC. This is a retrospective observational study using anonymised data from commercial compassionate-use access registrations and a privately funded pharmacy prescribing register. Treatment duration was defined as time from drug initiation to treatment discontinuation. Kaplan-Meier analysis of treatment duration was performed using R for windows (v4.3.2). A case report is also provided of an exceptional responder. Eighteen patients were identified who received HER2-directed therapies for HER2-positive recurrent/metastatic SGC, and complete data on treatment duration was available for 15/18. Histology was salivary duct carcinoma in 13/18 patients, adenocarcinoma NOS in 4/18, and carcinoma ex pleomorphic adenoma in 1/18. Median treatment duration was 8.3 months (95% CI: 6.41-not reached) and the range was 1.0-47.0 months. Choice of HER2-directed therapy varied, with ado-trastuzumab emtasine being most common (9/18). At time of analysis, HER2-directed therapy was ongoing for 9/15, discontinued due to disease progression for 4/15, discontinued due to toxicity for 1/15, and 1/15 was discontinued for an unspecified reason. An exceptional responder experienced a complete response with a treatment duration of 47.0 months. This real-world data is comparable to the median PFS observed with HER2-directed therapies in phase II trials and supports the use of HER2-directed therapies in this group.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e5d612213a9eb6b3573769b931f4cf360b6b7a102dcf7503133fe3099fed4f63","category":"Interdisciplinary"}