{"title":"The association between arthritis and cognitive function impairment in the older adults: Based on the NHANES 2011–2014","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310546","date":1727445600000,"content":"<p>by Taihong Lv, Hanming Yu, Zishuo Ji, Li Ma</p>\r\nObjective <p>Arthritis has been postulated as a prevalent potential risk factor for the emergence of dementia and cognitive impairment. This conjecture prompted an examination of the correlation between arthritis and cognitive impairment using the National Health and Nutrition Examination Survey (NHANES) repository. The analysis was meticulously adjusted for potential confounders such as age and assorted systemic comorbidities, to ensure robustness in the results obtained.</p> Methods <p>Among 2,398 adults aged 60 years and above, logistic regression and cubic spline models were employed to elucidate the relationship between arthritis and cognitive performance. This was assessed utilizing tests such as Immediate Recall test (IRT), Delayed Recall test (DRT), Animal Fluency Test (AFT), and Digit Symbol Substitution Test (DSST).</p> Results <p>In our investigation, a total of 19931 individuals were analyzed, among which 2,398 patients (12.03%) were identified with arthritis. Subjects with arthritis inflammation had lower DSST and AFT scores compared to the healthy group, indicating cognitive decline. After adjusting for all covariates, arthritis was significantly associated with higher DSST and AFT scores by logistic regression modeling (OR: 0.796, 95% CI: 0.649–0.975; OR: 0.769, 95% CI: 0.611–0.968).</p> Conclusion <p>Our analysis underscores the potential linkage between arthritis prevalence and cognitive impairment within a nationally representative of US older adults.</p>","author":"Taihong Lv","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e5d69a96493b070a88a06dca9ddd52e94b3cc1d0b48943667f70753ad9bb9fe9","category":"Interdisciplinary"}