{"title":"X10 Esports จากประเทศไทยคว้าแชมป์ VALORANT Challengers SEA Finals คว้าตั๋วแข่ง Master ที่ประเทศไอซ์แลนด์","link":"https://www.blognone.com/node/122494","date":1620107489000,"content":"<div><div><div><p>จบไปเป็นที่เรียบร้อยกับการแข่งขัน VALORANT Challengers SEA Finals ซึ่งเป็นการแข่งขันในสายภูมิภาคเอเชียตะวันออกเฉียงใต้ แชมป์ประจำสายได้แก่ทีม X10 Esports จากประเทศไทย เป็นการคว้าชัยชนะ Challengers สายภูมิภาค 2 สมัยซ้อนของทีม คว้าตั๋วไปชิงชัยต่อในระดับ Masters ที่ประเทศไอซ์แลนด์</p>\n<p>สำหรับการแข่งขันในสายภูมิภาคนี้ เป็นการนำผู้ชนะในแต่ละประเทศมาเจอกันได้แก่ Bren Esports และ 6045Pirates จากฟิลิปปินส์, CBT Gaming ทีมผสมจากฮ่องกงและไต้หวัน, Paper Rex ทีมผสมจากมาเลเซียและสิงคโปร์, Team nxl และ BOOM Esports จากอินโดนีเซีย, CERBERUS Esports และ FEARUS จากเวียดนาม, X10 Esports และ FULL SENSE จากประเทศไทย</p>\n<p>ผลปรากฎว่าทีมจากประเทศไทยทั้ง 2 ทีมเข้าสู่รอบไฟนอล แข่งกันในรูปแบบ Best Of 5 ผลการแข่งขันคือ X10 Esports ชนะ FULL SENSE ไปด้วยคะแนน 3 ต่อ 1 เกม รับเงินรางวัลในการแข่งขัน 15,000 ดอลล่าห์สหรัฐ รวมไปถึงสิทธิ์ในการเข้าแข่งในทัวร์นาเมนต์ระดับ Masters จัดในรูปแบบออฟไลน์ที่เมือง Reykjavík ประเทศไอซ์แลนด์ โดยจะไปเจอกับทีมในภูมิภาคอื่นๆ ได้แก่ญี่ปุ่น, เกาหลี, บราซิล, ยุโรปและตะวันออกกลาง, ลาตินอเมริการวมไปถึงอเมริกาเหนือ ที่จะเจอกับทีม Sentinels ที่มีผู้เล่นอย่าง Tenz โปรเพลเยอร์ VALORANT เข้าร่วมแข่งขันอีกด้วย</p>\n<p>มาเอาใจช่วย X10 Esports จากทีมไทยในการคว้าแชมป์และติดตามการแข่งขัน VALORANT Champions Tour 2021: Stage 2 Masters ได้ในวันที่ 24 - 30 พฤษภาคมนี้ โดยมีเจ้าภาพงานคือ Riot Games</p>\n<p>ที่มา : <a href=\"https://www.facebook.com/ThaiESL/\">ESL Thailand</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2b3c2e2f3a8d76d62aa86a76b049dcb6.jpg\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9fd1dbdd03051e4982913204d31febc7.jpg\" /><br />\nภาพจาก : <a href=\"https://liquipedia.net/valorant/VALORANT_Champions_Tour/2021/Southeast_Asia/Stage_2/Challengers_Finals\">liquipedia</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/valorant\">Valorant</a></div><div><a href=\"/topics/esports-0\">eSports</a></div><div><a href=\"/topics/thailand\">Thailand</a></div><div><a href=\"/topics/game\">Game</a></div></div></div>","author":"vvkungx","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e5d8c731689eee27371ff519bc312bfa9a84b8dc5b4d2e8bd45d971c64a55eab","category":"Thai"}