{"title":"The rainstorm influence on ecological restoration: A novel response ecological model for an urban shallow lake","link":"https://onlinelibrary.wiley.com/doi/10.1111/wej.12917?af=R","date":1714620392000,"content":"<h2>Abstract</h2>\n<p>Environmental processes in cities and suburbs are significantly impacted by climate change. The development of reliable ecological models may successfully direct agricultural activities. Numerous models have been put forth as of late; however, because to the complexity of environmental microorganisms, their use in complex systems is still restricted. For a better understanding of the ecological restoration of an urban lake system that had been disturbed by rainfall, an improved ecological dynamic model that took into account inundation plants, phytoplankton and microorganisms was proposed based on the field survey. Observed data from a shallow urban lake with a surface area of approximately 66 600 m<sup>2</sup> in the heart of Shunde district, Foshan, in South China, was used to validate the model. In this model, five hypotheses—phytoplankton, microorganisms, NH<sub>3</sub>-N, COD and TP in water—were selected as experimental variables. To assess the model's correctness and dependability, the correlation coefficients (R) and root mean square error-observations standard deviation ratio (RSR) were computed. The results from the establish model (0.446 &lt; R &lt; 0.985, RSR &lt; 0.7) are very similar to those of actual observations. In addition, four microbe species (<i>Aquabacium</i>, <i>Bradyrhizobium japonicum</i>, <i>Curvibacter</i> and <i>Cyanobacteria</i>) multiplied when pollutant concentration dropped. Our model provides a useful tool for managing urban shallow water lakes by properly simulating the dynamic changes of aquatic species and microbes in urban shallow water lakes.</p>","author":"Zhiqiang Yan, \nLuming Wu, \nFenghui Lu, \nJingwen Huang, \nQingwu Long","siteTitle":"Wiley: Water and Environment Journal: Table of Contents","siteHash":"b8106c59269b0bf6595ebcba72d4376e8b07e3df9f0e7d2a7b1cfbc109aa602a","entryHash":"e5d86576f91ee04050aa171277a5edcebd89fe404010bd389f5b118bc07d0693","category":"Environment"}