{"title":"Methodological approach for the evaluation and mapping of the agronomic suitability of soils in tropical zones: Case study of the Bambouto volcanic massif (Western Cameroon) and the Bokito district (Central Cameroon)","link":"https://journals.plos.org/sustainabilitytransformation/article?id=10.1371/journal.pstr.0000067","date":1689256800000,"content":"<p>by Leumbe Olivier, Marie Roumy Ouafo, Paul Ndjigui, Dieudonné Bitom, Marie Paule Mfoumbeng</p>\r\n\r\nThe main pillar of agriculture is the soil because it is both the support and the reservoir of essential nutrients for the plant. The food function it provides for humanity can only be fully fulfilled if it is balanced. Therefore, the development of sustainable agriculture in the world necessarily requires knowledge of the soil. The evaluation of agronomic suitability consists in determining its intrinsic capacity to sustain agricultural productivity over time. Many studies have been conducted in the domain of agricultural land assessment, but the applicability of the methods used in the tropical context requires adaptations that are not always obvious. The new methodological approach we propose for agronomic suitability assessment(AA) was designed and tested in Cameroon (Central Africa) in two pilot sites chosen in two different agro-ecological zones. The sites were the bimodal forest in Bokito which developed on yellow ferralitic soils, and the highland in the Bambouto volcanic massif which had a great pedological variability ranging from red ferralitic soils to andic ferralitic soils and andosols. The approach is inexpensive and based on the combination of four intrinsic soil parameters, namely acidity (pH), useful water reserve (RU), cation exchange capacity (CEC) and erodibility (K); according to the formula: AA = pH × RU × CEC × K. The unit of measurement is the « equivalent hour per mega joule per millimeter (eq.hr. MJ<sup>-1</sup>mm<sup>-1</sup>) ». The results showed that the agronomic suitability of the yellow ferralitic soils of Bokito varies from 0.00 to10.53 eq.hr. MJ<sup>-1</sup>mm<sup>-1</sup>. On the volcanic massif of Bambouto, the agronomic aptitude varies from 0.00 to 15.70 eq.hr. MJ<sup>-1</sup>mm<sup>-1</sup> on the red ferralitic soils of the lower part of the massif, from 15.70 to 41.84 eq.hr. MJ<sup>-1</sup>mm<sup>-1</sup> on andic ferralitic soils of the middle part of the massif and reaches 108.85 eq.hr. MJ<sup>-1</sup>mm<sup>-1</sup> on the andosols of the summit part of the massif. This work could allow, on the one hand, a better allocation of agricultural land and thus participate in the development of second generation agriculture in sub-Saharan Africa; and on the other hand, contribute to determine more precisely the quality and quantity of fertilizer needed to maintain soil balance. Controlling the use of fertilizers will help to significantly reduce the quantities of chemical elements contained in agricultural products, limit water and soil pollution and thus better preserve human health.","author":"Leumbe Olivier","siteTitle":"PLOS Sustainability and Transformation","siteHash":"5acd099bb614e5ebff1e724af0cad6ab2b3ef1c50ce1616dc0b5d51f3d4a8e96","entryHash":"e5de0d89f25dfcf07a76286b5a43b3ef779e27870f149f216cccec2097fa3dbc","category":"Environment"}