{"title":"Network specificity decreases community stability and competition among avian haemosporidian parasites and their hosts","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13831?af=R","date":1715764666000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Parasites play a fundamental role in shaping ecological communities and influencing trophic interactions. Understanding the factors that drive parasite impacts on community structure and stability (i.e. resilience to disturbances) is crucial for predicting disease dynamics and implementing effective conservation strategies. In this study, using avian malaria and malaria-like parasites as a model system, we investigated the relationship between specificity, community stability and parasite vulnerability and their association with host diversity and climate.</p>\n<h2>Location</h2>\n<p>Global.</p>\n<h2>Time period</h2>\n<p>2009–2023.</p>\n<h2>Major taxa studied</h2>\n<p>Avian malaria and malaria-like parasites.</p>\n<h2>Methods</h2>\n<p>By compiling occurrence data from a global avian haemosporidian parasite database (MalAvi), we constructed a comprehensive dataset encompassing 60 communities. We utilized a phylogenetic model approach to predict missing host–parasite interactions, enhancing the accuracy of our analyses. Network analyses based on bipartite interactions provided measures of network specificity, stability, modularity, parasite competition and vulnerability to extinction.</p>\n<h2>Results</h2>\n<p>We found that the high network specificity reduced community stability and decreased competition among parasites. Furthermore, we found that parasite vulnerability decreased with increasing community stability, highlighting the importance of community stability in host–parasite interactions for long-term parasite persistence. When exploring the influence of local host diversity and climate conditions on host–parasite community stability, we demonstrated that increasing host biodiversity and precipitation reduces parasite competition. Conversely, higher temperature raises competition among parasites.</p>\n<h2>Conclusion</h2>\n<p>These findings provide valuable insights into the mechanisms underlying parasite impacts on communities and the interplay between specificity, community stability and environmental factors. Further, we reveal the role of climate in shaping host–parasite interactions. By unravelling the complexities of parasite-mediated interactions, our research substantially improves the current knowledge of the importance of specificity as a modulator of interactions in bipartite networks.</p>","author":"Daniela de Angeli Dutra, \nRobert Poulin","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"e5e823312513ef6ca185233e5e964d1f399098e1dc4d0417e05a8a0a2e8adf2e","category":"Environment"}