{"title":"Assessing entrainment of larval fish in the Hogback Diversion Canal, San Juan River","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4258?af=R","date":1708384720000,"content":"<h2>Abstract</h2>\n<p>Water diversions worldwide may entrain or impinge fish and have population-level impacts, but barriers like fish screens can reduce such threats. Traditional barriers are ineffective in the San Juan River, USA, due to high sediment and debris loads, so the Hogback Diversion Canal, NM, employs a novel weir wall design to reduce entrainment of sub-adult and adult fishes. We evaluated the effectiveness of the weir wall in reducing the entrainment of larval fish using a combination of experimental and overnight trials. Larval fish densities were compared between the irrigation canal that delivers water to irrigators and subsequently entrains fish and the bypass canal that conveys water and fish back to the river. The density of hatchery-produced larval fish collected in the irrigation canal during the experimental trial (0.74 fish/m<sup>3</sup>) was 52% of their density in the bypass canal (1.43 fish/m<sup>3</sup>), suggesting entrainment reduction. The density of wild-produced larvae during overnight trials indicated some minor, mostly nonsignificant, differences between catch rates in irrigation and bypass canals, ontogenetic phases, and sampling dates. Though entrainment rates of wild-produced larvae were not significantly reduced, density differences among postflexion mesolarvae and metalarvae suggest possible entrainment reduction of more developed ontogenetic phases. More intensive research is necessary to better elucidate the efficacy of the novel weir wall for reducing the entrainment of larval fish. However, our larval fish results and the results from prior large-bodied entrainment studies suggest the novel weir wall may reduce fish entrainment in water diversions and benefit fluvial ecosystems in which traditional screens are unfeasible.</p>","author":"Stephani L. Clark Barkalow, \nRobert K. Dudley, \nSteven P. Platania, \nW. Howard Brandenburg, \nMark C. McKinstry, \nGary C. White","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"e5e8cd5a2bf5fa4460d36916aa5dedcfbcc06457401490ec1cc9788367270650","category":"Environment"}