{"title":"Urbanisation and agricultural intensification modulate plant–pollinator network structure and robustness","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14503?af=R","date":1709702006000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/a9241038-25ff-45a7-9a40-19db3882786a/fec14503-toc-0001-m.png\" alt=\"Urbanisation and agricultural intensification modulate plant–pollinator network structure and robustness\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/10/urbanization-and-agricultural-intensification-affect-plant-pollinator-coextinctions-by-altering-interaction-structure/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nLand use change is a major pressure on pollinator abundance, diversity and plant–pollinator interactions. Far less is known about how land-use alters the structure of plant–pollinator networks and their robustness to plant–pollinator coextinctions.\n\nWe analysed the structure of plant–pollinator networks sampled in 12 landscapes along an urbanisation and agricultural intensity gradient, from early spring to late summer 2021, and used a stochastic coextinction model to correlate plant–pollinator coextinction risk with network structure (species and network-level metrics) and landscape context.\n\nNetworks in intensively managed (i.e., agricultural and urban) landscapes had a lower risk of initiating a coextinction cascade, while networks in less intensively managed landscapes may be less robust. Network structure modulated the frequency and severity of coextinctions and species loss, while the strength of species interactions increased robustness.\n\nUrban networks were more species rich and symmetrical due to the high diversity of ornamental plants, while intensively managed agricultural landscapes had smaller, more tightly connected and nested networks.\n\nNetwork structure modulated the frequency of extinctions, which was decreased by greater linkage density, interaction asymmetry and interaction dependence in the networks, while once an extinction occurred, nestedness and linkage density propagated the degree of the coextinction cascade and species loss. At the species level, species strength was inversely correlated with extinction risk, implying that generalist species with a high number of interactions with specialists had the lowest extinction risk.\n\nAn interplay between land-use and network structure affects community robustness to coextinctions with implications for pollination services and plant reproduction. Land-use change or other global change pressures by reorganising species interactions can alter communities and their potential functioning.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/10/urbanization-and-agricultural-intensification-affect-plant-pollinator-coextinctions-by-altering-interaction-structure/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Willem Proesmans, \nEmeline Felten, \nEmilien Laurent, \nMatthias Albrecht, \nNathan Cyrille, \nAudrey Labonté, \nCorina Maurer, \nRobert Paxton, \nOliver Schweiger, \nHajnalka Szentgyörgyi, \nAdam J. Vanbergen","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"e5ede95e1b37732dc7a403dfc46a9d5c82b0dcd9faf6e93633cbc08006003819","category":"Environment"}