{"title":"Here's What Apple Vision Pro's Huge Box Looks Like","link":"https://www.macrumors.com/2024/01/22/heres-what-apple-vision-pros-box-looks-like/","date":1705964705000,"content":"Apple's Vision Pro headset comes in a very large box that uses the company's typically distinctive design language, <em>MacRumors</em> has seen. \r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2024/01/Apple-Vision-Pro-Box-and-Ref-Feature-2.jpg\" width=\"2500\" height=\"1406\" /><em>Render of the <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> box based on official materials.</em></div>\r<br />\nThe packaging, seen by <em>MacRumors</em> in an Apple employee training video, mirrors the design used across many of its other devices that come in boxes that slide open from the top. Those hoping for an exciting new packaging design for the new product line will be disappointed; the top of the cuboid box features a front view of the Vision Pro headset, while each of the longer sides is simply emblazoned with gray Apple \"Vision Pro\" text.\r<br />\n\r<br />\nWhile the design itself may be fairly unremarkable, the box's size is immense, almost filling the entire lap of a customer. This is because it contains a Solo Knit Band, a Dual Loop Band, a Light Seal, two Light Seal cushions, a cover, an external battery pack, a USB-C charging cable, a power adapter, a polishing cloth, and the Vision Pro headset itself, necessitating an extremely large receptacle. Until now, the size and design of the box has been unknown.\r<br />\n\r<br />\nCustomers who purchase a Vision Pro in-store are set to have their device's various sized parts boxed up with the headset itself by <a href=\"https://www.macrumors.com/guide/apple-store/\">Apple Store</a> employees. The device is arranged lengthways in the oblong box and comes pre-attached to the Solo Knit Band. Even though the Vision Pro's box is much larger than that of devices like the <a href=\"https://www.macrumors.com/roundup/mac-studio/\">Mac Studio</a>, which have a fabric handle on the top to help transport it, there is no grab-handle on the top of Vision Pro's box.\r<br />\n\r<br />\nThe Vision Pro headset is set to launch on Friday, February 2. <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> <a href=\"https://x.com/markgurman/status/1749199540723535949?s=20\">yesterday said</a> that the Vision Pro, like the original <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, will be accompanied by a commemorative shopping bag for those who buy or pick-up the device in-store. <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AppleVisionPro\">Vision Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/22/heres-what-apple-vision-pros-box-looks-like/\">Here's What Apple Vision Pro's Huge Box Looks Like</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/heres-what-apple-vision-pros-huge-box-looks-like.2417144/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e5f6ce478f32ea7a9daa618bd7f4ff9a2a3e91dfc39ccfd1a1b96783ac107b5a","category":"Apple"}