{"title":"Song and genetic divergence within a subspecies of white-crowned sparrow (<i>Zonotrichia leucophrys nuttalli</i>)","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304348","date":1716991200000,"content":"<p>by Amy Rongyan Luo, Sara Lipshutz, Jennifer Phillips, Robb T. Brumfield, Elizabeth Perrault Derryberry</p>\r\n\r\nAnimal culture evolves alongside genomes, and the two modes of inheritance—culture and genes—interact in myriad ways. For example, stable geographic variation in culture can act as a reproductive barrier, thereby facilitating genetic divergence between “cultural populations.” White-crowned sparrows (<i>Zonotrichia leucophrys</i>) are a well-established model species for bird song learning and cultural evolution, as they have distinct, geographically discrete, and culturally transmitted song types (i.e., song dialects). In this study, we tested the hypothesis that divergence between culturally transmitted songs drives genetic divergence within Nuttall’s white-crowned sparrows (<i>Z</i>. <i>l</i>. <i>nuttalli</i>). In accordance with sexual selection theory, we hypothesized that cultural divergence between mating signals both preceded and generated genetic divergence. We characterized the population structure and song variation in the subspecies and found two genetically differentiated populations whose boundary coincides with a major song boundary at Monterey Bay, California. We then conducted a song playback experiment that demonstrated males discriminate between songs based on their degree of divergence from their local dialect. These results support the idea that discrimination against non-local songs is driving genetic divergence between the northern and southern populations. Altogether, this study provides evidence that culturally transmitted bird songs can act as the foundation for speciation by sexual selection.","author":"Amy Rongyan Luo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e5f91c5c19d70f3997b4e388705dbb7a9eed5cb6ca73d0fa14349d8d2386d602","category":"Interdisciplinary"}