{"title":"The Bounce Back: Riders who need a return to form in 2021","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/riders-who-must-bounce-back-in-2021","date":1611660575000,"content":"\n      <p><span style=\"font-weight: 400;\">Cycling is a sport of ups and downs, peaks and troughs, strong years and poor years. Naturally, riders can fall out of form or suffer due to unforeseen circumstances. We take a look at some of the cyclists who have recently battled a down year or poor spell and need to bounce back in 2021.</span></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<h4>Greg Van Avermaet: AG2R Citroën</h4>\n<p><span style=\"text-decoration: underline;\"><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_7295_1024x1024.jpg?v=1611593123\" alt=\"Greg Van Avermaet\"></span></span><span style=\"font-weight: 400;\"><i>Greg van Avermaet at the 2019 World Championships with Belgium. (Image credit: Alex Broadway/SWpix.com)</i></span></p>\n<p><span style=\"font-weight: 400;\">We have been accustomed to Greg Van Avermaet winning multiple races every season. This is hardly surprising; he possesses the formidable skills needed to win on a variety of terrains. He has won every year since 2013, but 2020 was the first season in almost a decade where GVA failed to claim a single victory.</span></p>\n<p><span style=\"font-weight: 400;\">It wasn’t for a lack of trying, though. He was three times in the top 5 at the Tour, and claimed top-10s at both Milan-San Remo and Strade Bianche. He planned on building his season towards his home monument and the race he dreams of winning, the Tour of Flanders. However, a crash in </span><span style=\"font-weight: 400;\">Liège-Bastogne-Liège</span><span style=\"font-weight: 400;\">, bizarrely taking place two weeks before the Tour of Flanders, denied him that opportunity. The Belgian described skipping the race as one of the most difficult decisions he’s made in his entire racing career.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/what-does-2021-hold-for-mark-cavendish\">Related – What does 2021 hold for Mark Cavendish?<br></a></strong></em><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/wout-van-aert\">Related – Wout van Aert: Comeback Kid</a></strong></em></p>\n<p><span style=\"font-weight: 400;\">However, now fully recuperated, GVA can look forward to a fresh start as leader for AG2R </span><span style=\"font-weight: 400;\">Citroën</span><span style=\"font-weight: 400;\">, who boast a fully revamped classics squad for 2021. The additions of Bob Jungels, Stan Dewulf and long-term teammate Michael</span><span style=\"font-weight: 400;\"> Schär</span><span style=\"font-weight: 400;\"> mean AG2R have all the cards required to play a great hand in supporting Van Avermaet this season.</span></p>\n<p><span style=\"font-weight: 400;\">Despite the talk of youngsters taking over the world of cycling, at 35-years-old, GVA remains one of the finest one-day racers around. He’s already been on the podium three times at the Tour of Flanders, but standing on the top step this year would not only mean a glorious bounce-back season, but perhaps the most emotional win of his career yet.</span></p>\n<h4>Fabio Aru: Qhubeka ASSOS</h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/c_3_1024x1024.jpg?v=1611593194\" alt=\"Fabio Aru\"></b><i><span style=\"font-weight: 400;\">Fabio Aru wins at the </span></i><i><span style=\"font-weight: 400;\">Giro d'Italia, 2015</span></i><i><span style=\"font-weight: 400;\"> (Image credit:</span></i><i><span style=\"font-weight: 400;\"> Pier Maulini/SWpix.com</span></i><i><span style=\"font-weight: 400;\">)</span></i></p>\n<p><span style=\"font-weight: 400;\">Rewinding to 2017 and Fabio Aru’s final season with Astana, it seemed like an average year for the former Vuelta winner. After claiming the national title, he managed 5th place and a stage win at the Tour de France. The Italian would’ve likely entered the race hoping for a podium, having already claimed three in his career.</span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"></span></p>\n<p><span style=\"font-weight: 400;\">But doesn’t that seem like an eternity away for Fabio, whose three-year spell at UAE can only be described as a nightmare.</span></p>\n<p>Early in 2019, it was discovered that Aru had an iliac artery issue, which prevented him from operating to his maximum capacity. The Italian cried when told of the complication. He had been bewildered for so long as to why he consistently failed to reproduce his earlier form despite total dedication to the sport.</p>\n<p><span style=\"font-weight: 400;\">However, Fabio’s struggles continued into 2020, which was illustrated on stage 9 of the Tour de France when he was dropped before the day’s climbing had begun.</span></p>\n<p><span style=\"font-weight: 400;\">Fabio has spent time racing cyclo-cross during the off-season, something you rarely see from a former Grand Tour champion and was widely applauded by fans. We can’t help but hope he re-discovers his form of old as he embarks on a new adventure with Qhubeka ASSOS in 2021.</span></p>\n<h4><span style=\"font-weight: 400;\">Steven Kruijswijk: Jumbo-Visma</span></h4>\n<p><span style=\"font-weight: 400;\"><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/0W5A5100_1024x1024.jpg?v=1611593259\" alt=\"Steven Kruijswijk\"></b></span><i><span style=\"font-weight: 400;\">Steven Kruijswijk during stage 11 of the 2019 Tour.</span></i><i><span style=\"font-weight: 400;\"> (Image credit: </span></i><i><span style=\"font-weight: 400;\">Zac Williams/SWpix.com</span></i><i><span style=\"font-weight: 400;\">)</span></i></p>\n<p><span style=\"font-weight: 400;\">With the emergence of <span>Primož Roglič</span> as one of the world’s leading Grand Tour riders, Tom Dumoulin’s announcement that he will be taking a prolonged break from cycling, and Sepp Kuss transitioning into one of the world’s premier climbers, no one seems to be talking about Steven Kruijswijk. Perhaps the forgotten man of Jumbo-Visma, Kruijswijk should be treated as anything but that.</span></p>\n<p><span style=\"font-weight: 400;\">This is a rider who would have likely won the Giro d’Italia in 2016 but for an unfortunate crash on the descent of the Colle dell’Agnello. He also finished on the podium in the Tour de France just two years ago.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/desire-journal/pro-team-bikes-2021\">Related – WorldTour team bikes 2021</a></strong></em></p>\n<p><span style=\"font-weight: 400;\">Kruijswijk suffered from a lack of luck in 2020. He looked in good shape at the Tour de l’Ain, where he finished fourth only behind <span>Roglič</span>, Bernal and Quintana. He continued his Tour prep at the <span>Critérium du Dauphiné</span> but crashed on Stage four on a treacherous descent. Tom Dumoulin stated that the road condition was a disgrace, but Kruijswijk’s chances of riding the Tour were over.</span></p>\n<p><span style=\"font-weight: 400;\">He returned to start the Giro, seeking revenge in the shade of pink after his dramatic fall in 2016, but the entire Jumbo-Visma squad abandoned the race after Kruijswijk tested positive for COVID-19.</span></p>\n<p><span style=\"font-weight: 400;\">The Dutchman plans on returning to the Tour de France in 2021. Whether he rides in support of Roglic or for himself, Kruijswijk will be key for Jumbo-Visma should he make it to the startline this time around.</span></p>\n<h4>Chloe Dygert: Canyon SRAM</h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_1947_1024x1024.jpg?v=1611593306\" alt=\"Chloe Dygert\"></b><i><span style=\"font-weight: 400;\">Chloe Dygert on her way to winning Gold in 2019.</span></i><i><span style=\"font-weight: 400;\"> (Image credit: </span></i><i><span style=\"font-weight: 400;\">Alex Whitehead/SWpix.com</span></i><i><span style=\"font-weight: 400;\">)</span></i></p>\n<p><span style=\"font-weight: 400;\">To put things simply, Chloe Dygert is one of the most talented female cyclists in the world right now. She soared to stardom when she annihilated the competition at the 2019 World Championships, winning the 30km time-trial by more than 90 seconds.</span></p>\n<p><span style=\"font-weight: 400;\">However, when looking to defend her title in Imola, the American crashed out on a right-hand corner where she suffered a severe leg injury. During her recovery, it was announced Dygert would sign with Canyon SRAM for 2021, where she would compete in her first season at WorldTour level. Just days after her signing was announced, the American was the subject of social media controversy, forcing her new employers to issue a public apology.</span></p>\n<p><span style=\"font-weight: 400;\">After turning 24 on the first day of 2021, there's a very real prospect that Chloe Dygert could improve substantially. Following her recovery, Dygert needs to turn the spotlight back to her on-road activities, where she already shines as one of the world’s best.</span></p>\n<h4>Egan Bernal: INEOS Grenadiers</h4>\n<div style=\"text-align: left;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20200913TDF1007-A.S.O._Pauline_Ballet_8f98b655-3a47-4a72-9a81-6473269caa8a_1024x1024.jpg?v=1611593371\" alt=\"Egan Bernal\" style=\"float: none;\"></div>\n<p><i><span style=\"font-weight: 400;\">Egan Bernal prior to stage 15 of the 2020 Tour de France. (Image credit: ASO/Pauline Ballet)</span></i></p>\n<p><span style=\"font-weight: 400;\">At the age of just 22, Egan Bernal became a serial winner. He won the 2019 edition of Paris-Nice which was quickly followed by the Tour de Suisse, before going on to become his country’s first Tour de France winner. The world was seemingly at Egan Bernal’s feet.</span></p>\n<p><span style=\"font-weight: 400;\">His troubles in 2020 started </span><span style=\"font-weight: 400;\">at the </span><span style=\"font-weight: 400;\">Critérium du Dauphiné.</span><span style=\"font-weight: 400;\"> A bac</span><span style=\"font-weight: 400;\">k injury meant he left the race early, putting his Tour de France participation in serious doubt. Despite the setback, Bernal started the Tour well and was still in contention entering the final week.</span></p>\n<p><span style=\"font-weight: 400;\">However, the Colombian dropped out the back of the peloton on the Grand Colombier, losing seven minutes which effectively ended his GC-bid. He abandoned the race two days later, concluding his season. It was later revealed that Bernal’s issues stemmed from having one leg longer than the other.</span></p>\n<p><span style=\"font-weight: 400;\">Egan has stated that his number one option for 2021 is the Giro d’Italia, where he is set to make his race debut alongside 2020 cham</span><span style=\"font-weight: 400;\">p T</span><span style=\"font-weight: 400;\">ao Geoghegan Hart.</span></p>\n<h4>Thibaut Pinot: Groupama-FDJ</h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/0W5A4859_1024x1024.jpg?v=1611593429\" alt=\"Thibaut Pinot\"></b><i><span style=\"font-weight: 400;\">Thibault Pinot after losing almost two minutes to his GC rivals at the 2019 Tour. (Image credit: Zac Williams/SWpix.com)</span></i></p>\n<p><span style=\"font-weight: 400;\">Thibaut Pinot arrived at the 2020 Tour de France as one of the leading contenders for the maillot jaune. Just a year prior, he appeared to be the best climber at the race after a glorious win on the revered Col du Tourmalet. His late attack sent team manager Marc Madiot into a frenzy as he cheered him home.</span></p>\n<p><span style=\"font-weight: 400;\">With just days remaining in the race, Pinot was one minute and 50 seconds behind race leader Julian Alaphilippe, but just 20 seconds behind eventual winner Egan Bernal. He had a realistic prospect of becoming France’s first Tour winner since Bernard Hinault in 1985, despite losing almost two minutes in the crosswind-struck stage 10. </span></p>\n<p><span style=\"font-weight: 400;\">The images that followed still torment many, as Thibaut’s body let him down once more. He was dropped early on stage 19, and sobbed in the arms of veteran teammate William Bonnet before abandoning the Tour de France.</span></p>\n<p><span style=\"font-weight: 400;\">Pinot seemed to be back with vengeance in 2020, arriving at the Tour after finishing 2nd at the Dauphin</span><span style=\"font-weight: 400;\">é</span><span style=\"font-weight: 400;\"> in the weeks prior. A moment of bad luck, however, on the race’s opening stage saw Thibaut go down in a bunch crash. It is not certain how big a role this played in Pinot’s upcoming demise, but he was dropped on stage 8’s Port de Bal</span><span style=\"font-weight: 400;\">è</span><span style=\"font-weight: 400;\">s, the first real GC test. </span><span style=\"font-weight: 400;\">He was surrounded by teammates as the peloton moved further up the road, sheltering </span>Thibaut as much from the wind as the scrutiny that awaited him at the finish.</p>\n<p><span style=\"font-weight: 400;\">France’s 35-year wait for a Tour de France winner goes on, but Thibaut has his eye on other goals this season: he will head to the Giro d’Italia for the first time since 2018. It has been six years since Thibaut stood on </span><span style=\"font-weight: 400;\">a Grand Tour podium, but anything less will surely be labelled as another failed year for the Frenchman.</span></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e60558ca88eebfd65fb4ecfbee63212f52c59e528aaf7d20debe72640a7b5c56","category":"Cycling"}