{"title":"YouTube and Spotify Apps Won't Be Available on Vision Pro","link":"https://www.macrumors.com/2024/01/18/youtube-spotify-vision-pro/","date":1705617760000,"content":"YouTube and Spotify do not plan to offer apps on the Vision Pro headset, according to a new report from <em><a href=\"https://www.bloomberg.com/news/articles/2024-01-18/youtube-and-spotify-join-netflix-in-not-launching-apple-vision-pro-apps\">Bloomberg</a></em>. YouTube said that it is not developing a YouTube Vision Pro app, nor will it allow the YouTube <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> app to run on the device.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Apple-Vision-Pro-with-battery-Feature-Blue-Magenta.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nSpotify is also not working on an app, and it does not have plans to allow the Spotify ‌iPad‌ app to be available through the Vision Pro <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. YouTube and Spotify will instead be accessible through Safari, similar to Netflix.\r<br />\n\r<br />\nNetflix <a href=\"https://www.macrumors.com/2024/01/17/netflix-wont-offer-vision-pro-app-at-launch/\">said earlier this week</a> that Netflix subscribers can watch content through the Vision Pro web browser, and that no dedicated app would be developed.\r<br />\n\r<br />\nGiven Apple's contentious relationship with Spotify, it is not surprising that Spotify has no intention of creating an <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> app. Many companies may also be taking a wait-and-see approach with the Vision Pro, as the device is expensive and Apple is not expected to sell many units. Far fewer people will be using the Vision Pro compared to the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or the ‌iPad‌, so there could be some hesitation to invest resources in the headset.\r<br />\n\r<br />\nAt the same time, while ‌iPad‌ apps can run on Vision Pro with little to no effort, YouTube and Netflix customers might be disappointed with the lackluster experience compared to entertainment apps designed specifically for Vision Pro, such as Disney+, which could cause issues for the companies. There are fewer expectations with a web-based experience, so it is likely the safest bet for streaming services not yet ready to build out full Vision Pro experiences.\r<br />\n\r<br />\nIf the Vision Pro headset is a hit, and apps like Disney+ and Max get a lot of use, companies that are not yet inspired to release apps could debut them in the future.\r<br />\n\r<br />\nThe <a href=\"https://www.macrumors.com/2024/01/16/apple-vision-pro-app-store-launches/\">Vision Pro App Store</a> launched earlier this week, and <a href=\"https://www.macrumors.com/roundup/visionos/\">visionOS</a> compatibility is listed on ‌App Store‌ pages, giving some insight into which apps will be available on the headset and which apps will not. <a href=\"https://www.macstories.net/news/a-survey-of-popular-apps-currently-compatible-with-apple-vision-pro/\"><em>MacStories</em> did a survey</a> of the ‌App Store‌, and found that there are as of yet no signs of several popular apps like Instagram, Facebook, WhatsApp, Snapchat, Amazon, Google, and Gmail.\r<br />\n\r<br />\nWhile ‌iPad‌ apps are available on Vision Pro by default, developers can opt out of having their apps appear on the device. It is not yet clear if the major apps listed above are opting out of the Vision Pro entirely, but they have turned off ‌iPad‌ app access and have not yet announced dedicated Vision Pro apps.\r<br />\n\r<br />\nPre-orders for the Vision Pro begin tomorrow morning at 5:00 a.m. Pacific Time, with a launch set to follow on Friday, February 2.<div>Tags: <a href=\"https://www.macrumors.com/guide/spotify/\">Spotify</a>, <a href=\"https://www.macrumors.com/guide/youtube/\">YouTube</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/18/youtube-spotify-vision-pro/\">YouTube and Spotify Apps Won't Be Available on Vision Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/youtube-and-spotify-apps-wont-be-available-on-vision-pro.2416725/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e6079ba49ac027c025f59960c4a5f403720ecb065944b1ea94490d5a20f2c955","category":"Apple"}