{"title":"Apple Maps: How to report accidents, speed checks, and hazards","link":"https://www.macworld.com/article/344720/how-to-report-accidents-speed-checks-and-hazards-apple-maps-siri-iphone.html","date":1619646668000,"content":"\n<div>\n<section><div></div></section><p>Apple keeps steadily improving Apple Maps, making it a viable alternative to the Google Maps juggernaut. With iOS 14.5, Apple Maps has gained the ability to show crowdsourced traffic incidents when to make driving easier and safer. Here’s how you report these incidents on your iPhone or on the CarPlay interface.</p>\n\n\n\n<h2>What you’ll need</h2>\n\n\n\n<p>Your iPhone must be updated to <a href=\"https://www.macworld.com/article/331864/ios-14-5-features-airtags-siri-unlock-with-apple-watch-how-to-install.html\">iOS 14.5</a> or later (whether you’re using the CarPlay interface or not).  The traffic incidents feature is currently only available in the U.S. and China.</p>\n\n\n\n<h2>Reporting an incident</h2>\n\n\n\n<p>The easiest way to report a road incident is probably to use Siri. Just say something like, “Hey Siri, report an accident,” or “Hey Siri, there’s something on the road,” or “Hey Siri, there’s a speed check here.” You don’t even have to launch Apple Maps to do this! </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/apple-maps-incident-iphone.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>Apple</p></div>\n\n\n\n<p>If you’re following turn-by-turn directions, you can tap the Route card at the bottom of the screen, then <em>Report</em> followed by <em>Accident</em>, <em>Hazard</em>, or <em>Speed Check</em>. </p>\n\n\n\n<p>On the CarPlay interface, you’ll see a report hazard button on the screen when you’re following turn-by-turn directions (it looks like a speech balloon with an exclamation point in it). Tap it and then tap <em>Accident</em>, <em>Hazard</em>, or <em>Speed Check</em>.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/apple-maps-incident-carplay.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>Apple</p></div>\n\n\n\n<p>Once reported, a little icon will appear on the map for hazards and accidents, while speed checks will instead issue a pop-up notification while you’re using turn-by-turn directions. Apple evaluates these reports and if it feels they are legit, they’ll be displayed on other drivers’ maps as well.</p>\n\n\n\n<h2>Clearing an incident</h2>\n\n\n\n<p>If you see an incident icon on your map but it’s not there in the real world any longer, you can report that it has cleared. Again, Siri is the easy way to do this. Say “Hey Siri, the hazard is gone,” or “Hey Siri, clear the accident,” or something similar. You can’t clear speed checks.</p>\n\n\n\n<p>If you don’t want to use Siri, you can tap the incident market on the map and then choose either <em>Cleared</em> or <em>Still Here</em>. This works on either your iPhone or on the CarPlay interface.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e60b5edfefe97f82fdc23010f5c3d899d5a1c03cf18f6d043a4581f803240883","category":"Apple"}