{"title":"Preparation and characterization of microcrystalline cellulose from rice bran","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13820?af=R","date":1723811417000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Rice bran, a by-product of rice processing, has not been fully utilized except for the small amount used for raising animals. The raw material source requirements of microcrystalline cellulose are becoming increasingly extensive. However, the characteristics of preparing microcrystalline cellulose from rice bran have not been reported, which limits the application of rice bran.</p>\n<h2>RESULTS</h2>\n<p>Microcrystalline cellulose was obtained from rice bran by alkali treatment, delignification, bleaching and acid hydrolysis. The morphology, particle size distribution, degree of polymerization, crystallinity, and thermal stability of rice bran microcrystalline cellulose were analyzed. The chemical compositions, scanning electron microscopy and Fourier-transform infrared analysis for rice bran microcrystalline cellulose showed that the lignin and hemicellulose were successfully removed from the rice bran fiber matrix. The morphology of rice bran microcrystalline cellulose was shown to be of a short rod-shaped porous structure with an average diameter of 65.3 μm. The polymerization degree of rice bran microcrystalline cellulose was 150. The X-ray diffraction pattern of rice bran microcrystalline cellulose showed the characteristic peak of natural cellulose (type I), and its crystallization index was 71%. The rice bran microcrystalline cellulose may be used in biological composites with temperatures between 150 °C and 250 °C.</p>\n<h2>CONCLUSION</h2>\n<p>These results suggest the feasibility of using rice bran as a low-price source of microcrystalline cellulose. © 2024 Society of Chemical Industry.</p>","author":"Yanlan Liu, \nJingfeng Ran, \nZiyang Xu, \nHao Cheng, \nBenping Lin, \nTianran Deng, \nCuiping Yi","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"e60e105e2f82730b8bc9789e76727aba8b9edc9d541fd69d9f115b811680462f","category":"Environment"}