{"title":"Zwift Launches Neokyo Roads: First Ride Thoughts","link":"https://www.dcrainmaker.com/2021/11/zwift-launches-neokyo-roads-first-ride-thoughts.html","date":1637251200000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3661.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3661_thumb.jpg\" /></a></p>\n<p>Zwift had just released the Neokyo roads, which are an addition to the Makuri Islands that were launched last spring. They connect to the existing Yumezi roads (which are also part of the Makuri Islands map), so you can ride between the two map chunks as you see fit. This map expansion was <a href=\"https://www.dcrainmaker.com/2021/10/zwift-details-plans-for-new-neokyo-map-new-user-interface-and-clubs-public-launch.html\">announced almost exactly a month ago</a>, as part of a slate of new changes coming to Zwift this winter. In other words, this is the first of the new things.</p>\n<p>These new routes roughly double the total road mileage within the Yumezi map (which was previously 27.6km/17.1mi miles) – so we’re talking about 50KM of total roadways now within the Makuri Islands.</p>\n<p>Unlike all existing maps, the Neokyo routes will only be nighttime roads, as it highlights the neon nature of the scenery. And neon there is…it’s literally as if someone owned stock in a neon sign company, and got paid commission or licensing fees for usage. But kidding aside, it’s also by far the most incredible set of roads visually that Zwift has ever done. The attention to detail and nuance is astounding.</p>\n<p>I gave the map a whirl earlier this morning before the roadways opened up, and I think I covered almost all the roads in the process (including re-riding some sections a number of times getting hopelessly lost on top of the buildings). Yes, I said on top.</p>\n<p>Note that if you plan to ride Neokyo, you should be able to do so now, but you’ll need to update your Zwift app, and that this particular update is a beefcake, so don’t do it at the last second if jumping in on a scheduled ride with friends.</p>\n<h3><span>The Neokyo Routes:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3651.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3651_thumb.jpg\" /></a></p>\n<p>Given that Neokyo is a part of the Makuri Islands, you can see it on the same map as the existing Yumezi portion. Yumezi is more countryside Japan themed, while Neokyo is more Tokyo themed. Some of the official routes (such as Wandering Flats, shown above), incorporate both. Above you can see for size and scale, the two chunks side by side.</p>\n<p>There are 9 new official routes added today, seven of which are fully within Neokyo, and two of which bridge the map pieces.</p>\n<p>Here’s the official listing/descriptions of routes from Zwift, along with screenshots I grabbed from the app, which, explains but doesn’t explain why the official Zwift route specs differ from what Zwift says in their app. I’m giving you both from Zwift, because frankly, I don’t know which one is right.</p>\n<p><b>RAILWAYS AND ROOFTOPS:</b></p>\n<p> </p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3646.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3646_thumb.jpg\" /></a></p>\n<p>Take to the upper city where you will race along city railways and rooftops.<br />\nDistance: 3.8 mi // 6.1 km, Elevation Gain: 226 ft // 68.9 m</p>\n<p> </p>\n<p><b>ROOFTOP RENDEZVOUS:</b></p>\n<p><strong><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3647.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3647_thumb.jpg\" /></a></strong></p>\n<p> </p>\n<p>Feel the burn as you climb to the top of Neokyo, scaling rooftops and monorails on the way.<br />\nDistance: 2.3 mi // 3.7 km, Elevation Gain: 16.7 ft // 5.1 m</p>\n<p> </p>\n<p><b>NEON FLATS:</b></p>\n<p><strong><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3648.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3648_thumb.jpg\" /></a></strong></p>\n<p> </p>\n<p>Paint the town as you dominate three sprints along this flat route through the city.<br />\nDistance: 8.9 mi // 14.4 km, Elevation Gain: 474.7 ft // 144.7 m</p>\n<p> </p>\n<p><b>SPRINTER’S PLAYGROUND:</b></p>\n<p><strong><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3649.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3649_thumb.jpg\" /></a></strong></p>\n<p> </p>\n<p>Keep that heart racing as you complete four sprints in a single route.<br />\nDistance: 7.6 mi // 12.3 km, Elevation Gain: 157 ft // 51.5 m</p>\n<p> </p>\n<p><b>NEOKYO ALL-NIGHTER:</b></p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3644.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3644_thumb.jpg\" /></a></p>\n<p> </p>\n<p>Explore everything that Neokyo has to offer including four sprints and a KOM along this challenging route<br />\nDistance: 15.1 mi // 24.3 km, Elevation Gain: 562.3 ft // 171.3 m</p>\n<p> </p>\n<p><b>SLEEPLESS CITY:</b></p>\n<p><strong><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3648-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3648_thumb-1.jpg\" /></a></strong></p>\n<p> </p>\n<p>Make your way through the heart of the city as you wind along this fast route.<br />\nDistance: 5.7 mi // 9.2 km, Elevation Gain: 268 ft // 81.7 m</p>\n<p> </p>\n<p><b>WANDERING FLATS:</b></p>\n<p><strong><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3651-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3651_thumb-1.jpg\" /></a></strong></p>\n<p> </p>\n<p>This long flatter route will take you from the scenic countryside to the bustling city.<br />\nDistance: 16 mi // 25.7 km, Elevation Gain: 866 ft // 264 m</p>\n<p> </p>\n<p><b>TEMPLES AND TOWERS:</b></p>\n<p><strong><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3650.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3650_thumb.jpg\" /></a></strong></p>\n<p> </p>\n<p>From downtown rooftops to mystical temples, grind to complete three KOM’s in a single route.<br />\nDistance: 20.2 mi // 32.5 km, Elevation Gain: 2,261.2 ft // 689.2 m</p>\n<h3><span>My First Neokyo Ride:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3646-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3646_thumb-1.jpg\" /></a></p>\n<p>Ok, to get things cooking I started with the the ‘Railways and Rooftops’ route. Namely because I heard something about checking out a train back in October, and if there’s anything I’m eager to go do – it’s play in train traffic.</p>\n<p>This route starts out briefly on the ground, before you climb your way up to one of two elevated levels. The first level is basically the elevated tramways:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3657.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3657_thumb.jpg\" /></a></p>\n<p>I’m not entirely sure if tramway is the right word here, as they also carry cargo. Most importantly is you can ride your bike next to them. The trains/trams/whatever’s loop around on a short circuit, so it won’t take long to see them screaming by.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3678.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3678_thumb.jpg\" /></a></p>\n<p>I’m sure some will try and sprint and catch them, but I didn’t have enough coffee for that today. Plus, the trainer I was testing was being a PITA and already half-broken, so I didn’t want to push my luck.</p>\n<p>Now, this route is named ‘Railways and Rooftops’, and I can confirm that you do indeed go up on rooftops. Because apparently playing in train traffic wasn’t dangerous enough. I’m sure there’s a Squid Games joke in here somewhere, but this is supposed to be Japan, not South Korea (yes, they’re both close by, but not same-same).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3661-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3661_thumb-1.jpg\" /></a></p>\n<p>In general, I’m going to avoid riding Neokyo with the <a href=\"https://www.dcrainmaker.com/2020/08/zwift-steering-elite-sterzo-smart.html\">Elite Sterzo Smart</a>, because without any guardrails on the tops of these buildings, I’m liable to steer myself off the edge of the building while eating a Haribo gummy bear.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3670.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3670_thumb.jpg\" /></a></p>\n<p>After I meandered around up top, I attempted to get myself back down. that turned out to be sightly more difficult than I envisioned. As a refresher, this is what the map here looks like. Basically, it’s like a piece of spaghetti stayed up too late, got drunk at the bar, and then passed out:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3647-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3647_thumb-1.jpg\" /></a></p>\n<p>Eventually though I got myself back down, not just from the rooftops, but from the rooftops to the elevated train roadway, and then again to the ground.</p>\n<p>I visited some food trucks, but regrettably no food was served, not even a burrito.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3687.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3687_thumb.jpg\" /></a></p>\n<p>I did find some bicycle lanes, which you actually briefly ride in. I thought the detailed roadway signs you see throughout downtown were super well done.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3685.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3685_thumb.jpg\" /></a></p>\n<p>Along the way I went through an indoor arcade, which had Zwift stations set up with cyclists pedaling on bikes in front of screens, using what appear to be beta editions of Zwift’s upcoming Zwift Bike Hardware.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/vlcsnap-2021-11-18-16h18m50s512.png\"><img src=\"https://media.dcrainmaker.com/images/2021/11/vlcsnap-2021-11-18-16h18m50s512_thumb.png\" /></a></p>\n<p>Mostly though, you’re just riding through a lot of dark city with bright neon lights, and a ton of people and pets alongside doing all sorts of random things.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3684.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3684_thumb.jpg\" /></a></p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3659.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3659_thumb.jpg\" /></a></p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3681.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3681_thumb.jpg\" /></a></p>\n<p>Oh, and there’s even Mt. Fuji off on the distance:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3667.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3667_thumb.jpg\" /></a></p>\n<p>You can head towards the harbor area, which makes a short loop where the neon fades away, and you’re on a quiet street. I imagine this would be great as part of a fast-paced circuit.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3696.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3696_thumb.jpg\" /></a></p>\n<p>From there you can meander through some cherry trees as you enter the grounds of the temple:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3700.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3700_thumb.jpg\" /></a></p>\n<p>This portion of the map feels like a transported bit of the regular countrywide Yumezi area, ported into Neokyo:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3701.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3701_thumb.jpg\" /></a></p>\n<p>After about 45 minutes of meandering and swerving through the neon lights, I called it a day. I had covered almost all of the roads in the new map, save the connector to the Yumezi map, as well as two alternate connector roads to the harbor. Gotta save something for next time!</p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/11/IMG_3691.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/11/IMG_3691_thumb.jpg\" /></a></p>\n<p>This is unquestionably the most detailed and artistically forward map that Zwift has ever produced. Nothing else comes close, and it really shows how far they’ve come. The visual detail seen here is leagues beyond what we’d see from an older map like Richmond, or even large chunks of Watopia. I’m sure I could ride it 25 times and still not notice some silly little vending machine detail, or random easter egg on the side of the road.</p>\n<p>However (look, ya know there was a however coming), my only complaint here, is that it sorta all just become a neon light swerving blur. Which is to say that while specific landmarks became memorable (e.g. next to the train tracks, the food trucks, etc…), much of it just became a never-ending twisting-turning blend of a dark city with bright lights – especially up on the rooftop areas. My screen was rotating with the non-stop turns so quickly that it was hard to appreciate it. Maybe I just need to ride slower, who knows. Does Zwift have a unicycle?</p>\n<p>And ultimately, that’s somewhat the tricky situation Zwift is in. They won’t win everyone with every addition, or even the entirety of just someone. In my case, I appreciated the graphical and design elements of it – it’s awesome, and very well done. But from the cycling side of my brain, it just seemed a bit over the top to actually ride a trainer though. I mean like, literally, over the top – you were on people’s rooftops.</p>\n<p>Zwift has said that they see the Makuri islands as the next big equal to Watopia. So to that end, we see Mt. Fuji off in the distance at various turns, and in fact, even see closed roadways leading off the map. Undoubtedly, those will eventually be opened up, and likely with different terrain that’ll suit different folks.</p>\n<p>Plus, we’ve <a href=\"https://www.dcrainmaker.com/2021/10/zwift-details-plans-for-new-neokyo-map-new-user-interface-and-clubs-public-launch.html\">got the big user interface refresh coming up</a>, which if Zwift is on schedule, means it’ll start hitting people’s computers next month. I’m certainly looking forward to that, and giving it a whirl.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"e6229bd5cb6dcd7c96dacb85eb081b48ef3c92b2fa9a43d204aa3c1770ac9c14","category":"Cycling"}