{"title":"How To Use Structured Workouts On The Wahoo RIVAL","link":"https://www.dcrainmaker.com/2021/05/how-to-use-structured-workouts-on-the-wahoo-rival.html","date":1622051628000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4948.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4948_thumb.jpg\" /></a></p>\n<p>While the big news from yesterday was <a href=\"https://www.dcrainmaker.com/2021/05/wahoo-elemnt-bolt-v2-2021-with-color-screen-maps-a-review-in-progress.html\">Wahoo’s new BOLT V2 bike computer</a>, they also announced structured workout support on the Wahoo <a href=\"https://www.dcrainmaker.com/2020/11/wahoo-rival-multisport-gps-watch-review.html\">RIVAL GPS watch</a>, enabling you to sync in workouts from TrainingPeaks, as of today. Though, it sounds like their rest of the major online training platforms are coming soon.</p>\n<p>In many ways, this follows along with what they’ve had on their ELEMNT series bike computers for years now, but of course in that case it was just cycling (unless you rode your bike into an ocean, in which <a href=\"https://www.dcrainmaker.com/2021/01/skydio-2-drone-65kph-wind-waves-cycling-test.html\">case it became an openwater swim workout</a>). However, the RIVAL officially supports more than that – specifically structured workouts for Cycling ,Running and Swimming. Thus, it wasn’t as simple as just taking the existing structured workout from the bike side, as they wouldn’t know how to deal with running/pace, etc…</p>\n<p>The <a href=\"https://support.wahoofitness.com/hc/en-us/articles/360017569220-ELEMNT-RIVAL-Firmware-Updates\">update is now live,</a> so you’ll need to update your RIVAL watch if it didn’t do it already. Just ensure that it’s charged up enough, and that the Wahoo ELEMNT app is on nearby, and you should see the offer to update, or you can launch it from the watch itself.</p>\n<h3>How it Works:</h3>\n<p>Ok, so the first thing is deciding on the source of your workout, and then ensuring that workout is on the RIVAL. By default it’ll automagically sync those workouts to your watch if calendar based. So for example, workouts from training platforms are typically tied to a given calendar date, as part of a larger plan. Those will automatically be available on your watch. Wahoo does this for workouts 5 days in advance.</p>\n<p>Of course, you’ll need to ensure that your Wahoo app is linked up to the training platform that you use, but undoubtedly you’ve already done that for the training log portion.</p>\n<p>In many case, I created a TrainingPeaks workout for today, just some 800’x and 200’s and then placed it atop today’s date in Training Peaks:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-60.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-60.png\" /></a></p>\n<p>For this I set target paces for each of the segment, which were based on the TrainingPeaks threshold paces. I was thus interested to see what would happen out on the road, since the Wahoo RIVAL doesn’t have any concept of running pace zones. Would it tie it to the static paces set by TrainingPeaks (which would be ideal), or something else? More on that in a second.</p>\n<p>Also of note is that in my case I stuck a bike workout on my calendar for today, and it synced that too (as well as my Friday workout). You can see both of these workouts, by sport, within the Wahoo app or the RIVAL. Tap the ‘Workout’ button, and choose the sport profile (Running, Cycling, etc…) at the top. Then from there choose the ‘Pick a Planed Workout’ option. This will be auto-filtered by sport. So you can see my running ones here after tapping running:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/WahooApp1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooApp1_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/WahooApp2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooApp2_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/WahooApp3.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooApp3_thumb.png\" /></a></p>\n<p>Like with cycling, Wahoo has baked in a handful of workouts for running too. Here’s those four running workouts:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/WahooApp4.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooApp4_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/WahooApp5.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooApp5_thumb.png\" /></a></p>\n<p>For each of them they have a bunch of descriptive text:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/WahooApp6.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooApp6_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/WahooApp7.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooApp7_thumb.png\" /></a></p>\n<p>Interestingly, they also have four baked in swim workouts too – that appear to work whether you choose openwater or indoor:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/WahooApp9.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooApp9_thumb.png\" /></a><a href=\"https://media.dcrainmaker.com/images/2021/05/WahooApp8.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooApp8_thumb.png\" /></a><a href=\"https://media.dcrainmaker.com/images/2021/05/WahooApp10.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooApp10_thumb.png\" /></a></p>\n<p>There are no workouts for the other sport modes that I could find (including Strength or Yoga), which would seem to be a tidy little opportunity to do some integration from their <a href=\"https://www.dcrainmaker.com/2018/12/sufferfests-revamped-features.html#recently-added-strength-workouts\">Sufferfest brand/app</a>. But I suppose that’s boiling the ocean type stuff.</p>\n<p>In any event, when you’re ready to go, select the sport of your choice and you’ll see that you’ve got a workout today. Alternatively, you can long-hold the lower left button, and go to Planned Workout:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4931.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4931_thumb.jpg\" /></a></p>\n<p>Then from there you’ll see the workout for that specific sport mode that you’ve already select (thus, you must be in a sport mode first). There’s also the option to sync, if you want to force a re-sync:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4934.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4934_thumb.jpg\" /></a></p>\n<p>After that you can confirm/select it, or view it. The Holiday Inn UI designer in me would say that it would seem they could have accomplished these options on the previous page with the existing buttons.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4935.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4935_thumb.jpg\" /></a></p>\n<p>And then finally, you’ll see the workout:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4936.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4936_thumb.jpg\" /></a></p>\n<p>With that, it’ll be loaded on the RIVAL, along with a new structured workout page, called the ‘Planned Workout Graph’. You can toggle this off if you don’t want it (from the Wahoo App). Though, I can’t really think of any sane reason why you’d want a structured workout but not know what the structured workout entails or their progress in it. Maybe that’s for people that like tangerine ice cream.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4939.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4939_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4938.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4938_thumb.jpg\" /></a></p>\n<p>In any case, go outside, and hit start on your workout. It gives you a 5 second beeping warning prior to the start of each interval, and then it’ll show you the distance for the next interval, as well as a descriptor. The descriptor page didn’t specify the upcoming pace targets though, which seemed kinda odd to me. In fact, if there’s any suggestion, it’d be to have an ‘Next Interval’ page option, where I could see the next interval, typically shown during recovery.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/WhaooRivalWorkout1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WhaooRivalWorkout1_thumb.jpg\" /></a></p>\n<p>Sure, I can see a little bar chart on the workout graph page – but that doesn’t show the specifics of the upcoming step. However, on that page you’ll see in blue your current place in life. You can see below I have 25:23 remaining in the workout, and this particular easy rest interval has 30 seconds left.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/WahooRivalWorkout4.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooRivalWorkout4_thumb.jpg\" /></a></p>\n<p>Meanwhile, the Workout Dial page has a little bar at the top showing the ranges for that interval, which match identically what TrainingPeaks had specified for this interval – 5:41/mile to 6:14/mile. You’ll see it lists me as ‘GOOD’, meaning I’m in the right zone. The pace shown there is my current pace, slightly smoothed.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/WahooRivalWorkout5.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooRivalWorkout5_thumb.jpg\" /></a></p>\n<p>Whereas if I’m going to fast, like this later interval, it’ll show FAST. Alternatively, it’ll also show SLOW, if you’re lagging.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/WahooRivalWorkout6.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooRivalWorkout6_thumb.jpg\" /></a></p>\n<p>At the top right corner of the workout graph is a little skip button, in case you decide to skip that interval:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/WahooRivalWorkout7.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/WahooRivalWorkout7_thumb.jpg\" /></a></p>\n<p>Finally, if you want to scale your workout (such as in a cycling workout) to increase or decrease the target, you can hold down the left button to get to the scaling menu. This option also allows you to start/stop the workout portion without impacting the recording (if you decide you just want to end the structured workout but keep riding/running/etc…)</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image0014-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image0014_thumb-1.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image001-4.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image001_thumb-4.jpg\" /></a></p>\n<p>During the workout there’s no out of zone/target notifications (audibly or such), the only indication is the workout dial data page. Once the workout ends, you’ll get the completion screen:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image00110.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image00110_thumb.jpg\" /></a></p>\n<p>And then the workout will sync up to the Wahoo app, and onwards to TrainingPeaks. While the TrainingPeaks app will show your workout automatically overlaid onto the scheduled workout, the Wahoo app itself doesn’t specify/list/record your original target paces. It’s just as if you simply hit the lap button for each one. So it’ll show those splits by lap, but not the original targets for the workout.</p>\n<h3>Wrap-Up:</h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4943.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4943_thumb.jpg\" /></a></p>\n<p>As I mentioned with the last Wahoo RIVAL <a href=\"https://www.dcrainmaker.com/2021/05/quick-hands-on-wahoo-adds-music-controls-to-rival-watch-plans-for-trainingpeaks-workout-support.html\">update a few weeks ago</a>, Wahoo is slowly checking off the boxes required to have a competitive watch in the multisport category. A category currently occupied mainly by Garmin, COROS, Polar, and Suunto. As with any endurance sports product, you’ve basically got a bunch of Type-A athletes that all want things a very specific way, and every feature is the most important feature ever. Like everyone else, undoubtedly I fall into that same camp too. Thus bringing a new watch into this market takes time, and many iterations. This is one of those iterations – albeit, a more substantial one.</p>\n<p>I’d love to see them build on this, especially with more details of upcoming steps in the workout, it’s super useful to know what you’re aiming for on the next interval – be it running or cycling (or yes, even swimming). And it’d also be handy to have out of zone workout notifications. Still, for a V1 go of things, it’s not too bad – at least in my first attempt using it for a run workout.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"e629c0a7d2e2d66de2dbed27ae273227b18348f02aa7a89e387b73bff9ddb047","category":"Cycling"}