{"title":"The Giro d’Italia turned on its head: Remco Evenepoel is out of the race with Covid-19, what’s next?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-giro-d-italia-turned-on-its-head-remco-evenepoel-out-of-the-race-with-covid-19-what-s-next","date":1684100241000,"content":"\n      <p><span>And just like that, everything has changed. Only a few hours ago, this year’s edition of the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> was shaping up to be a cracker of a battle for the pink jersey. Remco Evenepoel had <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-time-trial-win-but-a-slender-margin-is-remco-evenepoel-starting-to-struggle-at-the-giro-d-italia\">beaten Geraint Thomas by just nine hundredths</a> of a second in the individual time trial midway through the race, with Tao Geoghegan Hart close behind. It hadn’t been the Evenepoel domination that we saw earlier in the race, but instead the start of what many thought was going to be an exciting and tight-fought final two weeks. Questions were asked about whether Evenepoel dominating the opening time trial was a just fluke, or if the 23-year-old was struggling with fatigue after nine days of hard racing.</span></p>\n<div></div>\n<p><span>The brutally sad reason for Evenepoel’s marginal drop in form over the last two stages became evident, however, when his team <a href=\"https://twitter.com/soudalquickstep\">announced on social media</a> that the Belgian had tested positive for a case of Covid-19. He would be forced to leave the race, handing the pink jersey and leadership over to Thomas and the Ineos Grenadiers. Months of hard work, preparation and expectation by the Soudal – Quick-Step rider and the team around him halted to an abrupt end, a harsh reminder that Covid-19 is still rife among the peloton and can still derail everything, even if it doesn’t rule our world like it once did.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-ITT-Giro-2879_1024x1024.jpg?v=1684100024\" alt />Regardless of anyone’s personal opinion of Evenepoel, there is no denying that him leaving the Giro d’Italia is a heartbreaking loss for the race. The world champion was embarking on a journey during the three week Grand Tour, taking us all with him on an exciting and enthralling narrative arc. His cheeky confidence at the start of the race made him an intriguing competitor, his impassioned gestures to his team car after he crashed a few days ago gave a glimpse of his hot-headed personality, his racing style where he never fears making an attack creates a gripping spectacle. To see the world champion battling with the likes of Primož Roglič and fending off the attacks that would have inevitably come from the Ineos Grenadiers over the next few stages would have made for some incredible watching for fans.</span></p>\n<p><span>But the Giro d’Italia, like it does day after day, must move on. While the disappointment of a champion like Evenepoel having to leave Italy can be acknowledged, the race cannot wait for anyone. A new pink jersey will be stamped with the Ineos Grenadiers logo and placed on the shoulders of Geraint Thomas when the race resumes on Tuesday after the rest day – barring any Covid-19 related disasters for the Welshman.</span></p>\n<p><span>He will lead the race by just two seconds in front of Roglič with Ineos's Geoghegan Hart and João Almeida (UAE Team Emirates) just five and seventeen seconds behind him respectively. The general classification battle will take on an entirely different dynamic: rather than it being about trying to beat Evenepoel, the contenders who remain will now all be forced to start looking at each other. Will the Ineos Grenadiers back Geoghegan Hart for victory or will Thomas be their chosen rider? Is Roglič strong enough to spoil the party for both of them? Could Almeida be timing things perfectly for a resurgence in the final week? The void that Evenepoel abandoning the race leaves is simply filled with questions that will only be answered in the mountains as the Giro d’Italia continues.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-ITT-Giro-2921_1024x1024.jpg?v=1684100080\" alt />However, whatever the outcome may be by the time the winner eventually lifts that iconic trophy in Rome in two weeks time, there will always be one question remaining: what if Evenepoel had been there? It’s one that will always be unanswered. A question that is left only by a rider of Evenepoel’s talent and stature. The sort of question that can’t be ignored when Evenepoel still managed to win the stage today, despite being visibly unwell and exhausted in his post-race interviews.</span></p>\n<p><span>There is no doubt that the person who does take victory at this Giro d’Italia will be a deserved winner, but the race will not be the same without Remco Evenepoel.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e6335739cf334f19f6377cbf707975cc650c12bd96a6ddb968330d220bb48fd2","category":"Cycling"}