{"title":"Molecular Genetic Dissection of the Regulatory Network of Proton Motive Force in Chloroplasts","link":"https://academic.oup.com/pcp/advance-article/doi/10.1093/pcp/pcad157/7502675?rss=1","date":1701993600000,"content":"<span><div>Abstract</div>The proton motive force (pmf) generated across the thylakoid membrane rotates the F<sub>o</sub>-ring of ATP synthase in chloroplasts. The pmf comprises two components: membrane potential (∆Ψ) and proton concentration gradient (∆pH). Acidification of the thylakoid lumen resulting from ∆pH downregulates electron transport in the cytochrome <span>b</span><sub>6</sub><span>f</span> complex. This process, known as photosynthetic control, is crucial for protecting photosystem I (PSI) from photodamage in response to fluctuating light. To optimize the balance between efficient photosynthesis and photoprotection, it is necessary to regulate pmf. Cyclic electron transport around PSI and pseudo-cyclic electron transport involving flavodiiron proteins contribute to the modulation of pmf magnitude. By manipulating the ratio between the two components of pmf, it is possible to modify the extent of photosynthetic control without affecting the pmf size. This adjustment can be achieved by regulating the movement of ions (such as K<sup>+</sup> and Cl<sup>−</sup>) across the thylakoid membrane. Since ATP synthase is the primary consumer of pmf in chloroplasts, its activity must be precisely regulated to accommodate other mechanisms involved in pmf optimization. Although fragments of information about each regulatory process have been accumulated, a comprehensive understanding of their interactions is lacking. Here, I summarize current knowledge of the network for pmf regulation, mainly based on genetic studies.</span>","author":"","siteTitle":"Plant and Cell Physiology Current Issue","siteHash":"4cc6f9f83376b07c027fd7e94a91f237de774cefb179ee46a5bc732f13bf71a5","entryHash":"e634e4ed28b37abdd8b651bf2b46e12964c0d8b3a6080dce6bb129d458319e0a","category":"Environment"}