{"title":"Apple Develops Breakthrough Method for Running LLMs on iPhones","link":"https://www.macrumors.com/2023/12/21/apple-ai-researchers-run-llms-iphones/","date":1703154405000,"content":"<a href=\"https://www.macrumors.com/guide/apple-gpt/\">Apple GPT</a> in your pocket? It could be a reality sooner than you think. Apple AI researchers say they have made a key breakthrough in deploying large language models (LLMs) on iPhones and other Apple devices with limited memory by inventing an innovative flash memory utilization technique.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/siri-symbol-iphone.jpg\" width=\"850\" height=\"481\" />\r<br />\n<h2>LLMs and Memory Constraints</h2>\r<br />\nLLM-based chatbots like ChatGPT and Claude are incredibly data and memory-intensive, typically requiring vast amounts of memory to function, which is a challenge for devices like iPhones that have limited memory capacity. To tackle this issue, Apple researchers have developed a novel technique that uses flash memory – the same memory where your apps and photos live – to store the AI model's data. \r<br />\n\r<br />\n<h2>Storing AI on Flash Memory</h2>\r<br />\nIn a new <a href=\"https://arxiv.org/pdf/2312.11514.pdf\">research paper</a> titled \"LLM <em>in a flash</em>: Efficient Large Language Model Inference with Limited Memory,\" the authors note that flash storage is more abundant in mobile devices than the RAM traditionally used for running LLMs. Their method cleverly bypasses the limitation using two key techniques that minimize data transfer and maximize flash memory throughput:\r<br />\n<ol>\r<br />\n    <li><strong>Windowing:</strong> Think of this as a recycling method. Instead of loading new data every time, the AI model reuses some of the data it already processed. This reduces the need for constant memory fetching, making the process faster and smoother.</li>\r<br />\n    <li><strong>Row-Column Bundling:</strong> This technique is like reading a book in larger chunks instead of one word at a time. By grouping data more efficiently, it can be read faster from the flash memory, speeding up the AI's ability to understand and generate language.</li>\r<br />\n</ol>The combination of these methods allows AI models to run up to twice the size of the iPhone's available memory, according to the paper. This translates to a 4-5 times increase in speed on standard processors (CPUs) and an impressive 20-25 times faster on graphics processors (GPUs). \"This breakthrough is particularly crucial for deploying advanced LLMs in resource-limited environments, thereby expanding their applicability and accessibility,\" write the authors. \r<br />\n\r<br />\n<h2>Faster AI on iPhone</h2>\r<br />\nThe breakthrough in AI efficiency opens new possibilities for future iPhones, such as more advanced Siri capabilities, real-time language translation, and sophisticated AI-driven features in photography and augmented reality. The technology also sets the stage for iPhones to run complex AI assistants and chatbots on-device, something Apple is already said to be working on.\r<br />\n\r<br />\nApple's work on generative AI could eventually be incorporated into its ‌Siri‌ voice assistant. Apple in February 2023 <a href=\"https://www.macrumors.com/2023/03/15/apple-engineers-working-on-chatgpt-like-ai/\">held an AI summit</a> and briefed employees on its large language model work. According to <em>Bloomberg</em>, Apple is aiming for a <a href=\"https://www.macrumors.com/2023/10/22/apple-generative-ai-features-and-smarter-siri/\">smarter version of Siri</a> that's deeply integrated with AI. Apple is planning to update the way that ‌Siri‌ interacts with the Messages app, allowing users to field complex questions and auto-complete sentences more effectively. Beyond that, Apple is <a href=\"https://www.macrumors.com/2023/10/22/apple-generative-ai-features-and-smarter-siri/\">rumored</a> to be planning to add AI to as many Apple apps as possible.\r<br />\n\r<br />\n<h2>Apple GPT</h2>\r<br />\nApple is reportedly developing its own generative AI model called \"Ajax\". Designed to rival the likes of OpenAI's GPT-3 and GPT-4, Ajax operates on 200 billion parameters, suggesting a high level of complexity and capability in language understanding and generation. Internally known as \"Apple GPT,\" Ajax aims to unify machine learning development across Apple, suggesting a broader strategy to integrate AI more deeply into Apple's ecosystem.\r<br />\n\r<br />\nAs of the latest reports, Ajax is considered more capable than the earlier generation ChatGPT 3.5. However, it's also suggested that OpenAI's newer models may have advanced beyond Ajax's capabilities as of September 2023​.\r<br />\n\r<br />\nBoth <em>The Information</em> and analyst Jeff Pu claim that Apple will have some kind of generative AI feature available on the ‌iPhone‌ and iPad <a href=\"https://www.macrumors.com/2023/10/19/apple-generative-ai-late-2024-jeff-pu/\">around late 2024</a>, which is when iOS 18 will be coming out. Pu said in October that Apple is building a few hundred AI servers in 2023, with more to come in 2024. Apple will reportedly offer a combination of cloud-based AI and AI with on-device processing.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-gpt/\">Apple GPT</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/21/apple-ai-researchers-run-llms-iphones/\">Apple Develops Breakthrough Method for Running LLMs on iPhones</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-develops-breakthrough-method-for-running-llms-on-iphones.2414325/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e6458bda61f913f7c3f520fcc52ca3485821814523c24a48f85ed99f99d9015a","category":"Apple"}