{"title":"Varietal diversity as a lever for cassava variety development: exploring varietal complementarities in Cameroon","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.12899?af=R","date":1715852592000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Cassava is an important crop for the survival of smallholder farmers in Cameroon. However, the cassava sector has a low production per unit area compared to the technological potential in this country. In this context, breeders have developed varieties based mainly on their potential in terms of yield and disease resistance. These varieties have been widely disseminated in Cameroon within the framework of development projects. However, these releases have not achieved the expected adoption and yield levels at the national level. Therefore, it appears important to rethink the determinants of dissemination with a broader examination of the cassava production system.</p>\n<h2>RESULTS</h2>\n<p>This paper analyses varietal complementarity as a key strategy in support of optimizing the experimental and continuous use of cassava varieties by farmers in the Central and Eastern regions of Cameroon. These two regions account for 50% of the country's production. A total of 111 semi-structured interviews were conducted with farmers selected through purposive sampling in four villages in Central and Eastern Cameroon where improved varieties have been disseminated. The research revealed four types of complementarity, related to use, crop management, risk management and cultural complementarity.</p>\n<h2>CONCLUSION</h2>\n<p>Our results argue for considering varietal complementarities practiced by farmers, within research and development programs to develop more effective breeding and dissemination approaches. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Hubert Noel Takam Tchuente, \nGuillaume Hensel Fongang Fouepe, \nDanielle Claude Mbwentchou Yao, \nSyndhia Mathe, \nBéla Teeken","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"e6487a2f75069cd3f67b8226a9cbd33e9663002e4386d2222010bc3c40221185","category":"Environment"}