{"title":"Effects of Different Carbon Sources on the Growth and Production of Rotifer (Brachionus plicatilis) in a Zero‐Water Exchange Biofloc Culture System","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/8837330?af=R","date":1709539200000,"content":"<p><i>Brachionus plicatilis</i> is considered an indispensable first live feed for many fish and crustacean larvae; the demand for the species has increased globally. The mass production of the rotifer involves quality microalga and a standard diet; this culture is expensive and needs a skilled workforce. The hatchery’s incubators are likely to have limited resources leading to sudden rotifer culture crashes that ultimately disrupt the larvae production. More recently, improved sustainable rotifer production has been achieved through biofloc technology (BFT) that uses fish wastes and wheat flour. However, various carbon sources, which are typically used in BFT-based systems need to be explored and tested for their efficacies. A 4-day rotifer, <i>B</i>. <i>plicatilis</i> batch culture, was conducted in BFT systems by adding four carbon sources: molasses, rice bran, maize starch, and palm kernel expeller versus a control (without any carbon source). Fifteen 125 L containing polyethylene tanks with a water volume of 100 L were used for this experiment, and each tank was stocked with 5 × 10<sup>6</sup> rotifer (50 rotifers mL<sup>−1</sup>). Different carbon sources in triplicates including a control were tested as treatments. The carbon : nitrogen ratio in the study was maintained at 10 : 1. The rotifers were fed with Baker’s yeast at 1.0, 0.50, and 0.25 g million<sup>-−1</sup> rotifers for the first, second, and third day and continued after that. Total ammonia–nitrogen (TAN) and pH values were found to be significantly (<i>p</i> &lt; 0.05) lower in all four treatments of the BFT system than in the control. Significantly higher (<i>p</i> &lt; 0.05) settleable solids were obtained in the molasses and rice bran treatments than those in the maize starch or palm kernel expeller. Likewise, the significantly (<i>p</i> &lt; 0.05) higher density of <i>B</i>. <i>plicatilis</i> and their specific growth rate were obtained in the molasses and rice bran-adding treatments, followed by those in palm kernel expeller, maize starch, and the control. This study indicates that molasses and rice bran as carbon sources when added to BFT-based systems enhance <i>B</i>. <i>plicatilis</i> production.</p>","author":"Md. Eilious Hosain, \nS. M. Nurul Amin, \nMohd Salleh Kamarudin, \nAziz Arshad, \nMurni Karim, \nMd. Niamul Naser, \nRavi Fotedar, \nLee Seong Wei","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"e64fe65a1eb1af7bd0e730494a3beb028e5cf73bdedad765eb151b73aa08b668","category":"Environment"}