{"title":"474 Longitudinal assessment of Salmonella enterica prevalence and concentration throughout the gastrointestinal tract of finishing beef steers with and without liver abscesses","link":"https://academic.oup.com/jas/article/102/Supplement_3/383/7757419?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Our objective was to longitudinally assess the presence and quantity of <span>Salmonella enterica</span> throughout the gastrointestinal tract of finishing beef steers with and without liver abscesses (LA). Crossbred steers [n = 225; initial body weight (BW) = 353 ± 39 kg] were used in an observational case-control design with individual steer designated as the experimental unit. Nasal, ruminal fluid, and fecal samples were collected at feedlot arrival, 1 wk after adaptation to the finishing diet, and the day before harvest at a commercial abattoir. Healthy and abscessed liver tissue samples were collected at harvest. Steers were fed a steam-flaked corn-based diet without tylosin phosphate. After harvest, LA prevalence was determined, and steers were sorted into those with and without LA. Data were analyzed using the GLIMMIX procedure of SAS. Overall, LA prevalence was 18.7% (n = 42). Nasal <span>Salmonella</span> prevalence was 34.4% but did not differ between steers with or without LA (<span>P</span> = 0.73), and nasal <span>Salmonella</span> concentrations did not differ between treatments (<span>P</span> = 0.85) or collection day (<span>P</span> = 0.50). Ruminal fluid <span>Salmonella</span> prevalence was 73.7% but did not differ between treatments (<span>P</span> = 0.83). From feedlot arrival to harvest, ruminal fluid <span>Salmonella</span> concentration and prevalence decreased (<span>P</span> &lt; 0.01). Fecal <span>Salmonella</span> prevalence tended (<span>P</span> = 0.09) to be 6.4% greater in steers with LA. Conversely, fecal <span>Salmonella</span> concentration tended (<span>P</span> = 0.07) to be 5.9% greater in steers without LA. Fecal <span>Salmonella</span> prevalence was greatest after transition to the finishing diet (<span>P</span> &lt; 0.01), whereas fecal <span>Salmonella</span> concentration was greatest before harvest (<span>P</span> &lt; 0.01). Liver Salmonella prevalence was 9.8% and 6.5% for steers with and without LA, respectively, but did not differ between treatments (<span>P</span> = 0.47). Similarly, liver <span>Salmonella</span> concentrations did not differ in steers with or without LA (<span>P</span> = 0.18). Overall, these data suggest Salmonella concentration and prevalence were affected by time on feed, but not indicative of LA formation.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e655b8c5f4b5fa03ff0c9ae971bb8fb8eede59eecdce840245d30f958a517221","category":"Environment"}