{"title":"When profitability meets conservation objectives through biodiversity offsets","link":"https://onlinelibrary.wiley.com/doi/10.1111/nrm.12389?af=R","date":1715584096000,"content":"<h2>Abstract</h2>\n<p>Biodiversity offsets (BOs) are increasingly used as economic instruments to manage biodiversity and ecosystem services in the context of economic development. This study investigates the sustainability conditions of BOs. It focuses especially on both the timing and pricing of BOs in development-offset projects. To address this issue, a minimal time control model is proposed, allowing a dynamic and multicriteria approach to be combined through both ecological and economic targets. We rely here on no net loss (NNL) and positive net present value (NPV) goals. In particular, we focus on an offset marginal price, called offset sustainability price (OSP), which equalizes the NNL and payback times. We prove analytically how this OSP pricing corresponds to a win–win solution in terms of ecological-economic synergy. We also show that this OSP pricing can be very high compared to the project rate of return, particularly when the biodiversity loss is high. More globally, a static comparative analysis shows the extent to which the economic and biodiversity parameters impact the OSP. Finally, a numerical application related to mangroves and aquaculture in Madagascar illustrates the analytical findings. For this case study, we argue that the current BO price is underestimated.</p>\n<p><b>Recommendations for Resource Managers</b>:</p>\n<p>\n</p><p>The biodiversity recovery time to reach the no net loss (NNL) is not sufficiently taken into account in biodiversity offsets (BOs).</p>\n<p>An offset sustainability price (OSP), reconciling the profitability and NNL times, is calculated, thus strengthening the developer-pays principle of BOs.</p>\n<p>The OSP is the minimal offset price such that the developer is financially beneficial only after the biodiversity recovery.</p>\n<p>The OSP depends nonlinearly on both the developed surface area, the biodiversity initial states and dynamics as well as the economic parameters.</p>\n<p>With low discount rates, a multiplier effect simplifies the calculation of the OSP.</p><p></p>","author":"Celine Huber, \nLuc Doyen, \nSylvie Ferrari","siteTitle":"Wiley: Natural Resource Modeling: Table of Contents","siteHash":"3719477483f67b16afdbb60e07461dbbb5827188dd5d72806069fb36caa95c59","entryHash":"e6579943b42d3a6cbf4b97168f517faf70d32d52d4cecab6c8df5f3c7bd98773","category":"Environment"}