{"title":"A Snowy Cargo Bike & Sports Tech VLOG","link":"https://www.dcrainmaker.com/2021/02/snowy-cargo-sports-urban-arrow.html","date":1614180701000,"content":"<p><iframe src=\"https://www.youtube.com/embed/pzNwqNNP3ac\" width=\"720\" height=\"420\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>Back a week or two ago it got all snowy here in the Netherlands. It’s sorta a rare thing, and even more so, is the fact that it actually stayed on the ground for a meaningful amount of time. It seems to snow about once per year here, but the definition of ‘snowing’ is a bit iffy. Yes, snow might fall from the sky, but it actually doesn’t count as a snow day, per the national weather service, if there’s not 1cm of snow on the ground by <a href=\"https://www.dutchnews.nl/news/2020/12/its-a-record-693-days-without-an-official-snowfall-in-nl/\">9AM at the De Bilt weather station near Hilversum</a>.</p>\n<p>Yes, there are rules on snow days here.</p>\n<p>Anyway, come that Monday it was supposed to be the first day back to school for the kids after nearly two months of the most recent COVID cancellations, but the snow delayed that further. In order to preserve sanity in the house, I took the two older girls for a long bike adventure out to the countryside. That had the benefit of getting some longer activities on the Garmin Enduro watch, as well as a few other products I wanted stuff and footage for/from.</p>\n<p>I hadn’t intended on making a video of the adventure, but as I came down the home stretch in the last couple kilometers I realized I had taken piles of footage throughout the day for various other things, so I could pull it all together as a bit of a cargo bike in snow + DCR tech explainer. A VLOG of sorts with all the tech I had with me, including the following gear:</p>\n<ul>\n<li>DJI Mavic Air 2</li>\n<li>GoPro Hero 9</li>\n<li>GoPro MAX</li>\n<li>Urban Arrow Cargo Bike</li>\n<li>A pile of watches</li>\n<li>A lot of blankets</li>\n</ul>\n<p>It’s nothing crazy serious or deep technical – more fun and pretty drone and action cam videos than anything else. Plus, at just 6 minutes long, it’s an unusually short video for me.</p>\n<p>With that – go forth and hit play, and enjoy the ride!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"e660dc18891d6a9786042e81912a56dfa8fbde80dc00a05ebc4d205ab64117da","category":"Cycling"}