{"title":"An Improved Method to Identify Built-Up Areas of Urban Agglomerations in Eastern and Western China Based on Multi-source Data Fusion","link":"https://www.preprints.org/manuscript/202406.1193/v1","date":1718691022000,"content":"The rapid urbanization in China has significantly contributed to the vast expansion of urban built-up areas. Precisely extracting and monitoring these areas is crucial for understanding and optimizing the developmental process and spatial attributes of smart, compact cities. However, most existing studies tend to focus narrowly on a single city or global scale with a single dimension, often ignoring mesoscale analysis across multiple urban agglomerations. In contrast, our study employs GIS and image processing techniques to integrate multi-source data for the identification of built-up areas. We specifically compare and analyze two representative urban agglomerations in China: the Yangtze River Delta (YRD) in the east and the Chengdu-Chongqing (CC) region in the west. We use different methods to extract built-up areas from socio-economic factors, natural surfaces, and traffic network dimensions. Additionally, we utilize a high-precision built-up area dataset of China as a reference for verification and comparison. Our findings reveal several significant insights: (1) The multi-source data fusion approach effectively enhances the extraction of built-up areas within urban agglomerations, achieving higher accuracy than previously employed methods. (2) Our research methodology performs particularly well in the CC urban agglomeration. The average precision rate in CC is 96.03%, while the average precision rate in YRD is lower at 80.33%. This study provides an objective and accurate assessment of distribution characteristics and internal spatial structure of built-up areas within urban agglomerations. This method offers a new perspective for identifying and monitoring built-up areas in Chinese urban agglomerations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e667477fca4ad5edc22888a0b55e5b28dad8a809ab2a9c1a9bc3a70e08643dea","category":"Interdisciplinary"}