{"title":"The Effectiveness of Physical Activity Intervention at School on BMI and Body Composition in Overweight Children","link":"https://www.preprints.org/manuscript/202408.1784/v1","date":1724648209000,"content":"1) Background: Overweight children usually have lower levels of physical activity (PA) than their normal-weight peers. Low PA predisposes to increase fat mass in the body. The aim of this study was to evaluate the effectiveness of school-based PA intervention on anthropometric indicators and body composition of overweight and obese children during a two-year observation period, from the age of 10 to 12. (2) Materials and methods: The research included 148 children with overweight or obesity who were born in 2007. There were two groups of children of standard and elevated PA at school (SPA and EPA, 4 and 10 hours of physical education lessons a week, respectively). An anthropometric and body composition measurements were done. Body mass index (BMI), fat mass (FM), fat-free mass (FFM), skeletal muscle mass (SMM) and total body water (TBW) were determined. Totally, 5 measurements were done at intervals of 5–6 months. (3) Results: In EPA, the percentage of obese children decreased from 46% to 35.25%, and in SPA increased from 42.75% to 46%. In EPA, FM decreased from 28.65% to 26.41%, and in SPA increased from 30.31% to 31.75%. The highest increase in FFM was in EPA boys, while SPA boys recorded the highest decrease. In SPA, SMM increased by 0.43% from 38.85% to 39.28%, and in EPA by 2.51% from 40.27% to 42.78%. TBW In EPA slightly increased from 53.26% to 53.59%, and in SPA  decreased from 50.70% to 49.93%. (4) Conclusions: The elevated PA at school has a positive effect on the BMI and body composition of children who are overweight or obese. Increasing the mandatory number of physical education lessons in school curricula is an efficient strategy for reducing obesity in school-aged children.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e667d5b7c2be2782b34fbd1befa3079194b848e641124addba09f2227a2a6a15","category":"Interdisciplinary"}