{"title":"Gynecologic infection rates after ablation treatment for cervical intraepithelial neoplasia grade 2 and higher (CIN2+): Secondary analysis of a non-inferiority randomized trial","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003333","date":1720620000000,"content":"<p>by Rachel Masch, Gabriel Conzuelo-Rodriguez, Jameson A. Mitchell, Karla Alfaro, Montserrat Soler, Luis F. Chavez, Suhui Wu, Jinfen Sun, Longhua Hu, Dayana Marinela-Hernandez, Todd A. Alonzo, Juan C. Felix, Miriam L. Cremer</p>\r\n\r\nAlthough concerns have been raised regarding potential infection and morbidity in women undergoing ablation treatment for cervical precancer in low- and middle-income countries (LMIC), there is extremely limited data to substantiate this claim. This is a secondary analysis of a randomized non-inferiority trial (id: NCT03084081) that compares the efficacy and safety of three ablation treatments for biopsy-confirmed cervical intraepithelial neoplasia grade 2 or higher (CIN2+): CO<sub>2</sub> gas-based cryotherapy, non-gas cryotherapy, and thermal ablation (TA). Here, we present findings regarding the incidence of sexually transmitted infections (STI) and vaginitis post-treatment. Samples were collected at enrollment and again at 6 weeks post-treatment and assessed for STIs (<i>Chlamydia trachomatis</i> (CT), <i>Neisseria gonorrhea</i> (NG), and <i>Trichomonas vaginalis</i> (TV)) and vaginitis (Bacterial vaginosis (BV) and/or <i>Candida albicans</i> (Candida)). This analysis reflects 864 women with baseline and 6-week follow-up data. None of the ablative treatments put women at increased risk for STIs (CT, NG, TV) or vaginitis (BV, Candida). While most women adhered to post-treatment recommendations (97%) and no difference by treatment arm was observed, the incidence of STIs at follow-up in women that did not adhere with a given recommendation was higher compared to their adherent counterparts. The incidence of gynecologic infection did not increase with any of the ablation treatments from baseline to the six-week follow-up. Non-gas cryotherapy and TA emerge as safe alternatives to gas-based cryotherapy with respect to gynecologic infection rates.","author":"Rachel Masch","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"e668a87495579ea400f26fd5921575b24b572ad8c5d068777168ed57de903624","category":"Environment"}