{"title":"Tissue-specific deposition, speciation and transport of antimony in rice","link":"https://academic.oup.com/plphys/article/195/4/2683/7676395?rss=1","date":1715990400000,"content":"<span><div>Abstract</div>Rice (<span>Oryza sativa</span>) as a staple food is a potential intake source of antimony (Sb), a toxic metalloid. However, how rice accumulates this element is still poorly understood. Here, we investigated tissue-specific deposition, speciation, and transport of Sb in rice. We found that Sb(III) is the preferential form of Sb uptake in rice, but most Sb accumulates in the roots, resulting in a very low root-to-shoot translocation (less than 2%). Analysis of Sb deposition with laser ablation-inductively coupled plasma-mass spectrometry showed that most Sb deposits at the root exodermis. Furthermore, we found that Sb is mainly present as Sb(III) in the root cell sap after uptake. Further characterization showed that Sb(III) uptake is mediated by Low silicon rice 1 (Lsi1), a Si permeable transporter. Lsi1 showed transport activity for Sb(III) rather than Sb(V) in yeast (<span>Saccharomyces cerevisiae</span>). Knockout of <span>Lsi1</span> resulted in a significant decrease in Sb accumulation in both roots and shoots. Sb concentration in the root cell sap of two independent <span>lsi1</span> mutants decreased to less than 3% of that in wild-type rice, indicating that Lsi1 is a major transporter for Sb(III) uptake. Knockout of <span>Lsi1</span> also enhanced rice tolerance to Sb toxicity. However, knockout of Si efflux transporter genes, including <span>Lsi2</span> and <span>Lsi3</span>, did not affect Sb accumulation. Taken together, our results showed that Sb(III) is taken up by Lsi1 localized at the root exodermis and is deposited at this cell layer due to lack of Sb efflux transporters in rice.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"e6776752623c9f3cdb98467ee9e917ad9bd3716d41a24e4afaba2f80221d0f4f","category":"Environment"}