{"title":"427 Impact of late gestation slow-release nitrogen-enriched diets on energy metabolism in calf skeletal muscle: A proteomic and transcriptomic approach","link":"https://academic.oup.com/jas/article/102/Supplement_3/202/7757463?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The current study aimed to determine the enriched biological processes, through proteomic and transcriptomic data, associated with maternal slow-release nitrogen diets received during late gestation and their effects on the skeletal muscle of offspring. From d 180 to d 268 of gestation, a total of 16 pregnant Brahman cows were divided into two groups: a control (CON, n = 12) low crude protein (CP) basal diet (6% of CP, ad libitum) plus mineral mixture (130 gּ cow<sup>-1</sup>ּ d<sup>-1</sup>), or the CON treatment supplemented with a slow-released N (SRN, n = 9) based protein concentrate supplement [40% CP, fed 2 g/kg of body weight (BW)/d in the morning) composed by corn, soybean meal, urea and a SRN source (Timafeed Boost, Roullier Group, Saint-Malo, France). Muscle biopsies were performed on d 45 of age in calves for RNA sequencing (RNA-seq) and proteomic (HPLC-MS/MS) analyses. The quality control of RNAseq raw data was assessed using FASTQc software, with low-quality reads trimmed by Trimmomatic. Reads were mapped against the <span>Bos taurus</span> reference genome using STAR. Differentially expressed (DE) genes and isoforms, significant at an adjusted <span>P</span>-value ≤ 0.05, were identified using the limma package and Cuffdiff tool, respectively, in the R environment. Proteomic data was processed in MaxQuant against the <span>Bos taurus</span> reference proteome, with statistical analysis performed using the MSqRob package in R. Network analyses identified significant biological processes (adjusted <span>P</span>-value ≤ 0.05) among differentially abundant proteins (DAPs). Notably, while the experimental treatment did not affect transcript abundance, protein-level differences were observed. Enriched biological processes in SRN group skeletal muscle of calves included acetyl-CoA biosynthesis from pyruvate, mitochondrial respiratory chain complex assembly, regulation of calcium ion transmembrane transport, and several others related to energy and nitrogen metabolism. Protein-protein interaction network analyses revealed key processes such as ATP and glucose metabolism, tricarboxylic acid cycle, and sarcomere organization. Overall, our findings underscore the beneficial impact of slow-release nitrogen-enriched diets during late gestation on energy metabolism in calf skeletal muscle.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e678f8ba2b5ea88c06e44d98f8a577c1e1a3b1edeae98c5a8758165fdfdd1154","category":"Environment"}