{"title":"IRS to offer free tax filing in competition against much-criticized TurboTax","link":"https://arstechnica.com/?p=1976855","date":1697646858000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/getty-tax-protest-800x541.jpg\" alt=\"Advocates in front of an H&amp;R Block building hold signs that tell TurboTax and H&amp;R Block to \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/getty-tax-protest.jpg\">Enlarge</a> <span>/</span> Advocates gather on April 17, 2023 in Washington, DC, to call out tax prep firms like TurboTax maker Intuit and H&amp;R Block, and to support the Internal Revenue Service's exploration of free tax filing. (credit: Getty Images | Tasos Katopodis )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Internal Revenue Service yesterday <a href=\"https://www.irs.gov/newsroom/irs-advances-innovative-direct-file-project-for-2024-tax-season-free-irs-run-pilot-option-projected-to-be-available-for-eligible-taxpayers-in-13-states\">announced details</a> for a pilot of its free filing program for the 2024 tax season. People in 13 states \"may be eligible to participate in the 2024 Direct File pilot, a new service that will provide taxpayers with the choice to electronically file their federal tax return directly with the IRS for free,\" the IRS said.</p>\n<p>The pilot \"will allow the IRS to identify issues and make changes prior to any potential large-scale launch in the future,\" the agency said. It will assess customer support and technology needs, and help \"evaluate the costs, benefits and operational challenges associated with providing a voluntary Direct File option to taxpayers.\" That includes testing fraud detection and integration with state systems.</p>\n<p>Pilot eligibility is for those with \"relatively simple returns\" because it \"is limited by the types of income, tax credits and deductions that the product can initially support.\" The IRS said it invited all 50 states, but only some are participating at first:</p></div><p><a href=\"https://arstechnica.com/?p=1976855#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1976855&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e68356f8fc764284bf43e0d4a873271eeb067ec9cc5d10a6398fc5959c51df5b","category":"Tech"}