{"title":"Factors associated with COVID-19 among hospitalized patients with severe acute respiratory infections in Serbia, 2022–2023: A test negative case-control study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299210","date":1710770400000,"content":"<p>by Maja Stosic, Dragana Plavsa, Verica Jovanovic, Marko Veljkovic, Dragan Babic, Aleksandra Knezevic, Vladan Saponjic, Dragana Dimitrijevic, Miljan Rancic, Marija Milic, Tatjana Adzic-Vukicevic</p>\r\n\r\nSevere acute respiratory infections (SARI) are estimated to be the cause of death in about 19% of all children younger than 5 years globally. The outbreak of coronaviral disease (COVID-19) caused by SARS-CoV-2, increased considerably the burden of SARI worldwide. We used data from a vaccine effectiveness study to identify the factors associated with SARS CoV-2 infection among hospitalized SARI patients. We recruited SARI patients at 3 hospitals in Serbia from 7 April 2022–1 May 2023. We collected demographic and clinical data from patients using a structured questionnaire, and all SARI patients were tested for SARS-CoV-2 by RT-PCR. We conducted an unmatched test negative case-control study. SARS-CoV-2 infected SARI patients were considered cases, while SARS CoV-2 negative SARI patients were controls. We conducted bivariate and multivariable logistic regression analysis in order to identify variables associated with SARS-CoV-2 infection. We included 110 SARI patients: 74 were cases and 36 controls. We identified 5 factors associated with SARS-CoV-2 positivity, age (OR  =  1.04; 95% CI  =  1.01–1.07), having received primary COVID-19 vaccine series (OR  =  0.28; 95% CI  =  0.09–0.88), current smoking (OR  =  8.64; 95% CI  =  2.43–30.72), previous SARS CoV-2 infection (OR  =  3.48; 95% CI  =  1.50–8.11) and number of days before seeking medical help (OR  =  0.81; 95% CI  =  0.64–1.02). In Serbia during a period of Omicron circulation, we found that older age, unvaccinated, hospitalized SARI patients, previously infected with SARS CoV-2 virus and those who smoked, were more likely to be SARS-CoV-2-positive; these patient populations should be prioritized for COVID vaccination.","author":"Maja Stosic","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e683e6cf637f640a55e34a8e82da882a8d71177943f0445651e7979c3a2d4845","category":"Interdisciplinary"}