{"title":"High coral heat tolerance at local-scale thermal refugia","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000453","date":1720706400000,"content":"<p>by Liam Lachs, Adriana Humanes, Peter J. Mumby, Simon D. Donner, John Bythell, Elizabeth Beauchamp, Leah Bukurou, Daisy Buzzoni, Ruben de la Torre Cerro, Holly K. East, Alasdair J. Edwards, Yimnang Golbuu, Helios M. Martinez, Eveline van der Steeg, Alex Ward, James R. Guest</p>\r\n\r\nMarine heatwaves and mass bleaching have devastated coral populations globally, yet bleaching severity often varies among reefs. To what extent a reef’s past exposure to heat stress influences coral bleaching and mortality remains uncertain. Here we identify persistent local-scale hotspots and thermal refugia among the reefs of Palau, Micronesia, based on 36 years of satellite-derived cumulative heat stress (degree heating weeks–DHW, units: °C-weeks). One possibility is that hotspots may harbour more heat tolerant corals due to acclimatisation, directional selection, and/or loss of tolerant genotypes. Historic patterns of assemblage-wide mass bleaching and marine heatwaves align with this hypothesis, with DHW-bleaching responses of hotspots occurring at 1.7°C-weeks greater heat stress than thermal refugia. This trend was consistent yet weaker for <i>Acropora</i> and corymbose <i>Acropora</i>, with severe bleaching risk reduced by 4–10% at hotspots. However, we find a contrasting pattern for <i>Acropora digitifera</i> exposed to a simulated marine heatwave. Fragments of 174 colonies were collected from replicate hotspot and thermal refugium outer reefs with comparable wave exposure and depth. Higher heat tolerance at thermal refugia (+0.7°C-weeks) and a correlation with tissue biomass suggests that factors other than DHW may overwhelm any spatially varying effects of past DHW exposure. Further, we found considerable <i>A</i>. <i>digitifera</i> heat tolerance variability across sites; compared to the least-tolerant 10% of colonies, the most-tolerant 10% could withstand additional heat stresses of 5.2 and 4.1°C-weeks for thermal refugia and hotspots, respectively. Our study demonstrates that hotspot reefs do not necessarily harbour more heat tolerant corals than nearby thermal refugia, and that mass bleaching patterns do not necessarily predict species responses. This nuance has important implications for designing climate-smart initiatives; for instance, in the search for heat tolerant corals, our results suggest that investing effort into identifying the most tolerant colonies within individual reefs may be warranted.","author":"Liam Lachs","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"e6830e57af76cbb689d56c118a55e2de64d0b9c9f5d9c12bdb5388103d05acb6","category":"Environment"}