{"title":"The Impact of Type II Diabetes Mellitus on Non-surgical Periodontal Treatment: A Non-randomized Clinical Trial","link":"https://www.preprints.org/manuscript/202409.0862/v1","date":1726066863000,"content":"Background/Objectives: Periodontitis (P), a chronic inflammatory condition that affects the supportive tissues around the teeth, is 3 to 4 times more prevalent in individuals with diabetes mellitus (DM), with a direct correlation between its severity and the levels of glycosylated haemoglobin (HbA1c). This study aimed to evaluate the periodontal clinical parameters following non-surgical periodontal treatment (NSPT) in patients with and without type 2 DM and P. Methods: Forty patients with P were divided into two groups: Group DM/P and Group P. All patients were assessed at baseline, and 90 and 180 days after receiving NSPT. The parameters evaluated included HbA1c levels, plaque index (PI), probing pocket depth (PPD), clinical attachment level (CAL), and bleeding on probing (BoP). Statistical analysis was performed with a significance level set at α = 5%. Results: There were significant differences in HbA1c levels between the DM/P and P groups at baseline, 90, and 180 days, as expected. Importantly, HbA1c levels did not change after NSPT. Group P showed a significant reduction in both PI and BoP values at 90 and 180 days (p &amp;lt; 0.05). In contrast, group DM/P demonstrated a significant increase in the percentage of sites with PPD ≥ 5mm at 180 days (p &amp;lt; 0.05). Additionally, group P exhibited an increase in sites with PPD ≤ 4mm and a decrease in sites with PPD ≥ 5mm at both 90 and 180 days (p &amp;lt; 0.05). Conclusions: Our findings suggest that DM may compromise the effectiveness of NSPT, potentially hindering favorable outcomes during the follow-up period.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e689bd0fd35314ea710fc9421fd7d736dfc7e93aa109b33d1d7143a71b21f519","category":"Interdisciplinary"}