{"title":"Unraveling the forage productivity puzzle: Comparing fast and slow-growing grasses","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306692","date":1722348000000,"content":"<p>by M. Gabriela Pittaro, Paulo G. Duchini, Gabriela C. Guzatti, André F. Sbrissia</p>\r\n\r\nFunctional traits are powerful tools for distinguishing between plants with different resource acquisition strategies. Fast-growing plants normally dominate resource-rich habitats and present trait values associated with high productivity, such as high specific leaf area (SLA), short leaf lifespan, and rapid leaf elongation rate (LER). In contrast, slow-growing species have a higher leaf weight ratio (LWR), leaf lifespan (LLS), and phyllochron, which are useful traits for survival in stressful and unfertile environments, but are normally thought to be incompatible with high productivity, even under fertile conditions. We tested the hypothesis that slow-growing forage grasses have demographic parameters (tiller population density and canopy density) that offset their slow individual traits, making them as productive as fast-growing species when grown in fertile soil. Species with contrasting growth strategies (<i>Arrhenatherum elatius</i> L. and <i>Festuca arundinacea Schreb</i> cv. Quantum II, fast and slow-growing species, respectively) were cultivated in 45 m<sup>2</sup> field plots and subjected to the same cutting regime and nitrogen supply level. Functional traits and canopy attributes were continuously measured during 8 growing cycles after the establishment of the swards. <i>A</i>. <i>elatius</i> had higher SLA, LER, leaf senescence, and leaf appearance rates, whereas <i>F</i>. <i>arundinacea</i> had higher LLS and LWR values. Conversely, there were no differences in relative growth rate or forage accumulation. <i>F</i>. <i>arundinacea</i> was able to offset their plant functional traits, typically associated with slow-growing grasses, with some demographic parameter like higher tiller population density, allowing it to be as productive as the fast-growing <i>A</i>. <i>elatius</i> when both were grown in fertile soil. Therefore, we suggest cautionary use of traditional plant functional traits to explain and predict the annual productivity of slow-growing grasses.","author":"M. Gabriela Pittaro","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e6964c2c3e67dee2cbb0e810ce21320fb2bc296c0a424b04bff2bf31a85a7049","category":"Interdisciplinary"}