{"title":"Next-Generation 24-Inch iMac and 27-Inch 'iMac Pro': Rumor Recap","link":"https://www.macrumors.com/2023/04/18/24-inch-imac-and-imac-pro-rumor-recap/","date":1681834379000,"content":"Apple is working on an updated 24-inch <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a> and an all-new \"Pro\" ‌iMac‌ ahead of an approximate launch time frame at the end of this year, according to key reports from over the past year.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/iMac-Pro-2022-27-and-24-iMac.jpg\" alt width=\"1626\" height=\"914\" />\r<br />\nIn mid-2022, <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/2022/07/04/gurman-apple-still-working-on-pro-imac/\">Mark Gurman suggested</a> that Apple is working on at least two ‌iMac‌ models, likely using the \"<a href=\"https://www.macrumors.com/guide/m3/\">M3</a>\" series of chips. He said that Apple will likely launch an updated 24-inch ‌iMac‌ featuring the standard <a href=\"https://www.macrumors.com/guide/m3/\">M3</a> chip in 2023 and is continuing work on a high-end ‌iMac‌ model:<blockquote>I also still believe that Apple is working on a larger-screened iMac aimed at the professional market. I'd imagine this will use a variation of the M3 chip, likely an M3 Pro and M3 Max. That would match the chips inside of the MacBook Pro. I don't think the combination of a Mac Studio or Mac mini plus an Apple Studio Display cuts it for many pro users who want more screen real estate.</blockquote>Apple <a href=\"https://www.macrumors.com/2021/03/06/apple-confirms-imac-pro-will-be-discontinued/\">discontinued the iMac Pro</a> in March 2021 and it discontinued the 27-inch Intel-based version of the ‌iMac‌ in March 2022, leaving the 24-inch ‌iMac‌ with the <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> chip as the only remaining ‌iMac‌ model. For now, Apple has effectively replaced the 27-inch ‌iMac‌ with the <a href=\"https://www.macrumors.com/roundup/mac-studio/\">Mac Studio</a> and its matching <a href=\"https://www.macrumors.com/roundup/studio-display/\">Studio Display</a>.\r<br />\n\r<br />\nWhile some reports claim that there is <a href=\"https://www.macrumors.com/2022/03/11/apple-no-larger-screened-imac-pro/\">no high-end iMac in development</a>, several high-profile sources believe that a more powerful, larger ‌iMac‌ is still in the works. Display Supply Chain Consultants analyst Ross Young has said since 2021 that <a href=\"https://www.macrumors.com/2021/10/19/apple-27-inch-xdr-display-early-2022-rumor/\">Apple is working on</a> an ‌iMac‌ with a 27-inch mini-LED display with ProMotion, which would seemingly line up with a future \"‌iMac‌ Pro\" model in terms of feature-set. Likewise, Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> believes that a new, 27-inch ‌iMac‌ Pro model will <a href=\"https://www.macrumors.com/2022/03/06/kuo-imac-pro-in-2023-27-inch-display-this-year/\">launch in 2023</a> alongside a new <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a>.\r<br />\n\r<br />\nRumors about a new ‌iMac‌ Pro have faded in recent months, but the updated 24-inch model still seems to be on track to launch at the end of this year or early next year. Last month, <a href=\"https://www.macrumors.com/2023/03/05/new-imac-advanced-development/\">Gurman said</a> that the next-generation ‌iMac‌ had reached an \"advanced stage of development,\" adding that it likely \"won't arrive until the tail end of this year at the earliest or next year\" because it contains the ‌M3‌ chip – which also has yet to launch.\r<br />\n\r<br />\nThe ‌M3‌ family of chips are expected to be built on TSMC's 3nm technology, unlike the ‌M1‌ and <a href=\"https://www.macrumors.com/guide/m2/\">M2</a>, which are built using a 5nm process. The more advanced manufacturing process is expected to bring significant performance and efficiency improvements. Apple chip supplier TSMC is expected to begin commercial production of 3nm chips in the <a href=\"https://www.macrumors.com/2023/02/22/apple-secures-tsmc-3nm-chips/\">second-half of this year</a>, meaning that the first Macs with the ‌M3‌ chip would likely only be able to launch around the third quarter of 2023 at the earliest.\r<br />\n\r<br />\nLittle is known about the specifics of the two machines, but a larger, ~27-inch mini-LED display with ProMotion, ‌M3‌ Pro and ‌‌M3‌‌ Max chip options, and a slew of ports brought over from the MacBook Pro are the most likely prospective features for the ‌‌iMac‌‌ Pro. Given the fact that the 24-inch ‌iMac‌ was a fully redesigned machine upon its debut in 2021, major changes beyond the ‌M3‌ chip may be less likely, but a refreshed selection of color options seems highly probable.\r<br />\n\r<br />\nWhether an ‌iMac‌ with a larger display and a more powerful chip aimed at the professional market will emerge this year is yet to be seen and only the 24-inch model is currently rumored to be in an advanced stage of development. At minimum, Apple seems firmly poised to launch the new 24-inch ‌iMac‌ with the ‌M3‌ chip later this year, but a new ‌iMac‌ Pro is still very much on the table, especially going into 2024.<div>Tags: <a href=\"https://www.macrumors.com/guide/2023-imac-pro/\">2023 iMac Pro</a>, <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/imac.91\">iMac</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/18/24-inch-imac-and-imac-pro-rumor-recap/\">Next-Generation 24-Inch iMac and 27-Inch 'iMac Pro': Rumor Recap</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/next-generation-24-inch-imac-and-27-inch-imac-pro-rumor-recap.2387130/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e69fe4290946cfa0e4986758d399810caa49281cf8dc479952eaf365d8560d40","category":"Apple"}