{"title":"239 Variation in muscle protein synthesis in growing gilts is partially associated with insulin resistance and sensitivity","link":"https://academic.oup.com/jas/article/102/Supplement_2/193/7664986?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Pigs with similar body weight (BW), same genetic background and sex vary in protein deposition (PD) overgrowth. We aimed to study metabolic factors influencing PD in 65 kg BW gilts. Gilts were fed ad libitum a diet balanced to maximize PD. Dual X-rays were conducted to estimate body protein mass on d 1 and 21, allowing calculation of PD by difference. On d 23, the gilts were categorized into Low (157 g/d) and High (219 ± 9.97 g/d) PD groups. In each group, eight pigs underwent jugular vein cannulation. After a 48-h recovery period, where they were fed at 90% of the measured feed intake, they were fasted for 8 h. All pigs were then given a 300 g meal at time 0, and blood samples were collected at 10, 15, 20, 30, 40, 50, 60, 75, 90, 120, 150, 178, and 178 min, to study insulin and glucose responses. At 180 min post-meal, a solution of L-<sup>13</sup>C valine was administered i.v. (18 ape – flooding dose), and liver, duodenum, and longissimus dorsi muscle samples were collected within 5 minutes of slaughter. The fractional synthesis rate (FSR, %/d), absolute synthesis rate (ASR, g/d), ribosomal capacity for protein synthesis (Cs), and the efficiency of protein synthesis (<sub>K</sub>RNA) based on total RNA concentration in skeletal muscle were calculated. The insulin resistance index (HOMA-B) and insulin sensitivity index (QUICKI) were also determined. The difference between Low and High PD gilts was compared using a F-test. The longissimus dorsi muscle exhibited a 31% greater (<span>P</span> = 0.01) FSR in High compared with Low PD group. No significant differences were observed in the FSR of the jejunum and liver. High PD gilts showed a 55% greater ASR in whole-body muscles (<span>P</span> = 0.003) and 42% greater ASR in the liver (<span>P</span> = 0.04) compared with Low PD gilts, with no difference for the ASR in the jejunum. The <sub>K</sub>RNA in the longissimus dorsi was 48% greater in High PD gilts (<span>P</span> = 0.01), with no differences in <sub>K</sub>RNA for the jejunum or liver. Cs did not differ between Low and High PD gilts. The QUICKI index tended to be greater in High PD gilts (<span>P</span> = 0.10). Spearman’s correlation revealed that longissimus dorsi FSR was negatively correlated with the HOMA-B index (r = -0.53; <span>P</span> = 0.04). Increases in the HOMA-B index tended to be associated with greater <sub>K</sub>RNA (r = -0.49; <span>P</span> = 0.06). These correlations highlight the complex interplay of metabolic and hormonal factors involved in the observed differences in protein synthesis and efficiency in growing gilts. Insulin resistance and sensitivity may play a role in influencing skeletal muscle PD variations.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e6a16015c2d494a67db21308e4da8a31d7a9c5158098739f9dad12d695792d0a","category":"Environment"}