{"title":"Gravel bike vs road bike: just what are the differences?","link":"https://www.bikeradar.com/advice/buyers-guides/gravel-bike-vs-road-bike/","date":1638975642000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/Salsa-Warbird-Carbon-GRX-600-01-0b8d0ba.jpg?quality=90&amp;resize=620,413\" />                                            <p>Built for the tarmac or the trail beyond, while road and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bikes</a> share a lot in common, there are some more subtle differences that optimise them for different road and trail surfaces, as well as contrasting riding styles.</p>\n<p>These differences tend to exist on a spectrum, where road racing bikes are most dissimilar to burlier gravel bikes, and endurance road bikes and all-road gravel bikes tend to share more in common somewhere in the middle.</p>\n<p>Here, we check out what sets these bikes apart, before considering whether you really need a road bike or gravel bike, and how versatile a gravel bike can be for road riding, touring and as a winter road bike.</p>\n<section><div>\n        <h2>What are road bikes and gravel bikes designed for?</h2>\n<p>Both <a href=\"https://www.bikeradar.com/features/what-is-a-road-bike/\">road bikes</a> and gravel bikes exist within a number of different sub-categories; they’re largely designed for either sticking to the tarmac, or venturing off it.</p>\n<p>Within both categories, you’ll find race-orientated all-road steeds right the way through to endurance models, and everything in between. The specific purpose of these bikes will determine key features, such as geometry, tyre clearance, frame materials, finishing kit and mounts.</p>\n<p>Having said this, there are some general differences between gravel bikes and road bikes.</p>\n<p>\n\n    </p></div>\n    </section><h2>Gravel vs road bike geometry</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Gravel bike geometry varies widely from racier road-adjacent setups to more relaxed builds.</span></figcaption><span> <i>Wilier</i></span></div>\n<p>Longer, lower, slacker: probably terms you’re more familiar with from the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-trail-bikes/\">mountain bike</a> world, but also words that can be applied to gravel geometry when comparing them to road bikes.</p>\n<p>The demands of gravel riding and road riding are significantly different.</p>\n<p>While <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-geometry-explained/\" target=\"_blank\">road bike geometry</a> tends to err towards precise handling and a responsive, fast ride, gravel riders look for stability and capability over more technical terrain, while also maximising comfort for long days in the saddle.</p>\n<p>For these reasons, road and gravel bike geometries are significantly different. Gravel bikes feature longer wheelbases and slacker head tube angles to give added stability, just as trail bikes tend to be longer and slacker than <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cross-country-bikes/\">cross-country</a> bikes.</p>\n<p>Gravel bikes tend to be designed with a more upright body position in mind, with the exception of racing steeds, and therefore measure up with a shorter reach and higher stack than many road bikes. Endurance road bikes also feature a less aggressive position, so there may be some overlap here.</p>\n<p>Some gravel bikes have a sloping top tube, which not only leaves more seatpost exposed, giving a little extra compliance over the rougher stuff, but also gives easier manoeuvrability over the bike compared to a traditional, straight top tube.</p>\n<h2>Tyres and clearance</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Some gravel bikes, such as this Fairlight Faran, feature super-wide tyre clearances for rougher exploration.</span></figcaption><span> <i>Fairlight</i></span></div>\n<p>Tyres – and just as crucially tyre clearance – are one of the biggest differences between gravel bikes and road bikes.</p>\n<p>While many road bikes will be designed around 28mm tyres – or perhaps up to 32mm for progressive endurance road bikes – <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-tyres/\" target=\"_blank\">gravel bike tyres</a> tend to be no narrower than 35mm, extending up into <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cross-country-bikes/\" target=\"_blank\">XC mountain bike</a> territory at 2in (50mm) plus.</p>\n<p>Tyre clearance between the forks, seatstays and chainstays will determine the maximum width of tyres that can be used. This is generally much wider for gravel bikes to allow a greater range of tyres and treads to be used, as well as all-important mud clearance for wetter, stickier conditions.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> While almost all road tyres are slick, gravel tyres are anything but.</span></figcaption><span> <i>Wilderness Trail Bikes</i></span></div>\n<p>Where some gravel bikes are limited on tyre clearance, brands or riders might opt for <a href=\"https://www.bikeradar.com/features/what-is-650b/\" target=\"_blank\">650b wheels</a> to be able to fit a chunkier tyre without having to switch the frame.</p>\n<p>For road bikes, almost all are fitted with 700c wheels, except for some smaller-sized bikes, which use 650b or 650c to retain more proportional geometry.</p>\n<p>Almost all <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">road tyres</a> are slick, whereas almost all <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-tyres/\">gravel tyres</a> will feature at least some tread pattern. This will vary according to use, with semi-slick tyres for fast, dry racing and aggressive knobs for traction in muddier, more technical conditions.</p>\n<h2>Frame materials</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Steel frames are certainly more commonly used for gravel than road bikes.</span></figcaption><span> <i>Duncan Philpott / Immediate Media</i></span></div>\n<p>Both road bikes and gravel bikes are manufactured in a range of materials: <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-frame-materials/\">aluminium, carbon, steel and titanium</a>.</p>\n<p>Each material has its pros and cons, from budget to durability, weight and vibration absorption.</p>\n<p>Of course, there’s also a great deal of variation within materials: for example, the grade of steel can have a huge impact on the frame’s weight.</p>\n<p>Steel tends to be more popular in the gravel riding world than in road cycling, thanks to its strength, durability and vibration-dampening ride quality, as well as the popularity of custom builds in this category.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Carbon fibre allows for some exciting features such as the down tube storage employed by Specialized, Trek, Orbea and others.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>Having said this, carbon fibre is still probably the most popular material in both categories for higher-end builds, due to its stiff, lightweight quality and vibration absorption.</p>\n<p>Aluminium alloy frames are more common at the budget end of the spectrum, with robust builds at relatively low prices, perfect for beginner gravel riders.</p>\n<p>Titanium builds are highly coveted, and found at the premium end of the range. Titanium is often touted to give a superior ride quality, while being more lightweight and resistant to fatigue than steel.</p>\n<h2>Mounting points</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> More mounting points means you can add cargo or bottle cages to the forks.</span></figcaption><span> <i>Phil Hall / Immediate Media</i></span></div>\n<p>While racing road bikes are likely to have very few mounting points, catering only for a pair of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bottle-cages/\" target=\"_blank\">bottle cages</a> in the main triangle, endurance, urban and winter road bike builds are likely to have more mounts to allow you to fit <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mudguards-fenders-a-buyers-guide/\" target=\"_blank\">mudguards</a>, racks and more bottles.</p>\n<p>The same applies in the gravel realm, with racier builds stripped down to host just a few bottles, while more bikepacking-oriented bikes can be almost covered in bosses, from the top tube to fork legs and down tube.</p>\n<h2>Finishing kit</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Gravel-specific flared bars give a wider and more stable descending position.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Although road and gravel bikes do appear on the surface to be very similar, when you look more closely you can often find subtle differences, including the finishing kit: seatposts, stems, handlebars and saddles.</p>\n<p>Racing road bikes are optimised for efficiency, both in terms of pedalling and aerodynamics, so it’s no surprise that you find more aerodynamically shaped bars and seatposts there.</p>\n<p>Although you do encounter some aerodynamic finishing kit on gravel builds, features to give more stable handling and smooth out rougher trails tend to be more common.</p>\n<p>Flared handlebars give a wider, more stable position in the drops for descending on rougher surfaces, and have become a very popular choice on gravel bikes. Some gravel bikes feature flat bars instead.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The clever leaf spring Canyon VCLS seatpost is one option for smoothing out rougher rides.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Some gravel bikes also feature <a href=\"https://www.bikeradar.com/features/five-soft-riding-road-seatposts-tested-in-the-lab-and-on-the-road/\" target=\"_blank\">seatposts designed to give more comfort</a> over bumpier terrain, such as the <a href=\"https://www.bikeradar.com/reviews/components/seatposts/seatpost-and-seat-pin/canyon-vcls-post-2-0-review/\">Canyon VCLS 2.0</a>.</p>\n<p>You can also find some more advanced tech here, with suspension seatposts, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\" target=\"_blank\">dropper posts</a> and even suspension stems and headsets. These can be either integrated as part of the frameset or added as aftermarket options.</p>\n<h2>Suspension</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The RockShox Rudy Ultimate XPLR fork is among the first gravel suspension options.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>This is a growing trend in the gravel sector, from in-built frame micro-suspension of a few millimetres as seen on the new <a href=\"https://www.bikeradar.com/news/2022-bmc-urs-lt/\">BMC URS LT</a> to aftermarket suspension components such as the <a href=\"https://www.bikeradar.com/news/sram-rockshox-zipp-xplr/\">RockShox Rudy </a><a href=\"https://www.bikeradar.com/news/sram-rockshox-zipp-xplr/\">Ultimate</a><a href=\"https://www.bikeradar.com/news/sram-rockshox-zipp-xplr/\"> XPLR fork</a> offering up to 40mm travel.</p>\n<p>Interestingly, the origin of in-built gravel bike suspension could actually be attributed to road, where the spring classics such as Paris-Roubaix and the Tour of Flanders sparked an arms race in developing road micro-suspension to tackle the rough roads and pavé at speed.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Specialized Future Shock in action.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Although you’re more likely to see suspension on gravel bikes to reduce fatigue over longer rough rides or add a little extra technical capability, you might still see micro-suspension features on endurance road bikes, such as the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/specialized-roubaix-expert-long-term-review/\">Specialized Roubaix’s</a> Future Shock 2.0 headset.</p>\n<h2>Pedals</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Double-sided entry SPD pedals tend to be the most popular for gravel riders.</span></figcaption><span> <i>Mildred Locke / Immediate Media</i></span></div>\n<p>Road riders tend to prefer SPD-SL-style three-bolt <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-pedals/\">road bike pedals</a>, whereas gravel riders tend to opt for SPD-style two-bolt <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-pedals/\">mountain bike pedals</a> and cleats, with a few exceptions.</p>\n<p>As you’re more likely to spend a bit of time off the bike on rugged terrain, hard-wearing SPD metal cleats fare much better for off-road riding, and the pedals offer dual-sided entry, which can be really useful. The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bike-shoes/\">best gravel bike shoes</a> tend to be designed with this pedal and cleat system in mind.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> You’ll need to match your shoe type to your pedal type, in this case the two-bolt SPD.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>Some gravel riders prefer trail pedals, which offer a greater platform around the mechanism, or even flat pedals for more technical or muddier riding. These can also come in really handy for multi-day tours.</p>\n<p>SPD-SL-style pedals tend to be favoured on the road for their increased efficiency, twinned with stiffer-soled <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-cycling-shoes/\">road cycling shoes</a>, and are only typically used off-road for single-stage gravel races such as <a href=\"https://www.bikeradar.com/features/pro-bike/sbt-grvl-bikes/\">SBT GRVL</a>.</p>\n<h2>Do I really need a gravel bike if I have an endurance road bike?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The gap between endurance road bikes and gravel bikes is decreasingly small.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>As you’ll be able to tell by now, the differences between endurance road bikes and gravel bikes are narrower, with a more upright, comfort-oriented geometry, clearance for wider tyres and even sometimes frame-based features to smooth out rougher roads.</p>\n<p>So if you already have an endurance road bike, do you really need a gravel bike?</p>\n<p>The answer to this totally depends on what you want to do on your rides, and that typically comes down to tyre width and tread.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Trek’s Domane could have passed as a fully-fledged gravel bike a few short years ago.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>If you’re happy tackling rougher roads and smoother, hard-packed gravel in the dry, then an endurance road bike will be more than enough.</p>\n<p>Many now have generous clearances for wider, slick tyres, plus a little extra room for dirt, or you could even fit a file tread. For example, the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/trek-domane-sl7-review/\">Trek Domane</a> has clearance for up to 38mm tyres, which is essentially the narrow end of gravel bike territory.</p>\n<p>Once you start seeking out rougher, rockier, rootier and more technical tracks and trails, as well as year-round off-road conditions, a gravel bike really becomes useful.</p>\n<p>Let’s face it, bar a few areas in the US and some more remote national parks in Europe, the idea of gravel riding for most people is actually multi-terrain: taking in singletrack, doubletrack, field edge paths, canal towpaths, forestry roads and even some tamer mountain bike trails.</p>\n<p>Wider tyres and a slacker geometry really help on steeper and rougher terrain, so consider a gravel bike if you’re looking for a capable steed on off-road sections.</p>\n<h2>Can I use my gravel bike on the road?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> From dirt to the road, there’s absolutely no reason why you can’t ride your gravel bike on tarmac.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>You can certainly use your gravel bike on the road: in fact, you’ll probably need to ride at least short road sections to link up segments of off-road trails and dirt tracks.</p>\n<p>If you’d like to use your gravel bike exclusively on the road, it may be worth switching out the tyres for something a little slicker if you’re running gravel tyres with a more aggressive tread. This will help to reduce the rolling resistance and give you a speedier sensation over smooth tarmac compared to gravel tyres, which can sometimes feel a bit draggy or sluggish on the road.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Using a gravel tyre with a smoother central tread or semi-slick will help you sail on the road.</span></figcaption><span> <i>Teravail</i></span></div>\n<p>As you’ll typically feel less resistance from the road compared to looser gravel tracks, you might find that the gearing you have on your gravel bike is not optimised for the road. For example, if you are running a 1x <a href=\"https://www.bikeradar.com/advice/buyers-guides/gravel-bike-setup/\">gravel bike setup</a>, you might run out of top-end gears when descending on smooth tarmac.</p>\n<p>If you’re planning to buy a gravel bike that you know you’d also like to use on the road, consider a 2x drivetrain to help maximise your gear range.</p>\n<h2>Can I use a gravel bike as a winter road bike?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Could a gravel bike help keep you riding through winter?</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>With pothole-buffering chunky tyres, plenty of space for mudguards and a less aggressive riding position, gravel bikes can make some of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-road-bikes/\">best winter road bikes</a> for those base miles.</p>\n<p>Gravel bikes are almost exclusively specced with disc brakes, and more often than not hydraulic too. These offer really great braking performance, even when it’s wet. In addition, the levers are easy to operate, even when your hands are cold.</p>\n<p>As gravel bikes frequently (although not always) come with mounts for mudguards and racks, they make not only for good winter road bikes, but also for great <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-touring-bike-how-to-choose-the-right-one-for-you/\">touring bikes</a>. This is further complemented by the more upright, comfortable position, which is similar to what you’d find on most touring setups.</p>\n<p>Doubling up your bike’s use can also come in really handy if you’re limited on space or budget.</p>\n<h2>One bike, two wheelsets?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> One set for the road, one for the trail?</span></figcaption><span> <i>Robyn Furtado / Immediate Media</i></span></div>\n<p>More and more riders are taking this clever approach, opting for one gravel bike with two wheelsets to be able to tackle different terrain and switch easily between setups.</p>\n<p>Typically, you’d have a 700c wheelset with a slick, road-going tyre mounted for tarmac expeditions, plus a 650b wheelset with a chunkier, dirt-loving tread on higher-volume tyres for tackling more off-road-oriented rides.</p>\n<p>As you simply have to switch out the wheels, rather than the more involved process of switching tyres (especially when it comes to <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless setups</a>), this makes your single bike much more versatile.</p>\n<p>If you’re considering this as an option, think carefully about what your priorities are. You’ll need to choose the gearing and setup that’s the best compromise for you between these two riding styles.</p>","author":"Katherine Moore","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"e6a4a0cf54d52758d6202e16d912dad6072bb03b4840ea896bc4a68551f6f264","category":"Cycling"}