{"title":"Asymmetrical predation intensity produces divergent antipredator behaviours in primary and secondary prey","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14166?af=R","date":1724909688000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/ba8dbcc3-e538-403b-9f08-9d1c89b514fc/jane14166-toc-0001-m.png\" alt=\"Asymmetrical predation intensity produces divergent antipredator behaviours in primary and secondary prey\" />\n<p>These findings demonstrate that among a diverse prey guild within a spatially heterogeneous environment, asymmetrical predation between a primary and secondary prey species can modulate both the magnitude of perceived risk and the strategies used to manage it, highlighting an important and understudied contingency in risk effects research.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nIt is widely recognized that predators can influence prey through both direct consumption and by inducing costly antipredator behaviours, the latter of which can produce nonconsumptive effects that cascade through trophic systems. Yet, determining how particular prey manage risk in natural settings remains challenging as empirical studies disproportionately focus on single predator–prey dyads.\n\nHere, we contrast foraging strategies within the context of a primary and secondary prey to explore how antipredator behaviours emerge as a product of predation intensity as well as the setting in which an encounter takes place.\n\nWe studied the effects of spotted owls (<i>Strix occidentalis</i>) on two species experiencing asymmetrical risk: dusky-footed woodrats (<i>Neotoma fuscipes</i>; primary prey) and deer mice (<i>Peromyscus</i> spp.; alternative prey). Woodrats are most abundant within young forests, but predominantly captured by owls foraging within mature forests; in contrast, deer mice occur in high densities across forest types and seral stages and are consumed at lower per-capita rates overall. We deployed experimental foraging patches within areas of high and low spotted owl activity, created artificial risky and safe refuge treatments, and monitored behaviour throughout the entirety of prey foraging bouts.\n\nWoodrats were more vigilant and foraged less within mature forests and at riskier patches, although the effect of refuge treatment was contingent upon forest type. In contrast, deer mice only demonstrated consistent behavioural responses to riskier refuge treatments; forest type had little effect on perceived risk or the relative importance of refuge treatment. Thus, habitat can interact with predator activity to structure antipredator responses differently for primary versus secondary prey.\n\nOur findings show that asymmetrical predation can modulate both the magnitude of perceived risk and the strategies used to manage it, thus highlighting an important and understudied contingency in risk effects research. Evaluating the direct and indirect effects of predation through the paradigm of primary and secondary prey may improve our understanding of how nonconsumptive effects can extend to population- and community-level responses.\n</p>","author":"Corbin C. Kuntze, \nM. Zachariah Peery, \nJonathan N. Pauli","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"e6a589602a2a4059a82ad038c066bf022a972b8a0c64aad0484c8a2342cbbf2f","category":"Environment"}