{"title":"102 Estradiol and follicular growth are associated with estrous behavior monitored by an accelerometer in grazing beef cows","link":"https://academic.oup.com/jas/article/102/Supplement_1/37/7617914?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>In beef cattle, 40% of cows that display estrus do not remain pregnant after embryo transfer (ET). Estrus is a physiological behavior influenced by the concentration of sex-steroids. The use of accelerometer devices for estrus detection is a common practice in dairy operations. It remains unclear if this same artificial intelligence software can accurately measure reproductive behavior in beef females. We hypothesized that estrous variables detected by an accelerometer are associated with ovarian, hormonal, pregnancy outcome, and fertility-related variables measured in the cow. Fifty Bos indicus-influenced, cyclic, primiparous cows were fitted with an accelerometer collar (SCR Engineers, Israel) and a breeding indicator (Estrotectâ) to detect estrus after a synchronization protocol in five subsequent experimental replicates (n = 50*5 = 250). Only cows that showed estrus (d 0) remained in the study. The following variables were used from the accelerometer software: Activity Peak, Rumination Nadir, Estrus Duration, and Heat Index, calculated by proprietary algorithms. Dominant follicle (DF) diameter and plasma concentration of estradiol were measured on d -2 (day of progesterone device removal) and on d 0. On d -1 and d 4, endometrial thickness and luminal fluid accumulation were measured by ultrasonography. On d 7, two embryos were transferred/cow. Pregnancies were diagnosed on d 45 and terminated. After 30 d, a new replicate started. Cows included in at least two replicates that remained pregnant 100%, 99-50%, or less than 50% were classified as fertile, sub fertile, and infertile, respectively. Estrus display was recorded for 166 cows (66%). Estrus detection by accelerometer and Estrotect had excellent agreement rate (kappa coefficient 0.76). Cows detected in estrus only by Estrotect had 66% less pregnancy/ET than cows in estrus by both (9/21 vs. 97/145; P = 0.01). The DF diameter on d 0 was not associated with accelerometer variables. Cows with greater and moderate Activity Peak had a greater growth rate of the DF from d -2 to d 0 than lower Activity Peak cows (interaction day*Activity Peak; P = 0.06). Estradiol on d -1 was positively associated with the Activity Peak (P &lt; 0.0001). Cows with lower Activity Peak had a thicker endometrium on both d -1 and d 4 (P=0.02), and greater uterine luminal fluid score on d -1 (P=0.03). Fertility status was not associated with any accelerometer variables. In conclusion, the Activity Peak is associated positively with estradiol concentration and DF growth, however no association was found with pregnancy outcome and fertility. Therefore, the main advantage of accelerometers in beef ranches is the ability to detect estrus at a similar accuracy as breeding indicators, using less labor. Future enhancements in hardware and software to allow prediction of pregnancy outcomes are expected to increase reproductive efficiency in cow-calf operations.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e6a5ab66c81575706301c67c9c5ac8108a1bfd91d016ab4ae4563cc5024ea4a6","category":"Environment"}