{"title":"MicroBundleCompute: Automated segmentation, tracking, and analysis of subdomain deformation in cardiac microbundles","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0298863","date":1711461600000,"content":"<p>by Hiba Kobeissi, Javiera Jilberto, M. Çağatay Karakan, Xining Gao, Samuel J. DePalma, Shoshana L. Das, Lani Quach, Jonathan Urquia, Brendon M. Baker, Christopher S. Chen, David Nordsletten, Emma Lejeune</p>\r\n\r\nAdvancing human induced pluripotent stem cell derived cardiomyocyte (hiPSC-CM) technology will lead to significant progress ranging from disease modeling, to drug discovery, to regenerative tissue engineering. Yet, alongside these potential opportunities comes a critical challenge: attaining mature hiPSC-CM tissues. At present, there are multiple techniques to promote maturity of hiPSC-CMs including physical platforms and cell culture protocols. However, when it comes to making quantitative comparisons of functional behavior, there are limited options for reliably and reproducibly computing functional metrics that are suitable for direct cross-system comparison. In addition, the current standard functional metrics obtained from time-lapse images of cardiac microbundle contraction reported in the field (i.e., post forces, average tissue stress) do not take full advantage of the available information present in these data (i.e., full-field tissue displacements and strains). Thus, we present “MicroBundleCompute,” a computational framework for automatic quantification of morphology-based mechanical metrics from movies of cardiac microbundles. Briefly, this computational framework offers tools for automatic tissue segmentation, tracking, and analysis of brightfield and phase contrast movies of beating cardiac microbundles. It is straightforward to implement, runs without user intervention, requires minimal input parameter setting selection, and is computationally inexpensive. In this paper, we describe the methods underlying this computational framework, show the results of our extensive validation studies, and demonstrate the utility of exploring heterogeneous tissue deformations and strains as functional metrics. With this manuscript, we disseminate “MicroBundleCompute” as an open-source computational tool with the aim of making automated quantitative analysis of beating cardiac microbundles more accessible to the community.","author":"Hiba Kobeissi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e6b0026ccdad12b2a7d59c02273de45f2591706ae6daea7b07d8fc66c86b3610","category":"Interdisciplinary"}