{"title":"Substitution of Inorganic Fertilizers with Organic Fertilizers Influences Soil Carbon and Nitrogen Content and Enzyme Activity under Rubber Plantation","link":"https://www.preprints.org/manuscript/202404.0929/v1","date":1713197207000,"content":"Conventional fertilization practices can lead to many ecological problems, such as nutrient imbalance, soil acidity, and reduced soil fertility in natural rubber plantations. To address these challenges, a field investigation was strategically carried out to substitute inorganic fertilizer with organic fertilizers consisted of six treatments, i.e., no fertilization (CK), inorganic fertilizer (NPK), 25 % replacement of inorganic through organic (25%M), 50 % replacement of inorganic through organic (50%M), 75 % replacement of inorganic through organic (75%M), and 100% organic fertilizer (100%M). The soil physicochemical properties (SOC, TN, AN, C:N, pH, NH4+-N, and NO3--N) and carbon and nitrogen converting enzymes (BG, NAG, and LAP) were all determined. The partial substitution of inorganic fertilizers with organic fertilizers (i.e., 75%M at surface soil layer) showed higher SOC (14.52 g.kg-1), TN (1.06 g.kg-1), AN (20.07 mg.kg-1), C:N (14.63), NH4+-N (10.63 mgkg-1), and NO3--N(11.06 mg.kg-1) than NPK and CK. Such increase in physicochemical properties in partial replacement of inorganic with organic fertilizers plots resulted from higher carbon and nitrogen enzymes activities (BG (143.17 nmol.g-1.h-1), NAG (153.96 nmol.g-1.h-1), and LAP (153.48 nmol.g-1.h-1)) compared to NPK and CK, and further the person correlation and RDA analysis confirmed a significant positive correlation between SOC, AN, and soil enzymes. This study presents a new strategy for assessing the impact of partially replacing inorganic fertilizers with organic fertilizers in rubber plantations, mainly by modifying the soil nutrient composition in tropical regions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e6cab32192fad0378445a64f8d7568be39fc6b9876113ae771fa4146291ca11a","category":"Interdisciplinary"}