{"title":"Multiscale physiological responses to nitrogen supplementation of maize hybrids","link":"https://academic.oup.com/plphys/article/195/1/879/7334394?rss=1","date":1698710400000,"content":"<span><div>Abstract</div>Maize (<span>Zea mays</span>) production systems are heavily reliant on the provision of managed inputs such as fertilizers to maximize growth and yield. Hence, the effective use of nitrogen (N) fertilizer is crucial to minimize the associated financial and environmental costs, as well as maximize yield. However, how to effectively utilize N inputs for increased grain yields remains a substantial challenge for maize growers that requires a deeper understanding of the underlying physiological responses to N fertilizer application. We report a multiscale investigation of five field-grown maize hybrids under low or high N supplementation regimes that includes the quantification of phenolic and prenyl-lipid compounds, cellular ultrastructural features, and gene expression traits at three developmental stages of growth. Our results reveal that maize perceives the lack of supplemented N as a stress and, when provided with additional N, will prolong vegetative growth. However, the manifestation of the stress and responses to N supplementation are highly hybrid-specific. Eight genes were differentially expressed in leaves in response to N supplementation in all tested hybrids and at all developmental stages. These genes represent potential biomarkers of N status and include two isoforms of <span>Thiamine Thiazole Synthase</span> involved in vitamin B1 biosynthesis. Our results uncover a detailed view of the physiological responses of maize hybrids to N supplementation in field conditions that provides insight into the interactions between management practices and the genetic diversity within maize.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"e6eb6f1d4fe0f35fc47aeb10dc50d951fefc35a6b5d3496049a5af31906d4a54","category":"Environment"}