{"title":"Apple is doomed and the only thing that can save it is the Mac mini","link":"https://www.macworld.com/article/2128269/27-inch-imac-not-launching-studio-display-mac-mini.html","date":1699353000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It’s time for another entry in our infrequent series “How’s <em>That</em> Going?!”</p>\n\n\n\n<p>Now, cast your mind all the way back to, uh, well, like three weeks ago.</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1986404/apple-giant-32-inch-imac-testing.html\">“A Giant 32-Inch iMac is Reportedly in Testing–But Not Coming Anytime Soon”</a></p>\n\n\n\n<p>APPLE PREPPING LARGER IMAC! Finally, the tyranny of this 24-inch piece of crap will be ended!</p>\n\n\n\n<p>Now, re-enter the time machine and set the dial to today.</p>\n\n\n\n<p><em>Yes, it’s a dial.</em> The Macalope made it out of spare parts from washing machine, what else was he gonna use?</p>\n\n\n\n<p>In his review of the new G3 iMac, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://sixcolors.com/post/2023/11/m3-imac-review-keep-playing-the-hits/&amp;xcust=1-1-2128269-1-0-0&amp;sref=https://www.macworld.com/feed\">Jason Snell added</a>:</p>\n\n\n\n<blockquote>\n<p>Apple told me that it has no plans to develop a 27-inch iMac again.</p>\n</blockquote>\n\n\n\n<p><a href=\"https://www.macworld.com/article/2126605/apple-confirms-that-a-27-inch-imac-isnt-in-its-plans.html\"><em>Macworld</em></a> similarly reports:</p>\n\n\n\n<blockquote>\n<p>It appears that the questions about a bigger iMac are so persistent that Apple responded, confirming with Macworld that a 27-inch iMac with Apple silicon is not in the company’s plans.</p>\n</blockquote>\n\n\n\n<p>Clever readers who can distinguish between integers will note that Apple said it was not going to make a “27-inch” iMac again. It said nothing about a 32-inch unit.</p>\n\n\n\n<p>Still, <em>Macworld</em> concludes:</p>\n\n\n\n<blockquote>\n<p>The company clearly does not want customers to wait for a product that is not coming anytime soon.</p>\n</blockquote>\n\n\n\n<p>That seems about right to the Macalope, too. You want a bigger screen? Apple sells ‘em. You just have to pair it with a Mac mini or a Mac Studio.</p>\n\n\n<div><figure><img src=\"https://images.idgesg.net/images/idge/imported/imageapi/2021/12/28/13/macalope-2021-100915055-orig.jpg?quality=50&amp;strip=all&amp;auto=webp&amp;quality=85,70\" alt=\"Macalope\" loading=\"lazy\" /></figure><p>IDG</p></div>\n\n\n\n\n<p>While Mac sales were down considerably last quarter, the lineup actually makes a lot of sense right now (other than the Mac Studio and Mac Pro still running M2 processors instead of M3s, which makes it hard to price compare the 24-inch iMac and a Studio Display/Mac mini bundle).</p>\n\n\n\n<p>What is interesting to this fuzzy observer is how the Mac mini has slid into the position of importance formerly held by the iMac.</p>\n\n\n\n<p>Back in the day when kids used to still say things like “Back in the day…”, the iMac was the consumer machine and the Mac mini was for switchers. You’ve got that keyboard, mouse and monitor you used for your Dell Uninspiron, just get a new CPU. A <em>better</em> CPU. But the Mac mini has evolved into the desktop computer for anyone. Ranging in price from $599 to $4,499, it’s capable of satisfying a wide range of needs. Consumers can get the low end while developers who don’t want to spring for a Mac Studio can get a lot of value out of the top end. And when paired with a monitor not made by Apple, it’s not going to break the bank.</p>\n\n\n\n<p>If the Mac mini is going to be the Mac for the rest of us, it should better reflect that. They say you shouldn’t break what’s working, but the Mac mini’s form factor has been essentially unchanged since 2010, only occasionally sporting another one of Apple’s breathtaking grays. It’s not a product that’s supposed to stand out on a desktop, it’s a personal pan pizza box (seems like Apple maybe missed a step in wooing switchers by not emblazoning “You’ve tried the rest, now try the best” on it). But users might like it to learn a trick from the Mac Studio and take on a couple of front-facing ports.</p>\n\n\n\n<p>Let’s talk about the Touch Bar for a minute. No, don’t get up.</p>\n\n\n\n<p>Despite Apple’s contention that the Touch Bar was its answer to touch-based input on the Mac, it died a quiet death last week without ever making it to desktop Macs. If the company had a long-term plan for it beyond relegating it to the dustbin of technological history, it never clued the rest of us in on what it was.</p>\n\n\n\n<p>Getting back to “How’s <em>That</em> Going?!”, we can definitely draw a red line through the Touch Bar.</p>\n\n\n\n<p>Despite rumors of a 32-inch iMac, Apple seems content with the current Mac lineup. It’s certainly easier to understand than some of the company’s other lineups, but is putting new processors in going to be enough to get people to upgrade? Eventually, yes. But when? Upgrade cycles come in waves and a lot of people are still riding the M1 wave, which gave Macs a huge boost in both computing power and energy efficiency. The continued staying power of Apple silicon may mean that people can hang on to their Macs longer. If that’s the case, the company may need to look to other means to spur more frequent sales.</p>\n\n\n\n<p>Remember those iMacs with an arm? Those were cool.</p>\n\niMac, Mac, Mac Mini, MacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e6ebcc68506120e2ad3c30935aca8f5def76e78ef824fac1f8415f7e8ab65c28","category":"Apple"}