{"title":"Predicting neutralization susceptibility to combination HIV-1 monoclonal broadly neutralizing antibody regimens","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310042","date":1725631200000,"content":"<p>by Brian D. Williamson, Liana Wu, Yunda Huang, Aaron Hudson, Peter B. Gilbert</p>\r\n\r\nCombination monoclonal broadly neutralizing antibodies (bnAbs) are currently being developed for preventing HIV-1 acquisition. Recent work has focused on predicting in vitro neutralization potency of both individual bnAbs and combination regimens against HIV-1 pseudoviruses using Env sequence features. To predict in vitro combination regimen neutralization potency against a given HIV-1 pseudovirus, previous approaches have applied mathematical models to combine individual-bnAb neutralization and have predicted this combined neutralization value; we call this the combine-then-predict (CP) approach. However, prediction performance for some individual bnAbs has exceeded that for the combination, leading to another possibility: combining the individual-bnAb predicted values and using these to predict combination regimen neutralization; we call this the predict-then-combine (PC) approach. We explore both approaches in both simulated data and data from the Los Alamos National Laboratory’s Compile, Neutralize, and Tally NAb Panels repository. The CP approach is superior to the PC approach when the neutralization outcome of interest is binary (e.g., neutralization susceptibility, defined as inhibitory 80% concentration &lt; 1 μg/mL). For continuous outcomes, the CP approach performs nearly as well as the PC approach when the individual-bnAb prediction algorithms have strong performance, and is superior to the PC approach when the individual-bnAb prediction algorithms have poor performance. This knowledge may be used when building prediction models for novel antibody combinations in the absence of in vitro neutralization data for the antibody combination; this, in turn, will aid in the evaluation and down-selection of these antibody combinations into prevention efficacy trials.","author":"Brian D. Williamson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e6ec0175688cf96b973c2702c3ba4a746ca5fc869a9dcc04f55987504114c0ff","category":"Interdisciplinary"}