{"title":"Securing your digital life, the finale: Debunking worthless “security” practices","link":"https://arstechnica.com/?p=1812991","date":1637157629000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/hack-away-security-pills-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/hack-away-security-pills.jpg\">Enlarge</a> <span>/</span> Take one daily to keep Evil Hackerman away! (credit: <a href=\"https://arstechnica.com/author/aurich-lawson/\">Aurich Lawson | Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Information security and privacy suffer from the same phenomenon we see in fighting COVID-19: \"<a href=\"https://arstechnica.com/science/2018/05/i-watched-an-entire-flat-earth-convention-for-my-research-heres-what-i-learned/\">I've done my own research</a>\" syndrome. Many security and privacy practices are things learned second- or third-hand, based on ancient tomes or stuff we've seen on TV—or they are the result of learning the wrong lessons from a personal experience.</p>\n<p>I call these things \"cyber folk medicine.\" And over the past few years, I've found myself trying to undo these habits in friends, family, and random members of the public. Some cyber folkways are harmless or may even provide a small amount of incidental protection. Others give you a false sense of protection while actively weakening your privacy and security. Yet some of these beliefs have become so widespread that they've actually become company policy.</p>\n<p>I brought this question to some friends on InfoSec Twitter: \"<a href=\"https://twitter.com/thepacketrat/status/1459940987795652616\">What's the dumbest security advice you've ever heard</a>?\" Many of the replies were already on my substantial list of mythological countermeasures, but there were others that I had forgotten or not even considered. And apparently, some people (or companies... or even vendors!) have decided these bad ideas are canon.</p></div><p><a href=\"https://arstechnica.com/?p=1812991#p3\">Read 30 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1812991&amp;comments=1\">Comments</a></p>","author":"Sean Gallagher","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e6fb7acedfadd35ccf9f288e8187ef3af83a54df0d4f42257e584338aa28d373","category":"Tech"}