{"title":"Lakeshore areas of conservation interest: Characteristics of nursery areas of the threatened lake‐dwelling grayling, Thymallus thymallus","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.158?af=R","date":1711177200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c6eea629-e3d0-4629-ae72-02e080580094/aff2158-gra-0001-m.png\" alt=\"Lakeshore areas of conservation interest: Characteristics of nursery areas of the threatened lake-dwelling grayling, Thymallus thymallus\" />\n<p>The article details the results of a field-based study on the characteristics of nursery areas of a threatened lake-dwelling population of a fascinating salmonid fish, the grayling. We found that more exposed sites and fine-grained substrates made better nursery areas, while the average depth, bottom shear stress or shoreline orientation did not significantly explain the occurrence of young grayling. The results can be useful for managing and conserving lake-dwelling grayling and important lake habitats.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Research-based knowledge is essential for effective conservation and restoration of threatened aquatic species and habitats. Here, our aim was to gather this knowledge on the lake-dwelling grayling (<i>Thymallus thymallus</i>), typically a riverine fish. Such atypical populations are particularly vulnerable to anthropogenic impacts, including fishing pressure, climate change, eutrophication and waterway construction, some of which affect especially the early life stages. However, there is little information available to guide management and conservation of grayling in lakes. Accordingly, we assessed characteristics of the nursery areas in the threatened grayling population of Lake Puruvesi (eastern Finland). In particular, we used beach seines in two consecutive years to sample lakeshore sites (including islands) that were a priori presumed suitable for grayling. We assessed the occurrence of grayling fry (larvae and post-larvae &lt;40 mm in length) regarding depth, year, the site's exposure (fetch), bottom shear stress, substrate coarseness and shoreline's north–south orientation. Overall, we found grayling fry in low numbers at every fourth site, with the sites’ exposure and dominant substrate coarseness being most relevant variables. In particular, more exposed sites (i.e. with higher fetch values) and fine-grained substrates dominated by sand or gravel had more grayling fry. Average depth, bottom shear stress or shoreline orientation along the north–south axis did not have a significant effect. Together, the results suggest that the most important nursery areas for lake-dwelling grayling are lakeshore zones that are barren and exposed. Hence, the sites share characteristics with those used for reproduction by the more common riverine grayling. We hope that these findings will facilitate lake-dwelling grayling's management and conservation efforts.</p>","author":"Topi K. Lehtonen, \nEsa Hirvonen, \nIrma Kolari, \nJanne Ropponen, \nKristiina Nyholm, \nTapio Keskinen, \nTeppo Vehanen","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"e704046329e7acd05f348665745e5b568cd37cc2a2ed7ebb3db12126f2a62b32","category":"Environment"}