{"title":"จีนเผยแพร่ร่างกำกับดูแลเกมออนไลน์ฉบับใหม่ ต้องการคุมการใช้เงินในเกม อาจกระทบกับ Tencent","link":"https://www.blognone.com/node/137359","date":1703226245000,"content":"<div><div><div><p>สำนักงานสื่อและสิ่งพิมพ์แห่งชาติของจีน (NPPA) ซึ่งมีหน้าที่กำกับดูแลเนื้อหาเกมด้วย เปิดเผยร่างแนวทางกำกับดูแลใหม่ เพื่อควบคุมการใช้จ่ายตลอดจนเนื้อหาในเกม</p>\n<p>ในภาพรวมนั้น NPPA บอกว่าต้องการลดเทคนิคที่ผู้ให้บริการเกมทำเพื่อให้คนจ่ายเงินในเกมมากขึ้น และใช้เวลาในเกมมากขึ้น เช่น ห้ามการให้รางวัลตอบแทนหากมีการล็อกอินเข้ามาในเกมบ่อยขึ้น การห้ามบังคับผู้เล่นเข้าโหมดแข่งขันระหว่างกัน ในร่างยังเสนอแนวทางควบคุมเพิ่มเติม เช่น กำหนดเพดานที่ผู้เล่นจ่ายเงินในเกมได้สูงสุดด้วย ไปจนถึงการระบุว่าบริษัทเกมของจีน ต้องนำเสนอเนื้อหาเกมที่ไม่ขัดต่อกฎหมายของจีน แม้เกมนั้นจะขายในต่างประเทศก็ตาม</p>\n<p>Zeng Xiaofeng รองประธาน Niko Partners บริษัทวิจัยตลาดเกมในจีนและเอเชียตะวันออกเฉียงใต้ มองว่าคำสั่งนี้จะกระทบกับเกมส่วนใหญ่ในจีน ยกเว้นเกมที่ขายขาดไม่มี In-App เพราะกระทบต่อวิธีการทำเงินของเกมเหล่านี้โดยตรง</p>\n<p>ถึงแม้สถานะตอนนี้ยังเป็นร่างกฎหมาย และอยู่ในขั้นตอนเปิดรับฟังความคิดเห็น แต่นักวิเคราะห์ก็มองว่าเป็นการสะท้อนมุมมองที่หน่วยงานของจีนต้องการควบคุมธุรกิจเกมเพิ่มเติม ทำให้ราคาหุ้นของ Tencent บริษัทเกมรายใหญ่ของจีน และ Netease ปรับลดลงมาก หลังมีการเผยแพร่ร่างนี้ออกมา</p>\n<p>ที่มา: <a href=\"https://www.bloomberg.com/news/articles/2023-12-22/china-to-curb-excessive-online-games-spending-in-new-tightening\">Bloomberg</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fdd75775cd6b8348f4db9f4ca5fd8c39.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/tencent\">Tencent</a></div><div><a href=\"/topics/netease\">NetEase</a></div><div><a href=\"/topics/law\">Law</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e7076d7d49253dbe60c1a83151b358fbc4aac00ad6410bdf989e3bdf9cd6408f","category":"Thai"}