{"title":"Incidence of fungal contamination in fresh ginseng samples and mycotoxigenic potential of representative fungal isolates","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13592?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Fresh ginseng is typically accompanied by soil after harvest, leading to contamination with harmful fungi during storage and distribution. In this study, we investigated the incidence of fungal contamination in fresh ginseng (5–6 years old) purchased from 22 different stores in Geumsan, Korea.</p>\n<h2>RESULTS</h2>\n<p>The incidence of fungal contamination in the samples was 67.4–111.5%. <i>Fusarium solani</i> was the most abundant species in the head (38.5%) and fine root (19.3%) parts of the ginseng samples, whereas <i>F. oxysporum</i> was the most abundant in the main root (22.0%) part. We isolated <i>Aspergillus</i>, <i>Fusarium</i> and <i>Penicillium</i> spp. (total number of isolates: 395) from the ginseng samples, and 138 isolates were identified using phylogenetic analysis. Polymerase chain reaction-based screening of 65 mycotoxin-producing species revealed that two <i>P. expansum</i> isolates were positive for citrinin and/or patulin, and five <i>F. oxysporum</i> isolates were positive for fumonisin biosynthesis gene. One <i>P. expansum</i> isolate produced 738.0 mg kg<sup>−1</sup> patulin, and the other produced 10.4 mg kg<sup>−1</sup> citrinin and 12.0 mg kg<sup>−1</sup> patulin on potato dextrose agar (PDA) medium. Among the 47 representative <i>F. oxysporum</i> isolates, 43 (91.5%) produced beauvericin (0.1–15.4 mg kg<sup>−1</sup>) and four of them (8.5%) produced enniatin B and enniatin B<sub>1</sub> (0.1–1.8 mg kg<sup>−1</sup>) as well. However, none of these toxins was detected in fresh ginseng samples.</p>\n<h2>CONCLUSION</h2>\n<p><i>Fusarium solani</i> and <i>F. oxysporum</i> were the most abundant species in fresh ginseng samples. Most <i>F. oxysporum</i> (43) and <i>P. expansum</i> (2) strains isolated from fresh ginseng produced beauvericin and enniatins (B and B<sub>1</sub>), and patulin or citrinin, respectively, on PDA medium. This is the first report of the mycotoxigenic potential of <i>P. expansum</i> and <i>F. oxysporum</i> strains isolated from fresh ginseng. © 2024 Society of Chemical Industry.</p>","author":"Jang Nam Choi, \nSo Soo Kim, \nJi Seon Baek, \nJin Ju Park, \nJung Hye Choi, \nMi Jeong Lee, \nJa Yeong Jang, \nJeom Soon Kim, \nTheresa Lee","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"e7073c5a9f3f3fb830b110e6190ceb48315e2f713d3e272da1493c523c9264fc","category":"Environment"}