{"title":"How to try out the new double tap gesture on your old Apple Watch","link":"https://www.macworld.com/article/2067053/how-to-double-tap-gesture-old-apple-watch.html","date":1694616880000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>You’d be forgiven if you struggled to name anything new about the <a href=\"https://www.macworld.com/article/1472709/apple-watch-series-9-rumors-specs-features-price-release.html\">Apple Watch Series 9</a>. All of the changes (other than the new pink color) are under the hood, with a new S9 SiP, U2 ultra-wide band chip, and brighter display. </p>\n\n\n\n<p>However, the most intriguing new feature is a new double-tap gesture that lets you control some Apple Watch Series 9 commands without touching the display. All you need to do is tap the index finger and thumb of your watch hand together twice to trigger the primary function in an app, such as answering or ending a call, playing and pausing music, or snoozing an alarm. It’s a neat feature that could definitely come in handy (excuse the pun) when your other hand is full. </p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/2065050/iphone-15-pro-apple-watch-series-9-ultra-2-hands-on.html\">When we tried it out at the event</a>, we found the gesture takes a little getting used to, and good news: you can get used to it before your new Apple Watch Series 9 arrives. Apple already has a series of gestures baked into the Apple Watch’s Accessibility settings:</p>\n\n\n\n<ul>\n<li>Pinch (Tap your pointer finger to your thumb): Move to the next item</li>\n\n\n\n<li>Double pinch (Tap your pointer finger to your thumb twice quickly): Move back one item</li>\n\n\n\n<li>Clench (Close your hand into a fist): Tap an item</li>\n\n\n\n<li>Double clench (Close your hand into a fist twice quickly): Bring up the action menu</li>\n</ul>\n\n\n\n<p>The double pinch gesture sounds closest to the double tap gesture on the Apple Watch Series 9. You can test out the gestures by going to the Apple Watch settings on the watch or iPhone app, scrolling down to <em>Accessibility</em>, then <em>AssistiveTouch</em>. Turn on <em>AssistiveTouch</em> and then <em>Hand Gestures</em>, and you’ll be guided through a short tutorial to test out the commands.</p>\n\n\n\n<p>It’s not clear whether Apple will change the Accessibility hand gesture on the new watches or disable the double tap command when AssistiveTouch is enabled, but the new double tap gesture is clearly an extension of the longstanding Accessibility feature.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e708c4607bfe877254da2e2e213f89e4f001f1cf810482b77729578cf4bffdec","category":"Apple"}