{"title":"New Apple AI Model Edits Images Based on Natural Language Input","link":"https://www.macrumors.com/2024/02/07/apple-ai-model-edits-images-natural-language/","date":1707313034000,"content":"Apple researchers have <a href=\"https://arxiv.org/abs/2309.17102\">released</a> a new open-source AI model that is capable of editing images based on a user's natural language instructions (via <a href=\"https://venturebeat.com/ai/apple-releases-mgie-a-revolutionary-ai-model-for-instruction-based-image-editing/\"><em>VentureBeat</em></a>). \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/DALL·E-apple-logo-image-editing-ai.jpg\" width=\"1792\" height=\"1024\" /><div><em>MacRumors image made with DALL·E</em></div>\r<br />\nCalled \"MGIE,\" which stands for MLLM-Guided Image Editing, it uses multimodal large language models (MLLMs) to interpret user requests and perform pixel-level manipulations. \r<br />\n\r<br />\nThe model is capable of editing various aspects of images. Global photo enhancements can include brightness, contrast, or sharpness, or the application of artistic effects like sketching. Local editing can modify the shape, size, color, or texture of specific regions or objects in an image, while Photoshop-style modifications can include cropping, resizing, rotating, and adding filters, or even changing backgrounds and blending images.\r<br />\n\r<br />\nA user input for a photo of a pizza could be to \"make it look more healthy.\" Using common sense reasoning, the model can add vegetable toppings, such as tomatoes and herbs. A global optimization input request might take the form of \"add contrast to simulate more light,\" while a Photoshop-style modification could be made by asking the model to remove people from the background of a photo, shifting the focus of the image to the subject's facial expression. \r<br />\n\r<br />\nApple collaborated with University of California researchers to create MGIE, which was presented in a <a href=\"https://arxiv.org/pdf/2309.17102.pdf\">paper</a> at the International Conference on Learning Representations (ICLR) 2024. The model is available on GitHub, and includes the code, data, and pre-trained models. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/MGIE-apple-AI-model-image-editing.jpg\" width=\"856\" height=\"884\" />\r<br />\nThis is Apple's second breakthrough in AI research in as many months. In late December, Apple revealed that it had made strides in deploying large language models (LLMs) on iPhones and other Apple devices with limited memory by inventing an <a href=\"https://www.macrumors.com/2023/12/21/apple-ai-researchers-run-llms-iphones/\">innovative flash memory utilization technique</a>.\r<br />\n\r<br />\nFor the last several months, Apple has been testing an \"Apple GPT\" rival that could compete with ChatGPT. According to <em>Bloomberg</em>'s Mark Gurman, work on AI is a priority for Apple, with the company designing an \"Ajax\" framework for large language models.\r<br />\n\r<br />\nBoth <em>The Information</em> and analyst Jeff Pu claim that Apple will have some kind of generative AI feature available on the ‌iPhone‌ and iPad <a href=\"https://www.macrumors.com/2023/10/19/apple-generative-ai-late-2024-jeff-pu/\">around late 2024</a>, which is when iOS 18 will be coming out. iOS 18 is said to include an <a href=\"https://www.macrumors.com/2023/09/06/ios-18-siri-improvements/\">enhanced version of Siri</a> with ChatGPT-like generative AI functionality, and has the potential to be the \"biggest\" software update in the iPhone's history, <a href=\"https://www.macrumors.com/2024/02/06/ios-18-biggest-update-rumor/\">according to Gurman</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-gpt/\">Apple GPT</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/07/apple-ai-model-edits-images-natural-language/\">New Apple AI Model Edits Images Based on Natural Language Input</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/new-apple-ai-model-edits-images-based-on-natural-language-input.2418775/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e70be0168aa4aee770dd27848c1adc94cff53c460059eb0dfef719cc4efc6c83","category":"Apple"}