{"title":"Rice Growth and Leaf Physiology in Response to Four Levels of Continuous Drought Stress in Southern China","link":"https://www.preprints.org/manuscript/202406.1628/v1","date":1719211464000,"content":"Exploring the growth and physiological response mechanisms of rice under continuous drought stress circumstances can provide a significant scientific foundation and technological assistance for meeting drought difficulties, improving drought resistance and rice (Oryza sativa L.) output, and ensuring food security. In this study, a rice field experiment was conducted under a rain shelter with five different treatments set up: P1 (drought stress from tillering stage), P2 (drought stress from jointing-booting stage), P3 (drought stress from heading-flowering stage), P4 (drought stress from grain filling stage), and CK (adequate water management throughout the growth stage). Continuous drought stress from different growth stages with four levels (mild, medium, serious, and extreme). The results showed that the effects of different drought stress treatments on rice growth varied significantly. Compared with the CK treatment, plant height was reduced by 12.10%, 8.14%, 3.83%, and 1.06% in the P1, P2, P3, and P4 treatments, respectively; and the number of tillers was reduced by 23.83%, 18.91%, 13.47%, and 8.68%, respectively. With the increase in drought stress levels, SPAD values and Rubisco activity of rice leaf continued to decrease; SOD activity showed a decreasing trend, but the decreasing trend of POD and CAT activities was not significant, while MDA content showed an increasing trend. For yield components, continuous drought stress significantly reduced spike length, effective number of spikes, thousand grain weight, grain number per spike, and fruiting rate of rice compared to CK treatments during the growth period. In general, continuous drought stress during the early growth period affected the effective spike number and the grain number per spike. Continuous drought stress after the grain filling stage had the least effect on yield and water use efficiency was much higher than other treatments. The results of these studies reveal the response of rice growth and physiology to continuous drought stress, which is important for agricultural practices.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e70c0669d663852e1c183a501cbd605dd57d97f13ed7e467384225bfb9fab674","category":"Interdisciplinary"}