{"title":"How To Use a Cycling Power Meter With a Garmin Vivoactive or Venu Watch","link":"https://www.dcrainmaker.com/2021/05/how-to-use-a-cycling-power-meter-with-a-vivoactive-or-venu-watch.html","date":1620725658000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4674.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4674_thumb.jpg\" /></a></p>\n<p>Officially, power meters are not supported on Garmin’s Venu &amp; Vivoactive watch series. That’s because (in Garmin’s eyes) the target market for those watches is a more mainstream consumer that doesn’t have <a href=\"https://www.dcrainmaker.com/2021/03/garmin-rally-power-meter-review-spd-spd-sl-look-keo.html\">$1,100 cycling power meters on the bikes</a> in their garage (or $<a href=\"https://www.dcrainmaker.com/2020/01/stages-further-lowers-power-meter-pricing-to-299.html\">299 power meters</a>). Essentially, it’s the same target market as an Apple Watch or a high-end Fitbit. In fact, in a recent discussion with Garmin about the <a href=\"https://www.dcrainmaker.com/2021/04/garmin-venu2-venu2s-smartwatch-review.html\">Venu 2 that just launched</a>, they noted the most popular timed activity recorded on a Venu series was a walk.</p>\n<p>No matter the case or reasoning, that doesn’t keep people from wanting more power. Or, some power at all. So, here’s how you can record power meter data on your Venu or Vivoactive series watch. In fact, <strong>this actually works on any Garmin watch that supports Connect IQ Data Fields</strong> (so, that would include something like a Forerunner 230/235 series).</p>\n<p>To be clear upfront, while this solution does very much work and thousands of people have used it – it’s not perfect. The main limitation is that not all 3rd party platforms properly see the power meter data afterwards. For example, TrainingPeaks does, but Strava doesn’t. Garmin shows it themselves, but it isn’t used for things like wattage personal records or such. But hey, even the <a href=\"https://www.dcrainmaker.com/analyzer\">DCR Analyzer shows it</a>. But we’ll get into all that later and you can decide whether that matters to you or not.</p>\n<p><strong>Setup Difficulty:</strong> Easy<br />\n<strong>Setup Time:</strong> 3-5 mins (one-time)<br />\n<strong>Requirements:</strong> Your watch, plus either phone or computer</p>\n<p>With that, let’s knock this out</p>\n<h3><span>Getting it Installed:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-34.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-34.png\" /></a></p>\n<p>The first thing you need is a compatible device. I’m not going to list the dozens upon dozens of devices here (<a href=\"https://apps.garmin.com/us-EN/apps/70f1aea3-f1d3-47f6-b7aa-23f029a75e3b#compatible-devices\">they’re all listed here</a>), but essentially, if you’ve got anything halfway new that’s not a Garmin Instinct, you’re good to go. Note that if you have a watch that’s capable of recording power (like a Forerunner 745/945/etc…), there’s almost zero reason to use this data field. The only reason you would use it is if you wanted to record a *SECOND* power meter concurrently.</p>\n<p>Here’s the link <a href=\"https://apps.garmin.com/us-EN/apps/70f1aea3-f1d3-47f6-b7aa-23f029a75e3b#0\">to the app on the Garmin Connect IQ App Store</a>, it’s called simply enough “ANT+ Power Meter”, by Takura87. More interestingly, it’s actually one of only a handful of apps to go through the ANT+ device profile certification process, with ANT+ themselves. Meaning, it complies with all power meter communication specifications.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-35.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-35.png\" /></a></p>\n<p>Tap to download it, or, if on mobile it’ll swing you over to the <a href=\"https://apps.garmin.com/us-EN/apps/70f1aea3-f1d3-47f6-b7aa-23f029a75e3b#0\">Garmin Connect IQ app to install it</a> (via phone or desktop computer). Quick and easy, shown here via desktop:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-36.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-36.png\" /></a></p>\n<p>It’ll then tell you that it’ll send the app to your watch the next time it syncs. If you’ve got Garmin Express on your desktop computer, then you can hurry things up by connecting the watch physically. Or, you can force a sync with your smartphone. Or, you could just wait and it’ll settle out. Your call.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-37.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-37.png\" /></a></p>\n<p>And at this point, you’re done with getting it installed on your watch. But you’ll still need to configure your data fields to include it, otherwise it won’t record the data. In the next section I cover that, as well as my recommended configuration.</p>\n<p><em>(Side note: I’ve actually used a variant of this app for years in some of my testing, including one version that allowed you to record multiple power meters. These days, you can do that instead with secondary named </em><a href=\"https://apps.garmin.com/en-US/developer/478692d9-e08c-40c2-bc49-f80e2b4c6eca/apps\"><em>versions of the app running as Connect IQ data fields</em></a><em>. This allows you to record multiple power meters to the .FIT file.)</em></p>\n<h3><span>Using it:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4663.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4663_thumb.jpg\" /></a></p>\n<p>Now at this point, if you’ve only got one power meter (remember, a smart trainer also broadcasts as a power meter), then you can open the app up and it’ll just search for the nearest ANT+ power meter and pair to it.</p>\n<p>But in my case, I’ve got…umm…a lot of power meters and trainers. And in fact, even if you only have one, I’d put the ANT+ ID in, because the app will technically scan each time – so if you go for rides with a friend, or a partner has a bike/trainer nearby, it might accidentally pick up that one. Versus having it manually set, it’ll use that each time. But again, your call, it’s easy.</p>\n<p>There’s two ways you access this – on your smartphone with the Garmin Connect Mobile app, or desktop computer with Garmin Express. For the heck of it, I’ll choose desktop computer with Garmin Express. Open up your watch, and then tap apps, and scroll all the way down in your app list to “ANT+ Power Meter”, then hit the little “…” next to it:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-38.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-38.png\" /></a></p>\n<p>Next, we’re gonna fill in a single field with your ANT+ ID. You can find your ANT+ in a variety of locations, most notably simply on the side of most power meters. It’s a 4-5 digit number in most (it can technically be 1-6 digits, but it’s almost always 4-5 digits). For example, on a Quarq power meter, it’s etched near the battery cap area, on Garmin Vector pedals it’s on the left pedal near the crank arm. On a smart trainer it’s often not written on it, but you’ll find it in any apps you have, such as Zwift or such, or the company’s own app will display it.</p>\n<p>Then, go ahead and tap two of these three things to on:</p>\n<p>A) Set Replace Power = On<br />\nB) Set Replace Cadence = On<br />\nC) Set Pause Search = Off</p>\n<p>I’ll explain all three of these after the screenshot.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-39.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-39.png\" /></a></p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-40.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-40.png\" /></a></p>\n<p>So setting the ANT+ ensures it only connects to your power meter or trainer, and not to a BFF’s or such.</p>\n<p>The<strong> Replace Power</strong> and <strong>Replace Cadence</strong> options are <strong>important</strong>, because <strong>they tell apps like TrainingPeaks that this is legit power and cadence data</strong>, and not just some random app recording an unknown data parameter (like ‘<a href=\"https://apps.garmin.com/en-US/apps/75b350a9-c467-4a7e-bdf7-7a5f358e6842\">Beers Consumed</a>’ or something).</p>\n<p>Finally, the <strong>Pause Search option is interesting</strong>, because it tells the app to keep looking after the two-minute search period, even if it can’t find your power meter. This is useful if you stop somewhere or if your power meter simply isn’t on yet. Note though, that this will increase battery burn slightly during use, so keep that in mind.</p>\n<p>With that, click ‘Save’ and call it done!</p>\n<p>But wait, we need to simply add this to our bike profile, like any other data field. Go into your data field settings and add it to a data page of your choosing. If you’ve never customized anything in here before, then Data Page 3 is likely not used/enabled, so you can add it there and remember to toggle it to enabled.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vivoactivepowermetersettings.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vivoactivepowermetersettings_thumb.jpg\" /></a></p>\n<p>And then go into the data fields, and look for the category called ‘ConnectIQ Fields’:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4641.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4641_thumb.jpg\" /></a></p>\n<p>And then inside that you’ll find the power meter field:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4642.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4642_thumb.jpg\" /></a></p>\n<p>Also – as a reminder, if you’re riding both inside and outside, those are technically two different sport profiles with two different data field sets. So remember to add it to a data page there too.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4644.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4644_thumb.jpg\" /></a></p>\n<p>With that, we’re ready to rumble. Now, let’s ride! After your power meter wakes up, you’ll see it’ll send data over to the Connect IQ Data Field, showing your power numbers. It’s really as simple as that. On the upper right corner you’ll see the ANT+ ID that you’ve entered, along with your current power/wattage. To the right of the power, you’ll see your cadence.</p>\n<p>In the below example the values are:</p>\n<p>54715: My power meter ANT+ ID<br />\n142: My current watts/power<br />\n73: My current cadence<br />\n92: My current heart rate</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vivoactivepowermeter.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vivoactivepowermeter_thumb.jpg\" /></a></p>\n<p>You can see how in this case I’m on an indoor stationary bike paired to a pair of power meter pedals, that are also concurrently broadcasting to Zwift on an iPad via Bluetooth Smart. Two for the price of one!</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/vivoactivepowermeterzwiftpower.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/vivoactivepowermeterzwiftpower_thumb.jpg\" /></a></p>\n<p>Now, keep pedaling until you’re done suffering, and then save as normal. There’s literally nothing else to do here, it’s quietly collecting all of your power meter data behind the scenes for your ride.</p>\n<h3><span>Afterwards Data:</span></h3>\n<p>So, with our ride complete, what kind of data do we have? Well, first off, we won’t see any power summary data on the Vivoactive/Venu watch itself. This is because, frankly, the Vivoactive/Venu series barely tells you anything as it is post-workout, let alone power. Instead, you’ll need to crack open your favorite (or not-favorite) apps to get started. Starting with the basics, you’ll see power and cadence listed as a graph within the list of charts:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-41.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-41.png\" /></a></p>\n<p>You’ll notice these have the little ‘IQ’ icon/logo after them. This means the data came from a Connect IQ App, versus natively recorded by the Garmin, as the heart rate (which was using the optical HR sensor) doesn’t have that icon. But in terms of the data in those charts, you can use it just the same.</p>\n<p>What you won’t notice here is a summary field down below with your power. On a ‘normal’ Garmin device that’s natively capable of recording power, you’d see things like average or max power in this section. You’ll notice off to the side it’ll show the Connect IQ app listed though:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-42.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-42.png\" /></a></p>\n<p>The data is similar on Garmin Connect Mobile. You’ll notice the “ANT+ Power Meter” app listed on the first page of the activity summary. If you’re missing that post-ride, that means you didn’t add it to your data fields for that profile. In the main summary screen though, you won’t see power summary like you would on a ‘normal’ Garmin power meter compatible device. But, you can see the power and charts shown on the graphs page below:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/GCM1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/GCM1_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/GCM2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/GCM2_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/05/GCM3.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/GCM3_thumb.png\" /></a></p>\n<p>For many users, this is perfectly fine. But, just to be clear, there are other <strong>Garmin-specific caveats</strong> here for not having it natively recorded, they include:</p>\n<p><strong>– No power/wattage personal records or achievements:</strong> You won’t get notified of your ‘Top 20-minute power’ or anything akin to that, since this isn’t recognized as power within Garmin’s realm.</p>\n<p><strong>– Any power-based reports or dependent feature won’t show-up either:</strong> This includes things like FTP calculation, since the Vivoactive/Venu doesn’t support power, and it’s not reporting it as true power, no go here.</p>\n<p><strong>– No training load/recovery support</strong>: In the incredibly quirky scenario where you have a newer Garmin Edge device but for some odd reason don’t want to record with that – it won’t contribute power data to that. I can’t honestly think of any logical scenario that you’d not record on the device that does power, but hey, just being clear. Reminder: The Garmin Vivoactive/Venu series doesn’t support training load anyway, so this is purely for *OTHER* Garmin watches/devices (which already support power meters).</p>\n<p>Ok, so next, let’s look at other apps. First up, TrainingPeaks. Here’s that workout over there:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-43.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-43.png\" /></a></p>\n<p>Then there’s Strava. Simply put, no, Strava won’t recognize this power. They could if they wanted to, but they don’t re-map a declared power value atop Garmin’s native fields from Connect IQ.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-44.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-44.png\" /></a></p>\n<p>Today’s Plan. No, this doesn’t seem to work, at least not at first glance. Today’s Plan typically has the most robust underlying data support of all the platforms, so it wouldn’t surprise me if there’s some trick to getting the .FIT Developer fields to enumerate and I’m just missing it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-45.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-45.png\" /></a></p>\n<p><a href=\"https://www.dcrainmaker.com/analyzer\">DCR Analyzer</a>. Of course it works. We support all .FIT Developer fields (even ‘Beers Consumed’), so you can easily see it there. You’ll see both the cadence data (in purple) and the power data (in teal).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-46.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-46.png\" /></a></p>\n<p>And here’s a comparison <a href=\"https://analyze.dcrainmaker.com/#/public/c529e64c-e78c-456e-455e-f16ff9b7f9a6\">showing the data plotted again</a> in the DCR Analyzer comparing a PowerTap P1 to Peloton Bike (non-Plus), showing the typical inaccuracy there.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-47.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-47.png\" /></a></p>\n<p>In fact, just last week we quietly rolled out an update to the DCR Analyzer that now lets you compare *ANY* data fields under the ‘Developer Fields’ chart. Geeky, I know, but this means you can compare a drop in cadence to why a power meter drops out. Or such. Not really related here, but interesting nonetheless.</p>\n<p>If you want to try out a test file yourself on the platform of your choice, you can download my <a href=\"https://www.dropbox.com/s/xdt4pxi6quw71qs/Vivoactive4-WithCIQ-PowerData-6669636553_ACTIVITY.fit?dl=0\">Vivoactive 4 .FIT file here with power data</a> and upload it to your account/platform to see if it supports it or not.</p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_4655.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_4655_thumb.jpg\" /></a></p>\n<p>And with that – you’ve now converted your Vivoactive 4, or Venu, or Venu 2, or Forerunner 245, or whatever watch is power meter capable. Simple as that.</p>\n<p>Now, whether or not that makes sense for most people is an entirely different question. If you’re a daily power meter user, then honestly this probably doesn’t make a ton of sense compared to having a device that fully supports power natively. But if you need or use power sparingly, then this would probably fit the bill quite nicely. For example say your gym or hotel has indoor bikes that broadcast power out via ANT+, and you simply want to record that while travelling – this is perfect.</p>\n<p>Still, it’s the perfect example of where Connect IQ can fill in the gaps of the platform, and expand upon it too. For example, this can also be used to record multiple power meters. Such as for regular power meter users that want to occasionally record and compare their trainers and power meters without having to purchase multiple units or run a slew of different apps on tablets or phones concurrently. This takes all the data and pulls it into a single cohesive file. Handy!</p>\n<p>With that – thanks for reading!</p><div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase. These posts generally take a lot of time to put together, so if you're shopping for the Garmin Vivoactive 3, Garmin Vivoactive 4 or Garmin Venu 2 or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n\r\n\r\n\r\n<div>\n<div><div><h4><a href=\"https://www.dcrainmaker.com/2017/10/garmin-vivoactive-3-in-depth-review.html\" target=\"_blank\">Garmin Vivoactive 3</a></h4><div><a href=\"https://www.amazon.com/Smartwatch-Vivoactive-Waterproof-Glonass-Stainless/dp/B0751GBCKN?dchild=1&amp;keywords=Garmin+Vivoactive+3&amp;qid=1620726011&amp;sr=8-6&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=a0a411ae1ef92c9df2ff3dbb059488e2&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2017/10/Garmin-Vivoactive-3-transparent-e1606334365128-106x125.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Smartwatch-Vivoactive-Waterproof-Glonass-Stainless/dp/B0751GBCKN?dchild=1&amp;keywords=Garmin+Vivoactive+3&amp;qid=1620726011&amp;sr=8-6&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=a0a411ae1ef92c9df2ff3dbb059488e2&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$130</span></a> </div></div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/09/garmins-vivoactive-4-series-everything-you-need-to-know.html\" target=\"_blank\">Garmin Vivoactive 4</a></h4><div><a href=\"https://www.amazon.com/Garmin-v%C3%ADvoactive-Smartwatch-Features-Monitoring/dp/B07W7W8WBH/ref=as_li_ss_tl?ac_md=0-0-Z2FybWluIHZpdm9hY3RpdmUgNA==-ac_d_rm&amp;keywords=Garmin+Vivoactive+4&amp;pd_rd_i=B07W7W8WBH&amp;pd_rd_r=1746fada-46e9-4a90-b5e1-3344e5b9530f&amp;pd_rd_w=pot3x&amp;pd_rd_wg=Bz9kK&amp;pf_rd_p=39892eb5-25ed-41d8-aff1-b659c9b73760&amp;pf_rd_r=02ZRSV7K88SVHS0CYVPS&amp;psc=1&amp;qid=1573680891&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=a40d1871a9d8162a5296689415184f9b&amp;language=en_US\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2019/11/Garmin-Vivoactive-4-Transparent-125x92.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-v%C3%ADvoactive-Smartwatch-Features-Monitoring/dp/B07W7W8WBH/ref=as_li_ss_tl?ac_md=0-0-Z2FybWluIHZpdm9hY3RpdmUgNA==-ac_d_rm&amp;keywords=Garmin+Vivoactive+4&amp;pd_rd_i=B07W7W8WBH&amp;pd_rd_r=1746fada-46e9-4a90-b5e1-3344e5b9530f&amp;pd_rd_w=pot3x&amp;pd_rd_wg=Bz9kK&amp;pf_rd_p=39892eb5-25ed-41d8-aff1-b659c9b73760&amp;pf_rd_r=02ZRSV7K88SVHS0CYVPS&amp;psc=1&amp;qid=1573680891&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=a40d1871a9d8162a5296689415184f9b&amp;language=en_US\"><span>Amazon</span> <span>$268</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2Fgarmin-vivoactive-4s-heart-rate-monitor\"><span>Backcountry</span> <span>$350</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2Fgarmin-vivoactive-4s-heart-rate-monitor\"><span>Competitive Cyclist</span> <span>$350</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F169352%2Fgarmin-vivoactive-4-gps-smartwatch\"><span>REI</span> <span>$300</span></a> </div></div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/09/garmin-venu-with-amoled-display-everything-you-ever-wanted-to-know.html\" target=\"_blank\">Garmin Venu 2</a></h4><div><a href=\"https://www.amazon.com/Garmin-Smartwatch-Advanced-Monitoring-010-02430-01/dp/B0911XHHCN?dchild=1&amp;keywords=010-02430-01&amp;qid=1619110116&amp;sr=8-1&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=476b4467b79001df40225ac120928b60&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2021/04/Garmin-Venu-2-Transparent-1-116x125.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Smartwatch-Advanced-Monitoring-010-02430-01/dp/B0911XHHCN?dchild=1&amp;keywords=010-02430-01&amp;qid=1619110116&amp;sr=8-1&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=476b4467b79001df40225ac120928b60&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span></span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F199417%2Fgarmin-venu-2\"><span>REI</span> <span>$400</span></a> </div></div></div>\n\r\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p></div>\n<p></p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"e70e3ac30c7b7e46701538b9d651f018583f3b09db4f9ba6dbd1c02b9ba1ff81","category":"Cycling"}