{"title":"The effect of three types of heat treatment on the hardness and corrosion resistance of Al 2014 alloy","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400134?af=R","date":1723612526000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/e6a0708a-9913-4bb9-a0a1-d0288d9f7772/appl202400134-gra-0001-m.png\" alt=\"The effect of three types of heat treatment on the hardness and corrosion resistance of Al 2014 alloy\" /><p>Hardness enhancement. T6 Standard Aging: Achieved the highest hardness due to optimal Al2Cu precipitate distribution. —RRA Treatment: Significant hardness improvement over untreated alloy; retrogression dissolves and re-aging reforms precipitates. Modified RRA: Lowest hardness due to overaging and coarse precipitate formation. Corrosion resistance. T6 Treatment: Superior corrosion resistance with the lowest corrosion current density and minimal pitting. RRA -treatment: Improved resistance compared to untreated alloy but with slightly deeper pits. Modified RRA: Poor corrosion resistance with significant pitting and cracking. Microstructural stability. T6 and RRA treatments: Promote robust passive film formation, enhancing surface protection and stability. SEM &amp; EDS analysis: Confirm reduced pitting and cracking in T6 and RRA samples; localized copper and magnesium depletion in untreated and overaged samples indicating severe pitting.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Al 2014 is a high-strength aluminum alloy widely used in the aerospace and automotive industries for its mechanical strength. This research examines the effects of three heat treatment processes—retrogression and re-aging (RRA), T6 standard aging, and a modified RRA with high-temperature pre-aging—on the hardness and corrosion resistance of Al 2014. Polarization studies using potentiodynamic electrochemical methods in a 3.5 wt% sodium chloride solution were conducted to evaluate the corrosion resistance. The results showed that heat treatment, which causes precipitation hardening, shifted the corrosion potential (<i>E</i>) toward a more noble direction. The formation of Al<sub>2</sub>Cu precipitates is associated with improved corrosion resistance. Additionally, samples treated with the T6 process exhibited a higher corrosion current density compared to untreated Al 2014 alloy samples, indicating superior corrosion resistance. Analysis of corroded surfaces using scanning electron microscopy (SEM) with energy-dispersive X-ray spectroscopy (EDS) showed evidence of general and pitting corrosion, with distinct patterns among the three heat treatment processes. A comparison of the results revealed that the T6 standard aging process provided the best combination of hardness and corrosion resistance. This was likely due to the formation of stable precipitates during aging. The results also indicated that the RRA process showed good performance, suggesting it is a viable alternative when a balance between hardness and toughness is required. The modified RRA with high-temperature pre-aging resulted in lower performance, likely due to overaging, which reduced hardness and corrosion resistance. These findings highlight the significance of heat treatment in improving the corrosion resistance of Al 2014 alloy. This suggests that particular processes can enhance the alloy's durability in corrosive environments, potentially leading to a longer lifespan and reduced maintenance costs. The T6 standard aging process offers the best balance of enhanced hardness and corrosion resistance for Al 2014 alloy, making it ideal for extending lifespan and reducing maintenance costs in corrosive environments. Careful selection of heat treatment is crucial based on specific alloy performance requirements.</p>","author":"Ansari Shadab Azhar Nazeer Iqbal, \nM Abdur Rahman, \nHussain H. Naveed","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"e717f3a9d5ae3cda2c02214ba10b80c7b7509cc5e53d00ea559b2e307ae8abb3","category":"Environment"}