{"title":"Fetal abdominal obesity in women with one value abnormality on diagnostic test for gestational diabetes mellitus","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304875","date":1717509600000,"content":"<p>by Wonjin Kim, Soo Kyung Park, Yoo Lee Kim</p>\r\n\r\nPrevious studies have shown that fetal abdominal obesity (FAO) was already observed at the time of gestational diabetes mellitus (GDM) diagnosis and persisted until delivery despite management in older and/or obese women. In this study, we investigated whether fetuses of women with milder hyperglycemia than GDM have accelerated abdominal growth, leading to adverse pregnancy outcomes. We retrospectively reviewed the medical records of 7,569 singleton pregnant women who were universally screened using a 50-g glucose challenge test (GCT) and underwent a 3-h 100-g oral glucose tolerance test (OGTT) if GCT result was ≥140mg/dL. GDM, one value abnormality (OVA), and normal glucose tolerance (NGT, NGT1: GCT negative, NGT2: GCT positive &amp; OGTT negative) were diagnosed using Carpenter-Coustan criteria. With fetal biometry data measured simultaneously with 50-g GCT, relative fetal abdominal overgrowth was investigated by assessing the fetal abdominal overgrowth ratios (FAORs) of the ultrasonographically estimated gestational age (GA) of abdominal circumference(AC) per actual GA by the last menstruation period(LMP), biparietal diameter(BPD) or femur length(FL), respectively. FAO was defined as FAOR ≥90th percentile The FAORs of GA-AC/GA-LMP and GA-AC/GA-BPD were significantly higher in OVA subjects compared to NGT subjects but not in NGT2 subjects. Although the frequency of FAO in OVA (12.1%) was between that of NGT (9.6%) and GDM (18.3%) without statistically significant difference, the prevalence of large for gestational age at birth and primary cesarean delivery rates were significantly higher in OVA (9.8% and 29.7%) than in NGT (5.1% and 21.5%, p&lt;0.05). Particularly, among OVA subjects with FAO, the prevalence (33.3% and 66.7%) was significantly higher than in those without FAO (9.7% and 24.2%, p&lt;0.05). The degree of fetal abdominal growth acceleration in OVA subjects was intermediate between that of NGT and GDM subjects. OVA subjects with FAO at the time of GDM diagnosis were strongly associated with adverse pregnancy outcomes.","author":"Wonjin Kim","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e71870c9ba73b86e1c53da558b2e84c5b2af2984d428a3cd5602eb70932d7e7f","category":"Interdisciplinary"}