{"title":"“Agricomb” is the perfect tool for measuring gases from cow burps","link":"https://arstechnica.com/?p=1753395","date":1620211519000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/agriccombTOP-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/agriccombTOP.jpg\">Enlarge</a> <span>/</span> It's a myth that cows fart methane; they actually burp out the greenhouse gas. Agriculture now has a new tool for measuring that methane, which could help design cleaner and more productive farms. (credit: <a href=\"https://www.gettyimages.com/\">BerndBrueggemann/iStock/Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p><a href=\"https://www.nist.gov/topics/physics/optical-frequency-combs\">Optical frequency combs</a> are essentially high-tech \"rulers\" for measuring different colors of light; they're useful for making <a href=\"https://www.nist.gov/news-events/news/2014/07/comb-chip-powers-new-nistcaltech-atomic-clock-design\">better atomic clocks</a> and hunting for exoplanets, among other things. Now scientists at the National Institute of Standards and Technology (NIST), collaborating with researchers at Kansas State University (KSU), have introduced the \"agricomb,\" an optical frequency comb that measures the gassy emissions from cow burps—the first use of frequency combs in an agricultural setting. The tool could one day help boost agricultural yields and enable the design of cleaner farms, according to <a href=\"https://advances.sciencemag.org/content/7/14/eabe9765\">a recent paper</a> published in the journal Science Advances.</p>\n<p>According to the authors, the so-called \"digestive processes\" of livestock account for the largest US source of methane and ammonia emissions. (The former is a major greenhouse gas, while ammonia is an atmospheric pollutant.) A single cow belches about 220 pounds of methane every year.</p>\n<p>That's one reason why there are calls in some quarters to drastically cut down on consumption of beef. However, some scientists—notably <a href=\"https://theconversation.com/yes-eating-meat-affects-the-environment-but-cows-are-not-killing-the-climate-94968\">Frank M. Mitloehner of the University of California, Davis</a>—have pointed out that cows and other ruminants nonetheless currently account for just 4 percent of all greenhouse gases produced in the US, thanks to better breeding, genetics, and nutrition, among other advances.</p></div><p><a href=\"https://arstechnica.com/?p=1753395#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1753395&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e7252f78263fd79e128690fffaf9b2b3e3d5d2d1bafbbe7d1bae4d285737b11b","category":"Tech"}