{"title":"In a breakthrough 2021 season, Neilson Powless is coming into his own","link":"https://cyclingtips.com/2021/10/in-a-breakthrough-2021-season-neilson-powless-is-coming-into-his-own/","date":1633728980000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/powless_1a-650x433.jpg\" /></div><h2>In a breakthrough 2021 season, Neilson Powless is coming into his own</h2><p>\n</p><p>As Neilson Powless (EF Education-Nippo) rolls up to the start line in Como, Italy, on Saturday for Il Lombardia, he’ll be taking on the final WorldTour race of a season that has seen him achieve the biggest results of his young career.</p>\n\n\n\n<p>Two of those results stand out among the strongest one-day results by an American pro in a decade or more. In August, Powless stormed to <a href=\"https://cyclingtips.com/2021/07/neilson-powless-wins-the-clasica-san-sebastian/\" target=\"_blank\">victory at the Clásica San Sebastián</a>, the first men’s WorldTour one-day win for an American pro since Tyler Farrar’s win at the Vattenfall Cyclassics in 2010. Then, in September, he finished fifth in the elite men’s road race at <a href=\"https://cyclingtips.com/2021/09/julian-alaphilippe-successfully-defends-his-rainbow-jersey/\" target=\"_blank\">Flanders Worlds</a>, the best result for an American in that race since Chann McRae’s fifth-place finish at Worlds back in 1999.</p>\n\n\n\n<p>In short, things have really been coming together Powless recently. He attributes his success to a variety of factors coming together: A few crucial periods of relaxation and some targeted training have helped, and he’s gotten a matrimonial boost too.</p>\n\n\n\n<p>“It’s definitely a combination of a lot of things. I got married last November. Taking five weeks off last November I think really helped set me up to train with a lot more energy than I have in the past,” he told CyclingTips by phone ahead of Il Lombardia.</p>\n\n\n\n<p>“That set me up for a decent UAE Tour. When I got back to training, I wanted to train so hard and maybe a little bit too hard for winter training, but it helped set me up for UAE and that was a really nice result. I think it came back to bite me a few weeks later in Paris-Nice but in the end I was super happy with the ride in UAE. My wife has been amazing this past year just supporting me and always encouraging me and being there for me and also just having somebody to have these experiences with I think helps me to get a lot more out of them and just enjoy the time off and also the racing and training a bit more.”</p>\n\n\n\n<p>Powless said over the past offseason, he focused on “longer threshold time trial type efforts” with his focus on his stage racing start at the UAE Tour. After a strong ride there to take fifth overall, his best ever result in a WorldTour stage race, he got sick in March. That did not help with his ensuing race goals, and the Tour de France didn’t go as well as he’d hoped either.</p>\n\n\n\n<p>Then, however, Powless took a brief “vacation” – bringing his bike along, of course – that he says helped immensely as he refocused his training.</p>\n\n\n\n<p>“After the Tour I basically just told myself I wanted to have fun with training, so I did a lot of really explosive efforts on three-minute to six-minute hills,” he said. “I would just try to set my fastest time up those hills. And I started setting records and enjoying it. I took a short a vacation – well, I can’t really call it a vacation because I took my bike – but I went to Greece with my wife and some of her relatives for week just after the Tour and I brought my bike out there. There was like one mountain on this island and I would just go and ride around the mountain and take stabs at the Strava KOMs on all the little hills. It really helped me to I guess sharpen up. After the Tour I didn’t need to train a lot but I felt like I needed some of that intensity because that’s what I was lacking in the Tour. Super explosive stuff.</p>\n\n\n\n<p>“I knew the engine was there. I told myself, ‘Go have fun. Wake up, go have breakfast, go hang out by the beach and go swimming, and then in the afternoon before dinner go out for two, two and a half hours, cruise along and when whenever you see a hill ride as fast as you can up to the top.’ I don’t know what exactly went on physiologically but I think it helped set me up perfectly for San Sebastian and it helped get my mind right too. I cam back from Greece three days before San Sebastián so it was a pretty quick turnaround. It was awesome.”</p>\n\n\n\n<p>Powless’s San Sebastián win was EF’s first WorldTour one-day victory since Sep Vanmarcke won the Bretagne Classic in 2019. Powless followed that up with a strong ride at the Coppa Sabatini, finishing sixth with his teammate Michael Valgren taking then win, and then he rode the a top five at Worlds. Along the way, his plans and his role are evolving as his sport directors are starting to work him into their gameplans as a more prominently featured rider in the one-day and one-week events.</p>\n\n\n\n<p>“It’s kind of cool to be in that position and it can definitely add a bit more pressure sometimes, but it’s also super humbling when the directors are really confident that I can follow up the support that the team can give me,” Powless said. “I’m hoping to build on that, especially tomorrow and also going into next year. I really hope that I can be a rider that’s reliable to racing at the front, not just a few times a year but to be consistently there.”</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/powless_worlds-1340x849.jpg\" /><figcaption>Neilson Powless en route to fifth place in the elite men’s race at Flanders Worlds.</figcaption></figure>\n\n\n\n<p>Powless’s impressive 2021 campaign comes five years after he burst onto the scene as an under-23 rider, taking ninth overall and the young rider’s jersey at the Tour of California and win a stage at the Tour de l’Avenir, among other promising results. He spent that season and the next one with Axeon Hagens Berman before making the big jump up to the WorldTour level with the team now known as Jumbo-Visma. After two years there, he signed with EF, telling CyclingTips at the end of 2019 that the training protocols that he had followed with the Dutch WorldTour outfit <a href=\"https://cyclingtips.com/2019/12/the-jumbo-visma-development-system-works-for-many-but-not-for-all/\">just hadn’t worked as well as hoped</a>.</p>\n\n\n\n<p>After four years on the WorldTour, his progression from promising prospect to a experienced top-division pro has not been a linear one, but he has progressed nonetheless. He can see the ways in which he did develop during his time with the Jumbo-Visma organization, while also acknowledging that he has taken major strides in the numbers department since the change of scenery.</p>\n\n\n\n<p>“When I first came into the WorldTour, it didn’t feel like I made many improvements, at least improvements that you could really see on paper,” he said. “I think in my first two years at Jumbo I was making some really big steps forward in terms of my endurance and durability and recovery but in terms of raw numbers, it was hard for me because I wasn’t really sure why I wasn’t seeing a lot of improvements in just the pure strength efforts of one to 20 or 30 minutes, whatever it is.</p>\n\n\n\n<p>“Looking back on it, I think I made really big improvements in recovery and endurance when I was with them, and that’s something that you don’t quite often see as clearly. But definitely these days, since last year and this year, I’ve been making pretty big improvements and it’s been really fun to see and I feel like I really enjoy setting faster times on climbs and seeing a new power record or something like that.</p>\n\n\n\n<p>“It’s always reassuring and pretty fun to track the progress on stuff like that. It’s hard to say exactly what it is but I think i’m just having a lot of fun with training right now, and as you get older too, you start to learn what works for you and I think that this year and last year, I’ve really just started to figure out how to listen to my body and how to get the most out of it. When you’re enjoying the training and you’re confident in it, then you’re going to see improvements.”</p>\n\n\n\n<p>That’s certainly been reflected this year as Powless has put in strong showings at the very highest level. He sees those results in the context of recent successes from compatriots like Sepp Kuss (Jumbo-Visma), Brandon McNulty (UAE Team Emirates), and Quinn Simmons (Trek-Segafredo) as something for American fans to get excited about.</p>\n\n\n\n<p>“I really hope this is sort of the beginning of USA Cycling and American athletes racing at the front of big races like this again and hopefully consistently at World Championships,” he said of his strong showing at Worlds. “I think we’ve got a pretty diverse group of super strong guys. Brandon is super strong at one-day races like we saw at the Olympics and also in time trials. I think Quinn is going to be definitely a top contender for some of the hardest Classics out there the next few years. Sepp is one of the best climbers in the world. I’m hoping I can sort of fill my role as sort of a crossover between those three.”</p>\n\n\n\n<p>Looking ahead, Powless will start Il Lombardia on Saturday as one of a handful of strong options for EF, with Sergio Higuita and former third-place finisher Rigoberto Urán also in the mix, and Powless says he’s hoping to “sneak away a bit earlier than the final ascent of the day.” Beyond that, he will go into the offseason with an eye towards building on his promising showings thus far in the hillier one-day races, with the Ardennes Classics as an obvious objective.</p>\n\n\n\n<p>He’s shown so far that he has potential on that terrain – and he enjoys it too.</p>\n\n\n\n<p>“I really would like to become more of a punchy-type racer. Maybe in a few years I can really start to focus on being in the top five of WorldTour stage races, but just with how this second half of the year has gone, these punchy Italian one-day races have been really fun to race, and have been suiting me pretty well, so I hope I can continue to improve in races like that.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/in-a-breakthrough-2021-season-neilson-powless-is-coming-into-his-own/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e729074ba9df464275f2dc424a02cb02b449fa9bab1439bb51e975efc0439cf6","category":"Cycling"}