{"title":"Apple Again Extends Deadline Requiring Apps Offering Virtual Group Events to Use In-App Purchases","link":"https://www.macrumors.com/2021/04/22/apple-extends-in-app-purchase-event-requirement/","date":1619115115000,"content":"Last fall, Apple <a href=\"https://www.macrumors.com/2020/09/11/apple-updates-app-store-review-guidelines/\">changed its App Store rules</a> around in-app purchases for realtime experiences, and the guidelines technically require apps that offer virtual events to more than a single person to use in-app purchases.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-developer-app-banner.jpeg\" />\r\n<br />\r\nApple is not yet enforcing that rule, however, and has once again extended the timeline of when in-app purchases will need to be implemented. Apple has set the new deadline for December 31, 2021, which means that apps offering digital services to groups of people can continue to accept payment methods that do not use in-app purchases and are not subject to Apple's 15 to 30 percent cut through the end of the year.<blockquote>Last year, to support apps that adapted services from in-person to digital due to the COVID-19 pandemic, we temporarily deferred the requirement to offer paid online group event services (one-to-few and one-to-many realtime services) through in-app purchase in accordance with <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> Review Guideline 3.1.1. As the world continues to recover from the pandemic, we'd like to support the communities that are still providing digital services in place of in-person group events by extending the deadline further to December 31, 2021.</blockquote>Apple initially planned to begin requiring apps to comply with the in-app purchase rule for group digital events in December 2020, but <a href=\"https://www.macrumors.com/2020/11/23/virtual-group-events-in-app-purchase-deadline/\">implemented an extension</a> in November 2020 that would have put the deadline at June 30.\r\n<br />\r\n\r\n<br />\r\nApple says that it is not going to enforce the rule in order to continue to support communities that are still providing digital services in place of in-person group events.\r\n<br />\r\n\r\n<br />\r\nThe ‌App Store‌ rules specifically apply to one-to-a-few or one-to-many events that involve more than two people. Person-to-person experiences between two individuals do not need to use in-app purchases, so tutoring sessions, medical consultations, real estate tours, one-on-one fitness training sessions, and more can be purchased using alternative payment methods.\r\n<br />\r\n\r\n<br />\r\nMany popular apps, such as ClassPass and Airbnb, normally offer real world purchase options that don't need to use in-app purchases, but have been offering virtual experiences during the pandemic. Purchases for real world experiences are not subject to in-app purchases, but purchases for digital events are, so Apple has been wanting to take a cut of sales from those apps.\r\n<br />\r\n\r\n<br />\r\nAirbnb and ClassPass complained, which led to the rule that allows person-to-person experiences to skirt in-app purchase requirements.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/apple-developer-program/\">Apple Developer Program</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/22/apple-extends-in-app-purchase-event-requirement/\">Apple Again Extends Deadline Requiring Apps Offering Virtual Group Events to Use In-App Purchases</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-again-extends-deadline-requiring-apps-offering-virtual-group-events-to-use-in-app-purchases.2292810/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Cf_fvmnUnok:2uSSEuC5oxM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Cf_fvmnUnok:2uSSEuC5oxM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/Cf_fvmnUnok\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e730266217541d32fad67c8e9d04dfc2a7ad4b72f30e52626c7040d40e190cc8","category":"Apple"}