{"title":"ประธานเทศกาลหนังเมืองคานส์บอก Netflix และสตรีมมิ่งอื่นยังไม่มีผู้กำกับหน้าใหม่โดดเด่นเลยสักคน","link":"https://www.blognone.com/node/123590","date":1625560050000,"content":"<div><div><div><p>เป็นอีกความไม่เห็นตรงกันระหว่างสายภาพยนตร์เก่ากับสตรีมมิ่ง เมื่อ Thierry Fremaux ประธานเทศกาลภาพยนตร์เมืองคานส์ของฝรั่งเศส ในระหว่างสัมภาษณ์กับนักข่าวก่อนเปิดงาน มีการพูดคุยประเด็นหนังสตรีมมิ่ง โดย Fremaux ชื่นชมผลงาน Netflix หลายอย่าง ไม่ว่าจะเป็น Mank และ The Irishman จนนักข่าวขอให้เขายกตัวอย่างชื่อผู้กำกับหน้าใหม่ฝีมือดีจากสตรีมมิ่ง  ซึ่งเขามองว่า ไม่มีเลยสักคนในช่วงสิบปีมานี้</p>\n<p>เทศกาลภาพยนตร์เมืองคานส์บอยคอต Netflix มาตั้งแต่ปี 2018 โดยหนังของ Netflix จะไม่มีสิทธิ์เข้าร่วมประกวดใดๆ เว้นเสียแต่นำภาพยนตร์มาฉายบนจอใหญ่ในฝรั่งเศส หากอยากแข่งขันเพื่อชิงรางวัล Palme d'Or (รางวัลสูงสุดในการประกวดภาพยนตร์ของเทศกาลภาพยนตร์เมืองคานส์)</p>\n<p>Fremaux บอกด้วยว่า ความเป็นมาของเทศกาลหนังเมืองคานส์ ดำเนินมาถึงปีที่ 125 แล้ว ภารกิจของเทศกาลคือการค้นพบผลงานใหม่ๆ ส่วน Netflix ก็พยายามทำผลงานด้วยการดึงตัวผู้กำกับดังๆ มาร่วมงาน เขาจึงไม่มั่นใจว่า Netflix หรือสตรีมมิ่งอื่นๆ จะสามารถก้าวข้ามเทศกาลหนังเมืองคานส์ไปได้</p>\n<p>ความสัมพันธ์ระหว่างเทศกาลภาพยนตร์เมืองคานส์และ Netflix เริ่มไม่สู้ดีมาตั้งแต่ปี 2017 เมื่อคนในธุรกิจโรงหนังประท้วงเรื่องการรวมหนังจาก Netflix เข้ามาในการประกวดด้วย ทำให้ทางเทศกาลเปลี่ยนกฎและ Netflix ถอนหนังออกจากการประกวด 3 เรื่อง</p>\n<p>ปัจจุบัน Amazon ยอมทำตามกฎของเทศกาล ส่งหนังเจ้าประกวดในปีนี้ 2 เรื่อง แต่ Netflix ยังไม่ยอมทำตามกฎ เพราะมองว่าเข้มงวดเกินไป ด้านเทศกาลภาพยนตร์เมืองคานส์ประจำปี 2021 เริ่มต้นอย่างเป็นทางการในวันที่ 6-17 ก.ค.นี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/08b50743d44d0bfb546eb1b094ea90f9.png\" /><br />\nภาพจาก <a href=\"https://www.facebook.com/festivaldecannes/photos/a.370501022970840/4274083819279188\">Festival de Cannes</a></p>\n<p>ที่มา - <a href=\"https://www.straitstimes.com/life/entertainment/netflix-yet-to-discover-a-great-film-director-says-cannes-chief?utm_source=twitter&amp;utm_medium=social-organic&amp;utm_keyword=dlvr.it\">The Strait Times</a>, <a href=\"https://variety.com/2021/film/global/cannes-thierry-fremaux-talks-netflix-pandemic-challenges-in-pre-festival-press-conference-1235011781/\">Variety</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/movie-0\">Movie</a></div><div><a href=\"/topics/france\">France</a></div><div><a href=\"/topics/streaming\">Streaming</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e7373d4a147246360a4790a75e6308e97a6e1cf7938320feded71abc2524ad0c","category":"Thai"}