{"title":"How to share a mouse and keyboard between Macs and iPads","link":"https://www.macworld.com/article/785277/share-keyboard-mouse-multiple-macs.html","date":1686910605000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you have multiple Macs you want to use, it can be a hassle to manage multiple keyboards, mice, and other pointing devices. What if you could use a single set of input devices to control multiple Macs—and sometimes iPads?</p>\n\n\n\n<p>Since Monterey, Apple has offered Universal Control for Macs and iPads, a solution for sharing keyboards and mice between two Macs. Where Universal Control doesn’t fit, you can try a hardware or software KVM, which can share a set of input devices among multiple computers.</p>\n\n\n\n<h2>What is Universal Control?</h2>\n\n\n\n<p><a href=\"https://www.macworld.com/article/609440/how-to-universal-control-mac-ipad-mouse-keyboard-settings.html\">Universal Control</a> will let you use the same keyboard and mouse for all the Macs and iPads you are working on. All you have to do to switch devices is move the pointer until it crosses the edge of the screen. The new feature also makes it extremely easy to copy content between devices using drag-and-drop.</p>\n\n\n\n<p>Universal Control builds on the Continuity features Apple added years ago that made it easy to move from one device to another seamlessly. Then with Catalina in 2019 came Sidecar, which made it easy to use an iPad as an additional screen for your Mac. Read: <a href=\"https://www.macworld.com/article/671945/how-to-use-an-ipad-as-a-second-monitor.html\">How to use an iPad as a second screen with a Mac</a>.</p>\n\n\n\n<p>But Universal Control goes a step further than Sidecar did: rather than turning your iPad display into a secondary Mac display, Universal Control will maintain the iPadOS on the iPad, so that you can interface with the iPad as an iPad, rather than as a second screen for your Mac.</p>\n\n\n\n<p>Similarly, Universal Control brings a Sidecar-like feature to the Mac, so you can extend the primary screen to the secondary Mac, but you can also choose to use the two Macs independently so that you can interface between the two devices.</p>\n\n\n\n<p>Here we will explain how to use a keyboard and mouse with two Macs or a Mac and an iPad. Read on! </p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<h2>What you need for Universal Control </h2>\n\n\n\n<p>Universal Control lets you use a keyboard, mouse, or trackpad across multiple devices logged into the same iCloud account and that are in proximity to one another. MacOS Monterey version 12.4 or later and iPadOS 15.4 or later are required. You also need to have Bluetooth and Wi-Fi enabled.</p>\n\n\n\n<p>Universal Control is turned on by default on both your Mac and iPad, but you do need to set up a few things.</p>\n\n\n\n<ul><li>Universal Control arrived in March 2022 in <a href=\"https://www.macworld.com/article/678409/macos-12-3-bug-fixes-and-monitor-issues-fixed-in-macos-12-3-1.html\">macOS 12.3</a> or <a href=\"https://www.macworld.com/article/678403/ios-15-4-brings-masked-unlocking-and-15-4-1-fixes-battery-issues.html\">iPadOS 15.4</a> . In order for Universal Control to work you will need at least macOS 12.3 on your Mac(s) and iPadOS 15.4 on your iPad.</li><li>You will need a compatible Mac(s) and iPad (see compatibility list below).</li><li>You also need Bluetooth and Wi-Fi to be turned on on your Mac and iPad so make sure that they are all on.</li><li>You’ll also need to be signed into the same iCloud account on both devices.</li><li>You’ll also need to move your iPad or secondary Mac within 30 feet/10 meters of your Mac.</li></ul>\n\n\n\n<p>Apple offers <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT212757&amp;xcust=1-1-785277-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">this detailed setup guide</a> that includes minimum hardware model requirements for Macs and iPads.</p>\n\n\n\n<h2>Universal Control compatibility</h2>\n\n\n\n<p>Universal Control won’t work with every Mac or iPad. If you want to operate multiple Macs and iPads with one keyboard, mouse and trackpad you’ll need a recent Mac and a recent iPad, both devices will need to be logged into the same Apple ID, you will also need two-factor authentication, and you will need to be running macOS 12.3 or iPadOS 15.4.</p>\n\n\n\n<h3>Compatible Macs:</h3>\n\n\n\n<ul><li>MacBook Pro (2016 and later)</li><li>MacBook (2016 and later)</li><li>MacBook Air (2018 and later)</li><li>21.5in iMac (2017 and later)</li><li>27in iMac (2015 and later)</li><li>24in iMac</li><li>iMac Pro</li><li>Mac mini (2018 and later)</li><li>Mac Pro (2019)</li></ul>\n\n\n\n<h3>Compatible iPads:</h3>\n\n\n\n<ul><li>iPad Pro</li><li>iPad Air (3rd generation and later)</li><li>iPad (6th generation and later)</li><li>iPad mini (5th generation and later)</li></ul>\n\n\n\n<p>This means that if your Mac is from 2015 or earlier it’s not a feature you will be able to enjoy (unless you have a 27in iMac from that era).</p>\n\n\n\n<h3>Does Universal control work with Intel Macs?</h3>\n\n\n\n<p>Universal Control will work with some recent Intel Macs.</p>\n\n\n\n<h3>Does universal control work with iPhone?</h3>\n\n\n\n<p>Universal Control only connects the Mac and iPad, not the iPhone. The iPhone isn’t really suitable for use as an additional screen in this sort of set up.</p>\n\n\n\n<h3>How many devices can you link with Universal Control?</h3>\n\n\n\n<p>Up to three Macs or iPads can be linked this way. But you will need a Mac in order to use this with an iPad – you can’t use Universal Control to link two iPads (yet, anyway).</p>\n\n\n\n<h2>How to share a mouse and keyboard with two Macs</h2>\n\n\n\n<p>If you want to use your keyboard and mouse with two Macs follow these steps:</p>\n\n\n\n<ol><li>Open System Settings/System Preferences on your Mac and select Displays.</li><li>If using Ventura click on Advanced, otherwise click on Universal Control.</li><li>Check/tick all three boxes: ‘Allow your cursor and keyboard to move between any nearby Mac or iPad’ (that’s signed into your iCloud account). ‘Push through the edge of a display to connect to a nearby Mac or iPad’. And ‘Automatically reconnect to any nearby Mac or iPad’ which will ensure that your Mac and iPad reconnect next time. <img loading=\"lazy\" width=\"780\" height=\"590\" src=\"https://images.macworld.co.uk/cmsdata/features/3812900/universal_control_options_thumb.jpg\" alt=\"Universal Control Options\" /></li><li>Go to the other Mac and select the same three options in System Preferences/System Settings &gt; Displays. (If you don’t do this you won’t see the option to Link Keyboard and Mouse under Add Display in the next step.)</li><li>Click on the drop-down beside Add Display. You’ll see the option Link Keyboard and Mouse and the name of your secondary Mac underneath. You will need to make sure that these displays are set up in the same way as they are on your desk.<img loading=\"lazy\" width=\"712\" height=\"638\" src=\"https://images.macworld.co.uk/cmsdata/features/3812900/link_keyboard_thumb.jpg\" alt=\"Link keyboard and display\" /></li><li>Now drag your mouse to the second Mac and you will see the cursor appear on that screen. Click on a document and you’ll be able to type with the keyboard.</li><li>Drag the displays into a location that matches the setup on your desk so that you can find each display.</li></ol>\n\n\n\n<p>Now when you drag your cursor over in the direction of your secondary Mac screen, when you get to the edge of the screen your cursor will move to the other screen and you will be able to use your keyboard and mouse to control the secondary device.</p>\n\n\n\n<p>So for example, if you want to use FaceTime on your MacBook you can still use the mouse and keyboard usually associated with your Mac mini. You are using the FaceTime app on the MacBook, not the Mac mini.</p>\n\n\n\n<h2>How to share your mouse and keyboard with an iPad</h2>\n\n\n\n<p>On your iPad follow these steps:</p>\n\n\n\n<ol><li>Go to Settings &gt; General.</li><li>Go to AirPlay &amp; Handoff.</li><li>Make sure Cursor &amp; Keyboard is selected.</li></ol>\n\n\n\n<p>Now on your Mac follow these steps:</p>\n\n\n\n<ol><li>Open System Preferences/System Settings &gt; Displays.</li><li>Click on Add Display.</li><li>Under Link Keyboard and Mouse you should see your iPad. <img loading=\"lazy\" width=\"705\" height=\"694\" src=\"https://images.macworld.co.uk/cmsdata/features/3812900/use_mouse_and_keyboard_with_ipad_thumb.jpg\" alt=\"How to use mouse and keyboard with ipad\" /></li><li>Select your iPad (If it disappears just unlock your iPad or wake it up!)</li><li>You can click on the screens in the window (as seen above) and move them to a position that matches the setup on your desk so that you can easily find them!</li></ol>\n\n\n\n<p>Note that when we used the Home button on our iPad it stopped Universal Control, so if you do that you may need to start it again in System Preferences &gt; Displays.</p>\n\n\n\n<h2>How to drag and drop between Mac and iPad</h2>\n\n\n\n<p>While it was already possible to <a href=\"https://www.macworld.com/article/559916/how-to-universal-clipboard-iphone-mac.html\">copy and paste text between your Apple devices</a> thanks to Universal Clipboard, it’s now really easy to drag and drop files and other things between your iPad and Mac and vice versa. </p>\n\n\n\n<p>Prior to Universal Control if you wanted to copy a file or photo to an iPad from a Mac (or vice versa) you could use AirDrop (see: <a href=\"https://www.macworld.com/article/670984/how-to-airdrop-on-mac-iphone-and-ipad.html\">How to AirDrop on Mac, iPhone and iPad</a>), you could Message or Email from one device to the other, or you could save to iCloud where you could access it on either device, for example, anything saved to your Desktop can be accessed on any of your Apple devices if you subscribe to iCloud+ (see: <a href=\"https://www.macworld.com/article/671562/how-to-use-icloud-drive-to-sync-files-between-mac-iphone-and-ipad.html\">How to iCloud Drive to sync files between Mac, iPhone and iPad</a>).</p>\n\n\n\n<p>Now Universal Control has arrived it’s easy to drag and drop from the Mac to iPad, but you do have to show the file where it needs to go on the iPad (it won’t automatically get the correct place).</p>\n\n\n\n<p>For example, if you want to copy a photo from your Mac to your iPad follow these steps: </p>\n\n\n\n<ol><li>Open Photos on your iPad.</li><li>Click on the photo on your Mac.</li><li>Drag it from your Mac screen to the iPad.</li><li>Drop the photo into the Photos app (if doesn’t seem to work if you just drop onto the Photos icon, you need the app to be open.)</li></ol>\n\n\n\n<p>On the other hand, if you want to drag from the iPad to the Mac the process is a lot easier, just drag and drop to the desktop and it will end up there (and if you have Stacks selected it will be in the relevant folder). Read:  <a href=\"https://www.macworld.com/article/673135/clean-up-a-mac-desktop-with-mojave-desktop-stacks-other-tricks.html\">Clean up a Mac desktop with Mojave Desktop Stacks &amp; other tricks.</a></p>\n\n\n\n<p>Alternatively, drag it to a folder and drop it there.</p>\n\n\n\n<h2>What to do if your Mac and iPad don’t support Universal Control?</h2>\n\n\n\n<p>There are alternatives to universal control that will also allow you to use a single keyboard and mouse with two Macs and even an iPad. </p>\n\n\n\n<h2>How to use a Hardware KVM</h2>\n\n\n\n<p>Called KVM long ago for “keyboard, video, and mouse,” a KVM switch was an important tool for system and network administrators to avoid the clutter of extra bulky CRTs and keyboards in server rooms and elsewhere. Later, KVMs became handy for those who wanted to dock a laptop next to a desktop setup and use a larger monitor, full-sized keyboard, and mouse, trackball, or trackpad.</p>\n\n\n\n<p>Those KVMs had to include a VGA connection, multiple serial and audio connectors, and sometimes USB 1.1.</p>\n\n\n\n<p>Today, a KVM can be much simpler: you just need USB Type-A ports and can use USB-C adapters as necessary to connect to your Macs. This $19.99 list price <a href=\"https://www.amazon.com/gp/product/B01MXXQKGM?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">UGreen two-computer switch</a> could fit the bill for many people.</p>\n\n\n\n<h2>How to use a Software KVM</h2>\n\n\n\n<p>If you only want to switch among Macs, a virtual KVM might be the path of least fuss. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://symless.com/synergy&amp;xcust=1-1-785277-1-0-0&amp;sref=https://www.macworld.com/feed\">Symless Synergy</a> is just $29 for three computers, with those licenses covering macOS, Linux, Raspberry Pi, and Windows—you can mix and match installations.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/mac911-symless-synergy-mac-screen.png?w=1200\" alt srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/mac911-symless-synergy-mac-screen.png?quality=50&amp;strip=all 1556w, https://b2c-contenthub.com/wp-content/uploads/2022/06/mac911-symless-synergy-mac-screen.png?resize=300%2C207&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/06/mac911-symless-synergy-mac-screen.png?resize=768%2C530&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/06/mac911-symless-synergy-mac-screen.png?resize=1200%2C828&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/06/mac911-symless-synergy-mac-screen.png?resize=1536%2C1060&amp;quality=50&amp;strip=all 1536w\" width=\"1200\" height=\"828\" /><figcaption>Synergy lets you share a keyboard, mouse, and other input devices across computers running macOS and other platforms.</figcaption></figure></div>\n\n\n\n<p>Synergy works similarly to Universal Control (before Universal Control existed), letting you trigger movement among devices by sliding your cursor off the edge of one screen and onto another.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\niPad, Mac, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e739bec3eed12f2daacfad5e6a390f3681043c3b87a943166cc6bc6f46c64dc6","category":"Apple"}