{"title":"The rate, causes and predictors of ambulance call outs to residential aged care in the Australian Capital Territory: A retrospective observational cohort study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311019","date":1727704800000,"content":"<p>by Louise S. Cox, Mark Naunton, Gregory M. Peterson, Nasser Bagheri, Jake Paul Bennetts, Jane Koerner, Rachel Davey, Sam Kosari</p>\r\n\r\nOlder people in residential aged care are susceptible to acute illness or injury which may necessitate an ambulance call out, assessment/treatment by a paramedic and transfer to a hospital emergency department. Understanding the case mix of residential aged care ambulance attendances is important for prevention strategies and for planning services. A retrospective observational closed cohort study was designed to investigate the characteristics of emergency ambulance call outs to 15 residential aged care sites in the Australian Capital Territory over a 12-month period. Data were collected from the local ambulance service and the aged care sites. Case load data were analysed to determine rates, clinical characteristics, ambulance attendance outcomes and the temporal distribution of call outs. A Poisson regression model was developed to investigate demographic, morbidity and medication-related risk factors associated with the number of ambulance call outs per resident. Annual ambulance call out costs were estimated. There were 1,275 residents, with 396 (31.1%) requiring at least one ambulance call out over 12 months. Of 669 ambulance attendances, the majority (87.0%) were transported to emergency departments. Trauma (23.9%), pain (16.9%) and infections (9.4%) were the most common primary assessments by the ambulance attendees. Cases/day were similar throughout the year and on weekdays compared to weekends/public holidays. The main predictors of ambulance call out were multi-morbidity, taking regular anticholinergic medicines, being male and younger age. Estimated costs of ambulance call outs/year were $475/resident and $40,375/residential aged care site. The most frequent primary assessments (trauma, pain, infections) may constitute priorities for developing prevention strategies and for treatment initiatives within residential aged care. Strategies to reduce anticholinergic medication prescribing may also be a potential intervention to decrease ambulance call outs and hospital emergency department demand. The ambulance usage data from this study may be useful to compare with future datasets to measure the impact of the introduction of new services.","author":"Louise S. Cox","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e755b2f68fb0c4806f77c789b1fdeecafb2e4462f91d2ce55a5b98e73615631c","category":"Interdisciplinary"}