{"title":"HCP Vault and HCP Consul add new Canada, Japan, and US AWS regions","link":"https://www.hashicorp.com/blog/hcp-vault-and-hcp-consul-add-new-canada-japan-and-us-aws-regions","date":1675875600000,"content":"<p>HashiCorp Cloud Platform (HCP) is a popular way to get up and running on HashiCorp’s solutions without the overhead of installation, scaling, or lifecycle management. Today, HCP Vault, an identity-based cloud security solution, and HCP Consul, a cloud service networking and service mesh offering, are now available in new Amazon Web Services (AWS) regions around the globe, for the first time including Canada and Japan. In addition, HCP Vault recently gained multi-region replication support.</p>\n<p>Many organizations rely on infrastructure in geographically distributed AWS regions to increase service performance and lower request round-trip latency. The supported AWS regions now include:</p>\n<h3><a href=\"#united-states\">»</a><a></a>United States</h3>\n<ul>\n<li>North Virginia</li>\n<li><strong>New</strong>: Ohio</li>\n<li>Oregon</li>\n</ul>\n<h3><a href=\"#canada\">»</a><a></a>Canada</h3>\n<ul>\n<li><strong>New</strong>: Central</li>\n</ul>\n<h3><a href=\"#europe\">»</a><a></a>Europe</h3>\n<ul>\n<li>Frankfurt</li>\n<li>Ireland</li>\n<li>London</li>\n</ul>\n<h3><a href=\"#asia-pacific\">»</a><a></a>Asia-Pacific</h3>\n<ul>\n<li><strong>New</strong>: Tokyo</li>\n<li>Singapore</li>\n<li>Sydney</li>\n</ul>\n<p>For a full list of the AWS regions we support, see the <a href=\"https://developer.hashicorp.com/hcp/docs/hcp/supported-env/aws\">HCP documentation</a>.</p>\n<h2><a href=\"#multi-region-support-for-aws-regions\">»</a><a></a>Multi-Region Support for AWS Regions</h2>\n<p>In addition to new regional support for single region deployments, customers who want to streamline operations for multi-region support can now take advantage of our new multi-region replication support for HCP Vault.</p>\n<p>Using Vault as an example, multi-region support means that you can run a production-grade three-node Vault cluster in one AWS region and have it replicated to another three-node cluster in a different AWS region. For example, data in AWS Europe North 1 (Stockholm) could be replicated to AWS Europe West 2 (London). This can help lower latency between Vault and geographically dispersed applications in multi-region deployments.</p>\n<p>Replication operates using a leader-to-follower model, in which a leader cluster (known as a primary) is linked to a follower cluster. The primary cluster acts as the system of record and asynchronously replicates most Vault data.</p><img src=\"https://www.datocms-assets.com/2885/1675800708-perf-primary-secondary.png\" alt=\"Performance\" /><p>See our documentation for more information on <a href=\"https://developer.hashicorp.com/vault/tutorials/cloud-ops/vault-replication\">multi-region replication for HCP Vault</a>.</p>\n<h2><a href=\"#hcp-vault-a-gateway-to-zero-trust\">»</a><a></a>HCP Vault: A Gateway to Zero Trust</h2>\n<p>For many of our customers, the first service they start using on HCP is Vault, particularly to centralize secrets management for ephemeral resources like <a href=\"https://www.hashicorp.com/blog/the-state-of-vault-and-kubernetes-and-future-plans\">Kubernetes managed containers</a>. HCP Vault also enables secure secrets management across Amazon EC2, Amazon EKS, AWS Lambda, and many other AWS services.</p>\n<p>As a fully managed service, HCP Vault makes it easier to secure, store, and tightly control access to tokens, passwords, certificates, encryption keys, and other sensitive data. It also serves as an identity-based security platform for applications, network services (with <a href=\"https://cloud.hashicorp.com/products/consul\">HCP Consul</a>), and human users seeking secure remote access to infrastructure (with <a href=\"https://cloud.hashicorp.com/products/boundary\">HCP Boundary</a>).</p>\n<p>We designed HCP Vault to minimize the steps necessary to set up Vault within your AWS environments. At a high level, operators need to take four steps to start using HCP Vault:</p>\n<ol>\n<li><strong>Create an account:</strong> Sign up for a <a href=\"https://portal.cloud.hashicorp.com/sign-up\">HashiCorp Cloud Platform</a> account.</li>\n<li><strong>Deploy a cluster:</strong> Select HCP Vault from the dashboard. This <a href=\"https://learn.hashicorp.com/tutorials/cloud/get-started-vault?in=vault/cloud\">quickstart deployment guide</a> will walk you through the process of creating your HashiCorp Virtual Network (HVN) and a Vault cluster.</li>\n<li><strong>Set up your first secret:</strong> Use our <a href=\"https://developer.hashicorp.com/vault/tutorials/cloud/vault-first-secrets\">template for key/value secrets stores</a> to get up and running quickly.</li>\n<li><strong>Peer with AWS:</strong> Once you have deployed your HVN and cluster, you need to peer that network with your existing AWS environments.</li>\n</ol>\n<p>That’s it; you are ready to connect and use HCP Vault. In practice, these steps will have a range of options to meet the needs of your infrastructure, so we’ve created a series of <a href=\"https://learn.hashicorp.com/collections/vault/cloud\">HashiCorp Learn guides</a> to help you manage the finer details of your setup.</p>\n<h2><a href=\"#next-steps\">»</a><a></a>Next Steps</h2>\n<p>HCP Vault and HCP Consul are both available with hourly and annual pricing. <a href=\"https://cloud.hashicorp.com/pricing\">Get started and see pricing</a> today.</p>","author":"Megan LaFlamme","siteTitle":"HashiCorp Blog","siteHash":"3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"e75a97e1989116d40b81a87ce684d5a7e9be89b3f123191e8347fb","category":"Tech"}