{"title":"Waymo kills off autonomous trucking program","link":"https://arstechnica.com/?p=1957040","date":1690479219000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/5-1-800x450.jpg\" alt=\"A Waymo Via truck. Check out all that self-driving equipment on the front.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/5-1.jpg\">Enlarge</a> <span>/</span> A Waymo Via truck. Check out all that self-driving equipment on the front. (credit: Waymo)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google's cost cutters are taking another bite out of Waymo. After being hit by layoffs that cut <a href=\"https://arstechnica.com/gadgets/2023/03/waymo-hit-by-second-round-of-layoffs-has-cut-8-percent-of-staff-this-year/\">8 percent</a> of staff, it now looks like the self-driving truck program—Waymo Via—is dead. Waymo's announcement blog post tries to put a brave face on things, saying the company is \"Doubling down on Waymo One,\" its ride-hailing service, but also mentions that the company will \"push back the timeline on our commercial and operational efforts on trucking, as well as most of our technical development on that business unit.\"</p>\n<p></p><aside>\n  <h2>Google kills product</h2>\n\t<ul>\n\t    <li><a href=\"https://arstechnica.com/gadgets/2023/07/waymo-kills-off-autonomous-trucking-program/\">Waymo kills off autonomous trucking program</a></li>\n      <li><a href=\"https://arstechnica.com/gadgets/2023/06/google-assistant-kills-off-support-for-third-party-note-apps/\">Google Assistant kills off support for third-party note apps</a></li>\n      <li><a href=\"https://arstechnica.com/gadgets/2023/05/youtube-is-killing-off-youtube-stories-its-snapchat-clone/\">YouTube Stories, Google’s clone of Snapchat, is dying on June 26</a></li>\n      <li><a href=\"https://arstechnica.com/gadgets/2023/04/google-is-bricking-dropcams-and-nest-secure-offers-discounts-to-upgraders/\">RIP to Dropcams, Nest Secure: Google is shutting down servers next year</a></li>\n      <li><a href=\"https://arstechnica.com/gadgets/2023/03/google-assistant-might-be-doomed-division-reorganizes-to-focus-on-bard/\">Google Assistant might be doomed: Division “reorganizes” to focus on Bard</a></li>\n    </ul>\n  <span><a href=\"https://arstechnica.com/series/google-kills-product/\">View more stories</a></span>\n</aside>\nWaymo says it will somehow \"continue\" its partnership with big rig manufacturer Daimler Truck North America (that's where the big, blue Waymo Via truck came from), but Waymo's actions paint a different picture. TechCrunch's <a href=\"https://techcrunch.com/2023/07/26/waymo-puts-the-brakes-on-self-driving-trucks-program/\">Kirsten Korosec</a> reports that \"the vast majority of employees on Waymo’s trucking team have taken other roles within the company. A few number of individuals will be affected by the change but will be helping with the wind down of the program.\" Waymo's website has also been completely stripped of trucking mentions. The page for Waymo Via used to be at <a href=\"https://waymo.com/waymo-via/\">waymo.com/waymo-via</a> but now 404s (archive <a href=\"https://web.archive.org/web/20230704185020/https://waymo.com/waymo-via/\">here</a>), and the top-level navigation button for \"Trucking\" is gone.<p></p>\n<p>Waymo's focus on ride-hailing makes some sense. The reliability requirements for ride-hailing are much lower than trucking, making it a more lenient business. If you have a truck full of cargo, it's a major issue if something goes wrong and it can't reach its destination on time. The truck routes are many hours long over long distances and usually have some kind of delivery time attached. Your self-driving hardware and software has to work perfectly during all that. Ride-hailing is way easier. Trips are usually measured in minutes and in a localized area where you can easily dispatch support people if something goes wrong. Because the app is a central point of customer bookings, you can easily pause and resume accepting customers anytime. That makes it easy to shut down the fleet to deal with technical difficulties or bad weather. You can also rigidly control your service area and accept or decline trips on a whim. Everyone can just use Lyft instead.</p></div><p><a href=\"https://arstechnica.com/?p=1957040#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1957040&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e76df70250be413c0f64e340a574badc4da2c091eff1eae57742b4fdaffae744","category":"Tech"}