{"title":"Maintaining habitat diversity at small scales benefits wild bees and pollination services in mountain apple orchards","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12320?af=R","date":1713682800000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/5103193f-ae38-4d6a-97af-2977b8e9f25e/eso312320-toc-0001-m.png\" alt=\"Maintaining habitat diversity at small scales benefits wild bees and pollination services in mountain apple orchards\" />\n<p>Wild bees thrive in landscapes with a heterogeneous matrix from small to large spatial scales, even in regions with abundant semi-natural habitats. Higher proportions of semi-natural habitat in the farmlands promote bee diversity and crop pollination services. Preserving habitat quality and integrity, as indicated by the multidiversity index that reflects a biodiversity measure of the whole ecosystem, is also critical to promoting the conservation of wild bee populations and pollination services.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nLandscape context influences wild bee abundance and diversity, alongside pollination-related services. Growing evidence supports the positive effects of landscape heterogeneity on bee diversity and fruit production for pollination-dependent crops in flatlands. However, little remains known about these relationships in mountainous environments where the landscape matrix surrounding crops is often more complex than in lowlands.\n\nWe conducted our study in apple orchards in South Tyrol, an Alpine region in Italy, using pan-traps, direct observations of visitation frequency and a pollinator exclusion experiment. We investigated the scale-dependent effects of landscape heterogeneity and other parameters on wild bee assemblages and the related pollination service they provide at five spatial scales (radius 100–2000 m).\n\nWe found that landscape heterogeneity positively affected the abundance and richness of wild bees, with the strongest effect at 500 m. We calculated a multidiversity index, reflecting the land-use intensity based on the species richness of vascular plants, grasshoppers, butterflies, birds and bats. We identified a positive relationship between this multidiversity index and wild bee richness. Additionally, we found that visitation rate of wild bees was negatively affected by crop cover and that abundance of honeybees did not influence wild bee visitation rate or reproductive success. Finally, reproductive success was positively related to semi-natural habitat cover.\n\nLandscape heterogeneity should be maintained in apple orchards to continue to reap the benefits of vital pollination-related services. Diversification strategies should be implemented to promote habitat diversity at small scales, even in regions with more than 80% of (semi-)natural habitats.\n</p>\n<h2>Sintesi</h2>\n<p>\n\nL'abbondanza, la diversificazione delle specie e i servizi di impollinazione forniti dalle api selvatiche sono influenzati, tra gli altri fattori, dal paesaggio. Per le aree pianeggianti gli effetti positivi dell'eterogeneità del paesaggio sulla diversità delle api e sulla produzione di frutti per le colture dipendenti dall'impollinazione, sono assodati. Per contro, queste relazioni sono poco conosciute in montagna, dove la matrice paesaggistica che circonda le colture è spesso più complessa che in pianura.\n\nAbbiamo condotto il nostro studio in 14 meleti dell’Alto Adige, utilizzando trappole, osservazioni dirette sulla frequenza di visitazione dei fiori del meleto e facendo anche un esperimento di esclusione degli impollinatori. Abbiamo analizzato gli effetti di alcune caratteristiche del paesaggio sulle comunità di api selvatiche e sul servizio di impollinazione che esse forniscono per cinque scale spaziali (raggio di 100-2000 m dal centro dei meleti studiati).\n\nAbbiamo riscontrato che l'eterogeneità del paesaggio influisce positivamente sull'abbondanza e sulla ricchezza di specie delle api selvatiche. L'effetto più forte si è verificato a un raggio di 500 m. Il tasso di visita delle api selvatiche sui fiori di melo è stato invece influenzato negativamente dalla percentuale di terreno agricolo coltivato attorno ai siti studiati. L'abbondanza delle api da miele non ha influenzato il tasso di visita delle api selvatiche o l'allegagione. Quest'ultima è risultata invece positivamente correlata all'estensione degli habitat seminaturali.\n\nL'eterogeneità del paesaggio dovrebbe essere mantenuta nei meleti per continuare a beneficiare dei servizi vitali legati all'impollinazione. È necessario attuare strategie di diversificazione per promuovere la diversità degli habitat a piccola scala, anche nelle regioni con oltre l'80% di habitat (semi)naturali.\n</p>\n<h2>Zusammenfassung</h2>\n<p>\n\nDer Wildbienenbestand, die Artenvielfalt und die Bestäubungsleistungen werden unter anderem durch den landschaftlichen Kontext beeinflusst. Es gibt immer mehr Belege für die positiven Auswirkungen der landschaftlichen Heterogenität auf die Bienenvielfalt und die Obstproduktion bei bestäubungsabhängigen Kulturen im Flachland. Über diese Zusammenhänge in den Bergen, wo die Landschaftsmatrix rund um die Kulturpflanzen oft komplexer ist als im Flachland, ist jedoch wenig bekannt.\n\nWir führten unsere Studie in Apfelanlagen in Südtirol, einer Alpinen Region in Italien, durch. Dabei verwendeten wir Fallen, direkte Beobachtungen der Besuchshäufigkeit und ein Experiment zum Ausschluss von Bestäubern. Wir untersuchten die maßstabsabhängigen Auswirkungen der landschaftlichen Heterogenität auf die Wildbienenbestände und die von ihnen erbrachten Bestäubungsleistungen auf fünf räumlichen Skalen (Radius 100 - 2.000 m) um das Zentrum der untersuchten Apfelanlagen.\n\nWir fanden heraus, dass sich die Heterogenität der Landschaft positiv auf die Abundanz und Artenvielfalt von Wildbienen auswirkte. Die stärkste Auswirkung zeigte sich bei einem Radius von 500 m. Die Besuchsrate der Wildbienen wurde hingegen durch Ackerfläche negativ beeinflusst. Die Abundanz von Honigbienen hatte keinen Einfluss auf die Besuchsrate von Wildbienen oder den Bestäubungserfolg. Schließlich stand der Bestäubungserfolg in einem positiven Zusammenhang mit der Bedeckung durch naturnahe Lebensräume.\n\nDie Heterogenität der Landschaft sollte in Apfelanlagen beibehalten werden, um die Vorteile der lebenswichtigen Bestäubungsleistungen weiterhin nutzen zu können. Es sollten Diversifizierungsstrategien umgesetzt werden, um die Lebensraumvielfalt in kleinem Maßstab zu fördern, selbst in Regionen mit mehr als 80 % natürlichen (und naturnahen) Lebensräumen.\n</p>","author":"Sebastiano Zanini, \nMatteo Dainese, \nTimo Kopf, \nGeorg Leitinger, \nUlrike Tappeiner","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"e77125e84d4d2536242f12256479828348409e524245b6af66ee09fb698ae835","category":"Environment"}