{"title":"สงครามศาสนารอบใหม่ ผู้สร้าง Ruby on Rails ถอดภาษา TypeScript ออกจากโครงการ Turbo","link":"https://www.blognone.com/node/135641","date":1694196772000,"content":"<div><div><div><p>David Heinemeier Hansson (@dhh) ผู้ร่วมก่อตั้ง Basecamp และผู้สร้าง Ruby on Rails ประกาศถอดภาษา TypeScript ออกจากโครงการ Turbo ที่เร่งความเร็วหน้าเว็บด้วยการลดการโหลดจากการกดลิงก์หรือส่งข้อมูลฟอร์ม</p>\n<p>Hansson ระบุในประกาศว่าเขาไม่เคยชอบ TypeScript ตั้งแต่แรก และไม่ชอบตลอดที่ใช้งานมา 5 ปี แต่กลับชอบ JavaScript มากกว่าและนับว่าเป็นภาษาที่ชอบเป็นรองเพียง Ruby เท่านั้น และข้อเสียต่างๆ ของ JavaScript ก็ถูกแก้ไปเยอะแล้ว โดยเฉพาะ<a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Classes\">ระบบ class</a> ขณะที่ภาษา TypeScript นั้นเพิ่มขั้นตอนการคอมไพล์เข้ามาและบังคับใช้ type จนวุ่นวายและสุดท้ายในเคสยากๆ ก็ต้องใช้ any</p>\n<p>เหตุผลสุดท้ายคือไม่ว่าอย่างไรการเขียนโค้ดในเบราว์เซอร์ก็ต้องเขียนด้วย JavaScript อยู่ดี การยอมเขียน JavaScript เสียตรงๆ ก็ทำให้ไม่ต้องไปพึ่งเครื่องมือเพิ่มเติมอีก</p>\n<p>หลัง Hansson ประกาศปรับโครงการ Turbo เช่นนี้ก็สร้างข้อโต้แย้งค่อนข้างรุนแรงในชุมชนนักพัฒนา บางคนพยายามส่งแพตช์รองรับ TypeScript กลับเข้าโครงการ Turbo ขณะที่คนอีกจำนวนมากร่วมประท้วงด้วยการสนับสนุนแพตช์ ด้าน Hansson ก็มาเขียนบล็อกตอบว่าถ้าใครพบว่า TypeScript คือทางเลือกที่ดีก็ยินดีด้วย แต่ให้ไปแสดงออกที่อื่นอย่ามาประท้วงในเว็บสำหรับพัฒนาโครงการโอเพนซอร์สแบบนี้</p>\n<p>ที่มา - <a href=\"https://world.hey.com/dhh/turbo-8-is-dropping-typescript-70165c01\">world.hey.com</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e9a71854ed0866aa59303114195dd21a.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/typescript\">TypeScript</a></div><div><a href=\"/topics/open-source\">Open Source</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e77e90a6898f69b101b03d6bd72fb47fa3d8681cac6dad44d925291e17f066ed","category":"Thai"}