{"title":"Ixodes scapularis Calreticulin Binds Complement Proteins but Does Not Protect Borrelia burgdorferi from Complement Killing","link":"https://www.preprints.org/manuscript/202404.1648/v1","date":1714032343000,"content":"Ixodes scapularis is a blood-feeding obligate ectoparasite responsible for transmitting the Lyme disease (LD) agent, Borrelia burgdorferi. During the feeding process, I. scapularis injects B. burgdorferi into the host along with its saliva, facilitating the transmission and colonization of the LD agent. Tick calreticulin (CRT) is one of the earliest tick saliva proteins identified and is currently utilized as a biomarker for tick bites. Our recent findings revealed elevated levels of CRT in the saliva proteome of B. burgdorferi-infected I. scapularis nymphs compared to uninfected ticks. Differential precipitation of proteins (DiffPOP) and LC-MS/MS analyses were used to identify the interactions between Ixs (I. scapularis) CRT and human plasma proteins and further exploring its potential role in shielding B. burgdorferi from complement killing. We observed that although yeast expressed recombinant (r) IxsCRT binds to the C1 complex (C1q, C1r, and C1s), the activator of complement via the classical cascade, it did not inhibit deposition of the membrane attack complex (MAC) via the classical pathway. Intriguingly, rIxsCRT binds intermediate complement proteins (C3, C5, and C9) and reduces MAC deposition through the lectin pathway. Despite inhibition of MAC deposition in the lectin pathway, rIxsCRT did not protect a serum sensitive B. burgdorferi strain (B314/pBBE22Luc) from complement-induced killing. As B. burgdorferi establishes a local dermal infection before disseminating to secondary organs, it is noteworthy that rIxsCRT promotes the replication of B. burgdorferi in culture. We hypothesize that rIxsCRT may contribute to the transmission and/or host colonization of B. burgdorferi by acting as a decoy activator of complement and by fostering B. burgdorferi replication at the transmission site.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e796b8650c7fa5af94115f5f8abe8f4c7f57b47d8f5740aac67c605bba07b6c4","category":"Interdisciplinary"}