{"title":"PSV-2 Digestible indispensable amino acid scores (DIAAS) in pork products","link":"https://academic.oup.com/jas/article/102/Supplement_2/273/7664865?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The “Digestible Indispensable Amino Acid Score” (DIAAS) method measures protein quality in human foods. However, values for DIAAS are not available for some pork products. Therefore, this study aimed to determine DIAAS values for nine pork products. Nine diets contained one pork product (i.e., back ribs, shoulder butt, tenderloin, Coppa ham, prosciutto ham, speck ham, chorizo, Italian sausage, and bratwurst) as the only source of crude protein (CP) and amino acids (AA). Nine ileal cannulated gilts with an initial average body weight of 50.3 ± 3.8 kg were used in a 9 × 6 incomplete Latin square with 9 diets and six 7-d periods. Ileal digesta were collected on d 6 and 7 of each period. There were, therefore, six replicate pigs per diet, but no pig was fed the same diet twice. A nitrogen-free diet was used to measure basal endogenous losses of CP and AA, and this diet was fed to all pigs in one separate 7-d period. The standardized ileal digestibility (SID) and DIAAS of each pork product were calculated. Reference ratios were used for children from 6 mo to 3 yr old and individuals older than 3 yr. Data were analyzed by ANOVA using the MIXED procedure of SAS with pig as the experimental unit. Diet was the fixed effect and replicate pig was the random effect. Results indicated that for both age groups, prosciutto ham had greater (<span>P</span> &lt; 0.05) DIAAS than all other pork products (Table 1), which may be because prosciutto is from the hind leg of the pig, which contains less connective tissue. Prosciutto was also not smoked, which may contribute to the greater DIAAS values for this protein because smoking may reduce DIAAS. For children from 6 mo to 3 yr old, tenderloin, Coppa ham, and Italian sausage had greater (<span>P</span> &lt; 0.05) DIAAS than chorizo and bratwurst sausages, back ribs, and shoulder butt. However, for individuals older than 3 yr, Coppa ham had greater (<span>P</span> &lt; 0.05) DIAAS than all other pork cuts and sausages. The observation that back ribs and shoulder butt had decreased DIAAS than tenderloin is likely because tender cuts with less connective tissues tend to have greater concentrations of indispensable AA with less non-nitrogen content. In addition, for both age groups, there was no limiting AA for all pork products, except that chorizo sausage was limiting in sulfur AA for children from 6 mo to 3 yr old. In conclusion, data from this experiment demonstrated that all pork products have “good” or “excellent” protein quality for individuals older than 6 mo of age, indicating that these food ingredients may be used to complement lower-quality proteins and provide a meal with all indispensable AA.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e7a9e2a8cd567f6e233e44dae75bc05f8a9b4fc553109f56a3f667f9e26e64e5","category":"Environment"}