{"title":"Lotic‐SIPCO2: Adaptation of an open‐source CO2 sensor system and examination of associated emission uncertainties across a range of stream sizes and land uses","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10600?af=R","date":1713348971000,"content":"<h2>Abstract</h2>\n<p>River networks play a crucial role in the global carbon cycle, as relevant sources of carbon dioxide (CO<sub>2</sub>) to the atmosphere. Advancements in high-frequency monitoring in aquatic environments have enabled measurement of dissolved CO<sub>2</sub> concentration at temporal resolutions essential for studying carbon variability and evasion from these dynamic ecosystems. Here, we describe the adaptation, deployment, and validation of an open-source and relatively low-cost in situ <i>p</i>CO<sub>2</sub> sensor system for lotic ecosystems, the lotic-SIPCO2. We tested the lotic-SIPCO2 in 10 streams that spanned a range of land cover and basin size. Key system adaptations for lotic environments included prevention of biofouling, configuration for variable stage height, and reduction of headspace equilibration time. We then examined which input parameters contribute the most to uncertainty in estimating CO<sub>2</sub> emission rates and found scaling factors related to the gas exchange velocity were the most influential when CO<sub>2</sub> concentration was significantly above saturation. Near saturation, sensor measurement of <i>p</i>CO<sub>2</sub> contributed most to uncertainty in estimating CO<sub>2</sub> emissions. We also found high-frequency measurements of <i>p</i>CO<sub>2</sub> were not necessary to accurately estimate median emission rates given the CO<sub>2</sub> regimes of our streams, but daily to weekly sampling was sufficient. High-frequency measurements of <i>p</i>CO<sub>2</sub> remain valuable for exploring in-stream metabolic variability, source partitioning, and storm event dynamics. Our adaptations to the SIPCO2 offer a relatively affordable and robust means of monitoring dissolved CO<sub>2</sub> in lotic ecosystems. Our findings demonstrate priorities and related considerations in the design of monitoring projects of dissolved CO<sub>2</sub> and CO<sub>2</sub> evasion dynamics more broadly.</p>","author":"Andrew L. Robison, \nLauren E. Koenig, \nJody D. Potter, \nLisle E. Snyder, \nChristopher W. Hunt, \nWilliam H. McDowell, \nWilfred M. Wollheim","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"e7ab9bdcb1fd7c9091c6756a24af9d6bf7efbb719204009cb0a625f0e9326fbd","category":"Environment"}