{"title":"One‐bite sized 3D printed finger foods, oriented to malnutrition, sarcopenia, and frailty prevention in the older people","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13463?af=R","date":1710504288000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>In this study, innovative chocolate, citrus and mixture flavoured tofu-based nutritionally customized, dysphagia-oriented, comfortable-consumed, appetizing, one-bite sized finger foods, oriented to the malnutrition, sarcopenia, and frailty prevention in the older people were created by using 3D printing technology. Developed products were characterised by evaluating chemical composition, physical properties and performing sensory evaluation among geriatric clinic residents (≥60 years).</p>\n<h2>Results</h2>\n<p>The dietary composition of the developed food was: 19–21 g/100 g protein, 6-8 g/100 g fiber, 8-9 g/100 g fat, 11 mg/100 g iron, 14 mg/100 g zinc, 70 μg/100 g selenium. Foods were also enriched with branched-chain amino acids (BCAA), such as leucine, isoleucine and valine. All formulated foods were clasiffied as having 6 level by International Dysphagia Diet Standardisation Initiative (IDDSI) clasification. Chocolate-flavoured food was much harder (4914 g) with the lower adhesiveness value (−33.6 g.s), comparing to the citrus or mixture flavoured foods. Older people evaluated all finger foods as very easy handled by hand, soft, easy to swallow, having a moderate flavour intensity and a weak afterfeel. Despite the fact that the chocolate food was evaluated as having the highest hardness and gumminess values by the instrumental method, this difference was not noticeable to the evaluators. However 7% of the participants said that 3D printed foods were sticky to dentures.</p>\n<h2>Conclusion</h2>\n<p>These results suggests that is possible to create nutrient-dense comfortably consumed 3D printed foods, oriented to malnutrition, sarcopenia and frailty prevention in older people.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Aušrinė Kurapkienė, \nRimantė Vinauskienė, \nIna Jasutienė, \nGytė Damulevičienė, \nJurgita Knašienė, \nVita Lesauskaitė, \nClaire Sulmont‐Rosse, \nViktorija Eisinaitė, \nDaiva Leskauskaitė","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"e7ae3b63bc12eeae0692d7881f95f2fdcdc655c5b2321cf978c79cbd27f8b961","category":"Environment"}