{"title":"172 Impact of maternal and postnatal 25-hydroxycholecalciferol supplementation on porcine and avian satellite cell mitotic activity and skeletal muscle growth characteristics","link":"https://academic.oup.com/jas/article/102/Supplement_3/209/7757299?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Vitamin D is an essential micronutrient most well-known for regulating calcium and phosphorus homeostasis and bone mineralization. However, over the last 20 yr, the extra-skeletal, pleotropic effects of vitamin D and its metabolites have gained greater attention. For livestock species reared indoors, vitamin D supplementation is especially important and commonly achieved by dietary addition of cholecalciferol, also known as vitamin D<sub>3</sub> (D<sub>3</sub>). Cholecalciferol is hydroxylated in the liver to produce the circulating form, 25-hydroxycholecalciferol (25OHD<sub>3</sub>), also called calcidiol. Circulating 25OHD<sub>3</sub> is subsequently converted to 1α,25-hydroxycholecalciferol (1,25OHD<sub>3</sub>) which binds a nuclear receptor found in many tissues, including skeletal muscle, to elicit its effects. This presentation will focus on the recent work regarding the effects of both maternal and postnatal 25OHD<sub>3</sub> supplementation on porcine and avian satellite cell mitotic activity and skeletal muscle growth characteristics. Feeding broilers 25OHD<sub>3</sub> posthatch results in a satellite cell-mediated skeletal muscle hypertrophic response in the fast-twitch pectoralis major but not the slow-twitch biceps femoris. Maternal dietary supplementation of gilts and hens with 25OHD<sub>3</sub> in place of the majority of D<sub>3</sub> increases circulating 25OHD<sub>3</sub> concentrations in both dams and their offspring. The improvements in vitamin D status coincide with positive effects on skeletal muscle fiber number in fetal piglets as well as satellite cell mitotic activity and hypertrophic growth of fibers in both swine and broiler chickens. Though, interestingly, combining maternal and posthatch 25OHD<sub>3</sub> supplementation in broilers does not appear to produce additive or synergistic effects on SC-mediated muscle growth. However, increasing circulating concentrations of 25OHD<sub>3</sub> by supplementing either the maternal or postnatal diet with 25OHD<sub>3</sub> has positive effects on meat yield in both porcine and avian models. Overall, these data shed light on the cellular mechanisms behind the efficacy of this vitamin D supplementation strategy using commercially available 25OHD<sub>3</sub> sources in increasing meat yield and yet, leaves enough unanswered questions remaining to warrant further exploration.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e7c21306523c5a824893604896dcef34d974ab38427862b8f49fc21373e30c3d","category":"Environment"}