{"title":"Apple is testing an imminent iPhone update to squash more iOS 17 bugs","link":"https://www.macworld.com/article/2148463/ios-17-1-2-update-bug-fixes-security-updates.html","date":1700589367000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Get your iPhones ready: Apple is secretly working on a new iOS 17.1.2 update, based on results in a news site’s visitor data.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/11/20/apple-preparing-ios-17-1-2/&amp;xcust=1-1-2148463-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">MacRumors</a> reported Monday that it had spotted visits from browsers running iOS 17.1.2, which has not yet been released to the public or even beta testers. The only plausible conclusion–other than an unlikely case of sophisticated spoofing–is that Apple’s internal teams are testing the upcoming update by visiting sites on the public web.</p>\n\n\n\n<p>The last time this happened (as recently as <a href=\"https://www.macworld.com/article/2125513/ios-17-1-1-update-new-m3-macs.html\">iOS 17.1.1</a>) Macworld was able to replicate the results using our own web analytics, but that’s not the case this time around. Nobody running iOS 17.1.2 has visited Macworld.</p>\n\n\n\n<p>When Apple launches a major update for the iPhone, iPad, or Mac, the company releases a beta testing version before the official launch. That way, users and software developers alike can try it out and spot any bugs. This includes the big annual X.0 updates, such as iOS 17.0 this summer, and even X.X updates such as iOS 17.2, which is already in beta.</p>\n\n\n\n<p>Given that it appears to be in internal testing, it would be reasonable to expect the 17.1.2 update to roll out to the public within a matter of days. This case is slightly different, as most of Apple’s corporate employees get the week of Thanksgiving as a holiday, and this update is therefore likely to be held back until next week. As MacRumors notes, last year’s iOS 16.1.2 was released on November 30, almost a week after Thanksgiving. That would put iOS 17.2 on pace for a mid-December release.</p>\n\n\n\n<p>As for the actual content of the update… that remains a mystery. X.X.X point updates generally occupy themselves with bug fixes and security updates rather than new features, but we don’t yet know which ones will be addressed this time.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e7c65bcdf90fa433fc10f49930ff74e1d44f983595bd436a538438cc815dc27f","category":"Apple"}