{"title":"Serum 25(OH)D Analysis in Captive Pachyderms (Loxodonta africana, Elephas maximus, Diceros bicornis, Rhinoceros unicornis, Tapirus indicus) in Europe","link":"https://www.preprints.org/manuscript/202408.1775/v1","date":1724683757000,"content":"The aim of this study was to detect seasonal and species differences in serum 25-hydroxy vitamin D (25(OH)D) concentrations during summer and winter months in Asian (Elephas maximus) and African elephants (Loxodonta africana), black (Diceros bicornis) and Indian rhinoceroses (Rhinoceros unicornis) and Malayan tapirs (Tapirus indicus) - when kept in captivity in (Western) Europe. Both elephant species had a low circulating level of serum 25(OH)D while African elephants (median 33.2 nmol/l – range: 21.2-58.8 nmol/l,) did not show a seasonal variation. Asian elephants had significant higher circulating levels of serum 25(OH)D compared to their African counterparts, but also did not show a seasonal difference (median 68.7, – range 55.5-110.6 nmol/l). Both rhinoceros species investigated had higher serum 25(OH)D levels compared to both elephant species; the Indian rhinoceros had high circulating levels year around (median 107.9 – range: 106.3-132.8 nmol/l), while the black rhinoceroses showed significant lower 25(OH)D levels in winter (summer median 109.0– range 51.5-251.0 nmol/l; winter median 58.3 nmol/l - range 23.5-226.0 nmol). Malayan tapirs have very low levels of serum 25(OH)D (median &amp;lt; 20.3 – range &amp;lt; 20.3-33.5 nmol/l), which is comparable to horses. Higher levels of circulating 25(OH)D of elephants and rhinoceroses compared to horses, could indicate that elephants and rhinoceroses are capable of producing vitamin D. However, this requires further testing. If this is indeed the case, this might indicate that the Indian rhinoceros are capable of producing enough endogenous vitamin D year around at latitudes around 52°N, while both elephant species and the black rhinoceros are not. To the author’s knowledge, this is the first report of vitamin D levels in tapirs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e7d6e812ce7eaad2515ecc19d339de3e537a171b62d44a51cfb3b486ac8c5c4c","category":"Interdisciplinary"}