{"title":"Notes on Digital ID","link":"https://lewcpe.com/blog/archives/2253/notes-on-digital-id/","date":1616691989000,"content":"<p>นั่งอ่านเรื่อง Digital ID มาบ้าง ขอโน้ตเอาไว้ตรงนี้ก่อน</p>\n\n\n\n<p>เกาหลีใต้นับเป็นชาติที่ก้าวหน้าที่สุดมานาน ออก cert ใช้กันเป็นวงกว้าง (ออกไปแล้ว 15 ล้านใบ) แต่บทเรียนคือเกาหลีเลือกอิมพลีเมนต์ประหลาด ทำให้ต้องใช้ ActiveX/Java หน่วยงานราชการไม่อัพเดต สร้างปัญหาระยะยาว แทนที่จะปลอดภัยดันสร้างอันตรายหนักกว่าเดิม คนจะใช้งานต้องไปลง Antivirus เพิ่ม</p>\n\n\n\n<p>สุดท้ายเกาหลีใต้ยอมแพ้<a href=\"https://www.blognone.com/node/120040\"> เปิดให้เอกชนออก digital cert แทน</a> ปล่อยให้เก็บค่าธรรมเนียมได้ คิดว่าหวังว่าเอกชนจะแข่งกันเอง ไม่ดองระบบให้ล้าสมัยแบบรอบที่แล้วอีก แถมช่วงแรกทุกเจ้าที่เปิดมาฟรีหมด</p>\n\n\n\n<p>ออสเตรเลีย ไปท่าคล้ายๆ เกาหลีใต้ในปัจจุบัน ออก<a href=\"https://www.dta.gov.au/our-projects/digital-identity/trusted-digital-identity-framework\">มาตรฐาน TDIF</a> กำหนดว่าผู้ให้บริการยืนยันตัวตนต้องทำอะไรบ้าง  ตอนนี้ผู้ให้บริการหลักมีสองรายคือ myGovID และ Digital iD ของไปรณีย์ออสเตรเลีย (โดนวิจารณ์ว่าทำไมรัฐบาลต้องทำสองอันแข่งกันเอง) แม้ไปรษณีย์ออสเตรเลียจะกึ่งๆ เอกชนแต่ก็ถือว่าเป็นของรัฐอยู่ดี เลยกลายเป็นว่ารัฐทำสองอัน</p>\n\n\n\n<p>อ่าน TDIF แบ่งออกเป็น 4 หน้าที่ IdP เก็บข้อมูล, CSP ยืนยันตัวตน (งงว่าแยกทำไม <a href=\"https://dta-www-drupal-20180130215411153400000001.s3.ap-southeast-2.amazonaws.com/s3fs-public/files/digital-identity/Trusted%20digital%20identity%20framework%202/Overview%20and%20Glossary.pdf\">paper ก็บอกว่ารวมกันกับ IdP ได้</a>), IDX น่าจะคล้ายๆ NDID บ้านเรา, ASP คนเติมข้อมูล เช่น มหาวิทยาลัยสามารถส่ง transcript แนบไปกับตัวตนได้ แนวทางแบบนี้ทำให้เห็นชัดว่าใครจะเข้าไปต่อตรงไหนบ้าง ล่าสุด DocuSign ไปร่วมกับ Digital iD ยืนยันตัวตนในระดับสำคัญได้แทนที่จะใช้แค่อีเมล</p>\n\n\n\n<p>สิงคโปร์ใช้ท่าแบบเกาหลีใต้เดิม คือรัฐเหมาคนเดียวเป็นแบบ SingPass เหมาเรียบทุกอย่าง เดิมออกแบบมาเป็น single sign-on ของรัฐ (ทำ IdP+CSP) ทำไปทำมา<a href=\"https://www.singpass.gov.sg/myinfo/intro\">เพิ่ม MyInfo รวม ASP</a> เข้าไปในตัว <a href=\"https://www.blognone.com/node/112151\">แถมเปิดบริการเซ็นเอกสาร </a>กลายเป็น DocuSign เรียบร้อย แต่ก็เปิดให้เอกชนใช้งานด้วย ธนาคารดึงข้อมูลกันได้แล้ว</p>","author":"lewcpe","siteTitle":"LewCPE's Blog","siteHash":"be60e5c67c985916e913225e0fa8794018c33c335df997dc89cd85d60cc43d78","entryHash":"e7dcc245b36cd9fd232989363a646884a01e36c565855a1f2cf64a9e2d61295e","category":"Thai"}