{"title":"Svalt Debuts New Heatsink Cooling Docks for MacBook Pro","link":"https://www.macrumors.com/2023/08/01/svalt-heatsink-cooling-docks/","date":1690921693000,"content":"Dock and stand accessory company Svalt this month introduced three new cooling docks that are designed for Apple's line of MacBook Pro machines. The <a href=\"https://svalt.com/products/cooling-dock-dhcr\">Cooling Dock DHCR</a>, <a href=\"https://svalt.com/products/cooling-dock-dhc\">Cooling Dock DHC</a>, and <a href=\"https://svalt.com/products/cooling-dock-dhcx\">Cooling Dock DHCx</a> are designed to be used with Macs in clamshell mode.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/svalt-cooling-dock.jpg\" alt width=\"2533\" height=\"1425\" />\r<br />\nPriced between $220 and $280, the docks are carved from solid aluminum to transfer heat away from the MacBook's processor. Svalt says the docks have been designed with cooling fins, deep air channels, and a curving horizontal air channel, all of which pull heat away from the MacBook Pro.\r<br />\n\r<br />\nThe DHC model has a built-in fan at the back of the dock, while the other two versions have optional add-on accessory fans or can be used without a fan.\r<br />\n\r<br />\nThe dock is designed to position the laptop at the ideal angle for heat dissipation, and a protective edge and retention pad hold the machine in place. Apple silicon Macs aren't known for their heat, but Svalt claims that the dock is able to eliminate heat throttling and ensure that the MacBook Pro is able to reach peak performance when in clamshell mode.\r<br />\n\r<br />\nAccording to Svalt, the Cooling Docks are built to \"seamlessly merge\" with the built-in cooling systems of the 2021 to <a href=\"https://www.macrumors.com/guide/2023-macbook-pro/\">2023 MacBook Pro</a> models and \"all other Apple laptops from the last decade.\"\r<br />\n\r<br />\nMore information on the docks can be <a href=\"https://svalt.com/\">found on the Svalt website</a>.<br />This article, \"<a href=\"https://www.macrumors.com/2023/08/01/svalt-heatsink-cooling-docks/\">Svalt Debuts New Heatsink Cooling Docks for MacBook Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/svalt-debuts-new-heatsink-cooling-docks-for-macbook-pro.2397492/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e7e223f98cffa55211fa024742fa637e92298ba9314802c1a191ad96dfe8745b","category":"Apple"}