{"title":"Complete Genome Sequence of the Butirosin-producing Bacillus vitellinus NBRC 13296 and its reclassification to Paenibacillus chitinolyticus","link":"https://www.preprints.org/manuscript/202408.1120/v1","date":1723696084000,"content":"Butirosins are naturally occurring aminoglycoside (AG) antibiotics featuring a 4,5-disubstituted 2-deoxystreptamine (2-DOS) with a (2S)-4-amino-2-hydroxybutyrate (AHBA) side chain. This side chain has been shown to confer resistance against AG modifying enzymes, leading to ongoing studies on the butirosin biosynthetic pathway and the corresponding enzymes. Butirosin is produced by Niallia (formerly Bacillus) circulans and Bacillus vitellinus, with most research focused on the former strain. To date, no whole genome analysis has been performed on B. vitellinus. In this study, we sequenced the complete genome of B. vitellinus NBRC 13296 and performed a comparative analysis of different butirosin biosyntheric gene clusters (BGCs), including those from N. circulans. The complete genome of B. vitellinus NBRC 13296 comprises a 6,331,192 base circlular chromosome with a GC content of 52.68%. The annotation revealed the presence of 5,605 CDSs, 70 tRNA genes, 30 rRNA genes, and 3 ncRNA genes in NBRC 13296. The highest dDDH and ANI values between NBRC 13296 and the most closely related type strain, Paenibacillus chitinolyticus KCCM 41400, were 97.8% and 98.66%, respectively. Based on these genome-based comparative analyses, we propose reclassifying B. vitellinus NBRC 13296 as P. chitinolyticus. Genome mining revealed 18 gene clusters encoding the biosynthesis of diverse secondary metabolites in the genome of B. vitellinus NBRC 13296, indicating the enormous biosynthetic potential of this strain. The predicted structural diversity of secondary metabolites includes aminoglycoside, PKS, NRPS, PKS-NRPS hybrids, metallophores, phosphonates, terpenes, β-lactones, and RiPP peptides. We then comparatively characterized butorosin BGCs previously studied in several N. circulans strains. Additionally, comparative genome analysis revealed complete butirosin BGCs identified from P. chitinolyticus KCCM 41400, P. chitinolyticus NRRL B-23119, P. chitinolyticus NRRL B-23120, P. chitinolyticus B-14908, P. chitinolyticus YSY-3.1, P. chitinolyticus JMW06, Paenibacillus sp. GbtcB18, Paenibacillus sp. HGH0039, Paenibacillus sp. MZ04-78.2. Finally, we identified the core region consisting of BtrS, BtrN, BtrM, BtrL, BtrA, BtrB, BtrC, BtrD, BtrD, BtrE, BtrF, BtrG, BtrH, BtrI, BtrI, BtrJ, BtrK, BtrO, BtrP, and BtrV, followed by an upstream region organizing BtrQ, BtrW, BtrX, BtrY, and BtrZ in the same transcriptional direction and sequential genetic arrangement, and a downstream region organizing various proteins based on BtrT, BtrR2, BtrU, and BtrR1. Our study provided insights into the reclassification of B. vitellinus NBRC 13296 to P. chitinolyticus and suggested the need for continued studies on butirosin biosynthesis from an enzymatic perspective.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e7ef2625c01166d2e0436ed1d8ef5a838a62e41655c99035bf95038e0e54003f","category":"Interdisciplinary"}