{"title":"Strade Bianche Donne 2024: preview, contenders, and prediction","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-donne-2024-preview-contenders-and-prediction","date":1709107200000,"content":"\n      <p>In the nine years since it was first run in 2015, Strade Bianche Donne has quickly grown to become one of most acclaimed races of the season. Everyone who’s anyone has won here, with the likes of Annemiek van Vleuten, Anna van der Breggen, Lizzie Deignan and Elisa Longo Borghini all gracing the honours board, and most recently the two new superstars of the peloton, Demi Vollering and Lotte Kopecky.</p>\n<div></div>\n<div></div>\n<p>Its status comes partly from the singular challenge posed by its gravel roads, which makes it among the very hardest Classics on the calendar, and this year it’s set to be even more demanding. Four more gravel sectors have been added, as a consequence of an extra loop that has been included in the finale that will see the Colle Pinzuto and Le Tolfe taken on twice, increasing the total number to twelve. Given the carnage of previous editions, which have always been very selective, the time gaps this year in light of the new route could be big.</p>\n<h3>Route</h3>\n<p>In each of the last four editions of <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche Donne</a>, the winner has ultimately been decided by the final climb of Via Santa Caterina that takes the riders to the finish at Piazza del Campo. Last year the SD Worx duo Demi Vollering and Lotte Kopecky caught and passed early attacker Kristen Faulkner on it, before taking part in a confused intra-team sprint won by the latter; Kopecky got the better of Annemiek van Vleuten in a two-up sprint up the climb the year before; in 2021, Chantal van den Broek-Blaak used the climb’s steepest slopes to drop Elisa Longo Borghini and solo to the finish; and in 2020 Van Vleuten took victory by dropping early attacker Mavi García on the climb.</p>\n<p>These have all been close races that have gone down to the wire, but the severity of the new route may mean the decisive race-winning move is made earlier this year. In total there will be 40km of gravel roads, making up almost a third of the race’s 137km duration. After four early gravel sectors to test the legs and begin to wear down the riders, the serious action is likely to kick-off about 75km from the finish on the San Martino in Grania, the longest (9.5km) and probably most recognisable sector of the race, made all the more difficult by its steep gradients.</p>\n<p>This is where the first significant selections are likely to be made, but those with their eye on victory will have to keep plenty in the tank to take on the seven sectors still to come after. These sectors are all much shorter, with the longest (Vico d’Arbia, the third-to-last sector) lasting just 3.3km, but most feature some vicious gradients to provide potential launchpads for attacks. Colle Pinzuto and Le Tolfe have been given particular prominence by each now being tackled twice, and, given the relative difficulty, the twelve kilometres between the top of the final ascent of the latter and the finish at Piazza del Campo could, contrary to recent editions, see the victor already out in front alone.</p>\n<h3>Contenders</h3>\n<p><strong>Demi Vollering</strong></p>\n<p>Last year, Demi Vollering’s annus mirabilis began with a victory at Strade Bianche, a result that initiated a remarkable run of results that saw her dominate the spring without finishing outside of the top two in any of her subsequent six Classics appearances. A repeat of that near-perfection is a lot to ask, but a defence of her Strade Bianche title is certainly on the cards, especially given how the severity of the climbing makes it one of the Classics best suited to her attributes.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_0964_c4ae1d42-d6ca-43fc-96f0-809e4a2e6408_1024x1024.jpg?v=1709052453\" alt=\"Demi Vollering Strade Bianche\" /></div>\n<p><strong>Lotte Kopecky</strong></p>\n<p>Ominously for the rest of the peloton, Lotte Kopecky has already opened her account for the 2024 season in terrain that’s not supposed to suit her, winning the mountain top finish of Jebel Hafeet at the UAE Tour, where she also did sterling work as a domestique to lead out Lorena Wiebes for two sprint wins. By contrast, Strade Bianche is clearly in her wheelhouse, and she would have won a second successive edition last year were it not for a late lunge to the line from her teammate Demi Vollering. Though her rivals would have taken heart from the way she proved to be <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad-why-voss-victory-shows-sd-worx-dominance-will-be-tough-to-maintain-in-2024\">beatable at Saturday’s Omloop Het Nieuwsblad</a>, where she finished second behind Marianne Vos, she still looks in very good form.</p>\n<p><strong>Kasia Niewiadoma</strong></p>\n<p>There was a time when Kasia Niewiadoma (Canyon-SRAM) seemed right on the brink of claiming a Strade Bianche title, during a four year stretch between 2016 to 2019 in which she finished on the podium in successive editions, but her form here has tailed off in recent years, with fourth-place in 2022 her best since.<img alt=\"Kasia Niewiadoma\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_8428_1024x1024.jpg?v=1709052426\" /></p>\n<p>That decline also coincided with a frustrating time in which she went over four years without winning any race, an implausibly long barren run that at last came to an end last autumn when she triumphed at the Gravel World Championships. As well as getting the winless monkey off her back, her success there reiterates her aptitude for rough road surfaces like those at Strade Bianche, and she’s one of the riders who will likely benefit from the tougher parcours this year.</p>\n<p><strong>Shirin Van Anrooij</strong></p>\n<p>The 2023 spring was a breakthrough campaign for Shirin Van Anrooij (Lidl-Trek), and, if her performance on Saturday’s Omloop Het Nieuwsblad is anything to go by, she might be poised to make another leap. In that race she was one of only three riders to follow the vicious attacks of SD Worx’s Lotte Kopecky in the finale, and though she didn’t ultimately have the legs to finish higher than fourth, the performance bodes very well for the rest of her spring. She skipped Strade Bianche last year, but ninth here in 2022 on debut suggests she can handle the dirt roads.</p>\n<p><strong>Puck Pieterse</strong></p>\n<p>At last year’s Strade Bianche, a 20-year-old Puck Pieterse (Fenix-Deceuninck) was the revelation of the race, finishing fifth despite having barely ridden on the road before, only to withdraw from the road for the rest of the year to concentrate on mountain biking and cyclocross. Anticipation has therefore been ripe as she returns to the road ahead of what is set to be a fuller programme in 2024, especially given the form she showed during a cyclocross campaign that culminated in her claiming bronze at the World Championships. Nobody knows what quite to expect, but the ceiling is high from a talent as prodigious as her’s, and eighth at Omloop Het Nieuwsblad followed by 10th at Omloop van het Hageland over the weekend was a promising start.</p>\n<p><strong>Other contenders</strong></p>\n<p>A resurgent Marianne Vos (Visma-Lease a Bike) catapulted herself to among the top favourites for the win at Strade Bianche following a brilliant win at Omloop Het Nieuwsblad, where she was both sprinting and climbing at her best again. Her record at Strade Bianche isn’t great, having never before finished higher than sixth in any of her previous five attempts, but the veteran is always a menace when in this kind of form.</p>\n<p>Lidl-Trek have yet to announce their full line-up for the race following their very impressive ride at Het Nieuwsblad, but you’d expect Elisa Longo Borghini to ride given her form in that race, and to be a contender for victory having won here previously and made the podium three other times. Similarly, Kristen Faulkner (EF Education-Cannondale), but is also in terrific form following her long-range victory at Omloop van het Hageland and has unfinished business with Strade Bianche after her podium finish from last year was overturned due to her wearing a banned glucose monitor.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-02651_1024x1024.jpg?v=1709052327\" alt=\"Elisa Longo Borghini\" /></p>\n<p>Mavi García (Liv Alula Jayco) is another rider who has had some joy by attacking long-range at Strade Bianche when doing so earned her a runner-up finish at the 2020 edition, and her rivals will therefore be wary of giving her leeway this year. Silvia Persico (UAE Team ADQ) can be an unpredictable rider, but a real candidate if on a good day, while this will be the last Strade Bianche in the career of Ashleigh Moolman (AG Insurance-Soudal Team) before retires, a race she relishes the climbing in and was third at a couple of years ago.</p>\n<h3>Prediction</h3>\n<p>Despite being defeated on Saturday at Omloop Het Nieuwsblad, SD Worx are still the team to beat at a race they’ve won for three consecutive years. The question is which of their co-leaders Demi Vollering and Lotte Kopecky will be the strongest? Kopecky might have gone better at the weekend, but the hilly terrain makes this a race better suited to Vollering, who we’re backing to defend her title.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e800271e07d9508c4a128f1d4bcde995b66a11a2ff062992e32c3c3064d33157","category":"Cycling"}