{"title":"Dopamine-derived pigments in nature: identification of decarboxybetalains in Amaranthaceae species","link":"https://academic.oup.com/plphys/article/196/1/446/7686996?rss=1","date":1717372800000,"content":"<span><div>Abstract</div>A unique family of decarboxylated betalains derived from dopamine has recently been discovered. Due to the lack of chemical standards, the existence and distribution of decarboxylated betalains in nature remain unknown. Traditional betalains contain <span>L-</span>dihydroxyphenylalanine as the starting point of the biosynthetic pathway and betalamic acid as a structural and functional unit, while the recently discovered betalains rely on dopamine. Here, 30 dopamine-derived betalains were biotechnologically produced, purified, and characterized, creating an unprecedented library to explore their properties and presence in nature. The maximum absorbance wavelengths for the pigments ranged between 461 and 485 nm. HPLC analysis showed retention times between 0.6 and 2.2 min higher than traditional betalains due to their higher hydrophobicity. The presence of decarboxybetalains in nature was screened using HPLC-ESI-Q-TOF mass spectrometry in various species of the Amaranthaceae family: beetroot (<span>Beta vulgaris</span> subsp. <span>vulgaris</span>), Swiss chard (<span>B. vulgaris</span> var. <span>cicla</span>), celosia (<span>Celosia argentea</span> var. <span>plumosa</span>), and quinoa (<span>Chenopodium quinoa</span>). The latter species had the highest content of decarboxybetalains (28 compounds in its POEQ-143 variety). Twenty-nine pigments were found distributed among the different analyzed plant sources. The abundance of decarboxybetalains demonstrated in this work highlights these pigments as an important family of phytochemicals in the order Caryophyllales.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"e80342835f4b3519ab05dc52ca67dd36483704af20c0e543a972ba7e2670da5a","category":"Environment"}