{"title":"Ripening Stage in Mechanical Properties of Chopin Apples for FEM Model Construction","link":"https://www.preprints.org/manuscript/202409.0825/v1","date":1726050887000,"content":"Most available studies on the mechanical properties of apples lack the comprehensive results needed for the construction and validation of FEM models. Researchers typically focus on either the flesh and epidermis or the whole fruit, often overlooking the maturity stage of the examined apples. They usually report only firmness or the starch index as indicators of maturity. Furthermore, many studies use store-bought apples, which is impractical for industrial applications since this fruit have already undergone various treatments before reaching the shelf. This article aims to determine the mechanical properties of apples necessary for constructing FEM models that are both adequate and useful for the industry. The new Polish apple variety, Chopin, was selected as the research material. The study was conducted for three stages of apple maturity: development, ripening, and senescence. Mechanical properties of the flesh and skin were determined as material data for FEM models. Force-displacement curves and pressure-force functions were examined for future model validation. Using micro-computed tomography, the bruise volumes of fruit subjected to 20%, 50%, and 80% of the destructive force were determined. Significant differences were found between apples in the senescence stage and those in the development and ripening stages. Results of Micro-Ct and the results of modified and real compression tests of whole fruit have allowed us to formulate the research hypothesis regarding the influence of flesh cracking (characterized by local drops of force), influencing the bruise visibility and detection.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e807ab173388e8f7ad0be2350739b854afaa2f3eb7f1b9ea6ce299612f3c969e","category":"Interdisciplinary"}