{"title":"PSII-15 Comparative analysis of equine diets on growth metrics and economic feasibility","link":"https://academic.oup.com/jas/article/102/Supplement_3/624/7757832?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The objective of the study was to assess the impact of two commonly available low non-structural carbohydrate equine diets on growth parameters and economic factors in young growing horses. To do this, young stock type horses n = 11; 6 fillies, 5 colts; body weight (BW) = 380.3 ± 15 kg] were separated into two groups that were balanced by age, sex, and BW. All horses were backgrounded for 14 d on a hay-only diet prior to the beginning of the study. Additionally, each group was assigned to one of two dietary treatments fed at 0.75% BW/d (as fed) twice daily in 12 h intervals for 56 d. Dietary treatments consisted of a leading national brand feed (n = 5) and Thomas Moore Calm and Safe (n = 6). Horses were allowed ad libitum access to Coastal bermudagrass (<span>Cynodon dactylon</span>) hay and fresh water. For the 56-d period, horses were exercised at a light workload for 30 min/d and 4 d/wk. For all growth measurements, a baseline measurement was recorded per horse. Growth measurements were then recorded at 7 d intervals. Data from these growth measurements were analyzed using PROC MIXED in SAS v9.4 with the fixed effects of day and diet. Growth metrics increased on all horses throughout the length of the trial regardless of dietary treatment (<span>P</span> ≤ 0.01), which is expected from young growing horses. A Diet x Day trend towards significance (<span>P</span> = 0.075) was observed for BW, as the leading national brand feed dietary treatment group tended to have heavier BW than the Thomas Moore Calm and Safe during the duration of the study. Additionally, body fat percentage was greater (<span>P</span> = 0.04) in the national leading brand feed group compared with the Thomas Moore group. None of the remaining growth metrics had any statistical difference across diets. Furthermore, there was no difference in dietary intake between dietary groups (<span>P</span> &gt; 0.5). These results suggest that the Thomas Moore Calm and Safe concentrate serves as a good alternative and economically friendly for young growing horses when compared with more traditional feeds currently on the market.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e80c19d88976d8241cf777c4898ef8d1f5146368a6aeec2afba48e1b846b7cf6","category":"Environment"}