{"title":"‘Now we have to fight to get selected for the Classics’ - Iván Cortina on Movistar’s modernisation and Classics success","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/now-we-have-to-fight-to-get-selected-for-the-classics-ivan-cortina-on-movistar-s-modernisation-and-classics-success","date":1680973934000,"content":"\n      <p><span>Once a team purely associated with the high mountains and stage races, 2023 has marked a clear shift for Movistar. Gone are the days of them bringing a team of resentful climbers to the cobbled Classics simply because they were required to do so as a WorldTour team, now we are seeing the blue jerseys of the Spanish squad at the front of some of the toughest one-day races in the world.</span></p>\n<div></div>\n<p><span>The breakthrough result was at E3 Saxo Classic, when Matteo Jorgenson and Iván Cortina finished fourth and fifth respectively in the race which is known as a mini Tour of Flanders. The two riders made up the positions behind The Big Three, Tadej Pogačar, Wout van Aert and Mathieu van der Poel – a feat unprecedented in Movistar’s history in the sport.</span></p>\n<p><span>“That was amazing, that is where I want to be in that position, fighting with the three superstars is hard but to be there in fourth and fifth place with both guys from the team is a victory in this case, that’s where I want to be and I’ll keep fighting for that,” Cortina says, looking back on his best ever result in a Classic.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-00782_1024x1024.jpg?v=1680973454\" alt />The 27-year-old explains that the last few years have seen a real shift from Movistar in regards to the one-day races, with a young group of riders pushing for modernisation and change.</span></p>\n<p><span>“The Classics group is a good group, everybody's young. A few years ago Movistar wouldn't go to the Classics because they had no riders. Now it's almost a fight to go to the Classics. Many riders want to go, that's good because if you go to these races and you don't want to really do them, this is super hard. It changes your mentality if you like the race and you are going to enjoy it and do your best,” he says.</span></p>\n<p><span>A few days after Jorgenson and Cortina’s impressive performance at E3 Harelbeke, their teammate, 23-year-old Oier Lazkano, finished in second place in Dwars door Vlaanderen, another unexpected result for the Spanish team. </span></p>\n<p><span>“We also had Oier with the second place in Dwars door Vlaanderen. Since the first year I’ve come here, now it is different with the materials and tyres, I did push quite a bit to improve that,” Cortina says.</span></p>\n<p><span>Looking ahead to <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-2023-contenders-and-predictions\">Paris-Roubaix</a>, Cortina explains he is confident in the team’s abilities after they have put a real effort into optimising their set-up for the hellish cobbles of Northern France. </span></p>\n<p><span>“We need to have someone in the break, this is quite important because if a rider like Oier could get in the break, for example, he can go to the finish. For me I’ll wait and find a good moment to move and anticipate,” Cortina explains.</span></p>\n<p><span>“If you move right and you have a bit of luck, there are ways you can be in a group in the front. I’ll do my best, give one hundred percent, then there’s nothing else you can do.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Roubaix-1558_1024x1024.jpg?v=1680973471\" alt />Cortina says that the Tour of Flanders was a success for the team as preparation for Roubaix, but explains that he thinks he is still a long way off racing against the Big Three who dominated the race.</span></p>\n<p><span>“If I want to win these races, I think it must be because of problems for others. If you have a one on one fight it would be super difficult because they have a different power,” Cortina says. “When Van der Poel attacked in E3 Harelbeke I was attacking as hard as I could, full gas at 700 watts for almost one minute and Van der Poel just passed me super easy.”</span></p>\n<p><span>“Flanders this year was crazy. I'm 27 years old, but I was the oldest of the team. We had a 19-year-old with Iván Romeo. When it is your first Flanders or first Roubaix everything is amazing, I was in the middle of the race after 100km and the break still hadn’t gone yet, I said to him, this is not normal.”</span></p>\n<p><span>Cortina notes the rapidly changing pace of the WorldTour peloton, something he has noted even in his relatively short career with Movistar so far. With the racing constantly getting faster, Cortina says that crashes are a far more common occurrence.</span></p>\n<p><span>“I’ve been a professional for seven years in the WorldTour and there’s a big difference from when I started, now we go really fast every race so you have less time to react and for example. The speed combined with these risks to get in front creates more crashes,” he says.</span></p>\n<p><span>The Spanish rider is aware that there will be huge risks at Paris-Roubaix this weekend, especially with the slippery and treacherous nature of the cobblestones. However, he comments that it is his dream to take victory in the Hell of the North, and will keep trying throughout his career. With Movistar’s bolstered Classics unit and added attention to detail when it comes to equipment, could this be the year of Spanish victory in a one-day cobbled Classic?</span></p>\n<p><span>“These will always be my favourite races that I love and I feel a passion for,” Cortina says. “Roubaix is the race I want to win once in my career.”</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e80de8aec7943ad3e12cbb4cbc2deb1b2b98f46170b9d56e9c3332fba5653423","category":"Cycling"}