{"title":"Nanoleaf's Matter Essentials Lights Now Available for Pre-Order","link":"https://www.macrumors.com/2023/03/22/nanoleaf-matter-preorder/","date":1679493600000,"content":"Nanoleaf today <a href=\"https://nanoleaf.me/en-US/products/essentials/\">began accepting pre-orders</a> for its Matter-enabled Essential lights, which are designed to work with <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a>, Google Home, Amazon Alexa, and more through the Matter cross-platform smart home connectivity standard.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/nanoleaf-matter.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nMatter-compatible Essential bulbs that include the A19 and BR30 are available, as is the Essential Lightstrip that works with Matter. Matter is a new smart home standard and is still rolling out, so these are some of the first lighting products that have native Matter support.\r<br />\n\r<br />\nFor ‌HomeKit‌ users, Matter works the same as ‌HomeKit‌ devices, but it connects through Matter instead of ‌HomeKit‌. That doesn't mean much for someone who has an all-HomeKit setup, but for households with multiple smart home platforms or different smartphone brands, it means the Matter lights can be controlled from any device. Both Android and <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users can control a Matter-enabled Nanoleaf light from their respective devices, provided the proper hub setup is available.\r<br />\n\r<br />\nThe new Nanoleaf Essentials lights work with Matter over Thread for an improved connectivity experience with other Thread devices. Nanoleaf's bulbs and lightstrip can be set to any one of 16 million colors or can be used to provide different shades of white lighting.\r<br />\n\r<br />\nEssentials lights with Matter support can be controlled from any smart home app, such as the Home app or the Nanoleaf app. The Nanoleaf app offers useful scene setups for working, evening ambiance, and more, and it provides an option to have the color temperature of the light shift throughout the day.\r<br />\n\r<br />\nMatter-enabled Nanoleaf lights can be <a href=\"https://nanoleaf.me/en-US/products/\">ordered from the Nanoleaf website</a>, with prices ranging from $20 to $50. The A19 bulb and Lightstrip are available for preorder today, while the BR30 is coming in April. Later this year, Nanoleaf will provide a GU10 light and a Recessed Downlight.\r<br />\n\r<br />\nNanoleaf is also working on an over-the-air update to add Matter to its existing line of light panels and light bars.<br />This article, \"<a href=\"https://www.macrumors.com/2023/03/22/nanoleaf-matter-preorder/\">Nanoleaf's Matter Essentials Lights Now Available for Pre-Order</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/nanoleafs-matter-essentials-lights-now-available-for-pre-order.2384435/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e821da9c200cb506096ca09d84d046699bbb116f7256c0e67610346ad045e8b5","category":"Apple"}