{"title":"Estimating Carbon Stock in Unmanaged Forests Using Field Data and Remote Sensing","link":"https://www.preprints.org/manuscript/202409.0536/v1","date":1725617223000,"content":"Unmanaged forest ecosystems play a critical role in addressing the ongoing climate and biodiversity crises. As there is no commercial interest in monitoring the health and development of such inaccessible habitats, low-cost assessment approaches are needed. We used a method combining RGB imagery acquired using an Unmanned Aerial Vehicle (UAV), Sentinel-2 data and field surveys to determine the carbon stock of an unmanaged forest in the UNESCO World Heritage Site wilderness area Dürrenstein-Lassingtal in Austria. The entry-level consumer drone (DJI Mavic Mini) and free of charge Sentinel-2 multispectral datasets were used for the evaluation. We merged the Sentinel-2 derived vegetation index NDVI with aerial photogrammetry data and used an orthomosaic and a Digital Surface Model (DSM) to map the extent of woodland in the study area. The Random Forest (RF) Machine Learning (ML) algorithm was used to classify land cover. Based on the acquired field data, the average carbon stock per hectare of forest was determined to be 371.423 ± 51.106 t of CO2 and applied to the ML-generated classification. An overall accuracy of 80.8% with a Cohen’s kappa value of 0.74 was achieved for the land cover classification, while the carbon stock of the living Above-Ground Biomass (AGB) was estimated with an accuracy of -1.0% (± 5.9%). In conclusion, the proposed approach demonstrated that the combination of low-cost remote sensing data and field work can predict above-ground biomass with high accuracy. The results and the estimation error distribution highlight the importance of accurate field data.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e82dfa423bc9c884c0badc5119fb4a9bd61929da48c23a11ff4c19409287c34d","category":"Interdisciplinary"}