{"title":"Colnago launches limited-edition $16,339 Tour de France bike","link":"https://www.bikeradar.com/news/colnago-tour-de-france-bike/","date":1622555431000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Colnago_V3Rs-TDF_front-1c87190.jpg?quality=90&amp;resize=620,413\" />                                            <p>Colnago has announced a limited edition version of its V3Rs road bike to mark the 108th edition of the <a href=\"https://bikeradar.com/events/tour-de-france\" target=\"_blank\">Tour de France</a> with an impressive £11,090 / $16,339 price tag.</p>\n<p>Made in collaboration with race organisers ASO (Amaury Sport Organisation), the bike is said to be the “first official bicycle in the history of the Tour de France”.</p>\n<p>The disc-equipped Colnago V3Rs is limited to just 108 bikes, one for every Tour since the race’s inception in 1903.</p>\n<p>The bike pays tribute to the Tour de France with a colour scheme that references the yellow of the race leader’s jersey but is for the most part black.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The seat tube on the limited-edition V3Rs has an outline of France.</span></figcaption><span> <i>Colnago</i></span></div>\n<p>Graphics on the frame also mark this out as a Tour de France special edition. The race logo is printed on the fork and top tube, while at the top of the rear triangle is an outline of France with the words “V3Rs winner of the 2020 Tour de France” inside – in honour of <a href=\"https://www.bikeradar.com/features/pro-bike/pogacar-bennett-bikes-paris/\" target=\"_blank\">Tadej Pogačar’s</a> victory at last year’s edition, where UAE Team Emirates riders rode the Colnago V3Rs.</p>\n<h2>The greatest bike for the greatest race?</h2>\n<p>Laurent Lachaux, head of commercial at ASO, says that ASO is happy to have found a licensee for an official Tour de France bike in Colnago as the company is “part of the history of the Tour de France” as well as Colnago bikes being “universally recognized as amongst the most technical and well-designed in the world”.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The bike is limited to 108 frames, one for every edition of the Tour de France.</span></figcaption><span> <i>Colnago</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/reviews/colnago-v3rs-review/\">Colnago V3Rs</a> was launched in 2019 as a successor to Colnago’s V2-R. Claimed to be lighter and stiffer than the V2-R, the bike ticks all the modern superbike requirements: it is available in a disc-specific model, it can take wider 30mm tyres and it has hidden cables and hoses.</p>\n<p>This limited-edition version is equipped with other Tour de France licensee brands: Selle Italia and Continental. Selle Italia provides the SLR Boost Carbon Superflow saddle and Continental provides the <a href=\"https://www.bikeradar.com/reviews/components/tyres/road-bike-tyres/continental-grand-prix-5000-clincher-tyre-review/\">Grand Prix 5000 tyres</a>.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Even the bike’s saddle points out it is a special-edition build.</span></figcaption><span> <i>Colnago</i></span></div>\n<p>The rest of the bike is decked out with Bora Ultra WTO DB wheels and a Deda Elementi Alanera DCR integrated monocoque carbon-fibre handlebar.</p>\n<p>The groupset is Campagnolo’s 12-speed Super Record EPS Disc, with its right lever in yellow to match the rest of the bike.</p>\n<h2>Will Colnago claim another Tour de France win with Tadej Pogačar?</h2>\n<p>The 2021 Tour de France starts in a matter of weeks on 26 June and, having snatched the 2020 edition of the race from Primož Roglič on the final time trial, Tadej Pogačar will return to the Tour de France to defend his title.</p>\n<p>This year’s <a href=\"https://www.bikeradar.com/news/2021-tour-de-france-route/\">Tour de France route</a> features plenty of climbing, including a double ascent of Mont Ventoux, but it also features 58km of time trials – the most the race has seen since 2013 – which might not favour Pogačar.</p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"e83694c4f358b55334bc46b0dcb2d21285e4c89d06f79b537689177eb58c5f90","category":"Cycling"}