{"title":"Feasibility Assessment of Wind Energy Study in Selected Districts of North Shewa Zone, Amhara, Ethiopia","link":"https://www.preprints.org/manuscript/202405.0764/v1","date":1715591919000,"content":"In this paper, the feasibility and potential assessment (PA) of wind power in six different areas MehalMeda, Eneware, DebreBerhan, AlemKetema, GundoMekel, and Majet are investigated. The data is collected from the National Metrological Agency (NMA) in Addis Ababa and from the districts of the case study areas and analyzed using MATLAB and HOMER software. Using the data collected at 10 meter height, wind direction using a wind rose, the wind frequency distribution, and wind turbine characteristics have been analyzed. Moreover, to obtain a more realistic wind potential study, the wind speed at a 10 meter height is extrapolated to a height of 50 meter in order to determine wind speed, wind power density, and wind energy density. The average wind speed of the zone at 10m and 50m heights are 1.58 m/s and 1.99 m/s, 3.06 m/s and 3.85 m/s, 4.75 m/s and 5.98 m/s, 2.29 m/s and 2.88 m/s, 1.01 m/s and 1.27 m/s and 4.07 and 5.12m/s at Alemketema, Debreberhan, Eneware, Gundemeskel, Majete and Mehalmeda respectively. The extrapolated result shows that the maximum wind speed and power densities at a height of 50 meter for Eneware, MehalMeda and Debre Berhan are 10.4 m/s, 689 W/m2, 8.9m/s, 429 W/m2 and 6.3m/s, 152.2 W/m2 respectively. The energy densities at a height of 50 meter for AlemKetema, DebreBerhan, Eneware, GundoMekel, Majete, and MehalMeda are 181.06 kWh/m2*yr , 1332.83 kWh/ m2*yr, 6078.91 kWh/ m2*yr, 857.76 kWh/ m2*yr, 58.78 kWh/ m2*yr, and 3939.42 kWh/ m2*yr respectively. As per the international standard for wind power and wind speed classification, considering the extrapolated height, Eneware, MehalMeda, and DebreBerhan have feasible wind potential for both small-scale and large-scale wind farm implementation, whereas Majete, AlemKetema, and GundoMeskel of the North Shewa Zone in the Amhara region have poor wind potential.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e8362ee48edc6c11304a528ac6134f0a1b71f60169221d3c01c33051af58ff0a","category":"Interdisciplinary"}