{"title":"Chromebook demand is plummeting as the pandemic eases","link":"https://arstechnica.com/?p=1799337","date":1632930878000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/XE930QCA_012_R-Perspective_Red-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/XE930QCA_012_R-Perspective_Red.jpg\">Enlarge</a> <span>/</span> The 2020 Samsung Galaxy Chromebook, which had a 4K OLED display.  (credit: Samsung)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>A global deceleration of laptop sales is being linked in <a href=\"https://www.trendforce.com/presscenter/news/20210928-10953.html\">a new report</a> from market research firm Trendforce to increasing vaccination rates and a corresponding decrease in remote work and remote learning. According to the findings, demand for Chromebooks slid by over 50 percent during one month since July. And notebook shipments for the remainder of the year are expected to be affected by the COVID-19 pandemic and the shifting demand from businesses.</p>\n<p>Trendforce said that interest for ChromeOS-powered laptops within the last year had primarily been driven by remote learning. The analyst pointed to rising vaccination rates in North America, Europe, and Japan throughout the second half of 2021 as recently slowing demand for Chromebooks.</p>\n<p>After being a “primary driver” of overall laptop shipments in the first half of 2021, Chromebook shipments dropped by over 50 percent during one month in the second half of the year. And because Chromebooks represent a “relatively high share” of HP's and Samsung’s overall laptop shipments, the OEMs’ shipments are predicted to fall by 10 to 20 percent from the first half of the year to the second half.</p></div><p><a href=\"https://arstechnica.com/?p=1799337#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1799337&amp;comments=1\">Comments</a></p>","author":"Scharon Harding","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e8370a91ccb640a9e3ae8568b4bc7e83484be069390e73428e08c36a6d59b4df","category":"Tech"}