{"title":"Investigation of biofluorescence produced by the red king crab Paralithodes camtschaticus","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.159?af=R","date":1711178610000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/5db5ef2f-18a8-4bc6-a0a3-bf6e4c20852f/aff2159-gra-0001-m.png\" alt=\"Investigation of biofluorescence produced by the red king crab Paralithodes camtschaticus\" />\n<p>After observing that the king crab Paralithodes camtschaticus biofluoresces, we carried out studies on two separately maintained groups of male crabs under controlled conditions. Hyperspectral imaging on group 1 (n = 18) examined the exoskeleton whereas fluorospectrometry examined the hemolymph of group 2 animals (n = 19). The results presented in this study indicate that king crab fluorescence changes due to external stimuli.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Biofluorescence is widely documented in marine organisms, yet few studies exist for decapods. After observing the king crab <i>Paralithodes camtschaticus</i> biofluoresces, we carried out studies on two separately maintained groups of male crabs under controlled conditions. Hyperspectral imaging on Group 1 (<i>n</i> = 18) examined the exoskeleton, whereas fluorospectrometry examined the hemolymph of Group 2 animals (<i>n</i> = 19). Both groups were investigated for fluorescence signals before and after exposure to a live shipping transportation simulation. The spines, chelae, eyestalks and cervical grooves of the cardiac region of <i>P. camtschaticus</i> fluoresce in the green spectra (∼500 nm), while the arthrodial membranes of the joints fluoresce in the red spectrum (∼680 nm). After the shipping simulation, we observed a significant decrease in fluorescence in the eyestalks (<i>p</i> = 0.009), while the cervical grooves showed a less significant change (<i>p</i> = 0.01). The hemolymph examined with 21 excitation wavelengths (250–350 nm) emitted fluorescence in ∼400–550 nm spectrum. We found a significant increase (<i>p </i>&lt; 0.05) in fluorescence for 16 excitation wavelengths after transport simulation. The results presented in this study indicate that king crab fluorescence changes due to external stimuli. Fluorospectroscopy or hyperspectral imaging technology may serve as an effective early indicator of preclinical stress in these commercially important decapods.</p>","author":"Thomas Juhasz‐Dora, \nTina Thesslund, \nJulie Maguire, \nThomas K. Doyle, \nStein‐Kato Lindberg","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"e838994b6133d1277e621785778262f73742dcbe8127ef6351f55db14e087c84","category":"Environment"}