{"title":"TikTok เปิดให้สร้างวิดีโอสติกเกอร์ GIF ใช้ส่ง DM ถึงกันได้","link":"https://www.blognone.com/node/133401","date":1681318245000,"content":"<div><div><div><p>TikTok เปิดตัวฟีเจอร์สติกเกอร์ GIF ที่ให้ผู้ใช้สามารถนำคลิปวิดีโอใน TikTok มาสร้างเป็นสติกเกอร์เพื่อเพิ่มความสนุกในการส่ง DM หาเพื่อน โดยต่อยอดมาจากก่อนหน้านี้ที่ TikTok เปิดให้สร้างสติกเกอร์แบบ GIF ผ่านการอัปโหลดรูปภาพหรือคลิปวิดีโอ</p>\n<p>ขั้นตอนในการสร้างสติกเกอร์จากคลิปวิดีโอที่มีอยู่เพียงแค่ไม่กี่ขั้นตอน เริ่มแรกกดเข้าไปหน้าแชท และกดเลือกที่สติกเกอร์ คลิกไปที่ Create New Stickers โดยวิดีโอที่นำมาสร้างเป็นสติกเกอร์สามารถเลือกได้จากหลายช่องทางเช่น คลิปวิดีโอที่เรากด Like, Post หรือ Favorites ไว้ใน TikTok</p>\n<p>ซึ่งคลิปวิดีโอเราเลือกสามารถนำมาปรับขนาดหรือตัดเลือกส่วนที่เราต้องการได้ นอกจากนี้ยังสามารถเพิ่มข้อความลงไปในสติกเกอร์ได้เช่นกัน เมื่อทำเสร็จแล้วก็เลือกว่าจะบันทึกสติกเกอร์ที่สร้างลงใน Sticker Store เพื่อเปิดให้ผู้อื่นสามารถค้นหาและใช้สติกเกอร์วิดีโอนี้ได้หรือกดปิดเพื่อใช้ส่วนตัว แต่ถ้าใครไม่อยากสร้างวิดีโอสติกเกอร์เองก็สามารถเลือกจากสติกเกอร์ที่คนอื่นสร้างภายในแอปฯ ได้</p>\n<p>TikTok พัฒนาฟีเจอร์นี้ขึ้นมาเพื่อต้องการให้ผู้ใช้เกิดการสื่อสารภายใน DM ของ TikTok มากขึ้น โดยถ้าเทียบกับแพลตฟอร์มคู่แข่งอย่าง WhatsApp, Messenger และ Instagram ก็มีสติกเกอร์ที่ผู้ใช้สามารถส่งถึงกันได้ จึงไม่แปลกใจที่ TikTok เพิ่มฟีเจอร์นี้ขึ้นมาโดยต่อยอดจากจุดเด่นของแอปฯ ในเรื่องของวิดีโอ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/d28e572f3cb95c65d413ccff05b87165.png\" /><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/6387da5fce11a126c49dd7a28cea817b.png\" /></p>\n<p>ที่มา: <a href=\"https://techcrunch.com/2023/04/11/tiktok-quietly-launched-a-gif-like-video-stickers-feature-for-direct-messages/\">Techcrunch</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tiktok\">TikTok</a></div><div><a href=\"/topics/gif\">GIF</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e847ffcf7b9a0182d6470a1bd4af89ca56e9736ed9378ef743bbc33e58b6659f","category":"Thai"}