{"title":"Make your own homemade energy bars for cycling | 3 easy-to-follow recipes","link":"https://www.bikeradar.com/advice/nutrition/make-your-own-energy-bars/","date":1639908000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/12/CYP387_300921_ss0063edit-8bd6927.jpg?quality=45&amp;resize=620,413\" />                                            <p>While there are plenty of delicious, nutritious and energy-dense readymade cycling food options available these days, you can save money and do away with often non-recyclable packaging while you’re at it by making your own tasty energy snacks.</p>\n<p>These recipes are simple, delicious and packed full of natural goodness – perfect for keeping your energy levels up as you ride.</p>\n<p>To keep your bars fresh (and your environmental credentials in check) we recommend storing all of these bars in a reusable beeswax wrap – check out a guide on <a href=\"https://www.gathered.how/arts-crafts/how-to-make-beeswax-wraps/\" target=\"_blank\">how to make your own beeswax wraps on our sister site, Gathered</a>.</p>\n<p>If you are trying out a <a href=\"https://www.bikeradar.com/advice/nutrition/can-a-vegan-diet-work-for-cyclists/\" target=\"_blank\">vegan diet</a>, check out our guide to <a href=\"https://www.bikeradar.com/advice/nutrition/vegan-cycling-snack-recipes/\" target=\"_blank\">six delicious vegan energy snacks</a> you can make at home.</p>\n<h2>Chocolate, chia and sweet potato brownies</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> These brownies are packed with vitamin A and fibre.</span></figcaption><span></span></div>\n<p>These bars are packed with great sources of vitamin A and, by using sweet potato over white potato, we’re almost doubling our dietary fibre intake.</p>\n<p>Further nutritional benefits come from the inclusion of chia seeds, dark chocolate and honey. The ingredients here should make 20 good-sized brownies.</p>\n<section><div>\n        <h3>Ingredients (20 servings)</h3>\n<ul><li>1 tbsp coconut oil</li>\n<li>450g diced sweet potato</li>\n<li>2 tsp ground cinnamon</li>\n<li>Salt and pepper</li>\n<li>50g honey</li>\n<li>180g unsalted butter, diced</li>\n<li>200g melted dark chocolate (minimum 70% cocoa solids)</li>\n<li>50g brown sugar</li>\n<li>1 tsp baking powder</li>\n<li>1 tbsp cocoa powder</li>\n<li>100g walnuts</li>\n<li>1 tbsp chia seeds</li>\n</ul><p>\n\n    </p></div>\n    </section><h3>Method</h3>\n<p><strong>1.</strong> Heat oil in a non-stick pan and cook the sweet potato, cinnamon and seasoning over a medium heat until the potatoes begin to soften (6-10 mins). Stir in the honey and set aside for 10 mins.</p>\n<p><strong>2.</strong> Place the potato mix in the bowl of a food processor and slowly add the butter, melted chocolate and brown sugar. Blend for 60 secs.</p>\n<p><strong>3.</strong> Blend baking powder and cocoa powder, ensuring it is mixed well. Stir in the walnuts and chia seeds. Blend for 30 secs so the walnuts still have texture.</p>\n<p><strong>4.</strong> Preheat the oven to 180°C. Pour the mixture into a non-stick baking tray and bake for 20 mins. Allow to cool for around 15 mins and then slice.</p>\n<h3>Nutritional info</h3>\n<ul><li>257 kcals</li>\n<li>22g carbs</li>\n<li>17g fat</li>\n<li>5g protein</li>\n<li>3g fibre</li>\n</ul><section><div>\n        <h3>Key ingredients</h3>\n<p><strong>Chia seeds:</strong> These celebrated seeds are high in fibre, which can help feed the good bacteria in your gut helping to maintain gut flora balance. Fibre will also increase satiety, encouraging you to feel fuller for longer.</p>\n<p>Chia seeds are also high in omega-3 fatty acids, which are essential fatty acids that can’t be produced by the body and are important to support cognitive, heart and eye function.</p>\n<p><strong>Sweet potato:</strong> Sweet potatoes are nutrient-dense, containing essential vitamins and minerals. Like chia seeds, they’re high in fibre to encourage the growth of good gut bacteria, and contain antioxidants, which help protect the body from free radicals.</p>\n<p>They are an excellent source of beta-carotene, which can be converted to vitamin A to support your immune system as well as healthy skin and eyes.</p>\n<p>\n\n    </p></div>\n    </section><h2>Peanut butter bars</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Enjoy these peanut butter bars before, during or after a ride.</span></figcaption><span></span></div>\n<p>Loaded with cyclists’ favourite peanut butter, these bars make a perfect on-the-go breakfast cereal bar that’s also great for a pre-, during or post-ride snack. Good-quality honey will add both flavour and nutritional benefits.</p>\n<section><div>\n        <h3>Ingredients (10 servings)</h3>\n<ul><li>225g pure honey</li>\n<li>180g smooth or crunchy nut<br />\nbutter of your choice</li>\n<li>200g rice crispy cereal</li>\n<li>125g shredded coconut</li>\n<li>90g dried fruit of your choice • 80g honey roasted nuts</li>\n</ul><p>\n\n    </p></div>\n    </section><h3>Method</h3>\n<p><strong>1.</strong> In a pan, slowly heat the honey until lukewarm. Add the nut butter and mix well.</p>\n<p><strong>2.</strong> Add the rice crispy cereal and coconut and combine well until the mixture has bound together. Stir in the dried fruit and nuts.</p>\n<p><strong>3.</strong> Pour the mixture into a greaseproof tray and press down until it’s packed down evenly.</p>\n<p><strong>4.</strong> Cover and place in a fridge until the mixture is firm, around one hour, then slice into bars.</p>\n<h3>Nutritional info</h3>\n<ul><li>220 kcals</li>\n<li>4.5g protein</li>\n<li>30g carbs</li>\n<li>10.6g fat</li>\n<li>3.3g fibre</li>\n</ul><section><div>\n        <h3>Key ingredients</h3>\n<p><strong>Honey:</strong> Honey is high in antioxidants that can help lower blood pressure. It also improves levels of ‘good’ HDL cholesterol and is a better replacement for refined sugar.</p>\n<p><strong>Nut butter:</strong> high in protein, healthy fats, fibre, antioxidants, vitamins and minerals. Aim for quality and a high pure nut content, but eat in moderation as nut butters can be high in <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-many-calories-does-cycling-burn/\" target=\"_blank\">calories</a>.</p>\n<p>\n\n    </p></div>\n    </section><h2>Coffee, nut and date bars</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> An easy no-cook bar that delives a caffeine hit.</span></figcaption><span></span></div>\n<p>These bars can be tailored to deliver an energy and concentration-boosting caffeine hit, which you can tailor to your tastes (more than 10g coffee powder may taste too bitter).</p>\n<p>The nuts and dates add further energy and nutritional gains.</p>\n<section><div>\n        <h3>Ingredients (10 servings)</h3>\n<div>\n<div>\n<div>\n<div>\n<ul><li>150g cocoa nibs</li>\n<li>75g almonds</li>\n<li>75g walnuts</li>\n<li>150g dates</li>\n<li>50g raisins</li>\n<li>5g coffee powder (add more if you want a stronger taste)</li>\n<li>2 tbsp sesame seeds</li>\n</ul></div>\n</div>\n</div>\n</div>\n<p>\n\n    </p></div>\n    </section><h3>Method</h3>\n<p><strong>1.</strong> Blend the cocoa nibs to a powder, then add the nuts and pulse the blender gently as you want to keep some texture.</p>\n<p><strong>2. </strong>Add dates, raisins, seeds and coffee powder and combine well.</p>\n<p><strong>3.</strong> Place in tray around 22 x 22cm and press the mixture firmly into the tray so it’s evenly spread</p>\n<p><strong>4.</strong> Chill in the fridge for about an hour. Remove and cut into slices.</p>\n<h3>Nutritional info</h3>\n<div>\n<div>\n<div>\n<div>\n<ul><li>260 kcals</li>\n<li>21g carbs</li>\n<li>18g fat</li>\n<li>5.5g protein</li>\n<li>3.5 fibre</li>\n</ul><section><div>\n        <h3>Key ingredients</h3>\n<p><strong>Walnuts:</strong> They have the highest content of antioxidants of any nut and also contain traces of melatonin, which may help promote better sleep and therefore enhance recovery.</p>\n<p>They’re a good source of essential omega-3 fatty acids and may also decrease inflammation due to their polyphenols as well as promote healthy gut bacteria.</p>\n<p><strong>Coffee:</strong> Coffee is one of the most proven endurance sport stimulants. It is thought to increase energy levels and cognitive function by blocking the neurotransmitter adenosine, which in turn triggers other neurotransmitters such as dopamine and norepinephrine to fire.</p>\n<p>It may also help boost metabolic rate and therefore help promote fat loss. Plus it’s a good source of Vitamin B.</p>\n<ul><li><a href=\"https://www.bikeradar.com/advice/nutrition/coffee-and-cycling-what-you-need-to-know/\">Coffee and cycling: what is the best coffee for cyclists?</a></li>\n</ul><p>\n\n    </p></div>\n    </section></div>\n</div>\n</div>\n</div>","author":"Cycling Plus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"e84978fd44be9357f3a09ff2185c9d2728cc80bde2b7807ac93aa918e555422c","category":"Cycling"}