{"title":"Pediatric and adolescent HIV viral load coverage and suppression rates in the context of the COVID-19 pandemic in 12 PEPFAR-supported sub-Saharan African countries in 2019 and 2020","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003513","date":1722520800000,"content":"<p>by Deborah Carpenter, Marisa Hast, Nicole Buono, Susan Hrapcak, Kimi Sato, Rosemary Mrina, Mackenzie Hurlston Cox, Patricia Aladi Agaba, Alexandra C. Vrazo, Hilary Wolf, Emilia D. Rivadeneira, Judith D. Shang, Magdalene Mange Mayer, Aka Herve Prao, Henri Onema Longuma, Constantin Kabwe, Patricia Nyembo Lwana, Tsegaye Tilahun, Mamorapeli Ts’oeu, Immaculate Mutisya, Lennah Nyabiage Omoto, Jessica Greenberg Cowan, Maria Ines Jorge Tomo de Deus, Omodele Johnson Fagbamigbe, Uzoma Ene, Akudo Ikpeazu, Mduduzi B. Ndlovu, Eva Matiko, Nicolas Schaad, Jema Bisimba, Elizabeth Lema, Kebby Musokotwane, Talent Maphosa, Buyile Buthelezi, Adegbenga Olarinoye, Ismail Lawal, Solomon Mukungunugwa, Janet Tulibonywa Mwambona, Teferi Wondimu, Immaculate Anne Kathure, Onyeka Donald Igboelina, Valery Nxima Nzima, Rosine Grace Bissai, Matjeko Lenka, Willibrord Shasha, N’guetta-Kan Olivier, Mѐrcia Matsinhe, Argentina Wate, Lingenda Godfrey, Heather Alexander, George Alemnji, Shirley Lecher</p>\r\n\r\nThe early period of the COVID-19 pandemic limited access to HIV services for children and adolescents living with HIV (C/ALHIV). To determine progress in providing care and treatment services, we describe viral load coverage (VLC) and suppression (VLS) (&lt;1000 copies/ mL) rates during the COVID-19 pandemic in 12 United States President’s Emergency Plan for AIDS Relief (PEPFAR)-supported countries. Data for children (0–9 years) and adolescents (10–19 years) on VLC and VLS were analyzed for 12 sub-Saharan African (SSA) countries between 2019 (pre-COVID-19) and 2020 (during COVID-19). We report the number of viral load (VL) tests, and percent change in VLC and VLS for patients on ART. For 12 countries, 181,192 children had a VL test during the pre-COVID-19 period compared with 177,683 December 2020 during COVID-19. VLC decreased from 68.8% to 68.3% overall. However, 9 countries experienced an increase ranging from a 0.7%-point increase for Tanzania and Zimbabwe to a 15.3%-point increase for Nigeria. VLS increased for all countries from 71.2% to 77.7%. For adolescents the number with a VL test increased from 377,342 to 402,792. VLC decreased from 77.4% to 77.1%. However, 7 countries experienced an increase ranging from 1.8% for Mozambique to 13.8% for Cameroon. VLS increased for all countries from 76.8% to 83.8%. This analysis shows variation in HIV VLC across 12 SSA countries. VLS consistently improved across all countries demonstrating resilience of countries during 2020. Countries should continue to improve clinical outcomes from C/ALHIV despite service disruptions that may occur during pandemic response.","author":"Deborah Carpenter","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"e84d2a2738db38683df755e6de77c5850968fa4e9da9ad325167d31121ac87b3","category":"Environment"}