{"title":"Favero Confirms Shimano Power Meter Pedals On The Way","link":"https://www.dcrainmaker.com/2021/06/favero-confirms-shimano-power-meter-pedals-on-the-way.html","date":1623774251000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-38.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-38.png\" /></a></p>\n<p>This is a quick post. Namely, because, only a single image has been posted. But Favero <a href=\"https://www.instagram.com/p/CQGVYzYAmrJ/\">shared on their Instagram account</a> that come next month (July, for <a href=\"https://www.amazon.com/2021-Wall-Calendar-16-Month-Reminder/dp/1839228016?dchild=1&amp;keywords=cycling+calendar&amp;qid=1623773993&amp;sr=8-4&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=6eea1df908aa4a8e5de60a6ccf3ffbe0&amp;language=en_US&amp;ref_=as_li_ss_tl\">those calendar-challenged</a>), they’ve got something in store for Shimano road users (that’d generally be considered SPD-SL).</p>\n<p>The above image appears to show not only the outline of a <a href=\"https://www.dcrainmaker.com/2017/09/favero-assioma-in-depth-review.html\">Favero Assioma</a>-style pedal (complete with pods), but also the slightly different outline of an SPD-SL pedal body. However more importantly, the company clearly highlights the spindle as part of this. Certainly people have done spindle <a href=\"https://www.youtube.com/watch?v=ybAFIhKahnM\">conversions in the past for other pedal types</a>, including the more gravel/mountain focused Shimano SPD. But that was never officially supported.</p>\n<p>One has to believe if Favero went to the trouble of whipping up a graphic intending to support the internal spindles semi-transparently, that they did so for a reason. Or, perhaps the graphic team was just bored. Who knows. I mean, obviously someone knows.</p>\n<p>Now, there’s many, many outstanding questions to be had, so many that I couldn’t possible fit them all:</p>\n<p>A) When exactly in July?<br />B) Is it backwards compatible to existing spindles as a conversion kit (e.g. existing LOOK Keo-ish pedals could be swapped to Shimano SPD-SL)?<br />C) Are there any other changes to the pods/platform/system?<br />D) Will you buy a completed system, or, have to part things together?<br />E) What will it cost?<br />F) What will availability be like (historically, Favero has had pretty limited manufacturing capacity relative to demand)?<br />G) What’s the Q-factor look like?<br />H) What’s accuracy look like (if changed)?<br />I) I think that’s it for now.</p>\n<p>Now, Shimano has actually seemingly answered one question, or confirmed something – which is that it’ll be SPD-SL. Which, would seem obviously, but hey, sometimes Captain Obvious gets drunk on Italian Prosecco on a warm June afternoon and so confirmation is important. Anyway, in a question from four days ago, someone asked specifically about SPD-SL o different Instagram post, and sure enough, they said “Watch this space a bit longer” (followed by not just one, but three fire emoji):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-39.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-39.png\" /></a></p>\n<p>And thus, we watched it a bit longer, and we got this new post:</p>\n<p><a href=\"https://www.instagram.com/p/CQGVYzYAmrJ/\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image-40.png\" /></a></p>\n<p>Obviously, Favero is looking to expand beyond just the existing Look-KEO(-ish) compatibility of their current and <a href=\"https://www.dcrainmaker.com/2017/09/favero-assioma-in-depth-review.html\">wildly popular Assioma pedals</a> (and <a href=\"https://www.dcrainmaker.com/2015/09/favero-depth-review.html\">bePro pedals before that</a>). With Garmin offering a triple pedal platform offering in <a href=\"https://www.dcrainmaker.com/2021/03/garmin-rally-power-meter-review-spd-spd-sl-look-keo.html\">Rally (SPD, SPD-SL, Look-KEO)</a>, Favero wouldn’t be the first. But, as they proved with Assioma, first doesn’t always matter. Accuracy and price tends to instead.</p>\n<p>The Favero Assioma have generally been found very accurate, and just as important – very well priced (arguably, from a business perspective, substantially lower than they should be). I often use them in my testing rotation alongside both Garmin Rally &amp; PowerTap P1/P2 pedals. They’ve also done a great job at providing a number of solid feature firmware updates over the past few years too.</p>\n<p>And with that, that’s all I have to say for now. Though, in the words of Favero: “Stay tuned [fire emoji]”!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"e852bd151717ec45ab640dc2531e7b3ff2dfeb6d9c98545c808faef13b22eac9","category":"Cycling"}