{"title":"Enhancing Alginate Hydrogels as Possible Wound Healing Patches: The Synergistic Impact of Reduced Graphene Oxide and Tannins on Mechanical and Adhesive Properties","link":"https://www.preprints.org/manuscript/202403.1344/v1","date":1711095670000,"content":"Hydrogels are three-dimensional crosslinked materials known for their ability to absorb water, exhibit high flexibility, biodegradability, biocompatibility, and mimic properties of different tissues in the body. However, their application is limited by inherent deficiencies in mechanical properties. To address this issue, reduced graphene oxide (rGO) and tannins (TA) were incorporated into alginate hydrogels (Alg) to evaluate the impact of the concentration of these nanomaterials on mechanical and adhesive, as well as cytotoxicity and wound healing properties. Tensile mechanical tests demonstrated improvements in tensile strength, elastic modulus, and toughness upon the incorporation of rGO and TA. Additionally, the inclusion of these materials allowed a greater energy dissipation during continuous charge-discharge cycles. However, the samples did not exhibit self-recovery under environmental conditions. Adhesion was evaluated on pig skin, revealing that higher concentrations of rGO led to enhanced adhesion, while the concentration of TA did not significantly affect this property. Moreover, adhesion remained consistent after 10 adhesion cycles, and contact time before the separation between the material and the surface did not affect this property. The materials were not cytotoxic and promoted healing in human fibroblast model cells. Thus, an Alg/rGO/TA hydrogel with enhanced mechanical, adhesive, and wound healing properties was successfully developed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e855f4f38f448ffd08ecb8469cf73ab46496f6bafc2b4d455fc5dea8dfad0bbe","category":"Interdisciplinary"}