{"title":"Grassland nature reserves safeguard a high species richness and biomass of grasshoppers","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14774?af=R","date":1725011729000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/afb32c1c-122b-456e-81d7-ed4d8a09d9bc/jpe14774-toc-0001-m.png\" alt=\"Grassland nature reserves safeguard a high species richness and biomass of grasshoppers\" />\n<p>To preserve biodiversity in nature reserves, we recommend (i) leaving uncut refuges during mowing and (ii) blocking drainage to stabilise the water level. Both measures contribute to a high species number and abundance of grasshoppers and many other insects. An effective conservation measure to promote species richness in the wider countryside would be to increase habitat diversity. This can be done by creating or restoring fallow islands, field margins, fringes and hedgerows.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nIn the course of land-use change, especially since the mid-20th century, the area of semi-natural (unimproved) grasslands has dramatically decreased. One way to counteract this process is to designate nature reserves. However, the effectiveness of nature reserves is controversial.\n\nThe aim of our study was to evaluate the environmental drivers of species richness and biomass of Orthoptera (hereinafter termed ‘grasshoppers’) in grasslands inside nature reserves and within the intensively used agriculture landscape (hereinafter termed ‘wider countryside’). For this purpose, we sampled the grasshoppers at the landscape scale in 45 randomly selected plots. Each plot had a size of 5 ha. The abundance of grasshoppers, as a basis for the biomass calculation, was recorded at the habitat scale in 20 meadow patches (500 m<sup>2</sup> each). In addition, various environmental parameters such as habitat diversity, mowing intensity and vegetation structure were determined at the landscape and habitat scale.\n\nOur results illustrate the importance of nature reserves for the conservation of grasshoppers. Control plots in the wider countryside harboured fewer species than plots within nature reserves. The differences were even clearer among threatened species. On average, plots in nature reserves had almost twice as many threatened species than control plots in the wider countryside. The comparison revealed similar patterns at the habitat scale: both the number of species and biomass were higher in nature reserves. At the landscape scale, number of species were best explained by the amount of wet grassland and habitat diversity. We identified mowing intensity and to a lower extend the degree of drainage as the key drivers of species richness and biomass at the habitat scale.\n\n<i>Synthesis and applications</i>: To preserve biodiversity in nature reserves, we recommend (i) leaving uncut refuges during mowing and (ii) blocking drainage to stabilise the water level. Both measures contribute to a high species number and abundance of grasshoppers and many other insects. An effective conservation measure to promote species richness in the wider countryside would be to increase habitat diversity. This can be done by creating or restoring fallow islands, field margins, fringes and hedgerows.\n</p>\n<h2>Zusammenfassung</h2>\n<p>\n\nIm Zuge des Landnutzungswandels, vor allem seit Mitte des 20. Jahrhunderts, hat die Fläche des extensiv genutzten Grünlands dramatisch abgenommen. Eine Möglichkeit, dieser Entwicklung entgegenzuwirken, ist die Ausweisung von Naturschutzgebieten. Die Wirksamkeit von Naturschutzgebieten ist aber umstritten.\n\nZiel unserer Studie war es, die umweltbedingten Einflüsse auf die Artenvielfalt und die Biomasse von Orthopteren (im Folgenden „Heuschrecken“ genannt) im Grünland von Naturschutzgebieten und in der intensiv genutzten Agrarlandschaft (im Folgenden „Normallandschaft“ genannt) zu bewerten.\n\nHierfür haben wir sämtliche Heuschreckenarten auf der Landschaftsebene in 45 zufällig ausgewählten Probeflächen kartiert. Jede Probefläche hatte eine Größe von 5 ha. Die Abundanz der Heuschrecken, als Grundlage für die Berechnung der Biomasse, wurde auf der Habitatebene in 20 Wiesenparzellen (je 500 m2) erfasst. Zudem haben wir verschiedene Umweltparameter wie die Habitatdiversität, die Mahdintensität und die Vegetationsstruktur auf der Landschafts- und Habitatebene aufgenommen.\n\nUnsere Ergebnisse verdeutlichen die Bedeutung von Naturschutzgebieten für die Erhaltung von Heuschrecken. Auf den Kontrollflächen in der Normallandschaft waren weniger Arten zu finden als auf den Probeflächen in Naturschutzgebieten. Noch deutlichere Unterschiede konnten wir für die gefährdeten Arten feststellen. Im Durchschnitt wiesen die Probeflächen in Naturschutzgebieten fast doppelt so viele gefährdete Arten auf wie die Kontrollflächen in der Normallandschaft. Der Vergleich ergab ähnliche Muster auf der Habitatebene: Sowohl die Anzahl der Arten als auch die Biomasse waren in Naturschutzgebieten höher. Auf der Landschaftsebene ließen sich die Artenzahlen am besten durch den Anteil an Feuchtgrünland und die Habitatdiversität erklären. Als Hauptfaktoren für die Artenvielfalt und die Biomasse auf der Habitatebene wurden die Mahdintensität und in geringerem Maße der Grad der Entwässerung ermittelt.\n\n<i>Synthese und Managementempfehlungen</i>: Um die Artenvielfalt in Naturschutzgebieten zu erhalten, empfehlen wir, 1. bei der Mahd ungemähte Refugien zu belassen und 2. Entwässerungssysteme zur Stabilisierung des Wasserstandes zu verschließen. Beide Maßnahmen tragen zu einer hohen Artenzahl und Abundanz von Heuschrecken und vielen anderen Insekten bei. Eine wirksame Naturschutzmaßnahme zur Förderung der Artenvielfalt in der Normallandschaft wäre die Erhöhung der Habitatdiversität. Dies kann beispielsweise durch die Schaffung oder Wiederherstellung von Bracheinseln, Feldrändern, Hecken und Säumen geschehen.\n</p>","author":"Dominik Poniatowski, \nValentina Weißgräber, \nMarco Drung, \nFelix Maximilian Freienstein, \nMarcel Kettermann, \nGwydion Scherer, \nThomas Fartmann","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"e85ad67259d9cd53be7288604204defa224781eb8db0b5ae8b5d4c452ffba098","category":"Environment"}