{"title":"Drivers of growth in strong year classes of the deepwater redfish (Sebastes mentella) population from the Gulf of St. Lawrence derived from otolith increment‐based growth chronologies","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15903?af=R","date":1723884839000,"content":"<h2>Abstract</h2>\n<p>The case of the deepwater redfish (<i>Sebastes mentella</i>) in the Gulf of St. Lawrence (GSL) is a compelling example of drastic fluctuations in annual recruitment strength, characteristic of spasmodic stocks. After three decades of low abundance, the emergence of three consecutive strong year classes in 2011–2013 resulted in an unprecedented increase in biomass. In spasmodic stocks such as GSL redfish, strong year classes sustain both the biomass and catch for decades. Therefore, understanding the growth dynamics of these cohorts is essential. In the present study, we reconstructed the annual growth rates of redfish using otolith increment-based annual chronology and investigated the drivers of growth variation in redfish strong year classes of the early 2010s and early 1980s. Stock biomass was identified as the main extrinsic driver of redfish growth, suggesting intense competition for food at high conspecific density. Warming of deep waters in the GSL, where adult redfish settle, positively correlated with individual growth. However, recent warming of the cold intermediate layer showed a negative correlation with redfish growth, likely related to the shrinking of the habitat this water mass provides for various redfish cold-water prey rather than to a direct effect of temperature. Reconstruction of redfish annual growth trajectories from birth to capture emphasized the importance of carryover effects in the growth potential of strong year classes. This work provided an important first outlook of the factors driving growth variation in GSL redfish spasmodic stock and explored midterm consequences of density-dependent pressures on biological parameters of the population.</p>","author":"Lola Coussau, \nOlivier Morissette, \nDominique Robert, \nPascal Sirois","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"e869d4817521907a0a9f6353f906e18d0c63f13f4b1e8303ad8f9518f0a07e64","category":"Environment"}