{"title":"Spotlight: King Cage Side Load titanium bottle cage review","link":"https://cyclingtips.com/2021/06/spotlight-king-cage-side-load-titanium-bottle-cage-review/","date":1623802200000,"content":"<div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/King-Cage-side-access-titanium-cage-1-650x366.jpg\" /></div>\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/King-Cage-side-access-titanium-cage-1-1340x754.jpg\" /><figcaption>King Cage’s new side-access titanium bottle cage fills a long-standing hole in the company lineup.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/King-Cage-side-access-titanium-cage-2-1340x754.jpg\" /><figcaption>The cage is similar to King Cage’s standard titanium model, except rotated on the bike by about 45°.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/King-Cage-side-access-titanium-cage-3-1340x754.jpg\" /><figcaption>The extra-wide mounting plates have holes for left or right installation. Production units will have holes in the center, too, and more rounded edges on the plates.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/King-Cage-side-access-titanium-cage-4-1340x754.jpg\" /><figcaption>As has always been the case with King Cage, the side-access cage is still welded by hand in Durango, Colorado.</figcaption></figure></li></ul></figure>\n\n\n\n<p>Often copied but rarely equaled, King Cage bottle cages have earned a fervently loyal following over the years. The hollow titanium models are very light and yet hold bottles with remarkable security, while the wallet-friendly stainless steel ones hold nearly as well without being much heavier. Both sport a classic aesthetic that never goes out of style, and neither marks up bottles like cheaper aluminum cages.</p>\n\n\n\n<p>The pricing is even competitive with bigger brands even though every cage is still made in small batches in Durango, Colorado, and their proven durability makes them superb value long-term. I personally own a set of King titanium cages that have seen regular use for over a dozen years now, and they still look (and work!) like new.</p>\n\n\n\n<p>Long missing from the range was a side-access model for use in tight spaces (like full-suspension mountain bikes and gravel bikes fitted with frame bags), but that’s finally about to change with the introduction of the new Side Load titanium cage.</p>\n\n\n\n<p>King Cage’s new side-access model offers a different take on the idea in that it’s basically a standard cage rotated about 45°. King makes these out of the same tubular stock as the standard titanium model, but the support plates are much wider than usual and have five sets of holes for left, right, or centered mounting (my early production model was missing the center holes). </p>\n\n\n\n<p>Retail price is the same at US$65 / AU$95 / £58 / €69, and they should be showing up on the King Cage website any day now. At least for now, company founder Ron Andrews says there’s no stainless model pending. </p>\n\n\n\n<p>As you’d expect, the Side Load cage is easier to use than other King Cage options when there isn’t enough room to slide the bottle straight in and out. As with other popular side-access cages, you can feed bottles into the Side Load cage bottom first at an abrupt angle, and then snake it into place. To get them out, you basically just give the bottles a little tug out to the side. </p>\n\n\n\n<p>Out on the road or trail, bottle hold is just as secure with the new Side Load cage as the standard titanium model. Bottles lock into place with firm snap, and losing one on a bumpy section isn’t a concern at all. Having some height options to the side-access holes is also a smart move given that anyone looking at this sort of cage will invariably be tight on space. Another smart move is the ability to attach the same cage for left- or right-handed access.</p>\n\n\n\n<p>Weight has crept up slightly relative to the standard titanium cage given the bigger mounting plates, but it’s still light at 35 g (just a 6 g increase from one of my personal cages). Given prior experience with the standard titanium model, wear just won’t be an issue at all, nor things like weld integrity. I have no reason to think this Side Load model won’t outlast the end of humanity just like other King Cages.</p>\n\n\n\n<p>That said, there are some compromises on this thing relative to the tried-and-true standard titanium model.</p>\n\n\n\n<p>Although bottles are held securely, the modified cage shape doesn’t have as much spring to it, so a bit more effort is needed to get bottles in or out. The cage also seems to have been designed around a particular bottle shape. Specialized bottles fit perfectly, as do ones from Bontrager, Polar Bottle, Camelbak, or anything else that features a similarly tapered base and pronounced neck. The more squared-off base used on Elite and Soma bottles keeps them from fully seating, though, as does the shallower neck on older Camelbak bottles.</p>\n\n\n\n<p>I also can’t help but feel like these side-access cages just don’t look as elegant as other King Cage models. </p>\n\n\n\n<p>As a result, I’m not sure these will end up being a classic like everything else in the King Cage catalog. But if function is at the top of your priority list, you’re already a King Cage fan (or have wanted to be one, but needed a side-access cage), and your cabinet of bottles will work with the shape, I have a hard time thinking you’ll need another cage ever again.</p>\n\n\n\n<p><strong>Price: </strong>US$65 / AU$95 / £58 / €69</p>\n\n\n\n<p><strong>Weight: </strong>35 g</p>\n\n\n\n<p><strong>More information:</strong> <a href=\"https://kingcage.com/\" target=\"_blank\">www.kingcage.com</a></p>\n\n\n<p>    </p><div>\n    <div>\n\t<em>Follow the link to see previous products we’ve reviewed in our <a href=\"//cyclingtips.com/tag/spotlight/”\" target=\"“_blank”\">Spotlight series</a>.</em>    </div>\n    </div>\n\t<p></p>\n<p>The post <a href=\"https://cyclingtips.com/2021/06/spotlight-king-cage-side-load-titanium-bottle-cage-review/\">Spotlight: King Cage Side Load titanium bottle cage review</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e876c6e22d78a49da1c175585857e962437ec39c10ca40876f65f86d943e9d05","category":"Cycling"}