{"title":"Apple Now Issues Mac-iOS Device Syncing Updates Via Software Update","link":"https://www.macrumors.com/2021/10/21/device-support-update-macos-software-update/","date":1634803155000,"content":"Late last month, Apple issued an unusual standalone software update to macOS users called \"<a href=\"https://www.macrumors.com/2021/09/30/macos-big-sur-device-support-update/\">Device Support Update</a>,\" which it said was to \"ensure proper updating and restoring for iOS and iPadOS devices with Mac.\" \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/Device-Software-Update.jpg\" />\r\n<br />\r\nWhile no other details were provided, it was assumed that the update added support for recently released devices, including <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> models, the new <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a>, and the ninth-generation <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>. Still, the update was the first of its kind to come through System Preferences -&gt; Software Update, which made some users curious about it.\r\n<br />\r\n\r\n<br />\r\nUsually when you connect an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, ‌iPad‌, or <a href=\"https://www.macrumors.com/roundup/ipod-touch/\">iPod touch</a> to a Mac, a dialog pops up from an app called MobileDeviceUpdater that says \"A software update is required to connect\" to your iOS device. This normally happens when the device has been independently updated with a newer version of iOS or iPadOS that  the Mac doesn't recognize, indicating that the download is required for your Mac to communicate with the device.\r\n<br />\r\n\r\n<br />\r\nIt looks as if Apple has now chosen to reduce the reliance on MobileDeviceUpdater by automatically delivering these downloads when they are ready via Software Update, so users no longer have to wait until they plug in an iOS device to get what is now referred to as a \"Device Support Update.\" The change is likely an effort to reduce the frequency of the MobileDeviceUpdater dialog popping up upon connecting a device, which may strike some users as some sort of malware.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/MobileDeviceUpdater-dialog-1.jpg\" />\r\n<br />\r\nThe change was helpfully confirmed by <em><a href=\"https://tidbits.com/2021/10/20/device-software-updates-now-appear-in-software-update-too/\">Tidbits</a></em>' Adam Engst, who sat on the mysterious Device Support Update for a week or two to verify what it was. \r\n<br />\r\n<blockquote>I got that chance today when I plugged in my iPad Pro and got the usual MobileDeviceUpdater dialog. I made sure that Software Update was still offering me Device Support Update, and then I allowed the MobileDeviceUpdater dialog to update my Mac. After closing and reopening Software Update, the Device Support Update option was gone, confirming that they're one and the same.</blockquote>As Engst notes, this isn't an earth-shattering discovery, but it's good to know what happens when installing future Device Support Updates from Software Update: They don't require a reboot, and users will still get a MobileDeviceUpdate dialog the next time they plug in their device if they haven't got around to installing the update.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macos-big-sur/\">macOS Big Sur</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macos-big-sur.226\">macOS Big Sur</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/21/device-support-update-macos-software-update/\">Apple Now Issues Mac-iOS Device Syncing Updates Via Software Update</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-now-issues-mac-ios-device-syncing-updates-via-software-update.2318386/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=owe7y9qa9pQ:3rqjqtzNEgY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=owe7y9qa9pQ:3rqjqtzNEgY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/owe7y9qa9pQ\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e8763c0d766ee0341244b03ed29a7e9c12e238d820677d62bac3a21f37a5b090","category":"Apple"}