{"title":"Apple AirDrop leaks user data like a sieve. Chinese authorities say they’re scooping it up.","link":"https://arstechnica.com/?p=1995574","date":1705081961000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/china-apple-airdrop-spying-800x450.jpg\" alt=\"Apple AirDrop leaks user data like a sieve. Chinese authorities say they’re scooping it up.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/china-apple-airdrop-spying.jpg\">Enlarge</a> (credit: Aurich Lawson | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Chinese authorities recently said they're using an advanced encryption attack to de-anonymize users of AirDrop in an effort to crack down on citizens who use the Apple file-sharing feature to mass-distribute content that's outlawed in that country.</p>\n<p>According to a <a href=\"https://www.nytimes.com/2022/10/24/business/xi-jinping-protests.html\">2022 report</a> from The New York Times, activists have used AirDrop to distribute scathing critiques of the <a href=\"https://en.wikipedia.org/wiki/Chinese_Communist_Party\">Communist Party of China</a> to nearby iPhone users in subway trains and stations and other public venues. A document one protester sent in October of that year called General Secretary Xi Jinping a “despotic traitor.” A few months later, with the release of iOS 16.1.1, the AirDrop users in China found that the \"everyone\" configuration, the setting that makes files available to all other users nearby, automatically reset to the more limited contacts-only setting. Apple has yet to acknowledge the move. Critics continue to see it as a concession Apple CEO Tim Cook made to Chinese authorities.</p>\n<h2>The rainbow connection</h2>\n<p>On Monday, eight months after the half-measure was put in place, officials with the local government in Beijing said some people have continued mass-sending illegal content. As a result, the officials said, they were now using an advanced technique publicly disclosed in 2021 to fight back.</p></div><p><a href=\"https://arstechnica.com/?p=1995574#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1995574&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e877f91d32b6d26eeb4a4035311259e6a069c6aae6f444667004e4dca979a65d","category":"Tech"}