{"title":"แล้วก่อนหน้านี้ใช้อะไร? ครม. เคาะหน่วยงานรัฐต้องใช้อีเมลเป็นช่องทางสื่อสารหลัก","link":"https://www.blognone.com/node/124280","date":1629256748000,"content":"<div><div><div><p>ที่ประชุมคณะรัฐมนตรี (ครม.) เห็นชอบกฎหมาย สนับสนุนรัฐบาลดิจิทัล ภาคธุรกิจสามารถทำธุรกรรมและติดต่อภาครัฐผ่านช่องทางอิเล็กทรอนิกส์ได้มากขึ้น โดยในการจัดทำระเบียบสำนักนายกรัฐมนตรี ว่าด้วยงานสารบรรณ (ฉบับที่ 4) พ.ศ.2564 (ระเบียบสารบรรณอิเล็กทรอนิกส์) ระบุ หน่วยงานของรัฐต้องใช้อีเมลในการสื่อสารเป็นหลักมีผลตั้งแต่วันที่ 23 สิงหาคม 2564 เป็นต้นไป เพื่อต่อยอดไปใช้ในการจัดทำระบบข้อมูลอิเล็กทรอนิกส์ได้</p>\n<p>นอกจากนี้ ในที่ประชุม ครม. ยังรับทราบการพัฒนากฎหมายเพื่อเร่งรัดให้เกิดรัฐบาลดิจิทัล (Digital Government) เช่น</p>\n<ul>\n<li>จัดทำร่างพระราชบัญญัติการปฏิบัติราชการทางอิเล็กทรอนิกส์ พ.ศ. ....การยื่นคำขอระหว่างประชาชนกับหน่วยงานรัฐ หรือระหว่างหน่วยงานรัฐด้วยกันสามารถทำโดยวิธีทางอิเล็กทรอนิกส์ได้</li>\n<li>ปรับปรุงกฎหมายที่ใช้บังคับอยู่ในปัจจุบัน บริษัทมหาชนจำกัดและคณะกรรมการบริษัทมหาชนจำกัด สามารถทำกิจกรรมต่างๆ ด้วยวิธีการทางอิเล็กทรอนิกส์ได้</li>\n<li>ปรับปรุงวิธีการเขียนกฎกระทรวงและกฎหมายลำดับรองอื่นให้หน่วยงานของรัฐให้บริการแก่ประชาชนด้วยวิธีการทางอิเล็กทรอนิกส์</li>\n<li>จัดทำระบบกลางทางกฎหมาย เพื่อให้เป็นแพลตฟอร์มกลางเกี่ยวกับกฎหมาย ที่ให้บริการแบบจุดเดียวเบ็ดเสร็จ (One Stop Service) แก่หน่วยงานของรัฐและประชาชน ตั้งเป้าเสร็จสมบูรณ์ภายในเดือนกรกฎาคม 2565</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/0f935f2ff23006a08a69dd5ea3909b5e.jpg\" /><br />\nภาพประกอบจาก Facebook ไทยคู่ฟ้า</p>\n<p>ที่มา - <a href=\"https://www.bangkokbiznews.com/news/detail/955227\">กรุงเทพธุรกิจ</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/thailand\">Thailand</a></div><div><a href=\"/topics/email\">Email</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e87cc7f01a24bfc8c75f5fa847be116acebac8a8ff1e626fec74955369ef9be8","category":"Thai"}