{"title":"Analysis of the mRNA Expression of Peripheral Blood Stem and Progenitor Cell Markers in Pancreatic Neoplastic Disorders","link":"https://www.preprints.org/manuscript/202410.0873/v1","date":1728876895000,"content":"Background\nOur aim was to assess the expression profiles of the messenger RNA (mRNA) expression profiles of stem cell genes (OCT4, NANOG) and pancreatic progenitor genes (CK19, HES1, INS, PDX1) in peripheral blood mononuclear cells (PBMNCs) in selected neoplastic pancreatic diseases, such as cancer and neuroendocrine tumors, to identify neoplastic disease markers in the pancreas.\nMethods\nIn this study, 49 patients diagnosed with pancreatic neoplastic diseases (37 with cancer and 12 with neuroendocrine tumors) and 34 control patients, all of whom were hospitalized at a tertiary center, were enrolled. Venous blood samples were collected from the participants, and RNA was extracted from peripheral blood mononuclear cells (PBMNCs). The mRNA expression levels of six stem cell and pancreatic progenitor markers—OCT4 (POU class 5 homeobox 1), NANOG, CK19 (keratin 19), HES1 (hes family bHLH transcription factor 1), INS (insulin), and PDX1 (pancreatic and duodenal homeobox 1)—were quantified via real-time quantitative PCR. The data were statistically analysed to explore associations between gene expression levels and various clinical, biochemical, and morphological parameters (including full blood count, Ca 19.9, weight, height, and BMI) via the Kruskal‒Wallis test, Mann‒Whitney U test, and Spearman rank correlation coefficient.\nResults\nThe results revealed that the expression of the gene associated with early stem cells, NANOG (median= 0.002, p=0.03), as well as the genes encoding insulin INS (median = 0,004, p=0.02) and cytokeratin 19 CK19(median 0.0003, p=0.005), was significantly elevated in patients with pancreatic cancer. However, these gene expression levels were not significantly different from those of controls in patients with neuroendocrine tumors. Additionally, no significant differences in gene expression were observed among patients at different stages of pancreatic cancer. Furthermore, CK19 overexpression was found to be positively correlated with inflammatory markers, specifically CRP and WBC, in patients with pancreatic cancer.\n\nConclusions\nElevated PBMNC mRNA expression of selected stem and progenitor genes (NANOG, INS, CK19) may serve as a marker of pancreatic cancer and is correlated with coexisting inflammation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e881993c33d1dc6ffbe75d69e507dcde124eb7f1357aacecadcdb453c77d4a8f","category":"Interdisciplinary"}