{"title":"Tesla cancels all right-hand drive Model S, Model X orders","link":"https://arstechnica.com/?p=1938840","date":1683894691000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-1126225194-800x503.jpg\" alt=\"Gerenal view on Right hand drive (RHD) model S by Tesla Motors at Tai Tak Cruise Terminal. 23JUL14 (Photo by Edward Wong/South China Morning Post via Getty Images)\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-1126225194-scaled.jpg\">Enlarge</a> <span>/</span> Tesla has been making right-hand drive versions of the Model S for a decade, but has now decided it's too complicated to continue. (credit: Edward Wong/South China Morning Post via Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Tesla is no longer making a right-hand drive version of its Model S and Model X electric vehicles. The decision means that customers in countries that drive on the other side of the road, like the UK, have had orders canceled, and potential buyers are being told to buy a different model, a car from inventory, or try a left-hand drive version.</p>\n<p>About 30 percent of the world's nations drive on the left side of the road, known confusingly as right-hand drive, as the driver's seat is on the right side of the car. The UK is probably the best-known right-hand drive country, along with most of its former colonies. While most of these are small countries, the list also includes highly populous countries like Japan, Indonesia, and India.</p>\n<p>Ars was contacted by a reader from New Zealand who ordered a right-hand drive Model X SUV almost three years ago because Tesla reached out to him yesterday to cancel his order:</p></div><p><a href=\"https://arstechnica.com/?p=1938840#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1938840&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e881b2d7aad0ce78ba56db0aa14d0d781acc3cc26232f39845282bd2ed145780","category":"Tech"}