{"title":"How 3D printing is changing design and manufacturing in the bike industry","link":"https://www.bikeradar.com/features/tech/3d-printing-future-of-bike-industry/","date":1693582213000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/04/Atherton-lugs-2bb97af.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/04/Atherton-lugs-2bb97af.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2022/04/Atherton-lugs-2bb97af.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2022/04/Atherton-lugs-2bb97af.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2022/04/Atherton-lugs-2bb97af.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2022/04/Atherton-lugs-2bb97af.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/04/Atherton-lugs-2bb97af.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/04/Atherton-lugs-2bb97af.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/04/Atherton-lugs-2bb97af.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/04/Atherton-lugs-2bb97af.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Atherton lugs\" title=\"Atherton-lugs\" />                                            <p>At its core, a bicycle is an extremely simple design. Two triangles create a frame, two circles for the wheels and then a handful of other parts help the rider speed up, slow down and steer.</p>\n<p>While these basic principles haven’t changed much since the late 19th century, the design of each component has been refined, rethought and refreshed over the intervening decades. At the same time, <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-frame-materials/\">bike frame materials</a> have shifted from steel to aluminium, carbon fibre, titanium and more.</p>\n<p>But are we about to enter a new era? With 3D printing heralded as the latest advance in manufacturing, a smattering of products have already made it to market – from components such as saddles and custom parts for pros, to <a href=\"https://www.bikeradar.com/features/pro-bike/filippo-ganna-pinarello-hour-record-bike/\">full-blown bike frames</a>.</p>\n<p>However, is 3D printing a viable alternative to traditional manufacturing methods? And what could it mean for the future of cycling tech?</p>\n<h2>What is 3D printing?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Denture created with a 3D printer\" title=\"Denture created with a 3D printer\" />\n\n</div><div><figcaption><span><i></i> 3D printing creates a product – whether it’s a bike part or a set of dentures – layer by layer.</span></figcaption><span> <i>Getty Images</i></span></div>\n<p>3D printing, or additive manufacturing to give it its proper name, does exactly what it says on the tin. Rather than carving something from a block of material – as happens with a milling process such as CNC machining – the design is built up, layer by ultra-thin layer.</p>\n<p>It all starts with a 3D CAD (computer-aided design) model, which is split into each individual layer. This is programmed into a 3D printer – a cube-shaped machine that doesn’t look too dissimilar to a standard, 2D printer.</p>\n<p>A thin coating of powder (commonly a metal such as titanium in the cycling industry) is spread across the bed of the printer before a laser beam scans the path of the first layer – the heat solidifying the points it touches and leaving the areas it doesn’t as powder.</p>\n<p>Another coating of powder is then added, and the process is repeated, the layers fusing with each other as the product builds from the base up until the final layer is completed.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"3D printing in the construction industry\" title=\"3D printing in the construction industry\" />\n\n</div><div><figcaption><span><i></i> A 3D printing construction technique is being used to build a server warehouse in Germany.</span></figcaption><span> <i>Alex Kraus / Bloomberg / Getty Images</i></span></div>\n<h2>Why is 3D printing useful?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Making of Atherton Bikes\" title=\"Full Speed Ahead - Atherton Bikes - 02\" />\n\n</div><div><figcaption><span><i></i> Atherton Bikes uses 3D printing to create its titanium lugs.</span></figcaption><span> <i>Dan Griffiths / Our Media</i></span></div>\n<p>The benefits of this new manufacturing process are numerous, but one of the key reasons it has been adopted by cycling product designers is because of its prototyping potential.</p>\n<p>Once a component has been designed on a computer, it can be sent to a 3D printer and produced without the need for moulds or investment in tooling.</p>\n<p>If any modifications are required, they can be made on-screen before being re-printed using the same machine – there’s no need to make different moulds or invest in tooling with every new version.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"A precise model of each component becomes the instructions for the 3D printer to follow.\" title=\"Full Speed Ahead - Atherton Bikes - 01\" />\n\n</div><div><figcaption><span><i></i> A precise model of each component becomes the instructions for the 3D printer to follow.</span></figcaption><span> <i>Dan Griffiths / Our Media</i></span></div>\n<p>“If we were doing a traditional method, you would do development work on aluminium mules and then turn that into a carbon frame you would then have manufactured,” says Rob Gowe, head of design at Atherton Bikes, which uses <a href=\"https://www.bikeradar.com/features/atherton-bikes/\">3D-printed titanium lugs on its carbon frame designs</a>.</p>\n<p>“The beauty of [3D printing] is we can develop the prototypes and refine them to a really high level, and then know that the characteristic is exactly what we’re going to see in the production model.”</p>\n<p>This also helps speed up the process, shaving time off the development of components, according to Alex Locatelli, product manager at Fizik.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"3D-printed Fizik saddle\" title=\"3D-printed Fizik saddle\" />\n\n</div><div><figcaption><span><i></i> Fizik is one of a number of brands to now offer 3D-printed bike saddles.</span></figcaption><span> <i>Fizik</i></span></div>\n<p>“The <a href=\"https://www.bikeradar.com/reviews/components/saddles/fizik-antares-versus-evo-00-adaptive-saddle-review/\">Antares Versus Evo</a> was the product where we learned to use the technology, and [3D printing] allowed us to make more than 100 iterations in two to three weeks.”</p>\n<p>Locatelli estimates that, with traditional methods, the same process would have taken “10 years to get the fine-tuning”, adding that “whenever you need to modify a mould, it takes between a couple of weeks to a month”.</p>\n<p>Although Locatelli says the printed saddle prototypes “would break easily after probably 100 metres”, in other cases, where the sample isn’t put under intense stresses, manufacturers have been able to start testing in the field while still refining the finished product.</p>\n<p><a href=\"https://www.bikeradar.com/news/geraint-thomas-sungod-gt/\">Geraint Thomas’ new signature SunGod GTs</a> are a prime example, The Welshman sported 3D-printed frames for the first week of the 2023 Giro d’Italia before switching to a fully moulded production sample on the first rest day.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Prototypes of SunGod GT sunglasses\" title=\"Prototypes of SunGod GT sunglasses\" />\n\n</div><div><figcaption><span><i></i> SunGod used 3D printing to create rapid prototypes of the new GTs sunglasses.</span></figcaption><span> <i>Charlie Allenby / Our Media</i></span></div>\n<p>SunGod’s head of product, Ed Watkiss, says the nylon-based material that the frames were printed in is a “bit more brittle” than the recycled TR90 plastic polymer used for the final version, but that ultimately the 3D-printed prototypes “perform so close to the actual one”, enabling Thomas to use the Giro as a final testing ground.</p>\n<p>3D printing is also useful for making custom specification items, or small batches of niche products for professional riders.</p>\n<p>The top riders on Team Ineos-Grenadiers, for example, are known to use 3D-printed time trial extensions. Each set is custom-made for the individual rider, with extensions shaped to match the rider’s forearms and time trial position.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"MOST handlebar on Filippo Ganna's Pinarello Bolide hour record bike\" title=\"MOST handlebar on Filippo Ganna's Pinarello Bolide hour record bike\" />\n\n</div><div><figcaption><span><i></i> <span>The handlebars on Filippo Ganna’s Pinarello Bolide F HR are made from 3D-printed titanium.</span></span></figcaption><span> <i>George Scott / Our Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/features/pro-bike/filippo-ganna-pinarello-hour-record-bike/\">Filippo Ganna’s 3D-printed Pinarello F HR 3D hour record bike</a> also sported a set of unique time trial extensions designed only to that bike and his individual riding position.</p>\n<p>Likewise, <a href=\"https://www.bikeradar.com/news/bastion-3d-printed-argon-18-sprint-stem/\">Bastion Cycles produces 3D-printed stems, handlebars and cranksets</a> in collaboration with Cycling Australia and its Olympic track cycling squad.</p>\n<p>Given their one-off designs or incredibly niche usage scenarios, these products have little commercial value beyond the realm of elite sport, and therefore may not have been financially viable using other construction methods.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Bastion 3D printed track cranks\" title=\"Titanium_Crank_1(Credit-Bastion)\" />\n\n</div><div><figcaption><span><i></i> Bastion developed 3D-printed stems, handlebars and cranksets for the Australian track team.</span></figcaption><span> <i>Bastion</i></span></div>\n<h2>Perfect for production?</h2>\n<p>The technology isn’t restricted solely to prototyping though, and a number of brands have turned to 3D printing for full-scale production, too.</p>\n<p>Some 3D-printed products are easy to spot – the futuristic-looking <a href=\"https://www.bikeradar.com/news/mythos-elix-3d-printed-stem/\">Mythos Elix stem</a>, for example, big holes in its predominantly hollow structure.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Meet the Mythos Elix, the world’s first 3D printed stem\" title=\"Mythos Elix - 04\" />\n\n</div><div><figcaption><span><i></i> Some 3D-printed products are designed to immediately catch the eye.</span></figcaption><span> <i>Mythos</i></span></div>\n<p>Others, such as <a href=\"https://www.bikeradar.com/news/silca-titanium-cleats/\">Silca’s titanium cleats</a>, are more subtle, reimaging standard shapes in an attempt to push the strength-to-weight ratio to its limits.</p>\n<p>While the experts we spoke to suggested some releases are nothing more than marketing gimmicks, there are instances when 3D printing is a better option than traditional manufacturing methods.</p>\n<p>Components manufactured using 3D printing can be designed to deal much better with complex, multi-directional loads than traditional methods ” explains Gowe from Atherton Bikes.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Making of Atherton Bikes\" title=\"Full Speed Ahead - Atherton Bikes - 11\" />\n\n</div><div><figcaption><span><i></i> Rob Gowe of Atherton Bikes says 3D printing allows for the fine-tuned manufacture of complex parts.</span></figcaption><span> <i>Dan Griffiths / Our Media</i></span></div>\n<p>He cites the bottom bracket shell used on the brand’s bikes as a good example: “You’ve got the force from the pedals, the shock, and linkages… coming from all different directions – pulling, twisting and bending.</p>\n<p>“Carbon is quite bad with dealing with those types of complex load cases and it’s also very bad at dealing with complex shapes.”</p>\n<p>Gowe says another benefit is it gives you the freedom to create shapes with a very high strength-to-weight ratio. “You’re able to put material exactly where you want it to deal with very specific stresses that are being experienced in that part,” he adds.</p>\n<p>“In a more traditional method, like CNC machining, you’ve got to get access for the cutter to get in to remove material.”</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Padding on a 3D-printed Fizik saddle\" title=\"Padding on a 3D-printed Fizik saddle\" />\n\n</div><div><figcaption><span><i></i> According to Fizik, the honeycomb-like structure of a 3D-printed saddle offers a 60 per cent reduction in pressure.</span></figcaption><span> <i>Fizik</i></span></div>\n<p>This advantage isn’t limited to printing in metals though, as Fizik’s 3D-printed saddles show.</p>\n<p>The padding is constructed from a carbon fibre compound that’s printed in a lattice structure shaped like a honeycomb.</p>\n<p>Locatelli claims this is “especially good for the rebounding and damping vibration needs” of a saddle, with “an average reduction in peak pressure of about 60 per cent” compared to a standard, non-3D printed model.</p>\n<p>He adds that pressure-mapping tools have shown it can improve balance on the saddle too, minimising loss of power transfer for those at the sharp end of racing.</p>\n<h2>Lowering barriers to entry</h2>\n<p>If you were to think all of this sounds expensive, you’d be right.</p>\n<p>However, for some smaller manufacturers, it can work out cheaper than alternative methods, by localising production and opening the market to companies who wouldn’t be able to invest in the tools, moulds and stock required to compete in the traditional supply chain.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Making of Atherton Bikes\" title=\"Full Speed Ahead - Atherton Bikes - 04\" />\n\n</div><div><figcaption><span><i></i> Atherton Bikes has worked closely with UK firm Renishaw.</span></figcaption><span> <i>Dan Griffiths / Our Media</i></span></div>\n<p>“Some customers say it’s decentralised parts production,” says Ben Collins, senior additive manufacturing application engineer at Renishaw, a UK-based 3D printer manufacturer that was integral in the design of <a href=\"https://www.bikeradar.com/features/pro-bike/hope-hb-t/\">Team GB’s Hope HB.T track bike for the Tokyo 2020 Olympics</a>.</p>\n<p>“Manufacturers can dock machines around the world and create different parts in different areas.”</p>\n<p>Gowe says this benefit of 3D printing enables and feeds into Atherton Bikes’ long-term plans.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Hope HB.T track bike\" title=\"A new hope 07\" />\n\n</div><div><figcaption><span><i></i> Renishaw also worked with Hope to develop the striking HB.T track bike for Team GB.</span></figcaption><span> <i>Mick Kirkman / Immediate Media</i></span></div>\n<p>“We would like to always manufacture local to where the product is being used. [Rather than] shipping things three times around the world, we could have a printer and a very small team in North America, for example, printing parts for the North American market.”</p>\n<p>The fluidity of production also enables companies to respond to new standards or changes without being left with stock that suddenly becomes out-of-date.</p>\n<p>“We make to order, so we can constantly update our product – if something like <a href=\"https://www.bikeradar.com/advice/workshop/sram-udh/\">[SRAM] UDH</a> comes along, you don’t have to scrap it and start again,” adds Gowe.</p>\n<h2>3D printing’s limitations</h2>\n<p>Additive manufacturing clearly has a number of benefits. But if it’s so good, why aren’t we all riding around on bikes that look like something straight out of Tron?</p>\n<p>While the first commercial 3D printer was unveiled in the 1990s, it’s still a relatively new – and niche – piece of technology. While there are small-scale advantages, 3D printing can also come with eye-watering costs if you’re looking to roll out a printed product for the mass market.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"An exhibitor displays a small 3D printer at the 2023 Kunshan Yuan Universe International Equipment Exhibition\" title=\"An exhibitor displays a small 3D printer at the 2023 Kunshan Yuan Universe International Equipment Exhibition\" />\n\n</div><div><figcaption><span><i></i> While it’s a fast-developing technology, 3D printers are still prohibitively expensive to own.</span></figcaption><span> <i>Getty Images</i></span></div>\n<p>Although relatively quick compared to other forms of prototyping, 3D printing is quite a slow and labour-intensive process. “We have a single Renishaw printer,” says Gowe. “It currently takes around 18 hours to build a set of lugs for one bike, so that’s a very hard limit on how many bikes we can make a year.</p>\n<p>“Eighteen hours is still a long time, whether you’ve got one printer or 10 printers.”</p>\n<p>Once a product has been 3D-printed, then, depending on the complexity of the design and the product’s final use, it may have to be baked in an oven; cut away from the build plate; have structures that are integral for heat dissipation and support during the printing process removed; get shot blasted; and have any bearing threads and fits CNC-machined before it’s cleaned and inspected ready for its final use.</p>\n<p>“A lot of people think once you’ve printed a part it’s done, but that’s pretty much the start of the process,” says Renishaw’s Collins.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"3D-printed Fizik saddle\" title=\"3D-printed Fizik saddle\" />\n\n</div><div><figcaption><span><i></i> Fizik’s Alex Locatelli says the brand is limited in the sizing and shape of the honeycomb structures used on its 3D-printed saddles.</span></figcaption><span> <i>Fizik</i></span></div>\n<p>The intricate designs required for small components such as saddle padding or sunglasses are at the ceiling of what is currently possible with the technology, too. “We are a little bit limited in the honeycomb structures and the sizing of the honeycomb that we can use,” explains Fizik’s Locatelli.</p>\n<p>Investing in the technology, though, is the ultimate barrier to entry. “To make it commercially viable, it has to be a reasonable cost to manufacture, and that’s the issue at the moment – material costs are really expensive, machine costs are massively expensive, and you’ve also got setup costs – you need to buy the space, you need to create the ancillaries,” explains Collins.</p>\n<p>It’s why the likes of SunGod use third-party bureaus, and why it has no plans to change this in the near future. “With 3D-printed technology developing so quickly at the minute, it doesn’t make sense for us to buy a machine, which is then going to be [updated] in three years’ time,” says Watkiss.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Development drawing of SunGodd GT sunglasses\" title=\"Development drawing of SunGodd GT sunglasses\" />\n\n</div><div><figcaption><span><i></i> Like many brands, SunGod uses a third party to manufacture 3D-printed products.</span></figcaption><span> <i>Charlie Allenby / Our Media</i></span></div>\n<h2>A 3D-printed future?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"3d printing technology for the aerospace industry\" title=\"3d printing technology for the aerospace industry\" />\n\n</div><div><figcaption><span><i></i> The growing use of 3D printing in the aerospace and automotive industries could accelerate the technology.</span></figcaption><span> <i>Getty Images</i></span></div>\n<p>As with all new technologies, there is a continual trickle-down effect, where processes get cheaper with each new improvement and increase in manufacturing supply.</p>\n<p>Collins says Renishaw’s aim with its next generation of machines is that they “can do full production at scale with as little hands-on”, while Gowe of Atherton Bikes believes the growing interest from the aerospace and automotive industries will accelerate 3D printing because “it’s got huge money behind it”, helping lower the costs.</p>\n<p>So are additive-manufactured frames and componentry likely to consign traditional materials and processes to the past in the not-too-distant future?</p>\n<p>Collins believes it’s a possibility: “You could have a whole frame created with this lattice structure and then have a really small skin on the top of it. In theory, that should be a really strong and lightweight frame design that you couldn’t create in any other kind of way.”</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Liam Cahill in wind tunnel getting bike fit.\" title=\"cyp_aero_ 314\" />\n\n</div><div><figcaption><span><i></i> Could 3D printing open up the option of custom parts following a bike fit?</span></figcaption><span> <i>Joseph Branston / Our Media</i></span></div>\n<p>Locatelli says Fizik’s immediate plan is to roll out the technology across “all the premium ranges of our saddles”, but expects that in years to come, 3D printing will come into its own in terms of customisation and bike fit.</p>\n<p>“If you go to a bike fitter before going to buy a bicycle, you can get all the data and send it to the bike manufacturer. They can customise the moulds to have your components in the right size for you,” he says.</p>\n<p>Locatelli says this will go a step further than the process currently used by brands such as Atherton Bikes – where different lengths of carbon tubes are bonded to 3D-printed titanium lugs to offer 22 different stock sizes and the option of completely custom frame geometry.</p>\n<p>“It will help to get a one-to-one bicycle for each rider – for example, they can have the handlebar with different curvature, width, dimensions, length.”</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Charlie Hatton 's Atherton Bike at Malvern Classic\" title=\"Charlie Hatton 's Atherton Bike at Malvern Classic\" />\n\n</div><div><figcaption><span><i></i> The Atherton AM.200 of new men’s downhill world champion Charlie Hatton uses 3D-printed lugs – but don’t expect to see them on an entry-level bike any time soon.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>Gowe is more pragmatic, suggesting that “it’s about finding the best solution for each component or each aspect of the bike. In some cases, that’ll be 3D printing, and in other cases, it will be more traditional methods.”</p>\n<p>Ultimately, 3D printing is here to stay, and will only become more commonplace as the technology evolves and production costs decrease.</p>\n<p>Don’t expect to buy a 3D-printed entry-level bike any time soon, though.</p>","author":"Charlie Allenby","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"e88da288c1d1aa01b80d39a84ea79bd94a51f9d2dba717d67ff242c0ada7a59d","category":"Cycling"}