{"title":"PSIV-21 Lipopolysaccharide (LPS) challenge alters the plasma metabolome of beef cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/461/7757728?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The objective of this study was to evaluate the serum metabolome at 3 major time points in cattle subjected to a lipopolysaccharide challenge. Steers (n = 10; 379 kg ± 30.7) were challenged intravenously with LPS [0.25 µg/kg body weight (BW)], and plasma was isolated from blood at -2, 0, 2, 4, 6, 8, 10, 12, 18, 24, 36, and 48 h relative to the LPS challenge at 0 h. Samples were selected for metabolomic analysis at -2, 2, and 8 h of the challenge based on oxidative stress markers present in companion studies. Liquid chromatography-electrospray ionization-high resolution mass spectrometry was used to separate and detect metabolites (50 to 1,400 m/z). Mass spectral features were annotated using MS-DIAL. Total ion count intensities were median normalized, log<sub>10</sub> transformed, and analyzed using MetaboAnalyst v.5. Partial least squares-discriminant analysis (PLS-DA), agglomerative clustering (AHC), and an analysis of variance (ANOVA) with a false discovery rate (FDR) adjusted <span>P</span> &lt; 0.05 were conducted. Of the 245 annotated metabolites, 155 differed between time points. Partial Least Squares- Discriminant Analysis (PLS-DA) and variable importance in projection (VIP) plot were used to visualize treatments and identify compounds driving discrimination between groups. Hierarchical clustering using the Ward method was used to determine metabolite differences present following an endotoxin challenge in cattle. Pathway analyses were also conducted via KEGG <span>Bos taurus</span> pathway library. Based on AHC, 2 clusters were generated where -2 h clustered separate from 2h and 8h. A PLS-DA explained most variation within the model across Component 1 (47.5%), with clear separation of metabolites present at -2 h versus those present at 2 and 8 h post challenge. A VIP plot recognized metabolite differences driven by taurocholic acid, LysoPE (18:3; Lysophospholipid), butyric acid, acitretin, and tauromuricholic acid. Pathway analyses further identified arginine biosynthesis, beta-alanine metabolism, arginine and proline metabolism, and histidine metabolism as the metabolic pathways likely driving differences in the data (FDR <span>P</span> &lt; 0.05). These data suggest that metabolites change drastically following an immune response and identify differences which may be further related to or contributing to oxidative stress in vivo. Additional research could aid in the identification of biomarkers significant to recognizing immune dysfunction and oxidative stress.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e892a6c0b3fa6391d9e42893512cca130e96530a57d3bb57aa2a29b047038a1a","category":"Environment"}