{"title":"Beyond the front yard: investigating environmental drivers of residential snake removals across two spatial scales in a desert city","link":"http://link.springer.com/10.1007/s11252-024-01578-2","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>In urban and suburban areas, wildlife and people are often in close quarters, leading to human-wildlife interactions (HWI). Understanding how wildlife interacts with humans and the built environment is critical as urbanization contributes to habitat change and fragmentation globally. The environmental drivers that influence HWIs are largely unknown in some systems, however, especially across multiple spatial scales. Using location and species data from a business that relocates snakes across the Phoenix metropolitan area (Arizona, USA), we found the most frequently removed were venomous (family Viperidae, e.g., rattlesnakes). Nonvenomous snakes were also removed (family Colubridae, e.g., gophersnakes). Using these records, we investigated taxa-specific habitat relationships at two spatial scales. The neighborhood scale focused on front yard measures of cover and vegetation classes, and the landscape scale focused on remote-sensed variables related to vegetation indices and degree of urbanization. Both analyses compared areas where snakes were removed to random locations in the city to evaluate used and available locations of snakes. At the neighborhood scale, snake removals (<em>n</em> = 59) occurred in yards with abundant vegetation and debris cover opportunities compared to random locations. At the landscape scale, snake removal locations (<em>n</em> = 764) had taxa-specific differences, with nonvenomous snakes removed from areas of higher urbanization than venomous snakes, a pattern was likely related to differences in life history and behavior. Environmental variables associated with HWI can vary across different spatial scales. Understanding these environmental characteristics associated with snake removals from residential can focus management activities to reduce potential human-snake conflict.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"e895f6a4e66ee4b7c705ae737188303bcaf1a4fca9e5caa63afd2bfeec662a51","category":"Environment"}