{"title":"Efficient data collection for camera trap‐based density estimation: A preliminary assessment","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12300?af=R","date":1706428800000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/004b2070-697c-41e0-8df2-8e9d45343801/eso312300-toc-0001-m.png\" alt=\"Efficient data collection for camera trap-based density estimation: A preliminary assessment\" />\n<p>Camera traps offer valuable wildlife data but analysis can be resource-intensive. Estimating distance based on animal size could enable efficient, retrospective analysis of diverse datasets. We assess the use of this approach on South African carnivores and Hungarian wild boar.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nCamera traps have great potential for generating wildlife insights by providing high resolution site-specific data. Methods of data collection and analysis reliant on these tools for population density estimation can be relatively resource intensive, hindering their mainstream adoption.\n\nHere, we explore the potential of population density estimates derived from a distance sampling method based on optics theory, which greatly simplifies the process of setting up camera sites and analysing data. Specifically, we (1) tested the method on human subjects in an artificial environment, (2) compared it to another method relying on virtual grids on images using wild populations of black-backed jackal (<i>Canis mesomelas</i>) and African civet (<i>Civettictis civetta</i>) in South Africa and (3) deployed it to estimate wild boar (<i>Sus scrofa</i>) population densities in Hungary.\n\nThe initial human trials resulted in an estimate that was extremely close to true population density. When compared to the virtual grid method, results suggest that our distance sampling method can deliver accurate estimates with increased convenience and robustness against disruptions of the camera sites. The wild boar study resulted in a realistic density estimate, which can be used as a baseline when assessing future fluctuations in population density.\n\nAs this new approach does not have special requirements for setting up camera sites, it is efficient and widely applicable across other density estimation methods requiring an estimate for effective detection distance. Additionally, the method can be applied in the retrospective analysis of existing datasets.\n</p>","author":"Bálint Ternyik, \nJamie E. T. McKaughan, \nRussell A. Hill, \nPhilip A. Stephens","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"e8a2116ad340f76ac8ebda5611ea0e437ca0417c04caffd27195d217919e8b99","category":"Environment"}