{"title":"What to Expect From Apple in 2024: Vision Pro, iPhone 16 Models, Revamped iPad Pro and More","link":"https://www.macrumors.com/guide/apple-what-to-expect-2024/","date":1703879761000,"content":"2024 is going to start off strong with the launch of the Vision Pro, Apple's first major new product since the 2015 Apple Watch, and new iPads, Macs, AirPods, and iPhones are set to follow.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nThere are some exciting products in the works, including a larger version of the <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a>, the first <a href=\"https://www.macrumors.com/guide/oled-ipad-pro/\">OLED iPad Pro</a>, updated iPhones, an Apple Watch with new health features, and more. In this guide, we've outlined everything that we know about the new products that are coming from Apple in 2024, based on current rumors.\r<br />\n\r<br />\n<h2>Apple Vision Pro (February 2024)</h2>\r<br />\nApple announced <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">the Vision Pro headset</a> at WWDC in June 2023, but it's finally almost ready to launch. Apple introduced the Vision Pro early to give developers time to create apps for the device, and since then, Apple has been working on finalizing the hardware and the <a href=\"https://www.macrumors.com/roundup/visionos/\">visionOS</a> operating system. The most recent rumors have suggested Apple will debut the Vision Pro in February.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/Vision-Pro-Person.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nAt launch, the Vision Pro is only going to be available in the United States, and it sounds like Apple may require customers <a href=\"https://www.macrumors.com/2023/12/11/apple-to-push-vision-pro-customers-to-pick-up/\">to purchase in store</a> or pick up online orders in a store in order for Apple employees to provide the right Light Seal and knitted headband for a good fit, plus Zeiss prescription lens inserts for those who need them.\r<br />\n\r<br />\nThe headset is similar to other virtual reality headsets like the Oculus, though it is made from glass and aluminum for a premium feel. Some early testers have said that the headset can be heavy on the head, but Apple may introduce an extra strap to mitigate some of the weight. The Vision Pro is using two 4K micro-OLED displays, and the technology is both more advanced and more expensive than the displays used by Apple's competitors.\r<br />\n\r<br />\nApple is not expecting to sell many Vision Pro headsets, and rumors suggest it'll manufacture around 400,000 units. At a $3,500 price point, it's not too surprising that interest may be limited.\r<br />\n\r<br />\nThe Vision Pro headset is a mixed reality device that transitions between virtual and augmented reality using a Digital Crown on the side. Content can be displayed in a full virtual environment, or in the real world around you using the augmented reality capabilities.\r<br />\n\r<br />\nThere are more than a dozen cameras in the Vision Pro headset, and it's controlled using subtle hand gestures and eye movements. Audio Straps provide spatial audio, and there's a somewhat weird external display that projects an image of your eyes so people can tell whether you're using the headset in VR or AR mode.\r<br />\n\r<br />\nWhile the headset isn't particularly affordable for most people, it's an exciting launch because it's using cutting-edge technology and it is an entirely new device that's going to evolve and become sleeker and more affordable over the next decade. The Vision Pro has been likened to the Apple Watch, which was also expensive and clunky when it launched, but Apple made updates at a rapid pace and by the third generation, it was much improved.\r<br />\n\r<br />\nMuch more information about the Vision Pro <strong><a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">can be found in our Vision Pro roundup</a></strong>, and we also have <a href=\"https://www.macrumors.com/roundup/visionos/\">details on visionOS in that roundup</a>.\r<br />\n\r<br />\n<h2>OLED iPad Pro (March 2024)</h2>\r<br />\nApple didn't update the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> lineup in 2023, but 2024 will be the year of the ‌iPad‌. The <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> models are set to get upgraded OLED displays for the first time, so ‌iPad Pro‌ screens will be as impressive as <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> screens.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/06/OLED-iPad-Air.jpg\" width=\"2363\" height=\"1329\" />\r<br />\nThis will be the first time that Apple has used OLED for such a large display, and OLED technology will bring deeper blacks, faster refresh rates, better contrast, and improved efficiency for less battery drain.\r<br />\n\r<br />\nOLED displays are thinner, so Apple may be planning to cut down on the thickness of the ‌iPad Pro‌. A design update is expected to accompany the OLED transition, and the new iPads will come in 11.1-inch and 13-inch sizes, up from the current 11-inch and 12.9-inch sizes. The size increase may come from a change in bezel width, so physical size could remain roughly the same.\r<br />\n\r<br />\nThe ‌iPad Pro‌ models will adopt the faster M3 chip that was first introduced in the MacBook Pro and <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a>. Built on a 3-nanometer process, the M3 offers up to 21 percent faster CPU speeds <a href=\"https://www.macrumors.com/guide/how-much-better-really-is-m3/\">compared to the M2</a>, and 15 percent faster GPU speeds. The GPU is also using a new architecture that optimizes memory allocation and utilization for improved performance and efficiency, plus it includes hardware-accelerated ray tracing and mesh shading.\r<br />\n\r<br />\nGPU improvements will result in better gaming graphics and capabilities, plus the ‌iPad Pro‌ will be more efficient at tasks like video editing.\r<br />\n\r<br />\nOther possible features include up to 4TB of storage, <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> charging capabilities, and a higher price tag due to the OLED display technology. More on what we are expecting from the ‌iPad Pro‌ can be found in <a href=\"https://www.macrumors.com/guide/oled-ipad-pro/\"><strong>our dedicated OLED iPad Pro guide</strong></a>.\r<br />\n\r<br />\n<h2>Two iPad Air Models (March 2024)</h2>\r<br />\nTo offer consumers more choice at a variety of price points, Apple is expanding the ‌iPad Air‌ lineup in 2024. For the first time, there will be two ‌iPad Air‌ models, just like there are two ‌iPad Pro‌ models.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/iPad-Air-12.9-Inch-Feature.jpg\" width=\"2192\" height=\"1233\" />\r<br />\nSizes will be similar to the ‌iPad Pro‌, coming in at 10.9 inches and 12.9 inches. The ‌iPad Air‌ models won't have OLED displays, ProMotion, or other high-end ‌iPad‌ features, but they will be cheaper than the ‌iPad Pro‌ models.\r<br />\n\r<br />\nSince Apple updated the design of the ‌iPad Air‌ in 2021, we're not expecting a major overhaul to the look of the device, but it's possible there will be some refinements to accommodate the new screen size.\r<br />\n\r<br />\n<h2>iOS 18 (June 2024)</h2>\r<br />\nApple introduces new software updates on an annual basis at its Worldwide Developers Conference, and this year, we're expecting <a href=\"https://www.macrumors.com/roundup/ios-18/\">iOS 18</a>. ‌iOS 18‌ should be one of the most interesting updates we've had in years because rumors so far suggest that we're going to see Apple getting into generative AI in a big way.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iOS-18-Mock-Feature-Baubles.jpg\" width=\"2250\" height=\"1266\" />\r<br />\nAI and machine learning will be used in multiple ways in ‌iOS 18‌, with a range of new AI integrations in apps. In <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a>, for example, we might see auto-generated playlists, and in apps like Pages and Keynote, we may see AI-assisted writing and slide deck creation.\r<br />\n\r<br />\n<a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> is expected to get features powered by large language models (LLMs), which are the driving force behind chatbots like chatGPT. ‌Siri‌ will include deeper integration with the Shortcuts app for automating complex tasks, and there will be improved interactions between ‌Siri‌ and the Messages app.\r<br />\n\r<br />\nSpeaking of Messages, ‌iOS 18‌ will see Apple adopting Rich Communication Services (<a href=\"https://www.macrumors.com/guide/rcs/\">RCS</a>) as an alternative to SMS/MMS. ‌RCS‌ will be used for conversations between ‌iPhone‌ users and Android users, and it will improve cross-platform messaging.\r<br />\n\r<br />\nHigher-resolution photos and videos will be supported, as will audio messages, cross-platform emoji reactions, read receipts, real-time typing indicators, and more. Basically, texting with someone on Android will feel a lot more like chatting with another ‌iPhone‌ user.\r<br />\n\r<br />\nBlue and green bubbles aren't going away, though. iMessage to iMessage chats will be blue, and Android to iMessage chats will still be green.\r<br />\n\r<br />\nMore information on what to expect from the ‌iOS 18‌ update <a href=\"https://www.macrumors.com/roundup/ios-18/\"><strong>can be found in our iOS 18 roundup</strong></a>.\r<br />\n\r<br />\n<h3>macOS 15, watchOS 11, and tvOS 18</h3>\r<br />\nAlong with ‌iOS 18‌, we'll also get new versions of macOS, watchOS, and tvOS. We haven't heard much about these updates, but we can expect some of the same AI improvements.\r<br />\n\r<br />\n<h3>visionOS 2</h3>\r<br />\nAlongside the Vision Pro headset, Apple will introduce ‌visionOS‌, the operating system that's designed to run on the device. It has a <a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a>, a dedicated <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, virtual reality environments, and Apple apps tailored to the Vision Pro Display. While the first iteration of ‌visionOS‌ will come out alongside the headset, ‌visionOS‌ 2 will likely be previewed in June. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/visionos-home-screen-mt-hood.jpg\" width=\"1600\" height=\"900\" />\r<br />\n<h2>Apple TV (First Half of 2024)</h2>\r<br />\nApple is working on a new version of the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> 4K, but it is not yet clear when it's going to launch. Rumored features include a faster A16 processor and support for Wi-Fi 6E or Wi-Fi 7.\r<br />\n\r<br />\nMore on the next-generation ‌Apple TV‌ can be <a href=\"https://www.macrumors.com/guide/2024-apple-tv/\"><strong>found in our Apple TV guide</strong></a>.\r<br />\n\r<br />\n<h2>iPhone 16 (September 2024)</h2>\r<br />\nThe standard <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a> models are expected to look similar to the <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> models with no size or design changes, but there will be some notable improvements. Apple is planning for a vertical camera arrangement to support spatial video capture, doing away with the diagonal lens setup.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iPhone-16-Mock-Header-With-Dynamic-Island.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nRight now, the <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> models are the only devices able to record spatial video that can be viewed on the Vision Pro, but that is expected to change in 2024. There's also going to be a new Capture Button on all four ‌iPhone 16‌ models, with the button situated on the right side of the device under the power button.\r<br />\n\r<br />\nIt'll be in roughly the same spot as the mmWave antenna on U.S. ‌iPhone‌ models, with the mmWave antenna set to move to the left side. As the name suggests, the Capture Button will provide users with a quick way to take videos. The Capture Button will be capacitive, offering haptic feedback when pressed, plus rumors suggest it supports multiple pressure levels.\r<br />\n\r<br />\nThe Action Button introduced with the ‌iPhone 15 Pro‌ is expected to expand to the standard ‌iPhone 16‌ models, so it will be available across the 2024 lineup. The Action Button can be assigned to do things like mute/unmute, activate translate, turn on the flashlight, set a Focus mode, activate a custom Shortcut, and more.\r<br />\n\r<br />\nThe Action Button on the ‌iPhone 16‌ models could be upgraded to use capacitive technology, which would provide haptic feedback when pressed.\r<br />\n\r<br />\nWith the ‌iPhone 15‌ lineup, Apple limited the 3-nanometer A17 Pro to the ‌iPhone 15 Pro‌ and Pro Max, but in 2024, all four ‌iPhone‌ models will get 3-nanometer A-series chips. A new thermal design to combat overheating is a possibility as well.\r<br />\n\r<br />\nWe have more on all of the features rumored for the ‌iPhone 16‌ <a href=\"https://www.macrumors.com/roundup/iphone-16/\"><strong>in our iPhone 16 roundup</strong></a>.\r<br />\n\r<br />\n<h2>iPhone 16 Pro (September 2024)</h2>\r<br />\nApple's flagship lineup consists of four phones, two standard models and two Pro models. This year, the <a href=\"https://www.macrumors.com/roundup/iphone-16-pro/\">iPhone 16 Pro</a> models are going to get a size update.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/iPhone-16-Pro-Mock-Header-Updated.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe ‌iPhone 16 Pro‌ is expected to have a 6.3-inch display, up from 6.1 inches, while the ‌iPhone 15 Pro‌ Max is expected to have a 6.9-inch display, up from 6.7 inches. To accommodate the larger displays, the ‌iPhone 16 Pro‌ and Pro Max will be slightly taller and wider than the equivalent ‌iPhone 15 Pro‌ models.\r<br />\n\r<br />\nAll of the features coming to the ‌iPhone 16‌ lineup are expected for the ‌iPhone 16 Pro‌ models, including the capacitive Capture Button on the right side and an updated capacitive Action Button, both of which will feature haptic feedback.\r<br />\n\r<br />\nA faster A-series chip is rumored, likely the A18 Pro, and there are some pretty major camera updates planned. Apple may add a 48-megapixel Ultra Wide lens, which will join the 48-megapixel Wide lens. The Ultra Wide camera will offer better low-light performance, and it will facilitate better spatial videos for the Vision Pro headset too.\r<br />\n\r<br />\nBoth the ‌iPhone 16 Pro‌ and the ‌iPhone 16 Pro‌ Max will get the 5x tetraprism lens that was limited to the 15 Pro Max in 2023, and there's one rumor about an even better periscope camera with \"super zoom\" capabilities.\r<br />\n\r<br />\nFaster 5G modem chips from Qualcomm are expected, and the ‌iPhone 16 Pro‌ models may also get the next-generation Wi-Fi 7 technology that offers up to 2.4x faster speeds than Wi-Fi 6.\r<br />\n\r<br />\n<h2>Apple Watch X (September 2024)</h2>\r<br />\nApple is planning a major update for the Apple Watch this year, perhaps in celebration of the 10th anniversary of the device. The Apple Watch was announced in 2014, but didn't come out until 2015, so technically it's not clear whether the anniversary will fall in 2024 or 2025. 2024 will, however, be the year that we're expected to get the \"Apple Watch 10\" or \"<a href=\"https://www.macrumors.com/guide/apple-watch-x/\">Apple Watch X</a>\" as rumors have called it.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/apple-watch-ultra-pink.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nRumors suggest there will be a new design and new health features for the 2024 Apple Watch. The next Apple Watch could be slimmer, and Apple may implement a magnetic band attachment system, changing how bands connect to the Apple Watch for the first time.\r<br />\n\r<br />\nThe new band system would mean that current bands would <a href=\"https://www.macrumors.com/2023/12/20/your-apple-watch-bands-may-not-work-with-new-model/\">not likely be compatible</a> with the new version of the Apple Watch, but swapping over to a magnetic system would free up space in the Apple Watch either to make the casing slimmer or to add bigger batteries or other new internal components.\r<br />\n\r<br />\nApple hasn't added new health features to the watch for some time, but in 2024, we could see sleep apnea detection and blood pressure monitoring. Rumors suggest the Apple Watch will be able to detect hypertension, monitoring whether a user's blood pressure is trending upward. The first iteration of blood pressure monitoring won't give specific systolic and diastolic readings, but a future version might.\r<br />\n\r<br />\nSleep apnea detection will be done through sleep measurements and the tracking of breathing patterns. The Apple Watch will be able to inform users if the condition might be present, allowing them to contact their doctor for more information.\r<br />\n\r<br />\nMore on changes expected for the 2024 Apple Watch <a href=\"https://www.macrumors.com/guide/apple-watch-x/\">can be found in our Apple Watch X guide</a>.\r<br />\n\r<br />\n<h2>AirPods 4 (September 2024)</h2>\r<br />\nFourth-generation AirPods are coming in 2024, and as with the <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a> and ‌iPad Air‌, Apple is going for a two-model launch. Two versions of the AirPods will be available at different price points, with the higher-end version to gain Active Noise Cancellation, a feature that has previously been limited to the <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> and <a href=\"https://www.macrumors.com/roundup/airpods-max/\">AirPods Max</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/07/airpodsd-3-purple-4.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe <a href=\"https://www.macrumors.com/guide/airpods-4/\">AirPods 4</a> will have an updated design that's a cross between the current <a href=\"https://www.macrumors.com/roundup/airpods/\">AirPods 3</a> and the ‌AirPods Pro‌, with shorter stems. Fit is expected to be improved, as is sound quality, but it is unclear if Apple will add silicone tips.\r<br />\n\r<br />\nA redesigned case is set to feature speakers for <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> alerts and a USB-C charging port, and with a software update coming later in 2024, Apple will add hearing aid functionality that will let the AirPods serve as an over-the-counter alternative to traditional hearing aids.\r<br />\n\r<br />\nNew ‌AirPods Pro‌ are in the works too, but a refresh isn't expected until 2025.\r<br />\n\r<br />\n<h2>USB-C AirPods Max (September 2024)</h2>\r<br />\nApple hasn't updated the ‌AirPods Max‌ since launch, and in 2024, they'll get a minor refresh. Apple is expected to add a USB-C port for charging and new color options, but nothing else will change.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/11/airpods-max-cyber.jpg\" width=\"2500\" height=\"1406\" />\r<br />\n<h2>iPad Mini 7 (October 2024)</h2>\r<br />\nThere's a new version of the <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a> coming, but no design changes are planned. We can expect an upgraded A-series chip, likely the A16, along with upgraded front and rear cameras.\r<br />\n\r<br />\nThe display assembly may be installed in a different way in order to minimize \"jelly scrolling\" or screen tearing, which can cause images and text on one side of the display to be tilted downward due to mismatched refresh rates.\r<br />\n\r<br />\nNew colors are likely, and Apple will probably add Wi-Fi 6E and Bluetooth 5.3, improvements it has been making to all of its ‌iPad‌ models.\r<br />\n\r<br />\n<h2>Refreshed Low-Cost iPad (October 2024)</h2>\r<br />\nAlongside the new ‌iPad mini‌ 7, we could see a refreshed low-cost ‌iPad‌. Apple typically updates the ‌iPad‌ on an annual basis, but the company skipped 2023, so we're due for a refresh.\r<br />\n\r<br />\nNo design changes are coming, but the ‌iPad‌ will get a faster chip (likely the A16), and it could be updated with support for Wi-Fi 6E.\r<br />\n\r<br />\n<h2>Mac mini (Late 2024)</h2>\r<br />\nThe <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a> is due for an update, as it was last refreshed with <a href=\"https://www.macrumors.com/guide/m2/\">M2</a> chips in January 2023. A 2024 version of the desktop machine will include Apple's M3 and M3 Pro chips.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/mac-mini-purple.jpg\" width=\"2500\" height=\"1406\" />\r<br />\n<h2>Accessories</h2>\r<br />\n<h3>Magic Keyboard</h3>\r<br />\nAlongside the new ‌iPad Pro‌ models, Apple is expected to debut an <a href=\"https://www.macrumors.com/2023/12/08/magic-keyboard-apple-pencil-rumors/\">updated version of the Magic Keyboard</a>. The new Magic Keyboard will feature a sturdier frame made from aluminum, giving it a more Mac-like look.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/04/2021-Magic-Keyboard-Blue.jpg\" width=\"2226\" height=\"1252\" />\r<br />\nThe keyboard will be made of aluminum as well, and Apple is planning to add a larger trackpad that more closely resembles the trackpad of the MacBook.\r<br />\n\r<br />\n<h3>Apple Pencil 3</h3>\r<br />\nA <a href=\"https://www.macrumors.com/2023/12/08/magic-keyboard-apple-pencil-rumors/\">refreshed version of the Apple Pencil</a> is in the works, with the new device set to be a followup to the <a href=\"https://www.macrumors.com/guide/apple-pencil/\">Apple Pencil</a> 2. It will be a higher-end ‌Apple Pencil‌ able to work with Apple's next-generation ‌iPad Pro‌ and ‌iPad Air‌.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/apple-pencil-memorial-day.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nWe don't yet know a lot about what we can expect from a new ‌Apple Pencil‌.\r<br />\n\r<br />\n<h2>Other Possibilities</h2>\r<br />\n<ul>\r<br />\n <li><strong>MacBook Pro</strong> - The MacBook Pro was updated with M3, M3 Pro, and M3 Max chips in late 2023. Apple sometimes refreshes the MacBook Pro annually, but so far there's no word of M4 chips or whether we'll see a MacBook Pro update in 2024.</li>\r<br />\n <li><strong>Mac Studio</strong> - The <a href=\"https://www.macrumors.com/roundup/mac-studio/\">Mac Studio</a> was updated with ‌M2‌ Max and ‌M2‌ Ultra chips in June 2023, so it could get an update with M3 chips at some point in 2024. Apple has not yet unveiled an M3 Ultra chip.</li>\r<br />\n <li><strong>Mac Pro</strong> - Like the ‌Mac Studio‌, the <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a> was refreshed in June 2023 with the ‌M2‌ Ultra. There's no word on when we'll see it updated again as of yet.</li>\r<br />\n <li><strong>Home Hub Device</strong> - Rumors suggest Apple is working on a smart home display that would serve as a central hub for controlling smart home products, and <a href=\"https://www.macrumors.com/2023/01/18/apple-smart-home-ipad-display/\">it could launch</a> as soon as 2024.</li>\r<br />\n <li><strong>New Display</strong> - There have been multiple rumors of a Pro Display XDR successor, but there's no word on when an update might come. It could be 2024, or it could be later.</li>\r<br />\n</ul>\r<br />\n<h2>Wrap Up</h2>\r<br />\nBased on what we're hearing so far, 2024 is going to be a monumental year for Apple. Along with the Vision Pro, the ‌iPad‌ lineup is set to get an overhaul, and the new ‌iPhone‌ models have some exciting features. We're also counting on a suite of new AI features in the software updates that are coming this year.\r<br />\n\r<br />\nMake sure to follow MacRumors.com and <a href=\"https://www.macrumors.com/roundup/\">the MacRumors roundups</a> and <a href=\"https://www.macrumors.com/guide/\">guides</a> over the course of 2024 to keep up with all of the rumors we're hearing. Bookmark our <a href=\"https://www.macrumors.com/guide/upcoming-apple-products/\">What to Expect Guide</a> and our <a href=\"https://www.macrumors.com/guide/apple-event/\">Events Guide</a> to see a continually updated overview of what's on the horizon.<br />This article, \"<a href=\"https://www.macrumors.com/guide/apple-what-to-expect-2024/\">What to Expect From Apple in 2024: Vision Pro, iPhone 16 Models, Revamped iPad Pro and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/what-to-expect-from-apple-in-2024-vision-pro-iphone-16-models-revamped-ipad-pro-and-more.2414978/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"e8a9b622d30c24b8a38b2e393644ab814d757a1ea8f439e19672b97535030555","category":"Apple"}