{"title":"Emil Carr-Ross Reflects on Being the Only Woman to Finish the 2023 l’Esperit de Girona – Richard Abraham, Tom Hardie, & Emil Carr-Ross","link":"https://theradavist.com/emil-carr-ross-2023-lespirit-de-girona/","date":1705842016000,"content":"<p><em>In September, <a href=\"https://emilcarr.scot/\">Emil Carr-Ross</a> became the first and only woman to finish the second edition of <a href=\"https://www.lesperitdelbikepacking.org/lesperit-de-girona-info\">L’Esperit de Girona</a>, the solo unsupported off-road bikepacking event held in Catalonia. She completed the 800km course in 8 days, 11 hours and 10 minutes. It was her first-ever ultra-distance event. Carr-Ross is also one of the few trans women competing in ultra-cycling. A few weeks after the event, she talked through her ride, her work for a refugee cycling charity in Glasgow, and her experiences as a trans athlete in the sport. Read all about it below…</em><span></span></p>\n<p><img width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-12.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-12.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-12.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-12.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-12.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-12.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-12.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-12.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p><strong>Richard Abraham</strong>: After a few weeks, how do you reflect on your ride at l’Esperit de Girona?</p>\n<p><strong>Emil Carr-Ross</strong>: A lot of people ask me, what was the high? What was the best place? What was the worst? And I can’t pick out anyone. It’s in many ways one of the hardest things I’ve ever been through. But it’s also one of the most worthwhile things that I’ve done for a long time. I have a lot of good memories, and what sticks out the most is just the experience I gained from doing it, from trying different setups in the lead-up to actually going out and doing it and putting all that kit and myself through basically the toughest bikepacking event possible. I came out with a lot of knowledge that I’d like to share with others.</p>\n<p><strong>RA</strong>: What particular memories do you have from the ride itself?</p>\n<p><strong>EC-R</strong>: There was one moment of hiking from Ribes de Freser at the start of the second hike-a-bike section. I got there about eight o’clock which is when the sun set. I was hiking overnight into the village of Nuria and it got to nearly three in the morning. I remember as I was hiking over there I could see a peak on my left totally covered in clouds. Next to it was a break, and I could see the peak I was heading to with clear skies.</p>\n<p>Every few seconds the view on the left was lit up with lightning. Then I looked to my right and could see shooting stars. I remember just stopping and sitting and closing my eyes for ten minutes, going into a half-sleep state, and then waking up finding it so peaceful and stunning. Seeing that peak surrounded by clouds and the way it just lit up. I couldn’t hear it, I could just see it. There was a big waterfall nearby so I could hear the torrent of water. In Catalonia, after sunset, the whole place just swells up with the sounds of insects, more than I’ve ever experienced in Scotland. I found that really striking. Little lizards crossing the paths as well. That’s the most lasting image.</p>\n<p><img width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-3.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-3.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-3.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-3.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-3.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-3.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-3.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-3.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p><strong>RA</strong>: Tell me tell me how you came to enter the event.</p>\n<p><strong>EC-R</strong>: So it was through my friend, Maja Naumcyzk, who had entered other ultra-events before. I know her through the Glasgow alternative cycling scene and when she was training for Race Through Poland, I came out on one of her training rides, a 200km loop starting and finishing in Glasgow and going through the Trossachs. She found that after the Race Through Poland, she was exhausted and didn’t want the rest of the year to be overcome with attempting another ultra. So that meant there was a space on the Tailfin bursary in July, two months before l’Esperit de Girona.</p>\n<p>I had never ridden an ultra or ever done anything of that scale or distance, but having met Maja I became quite interested in what she does. And knowing I had a bike I could adapt, I decided to go for it. Then the next two months of my life were totally focused on scrambling to get everything together.</p>\n<p><img width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-11.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-11.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-11.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-11.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-11.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-11.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-11.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-11.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p><strong>RA</strong>: I was going to ask why you chose to enter the event that nobody finished the previous year, but if that was the spot, then that was the spot…</p>\n<p><strong>EC-R</strong>: Yeah, I was aware of that and found that quite daunting. At first, I was maybe quite naive. I read some testimonials from last year, and very naively didn’t understand why everybody had scratched. But as it got closer and closer, I started to realize that the event was going to be pretty difficult. I started doubting myself, even whether I would finish it.</p>\n<p><strong>RA</strong>: Was there anything that piqued your interest in l’Esperit de Girona in particular?</p>\n<p><strong>EC-R</strong>: I’ve always really liked the idea of how bikes can get you anywhere by your own power. And I like the idea of just going out to places that no one can reach other than on a bike or on foot. It’s just a perfect combination of things for me really. I didn’t really know about ultra-distance as a format until I met my friends but as soon as I heard about them, I didn’t take much convincing.</p>\n<p><strong>RA</strong>: It was the Tailfin bursary that supported you to get there. Would cost have otherwise been a barrier to entry for you?</p>\n<p><strong>EC-R</strong>: The bursary was up to 400 Euros, reimbursed, to cover the cost of getting to the start line. Tailfin actually sent me on some bike-packing bags as well after the event, to help me take part in more events in the future. I’m really grateful for the support but a lot of people would still struggle to enter. I ended up spending basically all my spare income on clothing, gear, and a sleeping bag.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-14.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-14.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-14.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-14.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-14.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-14.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-14.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-14.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p><strong>RA</strong>: Do you know how much it costs you in total to compete?</p>\n<p><strong>EC-R</strong>: I had a spreadsheet with it all worked out. Probably about one and a half grand in total. Now I’ve got that kit, it will be easier for in the future. But I think there are still barriers for a lot of people. There’s also childcare or other care requirements or taking time off work. I don’t have a lot of annual leave left this year. If I was paying for everything myself, I don’t think I would have been able to go.</p>\n<p><strong>RA</strong>: What do you think the experience gave you?</p>\n<p><strong>EC-R</strong>: The race gave me a really great chance for self-reflection. It also gave me the confidence to take on another one. Previous to the event, I kept thinking, ‘No, I don’t really care about competing.’ I was interested in everyday cycling geared to cycling around the city to work and cycling as a means of transport, not as a competitive sport, or not even necessarily for fitness or anything. I’m very passionate about getting people on bikes, and getting people out of cars. But obviously, I also like keeping fit by cycling and challenging myself. And it was as I was getting to that point where I was thinking that I really liked challenging myself further and further and playing about with the bike setup. But I’m very grateful for disciplines like bike-packing. It’s about challenging yourself.</p>\n<p>It also gave me the motivation to help other people do the same. I’m involved in a project called <a href=\"https://dynamocic.org/\">Dynamo Glasgow</a> CIC, a community interest not-for-profit company. We’re queer-led and we’re hoping to start a bike-packing equipment library. Another thing to help more people take on ultra-distance cycling, cycle commuting, or anything on two wheels.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-4.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-4.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-4.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-4.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-4.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-4.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-4.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-4.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p><strong>RA</strong>: Do you think ultra-distance cycling is more of an accessible space for trans athletes to compete?</p>\n<p><strong>EC-R</strong>: Yeah, absolutely. I find bikepacking and Audax riding is inclusive by default, as it’s thought of as more of a personal challenge than a competition. I liked the idea of a personal challenge. It’s really about doing things by your own means. Getting their own own power, your own ability and you don’t have a big broom-wagon of 100 cars driving behind you.</p>\n<p>There are also organizations such as <a href=\"https://www.instagram.com/glasgowpedalcollective/\">Glasgow Pedal Collective</a>, which is women-led and part of a growing alternative cycling scene, which is inclusive by default too. I think, maybe, in what is quite a hard time for trans athletes, we need to just focus on what’s good, such as those organizations.</p>\n<p><strong>RA</strong>: Would you feel comfortable returning to l’Esperit or doing other bikepacking events?</p>\n<p><strong>EC-R</strong>: Definitely. It’s always going to be more difficult for me and others [trans athletes], I think. Maybe that’ll change as I physically transition and can blend in, which I’m in the process of. I’m quite visibly trans. I still have masculine features. So [in the future] that might make me feel more comfortable, knowing that I’m not as visibly trans. But I’m still fairly comfortable. But not everyone in my situation would be. It’s a hard time to be trans in any aspect right now.</p>\n<p>I think it makes it easier when people are proactively trying to include trans people as well. Platforming. Publicly stating that they are inclusive, publicly condemning organizations that aren’t.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-2.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-2.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-2.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-2.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-2.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-2.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-2.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-2.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p><strong>RA</strong>: Now you’ve got a taste for bikepacking, what’s next?</p>\n<p><strong>EC-R</strong>: James [Hayden, l’Esperit de Girona organiser] suggested the Highland Trail 550 race. It’s closer to home, easier to get to, and won’t be as financially difficult as other events. I’d like to come back to Catalonia to do l’Espirit again, however. Go in with better physical condition. When I started this year’s event I was at the tail end of a pretty rough virus. That set the tone for the whole race, where I was constantly struggling. I’d like to return to a better physical condition. With that, and some small changes to my setup, I think I could perform a lot better.</p>\n<p><strong>RA</strong>: What do you think your sort of skills or qualities are as an ultra-distance rider</p>\n<p><strong>EC-R</strong>: I would say I’m someone who definitely can keep it together under pressure. When I get stressed, I’m someone who comes up with solutions. It’s willpower. If I don’t want to do something, I can force myself to do it and keep going. Whereas other people just shut down.</p>\n<p><strong>RA</strong>: Tell me a bit more about your work for the <a href=\"https://www.bikesforrefugees.scot/\">Bikes for Refugees</a> charity.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-16.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/Espirit-Emil-16.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-16.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-16.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-16.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-16.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-16.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/Espirit-Emil-16.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p><strong>EC-R</strong>: I’ve been working there for one year. I’m a Project Worker which entails both being a mechanic and working on admin at the computer. I think the job is a perfect intersection of all of my ideals; I really care a lot about the environment and cycling being the cleanest, most efficient, and most liveable form of transport. Climate justice is also refugee justice; the climate crisis is going to cause massive refugee crises very shortly as much as the world becomes uninhabitable.</p>\n<p>We refurbish and repair bikes and get them out to refugees in Glasgow. We provide helmets, locks, and lights, and we try to offer continuing support as well. Sometimes we arrange skills and confidence sessions. People who are seeking asylum in the UK who have not yet been given the right to remain and have been put into accommodation are only given £5 a day. Where I live, that is the price of a return bus ticket. So that means some days you have to choose between food or going to the lawyer or going to the home office. Bikes are a big improvement to refugees’ financial means. And it’s also a mental health thing. Being outdoors is one of the best things for your mental health.</p>\n<p> </p>\n<hr />\n<p> </p>\n<p> </p>\n<p><em>Many thanks to Emil and Richard for pulling this together!</em></p>\n<p>The post <a href=\"https://theradavist.com/emil-carr-ross-2023-lespirit-de-girona/\">Emil Carr-Ross Reflects on Being the Only Woman to Finish the 2023 l’Esperit de Girona</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"e8b67f696742c42766794c9db4f182f17c8b5b17e2981b44f2d2bb9ae5d7aea7","category":"Cycling"}