{"title":"Lawsuit: Cop pulled over driver for TikTok livestream—and shared driver’s ID","link":"https://arstechnica.com/?p=1924325","date":1678912817000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1327894263-800x532.jpg\" alt=\"Lawsuit: Cop pulled over driver for TikTok livestream—and shared driver’s ID\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1327894263.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/emergency-lights-on-a-us-police-car-royalty-free-image/1327894263?phrase=police%20car\">Oliver Helbig | Moment</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A Dallas County Sheriff's Department deputy, Francisco Castillo, was briefly suspended after livestreaming a traffic stop, allegedly just to gain TikTok clout, in 2021. Now, the Texas motorist that he pulled over, Torry Osby, <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/Osby-v-Castillo-3-1-2023-Dallas-County-Petition.pdf\">is suing</a>, saying that the deputy exposed Osby to risks of identity theft and break-ins at his home by flashing Osby's driver's license and sharing his personal information to more than 100 followers tuned into Castillo's livestream.</p>\n<p>Osby’s lawyer, James P. Roberts, told Ars that it’s unlikely that their client was the only victim of Castillo’s alleged privacy-invading social media abuse. The complaint documents a seeming pattern of Castillo sharing videos while on duty that seemed to get more engagement than his other videos, making it appear likely to Osby's lawyers that Castillo was increasingly motivated to create videos of his police activity in hopes of boosting his likes and followers.</p>\n<p>“The deputy’s actions are deeply concerning given the number of other on-duty videos he has deleted from his TikTok account,” Roberts told Ars. “Through the course of this lawsuit, we will undoubtedly uncover other instances of livestreamed interactions with citizens between this deputy and others.”</p></div><p><a href=\"https://arstechnica.com/?p=1924325#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1924325&amp;comments=1\">Comments</a></p>","author":"Ashley Belanger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e8bab16cad121554b50c16db47ebc717deb99cb002a08c997fec2db909525063","category":"Tech"}