{"title":"Hogwarts Legacy","link":"https://neizod.dev/2023/02/27/hogwarts-legacy.html","date":1677509160000,"content":"<p>Lore-wise, despite the setting is in different era, the game just offer Harry Potter Experience™. Nothing more. Nothing less. Everything you’re familiar with the books or films appear here.</p>\n\n<blockquote>\n  <p><img src=\"/images/game/cover/hogwarts-legacy.jpg\" alt /></p>\n</blockquote>\n\n<p>Basically, you ARE Harry Potter, under different identity (name/appearance/house of your choice). You ARE the chosen one w/ the special power. Start the predetermined journey on the first semester at Hogwarts. Disobeyed school’s rules and uncover secrets. Have epic fights w/ bad guys and save the day. Then sum it up by the headmaster of the school at end of year ceremony (with a house win).</p>\n\n<p>It’s not a bad format… but after like two decades of this story-telling, I already have enough.</p>\n\n<p>Instead of the same final epic story, where every player walk the same path to the same conclusion (well, not the same, you are presented with a choice to finally be a bad guy or a good guy in the finale quest 🤷‍♀️). Why not let player craft their own unique story? Not unique like just selecting a unique wand. But the whole experience. Which class to spent a lot of time to master (let the player build a character whose never cast spell, but rely on plant alone, for example). Which quest to take in order or just simply skip it entirely to find another way around.<sup><a href=\"#fn:1\">1</a></sup></p>\n\n<p>Why not just let the player be a normal Hogwarts student, experiencing the school in the way they like, have a personal experience with their time in the school.</p>\n\n<hr />\n\n<p>Gameplay-wise, admittedly it is a fun experience for like the first 10 hours, but after that it just chores of unended unfun prolonged quests.</p>\n\n<p>Quests are super linear. Walk from this too that in almost straight path. Do some actions. Watch cut-scenes. Rinse and repeat. Puzzles along the way are mindlessly simple. Optional pickups are tiresome to pick since they’re hidden behind narrow walls that force you to go slow (very cheap trick I’d say).</p>\n\n<p>Also, the game is NOT an open-world like it advertised. Wanna explore on your own? Here’s a level 3 door lock that you won’t learn how to unlock until doing some chores that take 3 hours IRL. Wanna go “Pokémon” all those magical beast? This one won’t spawn until a very late main quest, despite you’ve found its nest. (if you want the true open-world experience, just go play Zelda BOTW!)</p>\n\n<p>Most important of all. There’s no consistency with the lore! Hogwarts forbid students to wander around in the castle at night. But you can just go anywhere anytime without the fear of being spotted. Wizarding World condemn those who dare to cast Unforgivable Curses. However you can Abracadabra everywhere without any penalty.</p>\n\n<p>Sigh…</p>\n\n<p>It’s not really a <em>bad</em> game, at least that’s something you can expect from AAA studios. But it is, at most, on par w/ the previously existing books/films/games in the franchise.</p>\n\n<p>Holding hand, I’d say that. Like watching a movie with interaction. While it’s might be fun for some people, this is just not work for me.</p>\n\n<div>\n  <ol>\n    <li>\n      <p>(Spoiler) I’m mostly disturbed by Sebastian’s questline and wish they are not mandatory; or the Polyjuice Plot that should be skipable since you can fly and land on the balcony of the headmaster’s office. <a href=\"#fnref:1\">↩</a></p>\n    </li>\n  </ol>\n</div>","author":"","siteTitle":"neizod's speculation","siteHash":"939338c5557b1743f2c128736c6006e145dcabc81da9970f1c0dc8ae2feb0830","entryHash":"e8d515b2195f6c46616060fe9b84fe1a640d2b5e77fda1a92a8a35c9916e938e","category":"Thai"}