{"title":"Inbreeding effects on different lineages of Thrips tabaci (Thysanoptera: Thripidae)","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae017/7628809?rss=1","date":1710374400000,"content":"<span><div>Abstract</div>Inbreeding can have detrimental effects on reproductive fitness, but the extent of lineage-specific variation in these effects remains poorly understood. This study investigated the effects of brother and sister inbreeding on reproductive fitness in 2 lineages (L1 and T) of <span>T. tabaci</span>. Inbred females from both lineages exhibited a significant reduction in longevity compared with the control group. The L1 lineage experienced a 27% and 43% decrease in longevity in the F2 and F3 generations, respectively, while the T lineage showed a similar trend with a 30% and 44% decrease. The T lineage consistently displayed slightly longer lifespans than the L1 lineage across all generations. Brother and sister inbreeding also led to a decrease in fecundity rates in both lineages. In the F3 generation, the number of eggs laid decreased by 59% compared with the F2 generation. The T lineage consistently exhibited slightly lower fecundity rates compared with the L1 lineage. Egg hatchability rates declined with subsequent inbreeding, with the F3 generation showing lower rates compared with the F2 generation. However, the T lineage did not exhibit a significant difference in inbreeding depression for egg hatchability rates, while the L1 lineage demonstrated a noticeable decrease. Deformities observed in male L1 lineage resulting from inbreeding were consistent with disruptions in normal developmental processes, affecting various body parts such as legs, antennae, and wings. Continued inbreeding increased susceptibility to inbreeding depression in terms of longevity, fecundity, and egg hatchability.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"e8e2be2f40a2f83588c38fcada36e7d5167b2ad60aa91d28e29688c1840300d6","category":"Environment"}