{"title":"Judge rejects Apple’s arguments for delaying ordered iOS App Store changes","link":"https://arstechnica.com/?p=1811770","date":1636515783000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-app-store-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-app-store.jpg\">Enlarge</a> (credit: Getty Images | NurPhoto )</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In September, US District Judge Yvonne Gonzalez Rogers <a href=\"https://arstechnica.com/gadgets/2021/09/injunction-apple-must-open-up-app-store-payments-in-90-days/\">ruled</a> that Apple must allow iOS developers to direct users to external content-purchasing mechanisms outside of the App Store's built-in In-App Purchases. Tuesday night, Rogers refused Apple's request to stay that ruling, setting the stage for it to go into effect December 9 pending further appeal.</p>\n<p>In <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/gov.uscourts.cand_.364265.830.0_8.pdf\">a blunt four-page ruling</a>, Judge Rogers said Apple's motion for a stay, <a href=\"https://arstechnica.com/tech-policy/2021/10/apple-called-epic-ruling-a-resounding-victory-but-is-appealing-it-anyway/\">filed last month</a>, is \"fundamentally flawed\" and \"based on a selective reading of this Court’s findings and ignores all of the findings which supported the injunction, namely incipient antitrust conduct including supercompetitive commission rates resulting in extraordinarily high operating margins and which have not been correlated to the value of its intellectual property.\"</p>\n<p>Apple's anti-steering provisions, which prevent app makers from telling users about alternate payment methods inside of the apps themselves, \"are one of the key provisions upon which Apple has been able to successfully charge supracompetitive commissions untethered to its intellectual property,\" Judge Rogers writes. Those provisions depress royalty rates for Epic's Unreal Engine specifically and \"in the industry generally\" she continues.</p></div><p><a href=\"https://arstechnica.com/?p=1811770#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1811770&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e8e8529a0fa1664bb5c91006fd112d86887b6e80b677cdcb596b10a1c466de72","category":"Tech"}