{"title":"Anaesthesia delivery systems in low and lower-middle-income Asian countries: A scoping review of capacity and effectiveness","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0001953","date":1710770400000,"content":"<p>by Sumbal Shahbaz, Natasha Howard</p>\r\n\r\nLiterature on anaesthesia systems in low and lower middle-income countries is limited, focused on the Africa region, and provides minimal data on anaesthesia or associated disciplines within intensive care, pain management and emergency medicine. We thus conducted a scoping review of primary and secondary research literature on capacity and effectiveness of anaesthesia delivery in low and lower middle-income countries in the Asia region from 2000–2021, to clarify existing knowledge, important gaps, and possible subsequent steps. We applied Arksey and O’Malley’s scoping literature review method to search five databases (i.e. EMBASE, CINAHL, Medline, Scopus, Web of Science), screen, extract, and synthesise data under three themes: (i) availability and type of anaesthesia workforce; (ii) anaesthesia system infrastructure, equipment, and supplies; and (iii) effectiveness of anaesthesia provision. We included 25 eligible sources of 603 identified. Only ten (40%) were published in the last 5 years and Asian lower-income countries were primarily represented in 15 multi-country sources. Fifteen (60%) sources used quantitative methods and provided limited information on data collection, e.g. sampling criteria or geographic areas included. No sources included countrywide data, despite anaesthesia delivery and resources differing significantly sub-nationally (e.g. central versus rural/remote, or insecure areas). Data on anaesthesiology delivery were limited, with findings including insufficiencies in workforce, supplies, training, and skills-building of anaesthesia personnel, along with the lack of consistent strategies for overcoming maldistribution of resources and improving anaesthesia delivery systems in the region. This review, a first attempt to synthesise existing data on anaesthesia delivery systems in low and lower-middle-income Asian countries, shows the anaesthesia literature is still limited. Findings highlight the urgent need for additional research and collaboration nationally and regionally to strengthen anaesthesia delivery and surgical facilities in resource-constrained settings.","author":"Sumbal Shahbaz","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"e8f8c5c20d83abcd1726bf65b9816fbfa62ff9a1020a7456cb38c364078b3f46","category":"Environment"}