{"title":"Satisfaction of basic needs mediates relationships between incremental mindsets and well-being","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309079","date":1723816800000,"content":"<p>by Marzena Cypryańska, John B. Nezlek</p>\r\n\r\nResearch on the extent to which people believe that people can change (incremental beliefs) suggests that incrementalist beliefs are positively related to well-being, whereas entity beliefs (people cannot change) are not. One explanation for this relationship is that incremental beliefs are associated with a mastery orientation, whereas entity beliefs are not. If this is the case, then autonomous and competence motives should mediate relationships between incrementalism and well-being because these motives reflect different aspects of mastery. The present study examined the possibility that autonomous and competence motives mediate relationships between self-theories and well-being. Participants were adult community members (<i>n</i> = 428) who completed the Life Engagement Test (eudaimonic well-being), the Satisfaction with life Scale (hedonic well-being), the Mental Health Continuum Scale (eudaimonic, subjective, and psychological well-being), the Basic Needs Satisfaction scale (autonomy, competence, relatedness), and a measure of implicit theories of the self (incremental and entity beliefs). Regression analyses found that incremental beliefs were significantly related (positively) to all three measures of well-being, whereas entity beliefs were not significantly related to well-being. Regression analyses also found that incremental beliefs were positively related to satisfaction of autonomy and competence needs but were not related to satisfaction of relatedness needs. Entity beliefs were not related to the satisfaction of any of the three basic needs. A series of mediational analyses found that competence and autonomy motives mediated relationships between incremental beliefs and all three measures of well-being. In all but one case, satisfaction with life, the direct effects of incremental beliefs on well-being were rendered non-significant when satisfaction of autonomy and competence needs were included as mediators. The present results confirm and extend to the general domain the supposition that a mastery orientation is responsible for relationships between well-being and incremental theories of the self. They also conform the importance of the tenants of Self-Determination Theory in understanding self-theories.","author":"Marzena Cypryańska","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e906d0a00a60f0c85ea29600bcbcb7f5e0a78639a5668f427f941eb841e7a48c","category":"Interdisciplinary"}