{"title":"STAT3-induced upregulation of lncRNA TTN-AS1 aggravates podocyte injury in diabetic nephropathy by promoting oxidative stress","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae079/7685977?rss=1","date":1717113600000,"content":"<span><div>Abstract</div><div>Background</div>Diabetic nephropathy (DN) is the most common microvascular complication of diabetes mellitus (DM), being the second cause of end-stage renal disease globally. Podocyte injury is closely associated with DN developmen. Our study aimed to investigate the role of long non-coding RNA (lncRNA) TTN-AS1 in DN-associated podocyte injury.<div>Methods</div>The mouse podocyte cell line (MPC5) and human primary podocytes were stimulated by high glucose (HG; 30 nM glucose) to establish the cellular model of DN. Before HG stimulation, both podocytes were transfected with sh-TTN-AS1#1/2 or pcDNA3.1/STAT3 to evaluate the influence of TTN-AS1 knockdown or STAT3 overexpression on HG-induced podocyte injury. TTN-AS1 and STAT3 expression in both podocytes was examined by RT-qPCR. Cell viability and death were assessed by CCK-8 and LDH release assay. ELISA was adopted for testing IL-6 and TNF-α contents in cell supernatants. The levels of oxidative stress markers (ROS, MDA, SOD, and GSH) in cell supernatants were determined by commercial kits. Western blotting was used for measuring the expression of fibrosis markers (fibronectin and α-SMA and podocyte function markers (podocin and nephrin) in podocytes.<div>Results</div>HG stimulation led to decreased cell viability, increased cell death, fibrosis, inflammation, cell dysfunction and oxidative stress in podocytes. However, knockdown of TTN-AS1 ameliorated HG-induced podocyte injury. Mechanically, the transcription factor STAT3 interacted with TTN-AS1 promoter and upregulated TTN-AS1 expression. STAT3 overexpression offset the protective effect of TTN-AS1 silencing on HG-induced podocyte damage.<div>Conclusion</div>Overall, STAT3-mediated upregulation of lncRNA TTN-AS1 could exacerbate podocyte injury in DN through suppressing inflammation and oxidative stress.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"e90be8c026056ec980aade2a356b054264130a24a1c46437d285471877da041d","category":"Environment"}