{"title":"Spatiotemporal variation in ecophysiological traits align with high resolution niche modelling in the short-range banded ironstone endemic Aluta quadrata","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae030/7681962?rss=1","date":1716508800000,"content":"<span><div>Abstract</div>Defining plant ecophysiological responses across natural distributions enables a greater understanding of the niche that plants occupy. Much of the foundational knowledge of species’ ecology and responses to environmental change across their distribution is often lacking, particularly for rare and threatened species, exacerbating management and conservation challenges. Combining high-resolution species distribution models (SDMs) with ecophysiological monitoring characterized the spatiotemporal variation in both plant traits and their interactions with their surrounding environment for the range-restricted <span>Aluta quadrata</span> Rye &amp; Trudgen, and a common, co-occurring generalist, <span>Eremophila latrobei</span> subsp. <span>glabra</span> (<a href=\"http://L.S.Sm\">L.S.Sm</a>.) Chinnock., from the semi-arid Pilbara and Gascoyne region in northwest Western Australia. The plants reflected differences in gas exchange, plant health and plant water relations at sites with contrasting suitability from the SDM, with higher performance measured in the SDM-predicted high-suitability site. Seasonal differences demonstrated the highest variation across ecophysiological traits in both species, with higher performance in the austral wet season across all levels of habitat suitability. The results of this study allow us to effectively describe how plant performance in <span>A. quadrata</span> is distributed across the landscape in contrast to a common, widespread co-occurring species and demonstrate a level of confidence in the habitat suitability modelling derived from the SDM in predicting plant function determined through intensive ecophysiology monitoring programmes. In addition, the findings also provide a baseline approach for future conservation actions, as well as to explore the mechanisms underpinning the short-range endemism arid zone systems.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"e91766d284110dfaaae1abf6e78378b16f85da32c60d4f5ef8984283700d82c6","category":"Environment"}