{"title":"BaHys—A Bayesian Modeling Framework for Long‐Term Concentration‐Discharge Hysteresis: A Case Study on Chloride","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035427?af=R","date":1718112306000,"content":"<h2>Abstract</h2>\n<p>Improving river water quality requires a thorough understanding of the relationship between constituent concentration and water discharge during runoff events (i.e., C-Q hysteresis), which may be strongly non-linear. Analysis of C-Q hysteresis on large temporal scales provides unprecedented insights into event dynamics and long-term concentration trends in surface and groundwater. Despite the increasing availability of time series data on water quality, there are still limited quantitative modeling frameworks that enable this analysis. Here, we combine Bayesian modeling and an existing mass balance to model long-term C-Q hysteresis dynamics in multi-decade constituent concentration and water discharge time series. We focus on the case study of chloride and demonstrate that our model can simultaneously characterize the size and rotation of C-Q hysteresis, and diffuse and low-flow inputs to constituent concentration using only time-series data from the river Rhine. Over 28 years of monitoring, we find that chloride exhibits a dominant clockwise dilution behavior that does not vary considerably under different hydro-climatic conditions, hinting to similar mobilization mechanisms over time. We also show decreasing chloride concentrations in surface and groundwater, due to the cessation of mining activities in the Rhine. Our approach uses uncertainty estimates to show the range within which model parameter values lie, aiding decision-makers in a robust assessment of river water quality. We conclude that Bayesian modeling of C-Q hysteresis provides a powerful framework for investigating long-term contamination dynamics that can be extended to several constituents to find factors controlling their export, ultimately suggesting mitigation measures for river contamination.</p>","author":"Maria Cairoli, \nFrancisco Souza, \nGerard Stroomberg, \nGeert Postma, \nLutgarde Buydens, \nJeroen Jansen","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"e922dfd397367b5e6454a6f7756da7e209c10d406d433152cafb62d162a2ec31","category":"Environment"}