{"title":"HCP Packer now supports webhooks and streamlined run task reviews","link":"https://www.hashicorp.com/blog/hcp-packer-now-supports-webhooks-and-streamlined-run-task-reviews","date":1697040000000,"content":"<p>HCP Packer is a powerful tool for tracking, governing, and managing image artifacts across multi-cloud environments. Today at <a href=\"https://hashiconf.com/global/\">HashiConf</a>, we are introducing two new features for HCP Packer: <em>project-level webhooks</em> and <em>streamlined run task reviews</em>. </p>\n\n<p>Project-level webhooks allow users to notify external systems about specific HCP Packer events using automation. Streamlined <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/settings/run-tasks\">run task</a> reviews provide meaningful context on run task evaluations for the HCP Packer run task on HashiCorp Terraform Cloud, building on the <a href=\"https://www.hashicorp.com/blog/terraform-cloud-adds-streamlined-run-task-reviews\">new functionality released in September</a>. These two additions help organizations improve the efficiency and security of image-related workflows across their multi-cloud infrastructure estate. </p>\n\n<h2>Project-level webhooks</h2>\n\n<p>A webhook is a method of automating the exchange between two applications in real time. It allows one system to send data to another as soon as a specific event occurs. Webhooks are integrated into many applications, such as <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/settings/notifications\">Terraform Cloud</a>, where they are often used to automate business processes.</p>\n\n<h3>Challenges</h3>\n\n<p>Before the addition of <a href=\"https://developer.hashicorp.com/hcp/docs/hcp/admin/projects\">project</a>-level webhooks, after completing an action in HCP Packer users had to manually orchestrate external workflows to ensure consistency across their infrastructure estate. For example, if a user revoked an image version, they then needed to manually delete the image in the cloud provider. The inability to hook HCP Packer into their existing automation pipelines added complexity to their image management workflows, opened organizations to security risks caused by human errors, and slowed deployment speed.</p>\n\n<h3>Introducing webhooks for HCP Packer</h3>\n\n<p>HCP Packer users can now configure webhooks at the project level, allowing them to implement automation when interacting with the HashiCorp Cloud Platform (HCP). Webhooks can be used to trigger custom automation in response to image lifecycle events such as:</p>\n\n<ul>\n<li>Creation, completion, and deletion</li>\n<li>Revocation and restoration</li>\n<li>Scheduling and canceling a scheduled revocation</li>\n<li>Assignment to a channel </li>\n</ul>\n<img src=\"https://www.datocms-assets.com/2885/1696629417-packer-webhooks.png\" alt=\"Webhooks\" /><p>Example workflows include initiating functional tests via Terraform Cloud after publishing a new image version, setting a deprecation date or tag in the cloud provider when an artifact is revoked, and sending notifications to stakeholders when these events take place.</p>\n\n<p>These automation workflows can be set up and edited directly in HCP:</p>\n<img src=\"https://www.datocms-assets.com/2885/1696605940-webhooks-tracker.png\" alt=\"Create\" /><img src=\"https://www.datocms-assets.com/2885/1696606015-all-events-packer-vault-secrets.png\" alt=\"Define\" /><h3>Key webhook benefits</h3>\n\n<p>Project-level webhooks have two chief benefits in HCP Packer: </p>\n\n<ul>\n<li><strong>More comprehensive workflow automation:</strong> Webhooks let you automate processes triggered by specific events to reduce manual effort while integrating with existing external pipelines and Terraform Cloud.</li>\n<li><strong>Enhanced security:</strong> Through automation, organizations can mitigate the risk of human errors such as missed notifications and forgotten image management tasks that could lead to outdated and insecure images throughout their infrastructure estate.</li>\n</ul>\n\n<p>See a demo of webhooks in this video:</p>\n<h2>Streamlined run task reviews</h2>\n\n<p>Terraform Cloud and HCP Packer let users tightly integrate their image management and provisioning workflows through the use of a <a href=\"https://www.hashicorp.com/blog/multicloud-golden-image-pipeline-terraform-cloud-hcp-packer\">golden image pipeline</a>. One component of this is the <a href=\"https://developer.hashicorp.com/packer/tutorials/hcp/setup-tfc-run-task\">Terraform Cloud run task for HCP Packer</a>, which helps prevent the deployment of non-approved images in two ways:</p>\n\n<ul>\n<li><strong>Data source image validation:</strong> scans your Terraform plan for references to the HCP Packer data sources, warning you or blocking the run if any referenced data is associated with a revoked image version.</li>\n<li><strong>Resource image validation:</strong> scans your Terraform configuration for resources that use hard-coded image IDs, checks if the image is tracked by HCP Packer, and warns you if the image is associated with a revoked version.</li>\n</ul>\n\n<h3>Run task evaluation challenges</h3>\n\n<p>Previously, Terraform Cloud users would receive HCP Packer run task evaluation information via a callback request that included only a brief message on the run task event. Users often had trouble with HCP Packer run task failures, because they lacked visibility into which resources were specifically affected, the details of the failure, and actionable guidance for remediation in warning and failure messages. Terraform Cloud addressed this issue through the addition of <a href=\"https://www.hashicorp.com/blog/terraform-cloud-adds-streamlined-run-task-reviews\">streamlined run task reviews</a>, which provides comprehensive details in-app. At release, however, this functionality was not yet supported for the HCP Packer run task. </p>\n\n<h3>Introducing streamlined run task reviews for HCP Packer</h3>\n\n<p>Users can now easily check their image compliance and get actionable guidance without having to leave Terraform Cloud. Practitioners can see a list view of run task evaluations for HCP Packer to identify warnings and failures for image-related events per resource. From there they can access the critical information needed to remediate image issues such as addressing revoked versions, untracked images, and more.</p>\n<img src=\"https://www.datocms-assets.com/2885/1696605993-runtask-warnings-failures-hcp-packer.png\" alt=\"View\" /><p>From the list view, users can click into run task warnings and failures to see additional details and remediation guidance.</p>\n<img src=\"https://www.datocms-assets.com/2885/1696605958-run-task-statuses.png\" alt=\"View\" /><h3>Key benefits of streamlined run task reviews</h3>\n\n<p>Streamlined run task reviews have two chief benefits in HCP Packer: </p>\n\n<ul>\n<li><strong>Improved security and compliance:</strong> Streamlined run task reviews for HCP Packer help organizations ensure their images are secure and compliant by providing clear and actionable remediation information. This prevents the deployment of non-approved images, minimizing risk in the infrastructure provisioning process.</li>\n<li><strong>Efficient issue remediation:</strong> Users can now diagnose and resolve image-related issues promptly without having to navigate to external systems and rely on additional tooling. This reduces the time and effort required to troubleshoot failures, streamlining the overall image management workflow.</li>\n</ul>\n\n<h2>Getting started with HCP Packer</h2>\n\n<p>To get started with webhooks and streamlined run task reviews for HCP Packer, please refer to the documentation:</p>\n\n<ul>\n<li><a href=\"https://developer.hashicorp.com/hcp/docs/hcp/admin/projects/webhooks\">Create and manage HCP Packer webhooks</a></li>\n<li><a href=\"https://developer.hashicorp.com/hcp/docs/packer/webhooks\">HCP Packer webhook events</a></li>\n<li><a href=\"https://developer.hashicorp.com/packer/tutorials/hcp/setup-tfc-run-task\">Set up Terraform Cloud run task for HCP Packer</a></li>\n<li><a href=\"https://developer.hashicorp.com/hcp/docs/packer/manage-image-use/terraform-cloud-run-tasks\">Streamlined run task reviews</a></li>\n</ul>\n\n<p>Or <a href=\"https://www.hashicorp.com/products/packer\">get started with HCP Packer for free</a> to track and manage artifacts across all your cloud environments.</p>\n","author":"Mitchell Ross","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"e9288b1d01aa3d259df3f098ef86332928799117941a305718384470129e8b0d","category":"Tech"}