{"title":"Inhibiting Bruton's Tyrosine Kinase to Counteract Chemoresistance and Stem Cell‐Like Properties in Osteosarcoma","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24368?af=R","date":1719386438000,"content":"<h2>ABSTRACT</h2>\n<p>Osteosarcoma, a highly aggressive bone cancer, often develops resistance to conventional chemotherapeutics, leading to poor prognosis and survival rates. The malignancy and chemoresistance of osteosarcoma pose significant challenges in its treatment, highlighting the critical need for novel therapeutic approaches. Bruton's tyrosine kinase (BTK) plays a pivotal role in B-cell development and has been linked to various cancers, including breast, lung, and oral cancers, where it contributes to tumor growth and chemoresistance. Despite its established importance in these malignancies, the impact of BTK on osteosarcoma remains unexplored. Our study delves into the expression levels of BTK in osteosarcoma tissues by data from the GEO and TCGA database, revealing a marked increase in BTK expression compared with primary osteoblasts and a potential correlation with primary site progression. Through our investigations, we identified a subset of osteosarcoma cells, named cis-HOS, which exhibited resistance to cisplatin. These cells displayed characteristics of cancer stem cells (CSCs), demonstrated a higher angiogenesis effect, and had an increased migration ability. Notably, an upregulation of BTK was observed in these cisplatin-resistant cells. The application of ibrutinib, a BTK inhibitor, significantly mitigated these aggressive traits. Our study demonstrates that BTK plays a crucial role in conferring chemoresistance in osteosarcoma. The upregulation of BTK in cisplatin-resistant cells was effectively countered by ibrutinib. These findings underscore the potential of targeting BTK as an effective strategy to overcome chemoresistance in osteosarcoma treatment.</p>","author":"Hsiao‐Chi Tsai, \nMing‐Yu Lien, \nShih‐Wei Wang, \nYi‐Chin Fong, \nChih‐Hsin Tang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"e92d6cc8eeb577597a43d579285b69d6723e8abf3e4731304f31fcd8ac82ed21","category":"Environment"}