{"title":"New USB-C logos may finally lead Apple users to the right cable","link":"https://www.macworld.com/article/540794/usb-c-logos-thunderbolt-cables.html","date":1633370724000,"content":"<div>\n<section><div></div></section><p>The problem with USB-C (technically “USB Type C” but nobody calls it that) is that it’s one connector with a lot of great properties (bi-directional, symmetrical, slim, locking) that <em>supports</em> a lot of technologies but <em>mandates</em> very few. When you see a USB-C port on a device, you don’t know what does and does not support it. Can you charge your device there? Is it data transfer only? How fast? What about DisplayPort?</p>\n\n\n\n<p>Buying cables can be just as bad. You may have no idea if a cable supports power delivery, or if it does what the wattage limits are. You don’t know if that USB-C cable supports faster data transfer speeds. And if you have Apple gear, where Thunderbolt compatibility is often key, there’s a whole other layer of specifications to worry about.</p>\n\n\n\n<p>The easy way out for Apple users is to buy <a href=\"https://www.amazon.com/dp/product/B01MQ5Z080?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Apple’s own branded cables</a>, which tend to support all the power and data transfer needs of its own devices. But Apple’s cables are expensive, only come in white, and only come in two lengths: 1 meter and 2 meters. </p>\n\n\n\n<h2>USB-IF to the rescue (sort of)</h2>\n\n\n\n<p>The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.usb.org/&amp;xcust=1-1-540794-1-0-0&amp;sref=https://www.macworld.com/feed\">USB Implementers Forum (USB-IF)</a> seems to have recognized what a mess this is and will address it with a set of new logos (shown below). A USB 4 cable will proudly say “40Gbps” in the logo, and a cable that supports the USB Power Delivery 3.1 specification will have either 60W or 240W displayed, to show which of the two maximum power ratings it supports.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/NewUSBImage_for_PR_FINAL_v21.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>USB-IF</p></div>\n\n\n\n<p>Certified cables will display these logos on their packaging or possibly on the cable itself, or on the company’s product page on their website. It’s a good thing to look for if you’re buying USB-C cables, but it only goes so far for Apple users.</p>\n\n\n\n<p>When it comes to charging, you want a USB-C cable that supports Power Delivery at the highest rates. Apple’s power adapters top out at 96W, and while that is only used on certain 16-inch MacBook Pro models, the 61-watt and 45-watt power adapters are strong enough that you want to make sure your cable’s up to the task.</p>\n\n\n\n<p>Similarly, Apple’s support of high data transfer speeds means that a USB 4 cable with support for 40Gbps is highly desirable, too. <a href=\"https://www.macworld.com/article/232531/what-usb4-could-mean-for-apple-products.html\">We covered this when USB 4 was announced</a>, but the USB 4 standard basically brings the spec up to Thunderbolt 3 performance levels. Apple only just recently started officially supporting USB 4 in Macs with the M1 chip, but the company has supported Thunderbolt 3 for years, which means you need a 40Gbps cable with a Type-C connector.</p>\n\n\n\n<p>In other words, if you have Apple stuff with a USB-C port on it and you want to buy a third-party cable that is likely to work with all your current and future Apple stuff, looking for that <strong>40Gbps</strong> and <strong>240W</strong> logo is a really good idea. You’re only going to see that 40Gbps logo on USB4 certified cables, which means it also supports DisplayPort 2.0, so you <em>should</em> be covered for all your Apple peripheral needs, including monitors. While USB 4 certification is not technically the same thing as Thunderbolt 3, the whole point of USB 4 is to essentially raise the minimum bar to the level of Thunderbolt 3.</p>\n\n\n\n<p>Of course, the problem with these logo programs is that they’re never mandatory and can take a while to become commonplace. And they only ensure that a cable’s design meets certain requirements, not that the cable will be durable or flexible or doesn’t get too hot when charging. A cable that does <em>not</em> carry these logos could be great, and a cable that <em>does</em> carry them might work well but falls apart after just a few months. Still, some assurance is better than none, and we would recommend that if you’re buying a non-Apple-brand USB-C cable you look for these logos.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"e943b2fa6a735e44a0caf68718951566120557e2d4cc7fc96601fc27ebe66900","category":"Apple"}