{"title":"Oxygen-Ozone and Porcine Collagen Injectable Therapies Im-Prove the Quality of Life in Low Back Pain Patients. Boosting Efficacy in Pain and Disability","link":"https://www.preprints.org/manuscript/202409.1246/v1","date":1726488437000,"content":"Background/Objectives: Intervertebral disc degeneration is the most common cause of low back pain (LBP) and lumbosciatica is a major challenge to healthcare systems worldwide. For years, ozone therapy has been used with excellent results in intervertebral disc disease and in patients with LBP. In vitro studies have demonstrated the positive action of porcine collagen in extracellular matrix remodeling and homeostasis. These tissue changes, associated with LBP, may suggest an indication for combined ozone/collagen treatment in patients with LBP. However, no studies have been reported regarding this combination of treatments. Methods: The present work compared, retrospective data of two treatment groups (each of 10 LBP patients): A) Oxygen-Ozone Therapy (OOT) vs. B) OOT plus porcine collagen type 1 injections (COL I). Pain intensity and physiological function were assessed by the numerical rating scale (NSR) method. The Roland-Morrison questionnaire was used to assess disability. Patient data were acquired before, during and at six months of follow-up. Significant differences were assessed by ANOVA and T-Student test. Results: The analyses revealed significant statistical differences comparing the two arms, where, the OOT COL I treatment demonstrated a booster efficacy in pain, while the questionnaire revealed a reduction in disability. Conclusions: Therefore, this combination therapy might be a promising approach for the management of patients with LBP.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e94308419ff4196a75d817967f427e468b0a0465ac95465ba4a27b0c433be864","category":"Interdisciplinary"}