{"title":"Pinot: ‘I still have a little bit of pride, a little bit of ego’","link":"https://cyclingtips.com/2021/08/pinot-returns-to-racing-i-still-have-a-little-bit-of-pride-a-little-bit-of-ego/","date":1629227734000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/pinot-650x399.jpg\" /></div><h2>Pinot: 'I still have a little bit of pride, a little bit of ego'</h2><p>\n</p><p>After nearly four months away from racing, Thibaut Pinot (Groupama-FDJ) returned to competition on Tuesday at the Tour du Limousin. In an interview with <a href=\"https://www.lequipe.fr/Cyclisme-sur-route/Article/Thibaut-pinot-je-veux-montrer-que-je-suis-toujours-la/1278724\" target=\"_blank\">L’Equipe</a>, the 31-year-old Frenchman said that following the lengthy hiatus from races as he tried to recover from lingering back issues, he is finally feeling “not bad.”</p>\n\n\n\n<p>It has been a tough two years for Pinot, who looked to be a real contender for yellow at the 2019 Tour before he abandoned the race on stage 9 due to a leg injury. In 2020, he crashed hard on the first day of the race and suffered a back injury that bothered him for months. Although he spent his offseason focused on recovering and made five race starts earlier this year, he was unable to ride at his best without pain, and thus stopped racing in April.</p>\n\n\n\n<p>As he told L’Equipe, it was not an easy period for him.</p>\n\n\n\n<p>“We will say that it was the hardest because I had the impression that everything we had done before, it had been for nothing, that everything had deteriorated during the month of April,” Pinot said. “We were at the same point as on the Tour and the Vuelta in 2020. So I stopped for three weeks. It did me good. I made quite a few appointments from right to left. Until mid-June, it was very hard because I couldn’t see any improvement.”</p>\n\n\n\n<p>Pinot said that he “mentally prepared not to pin on a bib this year,” and that in June he made a 2022 return his goal. Fortunately, that changed as he kept working at his recovery.</p>\n\n\n\n<p>“In fact, there has not been a miracle cure,” he said. “I’ve done so many things and seen so many people, everyone put their money together, and that’s what solved the problem. Whether it be the podiatrist, position studies in Besançon with trainers, physiotherapists, osteos.”</p>\n\n\n\n<p>Eventually, Pinot started to see results.</p>\n\n\n\n<p>“We were improving 1% per day, it was not obvious overnight,” he said. “I felt a little better at the end of June. I did a lot of work on back strength training in May-June, on stretching and flexibility. We changed my position several times on the bike, the podiatrist changed my soles, lots of little things. There, finally, I am higher on the saddle, much shorter at the level of the handlebars precisely to relieve my back as much as possible.”</p>\n\n\n\n<p>As things improved with his back, Pinot was finally able to start working his way back into form. He decided at a training camp in July that he was ready to return to racing, and now, he says that his numbers are encouraging.</p>\n\n\n\n<p>“Last week, I had my best time in the Ballon d’Alsace on Strava since I have been pro,” he said. “Since mid-July, I have enjoyed almost every workout.”</p>\n\n\n\n<p>Now, Pinot is back in competition with a surprisingly busy calendar ahead that includes multiple races in France before the series of late-season one-days in Italy that culminates with Il Lombardia, a race he won in 2018.</p>\n\n\n\n<p>“I want to show that I’m still here, that I still want it, because a lot was said about me since last year, that I spent my time on vacation enjoying life, having barbecues, that I didn’t have the mindset,” Pinot said. “A bunch of bullshit like that … I still have a little bit of pride, a little bit of ego, and I want to show who I am.”</p>\n\n\n\n<p>Beyond the rest of this season, it remains to be seen what the future holds for Pinot. Although he rode onto the Tour podium all the way back in 2013, he is still only 31, after all. That said, the six-time Grand Tour stage winner said that he was “not sure” he’d ever again find himself in the same position that he was in back in 2019, when a Tour win seemed like a genuine possibility.</p>\n\n\n\n<p>“I’m not sure that by the end of my career the possibility will arise,” he said. “At that point, I was on the right track. Winning a Tour de France is pretty complicated, you have to be lucky, a lot of little things. For a rider like me, who is not a champion like Bernal, Pogacar or Evenepoel, it only happens once in a career I think.”</p>\n\n\n\n<p>Then again, his strong showing through more than two weeks at the 2019 Tour was a pleasant surprise at the time, too, so Pinot couldn’t say one way or the other whether he was certain that his luck had run out.</p>\n\n\n\n<p>“We’ll see,” he said. “In 2019, I didn’t expect to find myself in this situation either, I didn’t believe it for a second. I knew I was fine but when I got to the Tour I didn’t think I was in a good position two weeks later to win it. Maybe it will happen again, but I’m not stubborn about it.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/pinot-returns-to-racing-i-still-have-a-little-bit-of-pride-a-little-bit-of-ego/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e947f908ed4e6dc28ac9add756c6eb435bb950fc2dc601be8d8fccf036e95585","category":"Cycling"}