{"title":"Lefevere vs Bennett saga continues with news Bennett will race for Ireland at Euros","link":"https://cyclingtips.com/2021/09/lefevere-vs-bennett-saga-continues-with-news-bennett-will-race-for-ireland-at-euros/","date":1631194434000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/GettyImages-1316804245-650x433.jpg\" /></div><h2>Lefevere vs Bennett saga continues with news Bennett will race for Ireland at Euros</h2><p>\n</p><p>Patrick Lefevere is not happy, to say the least, with the fact that Cycling Ireland has announced the participation of Sam Bennett in the road race at the European Championships this Sunday. The Deceuninck-Quickstep manager has threatened to cut Bennett’s salary in half after September. </p>\n\n\n\n<p>Bennett had a training accident in the weeks leading up to the Tour de France that resulted in a knee injury. The injury kept him from defending his green jersey. In the weeks afterwards, Lefevere publicly doubted the injury of the Irish sprinter. It was later confirmed the Irishman would indeed need surgery on the knee and wouldn’t be able to race for the remainder of the season.</p>\n\n\n\n<p>Until Cycling Ireland announced the line-up for Sunday’s rather hilly European Championships’ road race, that was. That news didn’t go down well with Lefevere. “This is a race with 4000 altitude meters,” Lefevere tells Het Nieuwsblad. “This selection is more of a legal move than a sportive choice for Bennett. People who know me know that I will never cut salaries for riders with a lengthy injury but in this case, the rider is of ill will. He doesn’t upload training files anymore. He doesn’t want to undergo the surgery either.”</p>\n\n\n\n<p>Bennett is set to leave Deceuninck-Quick Step at the end of 2021 and rejoin Bora-Hansgrohe, where he rode from 2017 to 2019. </p>\n\n\n\n<p>“He went to Chris Froome’s physiotherapist behind our backs who said he could train,” Lefevere went on. “He bypassed our own physician Yvan Vanmol who has seen these injuries in riders like Tom Boonen and Julian Alaphilippe but apparently his opinion was irrelevant.”</p>\n\n\n\n<p>In Lefevere’s opinion, Bennett wants to show he is race-ready and that it’s the choice of Deceuninck-Quick Step not to bring him to races. UCI regulations allow for a team to cut salaries when a rider is not eligible to ride for a period of over three months due to injury.</p>\n\n\n\n<p>“His manager Andrew McQuaid tells me Bennett plans on finishing the race but I am not so sure,” Lefever continues to Het Nieuwsblad. “We have proposed a test at the Bakala Academy but he refuses. To me it’s simple; you prove your fitness before you take the place of a teammate in a race.” Lefevere is now compiling a file with all instances where Bennett didn’t comply with team regulations like uploading training files or failure to wear team clothing.</p>\n\n\n\n<p>“What he does now is playing with my balls. Bennett already sent a letter to the UCI complaining about me talking about him in the media. It won’t work. I will get him back until steam comes out of his ears [sic].”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/lefevere-vs-bennett-saga-continues-with-news-bennett-will-race-for-ireland-at-euros/\">Read More</a>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"e947246a1e3345f0caf115f4fd6933a9d8f73a9d39e0989155becbc50af7288a","category":"Cycling"}