{"title":"Gneisses and Granitoids of the Basement of the Nepa-Botuoba Anteclise: Constraints for Relation of the Archean and Paleoproterozoic Crust in the Boundary Zone between the Tungus Superterrane and Magan Terrane (South Siberian Craton)","link":"http://link.springer.com/10.1134/S0869591124700139","date":1722470400000,"content":"<h3>Abstract</h3>\n                    <p>The paper presents geochemical and geochronological data on gneisses and granitoids from three deep boreholes (Yalykskaya-4, Danilovskaya-532, Srednenepskaya-1) in the basement of the southwestern part of the Nepa-Botuoba anteclise. Based on U-Pb zircon dating, three stages of granitoid magmatism were identified: ∼2.8, 2.0 and 1.87 Ga. At ca. 2.8 Ga magmatic TTG protoliths of biotite–amphibole gneisses (Yalykskaya-4 borehole) were formed, these rocks represent the Mesoarchean crust and experienced thermal effects typical of the Tungus superterrane of the Siberian craton at the terminal Neoarchean (∼2.53 Ga). Biotite gneissic granites (∼2.0 Ga) (Danilovskaya-532 borehole), which correlate in age with the granitoids of the basement of the Magan terrane and the Akitkan orogenic belt, were derived from a metasedimentary source formed by the erosion of predominantly Paleoproterozoic juvenile crust rocks. The 1.88 Ga A-type granite (Srednenepskaya-1 borehole) corresponds to the main stage of post-collision granite magmatism within the South Siberian magmatic belt. The ca. 2.8 Ga biotite–amphibole gneisses mark the eastern boundary of the Archean crust with Paleoproterozoic juvenile crust in the south of the Tungus superterrane, which are separated by a transitional zone intruded by granites having intermediate isotopic characteristics. The isotopic composition of Paleoproterozoic gneisses and granitoids indicates that marginal southern Magan terrane in contact with the Tungus superterrane includes blocks of both Archean and Paleoproterozoic crust, thus showing similarity with the Akitkan orogenic belt and accretionary orogens. The final amalgamation of the Tungus superterrane with blocks of the eastern part of the Siberian platform basement corresponds to a milestone of 1.88 Ga.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"e9534fd1ce09e61375b1480b23842b634a9627c09ec8647f7a24c13cd707e0b9","category":"Environment"}