{"title":"Canon เปิดตัว PowerShot PX กล้องถ่ายภาพและวิดีโออัตโนมัติพลัง AI","link":"https://www.blognone.com/node/125603","date":1635783958000,"content":"<div><div><div><p>Canon เปิดตัว PowerShot PX กล้อง AI ถ่ายภาพอัตโนมัติโดยใช้เทคโนโลยีตรวจจับใบหน้าและค้นหาวัตถุในภาพ ซึ่งพัฒนาต่อมาจากโครงการ <a href=\"https://www.blognone.com/node/121002\">PowerShot PICK</a> ที่เปิดตัวไปเมื่อต้นปี</p>\n<p>ตัวกล้อง Canon PowerShot PX สามารถปรับหมุนตัวเองเพื่อติดตามวัตถุได้ โดยหมุนซ้ายไปจนขวาได้ 340 องศา (ซ้าย 170 องศา ขวา 170 องศา) และขึ้นลงได้ 110 องศา (ลง 20 องศา ขึ้น 90 องศา) ตัวกล้องมีเซนเซอร์ CMOS 1/2.3 พร้อมโปรเซสเซอร์ Canon DIGIC 7 พร้อมเลนส์ 19-57mm เท่ากับตัวเลนส์ซูมได้ 3 เท่า และมีดิจิทัลซูมอีก 4 เท่า สามารถถ่ายภาพได้ที่ 11.7 ล้านพิกเซลเฉพาะในรูปแบบ JPEG เท่านั้น และวิดีโอ 1080/60p เฉพาะในรูปแบบ .MP4 เท่านั้น</p>\n<p>สำหรับบอดี้ของตัวกล้อง Canon PowerShot PX กว้าง 56.4 มิลลิเมตร สูง 81.9 มิลลิเมตร น้ำหนักราว 170 กรัม (รวม microSD แล้ว) มี Wi-Fi และ Bluetooth ในตัว สามารถดูรูปจากสมาร์ทโฟนหรือแท็บเล็ตได้ทันที ชาร์จแบตเตอรี่ผ่าน USB-C โดยแบตเตอรี่อยู่ได้ตั้งแต่ 2-5 ชั่วโมงขึ้นกับว่าถ่ายบ่อยแค่ไหน พร้อมระบบสั่งการด้วยเสียงที่ถ้าต้องการให้ถ่ายภาพแบบไม่ต้องอัตโนมัติก็สามารถสั่งเองได้</p>\n<p>Canon ระบุว่า PowerShot PX เน้นการถ่ายภาพแบบท่าทางเป็นธรรมชาติ สามารถเซ็ทให้ตัวกล้องเน้นจับหน้าใครสักคนก็ได้ (เช่นเป็นวันเกิดก็สามารถเซ็ทให้จับหน้าเจ้าของวันเกิดเยอะ ๆ ได้) รวมถึงรองรับการใช้งานร่วมกับแอป webcam utility ที่ทำให้ตัวกล้องเป็นเว็บแคมได้ด้วย</p>\n<p>Canon PowerShot PX ยังมีจำหน่ายเฉพาะในยุโรปเท่านั้น โดยจำหน่ายที่ราคา 500 ยูโร หรือราว 19,000 บาท</p>\n<p>ที่มา - <a href=\"https://www.dpreview.com/news/7544527335/canon-announces-powershot-px-ai-powered-camera-automatically-captures-photos-and-videos\">dpreview</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/cf660fac595389a15b87d392dfa61317.jpeg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/canon\">Canon</a></div><div><a href=\"/topics/camera\">Camera</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e9577dac8c5d9f6c5a249ce88dfa050b0ed489e41f2ba742435806959c957917","category":"Thai"}