{"title":"What is a heat wave: A survey and literature synthesis of heat wave definitions across the United States","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000468","date":1725544800000,"content":"<p>by Erin L. Bunting, Vasily Tolmanov, David Keellings</p>\r\n\r\nHeat waves are the last extreme weather events without a formal, on the books, definition. Instead, across the U.S. those working on extreme heat event management, forecasting, and planning are using differing definitions in their work. With such differing definitions being used there are widespread impacts including some to human and environmental health, natural resource management, and long-term emergency management planning. For instance, when should heat advisories for vulnerable populations be released when an event impacts a region using multiple definitions? There are concrete and justifiable reasons for the lack of a formal heat wave definition including, at its simplest, differences in what temperature is extreme enough, compared to the region’s climatological regimens, to be deemed as an extreme heat event or heat wave. This study looks for patterns and commonalities in emergency managers and climatologists, those most commonly addressing or planning for such events, definition of heat wave events through a review of the literature and widespread survey across the United States. Through a short 11-questions survey and subsequent text mining, we find widespread variability in the common heat wave definitions but a consistent pattern of core key term usage including aspects of heat duration, extreme temperature, and humidity. However, we also see little to no usage of non-climatological variables such as exposure, vulnerability, population, and land cover/land use.","author":"Erin L. Bunting","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"e95eb841662fe20bee34b9e01721d2c4f514ff0f05ff754d1a50f357190adb6c","category":"Environment"}