{"title":"'There’s pressure because all the team do is win': Anna Shackley on her breakthrough season and life with SD Worx","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/there-s-pressure-because-all-the-team-do-is-win-anna-shackley-on-her-breakthrough-season-and-life-with-sd-worx","date":1695654820000,"content":"\n      <p><span>In a peloton brimming full of SD Worx talent, there can be riders on the team that skirt under the radar. Sometimes, those who on any other squad would be seen as stars of the season are lost amongst <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> and World Championship victories, despite having results of their own that deserve attention. Anna Shackley, a stand-out rider in the burgeoning women’s under-23 cycling scene, falls into this category.</span></p>\n<div></div>\n<div></div>\n<p><span>Shackley’s summer has been one to remember. From her win in the under-23 race at the British National Championships, to her third place in the under-23 race at her home World Championships in Scotland – on a course which she said wasn’t even especially suited to her – to her second place at Tour l’Avenir Femmes, to her top-10 at the Tour de Romandie (supporting Demi Vollering to victory) and, most recently, her second place at the under-23 European Championships, there has been a steady flow of podium flowers and silverware onto the Scottish rider’s mantlepiece.</span></p>\n<p><span>In fact, Shackley is a clear example of why the introduction of races like the Tour l’Avenir Femmes and women’s U23 categories at championship events are so important. They have given her, like many others, a chance to shine outside of the domestique duties they tend to be in when riding for their WorldTour teams – an opportunity which the SD Worx rider has grabbed with both hands. </span></p>\n<p><span>“It feels different riding the under-23 races,” Shackley explains. “This is my last year as an under-23, so I go from being one of the younger ones in my team to one of the older ones in U23 races. It's a bit strange. You become more of a rider on the top level, rather than working for other people.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_0964_1024x1024.jpg?v=1695647879\" /></span></p>\n<p><span>When Shackley transitioned from the junior ranks to the professionals back in 2020, the only under-23 race she was able to compete in was the European Championships. Three years on and the number of opportunities for female under-23 riders is steadily increasing, something that Shackley only sees as a positive step forward.</span></p>\n<p><b>“</b><span>A lot of girls are now signing WorldTour contracts straight from the junior ranks. You go from doing an 80km junior race and being the top dog in the peloton to doing a WorldTour race and getting your head kicked in and struggling to finish,” she says. “It's a nice opportunity for a lot of riders to have that chance to go for the win and be more at the front of the race. It’s given me confidence.”</span></p>\n<p><span>It’s not only a shift in the racing dynamic that Shackley sees at under-23 events. She notes that at the Tour l’Avenir Femmes, where riders compete with national teams rather than their trade teams, the experience was far more rugged than the luxury of a WorldTour team bus or campervan.</span></p>\n<p><span>“It was kind of a humbling experience because you go back to racing how you were in juniors. I feel like sometimes we get quite pampered being on WorldTour teams. You get a lot of things provided for you, you have your bus and all your stuff with the team. If you forget something it’s okay because normally they have something to replace it but you go and race with the national team and you have to fend for yourself,” she says.</span></p>\n<p><span>On the bike, Shackley performed exceptionally well at the Tour l’Avenir Femmes, being the protected GC rider for the British team and eventually finishing in second place overall. The 22-year-old finished on the podium in three out of the five stages throughout the race.</span></p>\n<p><span>“I think you always look back thinking maybe I could have done more but, at the end of the day, I think Shirin [van Anrooij] who eventually won was just quite a bit stronger than me and she raced really well,” Shackley says pragmatically.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_0597_1024x1024.jpg?v=1695647870\" />Once she had secured her second place at the Tour de l’Avenir, Shackley slotted straight into team duties with SD Worx at the Tour de Romandie, back in her usual role as a domestique for riders like Tour de France Femmes winner Vollering. The transition from riding for your personal goals to being a team player who sacrifices their results for others is sharp, but Shackley says she has no problem doing so.</span></p>\n<p><span>“I think as soon as I'm in the team environment it's very easy to slot into the role. I'm surrounded by very impressive girls, obviously the team has been amazing this year, so it’s not hard to work for them,” she says. “Demi’s a very chill person. She's pretty relaxed but in the race when she needs something done she’s also direct. I think it's just the Dutch mentality as well, they’re very honest, which is good because that's how you need to be in a race.”</span></p>\n<p><span>In her three years as part of the SD Worx set-up, Shackley has gone from a first-year elite with very few results to speak of, to one of the most valued members of the Dutch team. Her progression has been fast, especially considering her lack of experience before joining SD Worx – she was selected for the team after Emma Trott, Shackley’s coach on the British Cycling Academy, recommended her to SD Worx team boss, Danny Stam.</span></p>\n<p><span>“It was in 2020 they signed me, which was a Covid year so they didn’t properly see me race until Europeans, because that's the only racing I did that year. I was a bit nervous joining the team because I thought: they might think I'm shit,” Shackley says with a laugh.</span></p>\n<p><span>“I was definitely thrown straight into the deep-end and I think for me that was okay. I was fine with not having as much nurturing. The team is always pretty supportive and you have to learn that if you ask something they will help you. In British culture you don't ask people things and you keep everything to yourself. With the Dutch it is the complete opposite of that, they always want to know what's going on with you. If you don't ask for help, they won't give you help. It’s been about learning that and it always feels like you’re kind of growing up with the team.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_0628-_1_1024x1024.jpg?v=1695647912\" />Despite joining the biggest women’s WorldTour team in the world so early in her career, Shackley says that she has been lucky with a relatively smooth transition to the elites, with no real setbacks or struggles. While she often plays the role of a domestique, Shackley is quick to point out that she has also had opportunities to go for her own results, namely at the UAE Tour at the start of this year, where she finished fourth, and even for individual stage wins at races like the Tour de Romandie.</span></p>\n<p><span>“We have opportunities in every race and you have to make your own opportunities as well. I was in a break at the Tour de Romandie recently and the team fully backed me to stay away but I knew if it came back, it was fine because Demi was also there. It's nice to have that safety barrier that if I mess up, Demi can pull it off,” she explains.</span></p>\n<p><span>As well as helping riders like Vollering to victories in some of the biggest races, Shackley also sees huge value in being teammates with such established general classification riders as she can learn from them each time they race together. This helps her both during crucial moments in races but also when deciding what training she needs to do to become more competitive herself.</span></p>\n<p><span>“The more races I do, I find that tactically I get a lot better,” she explains. “It's also just learning off the girls on the team. Training wise, I'm not a very explosive rider which doesn't help a lot at the time so I’ll be working on things like that as one of my biggest goals to improve.”</span></p>\n<p><span>SD Worx’s success in recent seasons has made them one of the most respected teams in the world, but it has also set an extremely high standard for them to live up to. For a rider like Shackley who is still in the early stages of her career, this can bring added pressure to perform.</span></p>\n<p><span>“The only thing with our team is we don't do so many smaller races, so you have to win big,” Shackley says. “It's obviously quite a lot of pressure because, especially this year, I feel like all the team is doing is winning. If you don't win, it seems a failure, but also every race you do is a learning experience. Hopefully in the next coming years I can manage to perform well enough to have more leadership but there's very strong riders on our team, not just Demi, so to get the opportunity is going to be quite hard. I'd have to be at the best level to make sure that the team would back me.”</span></p>\n<p><span>Shackley’s results this season will undoubtedly go a long way in proving to her team that she is a rider who can step into the role of a GC contender in the years to come. While 2023 has been a breakthrough year for the SD Worx rider, she still remains realistic and grounded when looking ahead to the future, although is optimistic about her chances.</span></p>\n<p><span>“I really like to stage races. I think I perform better over a few days period rather than one day. I would really love to win a stage race like the Tour de France and the Giro,” Shackley admits. “I’m hoping it’s in my future, but, of course, not many people manage to do it.”</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"e9633851685a1e9d6634f3989648e5d97cf7cd3c5357a60393cb9d2eabca71e3","category":"Cycling"}