{"title":"War Stories: How Crash Bandicoot hacked the original PlayStation","link":"https://arstechnica.com/?p=1656632","date":1630845949000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Shot by Sean Dacanay, edited by Jeremy Smolik. <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/02/crash_tscript.txt\">Click here for transcript</a>. </p></div>\n\n<p>When you hear the name <em>Crash Bandicoot</em>, you probably think of it as Sony's platformy, mascoty answer to Mario and Sonic. Before getting the full Sony marketing treatment, though, the game was developer Naughty Dog's first attempt at programming a 3D platform game for Sony's brand-new PlayStation. And developing the game in 1994 and 1995—well before the release of <em>Super Mario 64</em>—involved some real technical and game design challenges.</p>\n<p>In our latest War Stories video, coder <a href=\"https://all-things-andy-gavin.com/\">Andy Gavin</a> walks us through a number of the tricks he used to overcome some of those challenges. Those include an advanced virtual memory swapping technique that divided massive (for the time) levels into 64KB chunks. Those chunks could be loaded independently from the slow (but high-capacity) CD drive into the scant 2MB of fast system RAM only when they were needed for Crash's immediate, on-screen environment.</p>\n<p>The result allowed for \"20 to 30 times\" the level of detail of a contemporary game like <em>Tomb Raider</em>, which really shows when you look at the game's environments. Similar dynamic memory management techniques are now pretty standard in open-world video games, and they all owe a debt of gratitude to Gavin's work on <em>Crash Bandicoot</em> as a proof of concept.</p></div><p><a href=\"https://arstechnica.com/?p=1656632#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1656632&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e96e3bf9f9cbfd461c20c202f24dfa358a662dee921f4d93b332a0f7ce30e5d0","category":"Tech"}