{"title":"42 Challenges for agricultural social media influencers engagement with young, non-ag adults","link":"https://academic.oup.com/jas/article/102/Supplement_1/3/7617952?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Segments of society question the welfare of animals in production, whether types of product consumption have a negative impact on personal health, and environmental sustainability of producing livestock. As most Americans are three or more generations removed from production agriculture (American Farm Bureau, 2020), they have minimal incentive to question unsubstantiated information purported by anti-animal agriculture groups. Ag communication strategies often seem to fall short compared with anti-agricultural messages shared throughout the media infosphere. Prominent forms of digital / social media (SM) platforms have infiltrated daily lives of society. With the significance of engagement factors such as likes, comments, shares, and saves on such platforms in mind, our research sought to assess the willingness of SM users to interact with content on Instagram created by agricultural social media influencers (SMIs). Participants (n = 855; ages 18-30 from the U.S. and a non-ag background) were recruited through Prolific and anonymously completed a Qualtrics survey. Quantitative data were responses to questions about willingness to engage with both general content and agriculture-related content. Participants were shown images and narrative content from well-established agricultural SMIs. Participants were surveyed both before and after being shown example image posts of agricultural SMIs. Data were analyzed utilizing SPSS with independent variables consisting of general content versus agricultural content while dependent variables were comprised of the summation of participant engagement type willingness which was operationalized by numerically converting the five-point Likert scale. Results showed differences (P &lt; 0.05) in willingness to engage with agricultural SMI through likes, comments, shares, and saves than with general content. Results imply that agricultural SMIs will have more limited opportunities to facilitate engagement with young adult Instagram users than those that share generalized content. These outcomes reinforce a communication dilemma around SM engagement that focuses on reaching non-ag audiences with image and evidence-based agricultural content.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e97416ba72e80429b0dd58773828417809a6887fda9789b267f394231fb14851","category":"Environment"}