{"title":"128 Effects of dietary hybrid rye on quality and consumer acceptability of pork from pigs raised under organic conditions","link":"https://academic.oup.com/jas/article/102/Supplement_2/58/7664900?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>In organic pig production, hybrid rye grain and straw can be used as feed and bedding, respectively, to reduce production costs. However, there is a concern that replacing corn with hybrid rye in pig diets may affect pork quality. In this study, we investigated whether inclusion of hybrid rye in pig diets can affect quality and consumer acceptability of pork from organically raised pigs. Pigs [n = 200, initial body weight (BW) = 26.8±3.5 kg, 10 wk of age] were assigned to Control or Rye treatments (50 pigs/pen; 2 pens/treatment) within a hoop barn and stratified for BW and sex across pens. Control pigs received corn, soybean meal-based diets. Rye pigs were fed diets in which hybrid rye replaced 50% of the corn in control diets. Near market BW (average = 127 kg, 22 wk of age), 8 pigs per pen (4 barrows and 4 gilts) closest to the average BW of all pigs in the pen were selected for evaluation of pork quality and consumer acceptability. Carcass pH at 45 min and 24 h postmortem in the ham, and objective color scores (L*, a*, b*), shear force, and subjective color and marbling scores were collected from a loin chop. Loin chops were kept at or below -18°C until a consumer taste panel was conducted to assess overall liking, flavor liking, texture liking, toughness, juiciness, and off-flavor of pork from the cooked loin chops. Liking ratings were made on 120-point scales (0 - strongest dislike imaginable, 120 - strongest like imaginable). Toughness, juiciness, and off-flavor were ranked on 20-point scales (0 - none, 20 - extremely tough, juicy, or intense, respectively). Data were analyzed using the Mixed procedure, Frequency procedure with chi-square test of SAS. Measures of pork quality (pH at 45 min and 24 h, a*, b*, shear force, and subjective marbling and color scores) were not different between treatments (Table 1). Pigs fed Control diets displayed a greater (<span>P</span> = 0.006) L* reading than Rye-fed pigs indicating that pork from Control pigs was lighter in color than Rye-fed pigs. Generally, the taste panel did not detect a difference in acceptability of pork from Control and Rye-fed pigs. Juiciness and off flavor were scored very similarly by panelists. However, pork from Rye-fed pigs tended (<span>P</span> = 0.075) to be tougher than pork from Control pigs. Liking attributes (overall liking, flavor liking, and texture liking) were scored similarly between Rye-fed and Control pigs and generally better than neutral (neutral=60/120) by panelists. These data suggest that replacing 50% of corn with hybrid rye in diets for growing-finishing pigs will not negatively impact quality or consumer acceptability of pork.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e97aac5a91acc5ceded25f6b048ef3c1f98b0cbcf7b26c2b4733710fc7155811","category":"Environment"}