{"title":"An Accuracy Assessment of Field and Airborne Laser Scanning–Derived Individual Tree Inventories using Felled Tree Measurements and Log Scaling Data in a Mixed Conifer Forest","link":"https://academic.oup.com/forestscience/article/70/3/228/7637489?rss=1","date":1711670400000,"content":"<span><div>Abstract</div>On-the-ground sample-based forest inventory methods have been the standard practice for more than a century, however, remote sensing technologies such as airborne laser scanning (ALS) are providing wall-to-wall inventories based on individual tree measurements. In this study, we assess the accuracy of individual tree height, diameter, and volume derived from field-cruising measurements and three ALS data-derived methods in a 1.1 ha stand using direct measurements acquired on felled trees and log-scale volume measurements. Results show that although height derived from indirect conventional field measurements and ALS were statistically equivalent to felled tree height measurements, ALS measured heights had lower root mean square error (RMSE) and bias. Individual tree diameters modeled using a height-to-diameter-at-breast-height model derived from local forest inventory data and the software ForestView had moderate RMSE (8.3–8.5 cm) and bias (-3.0 – -0.3 cm). The ALS-based methods underdetected trees but accounted for 78%–91% of the field reference harvested merchantable volume and 71%–99% of the merchantable volume scaled at the mill. The results also illustrate challenges of using mill-scaled volume estimates as validation data and highlight the need for more research in this area. Overall, the results provide key insights to forest managers on accuracies associated with conventional field-derived and ALS-derived individual tree inventories.<strong>Study Implications</strong>: Forest inventory data provide critical information for operational decisions and forest product supply chain planning. Traditionally, forest inventories have used field sampling of stand conditions, which is time-intensive and cost-prohibitive to conduct at large spatial scales. Remote sensing technologies such as airborne laser scanning (ALS) provide wall-to-wall inventories based on individual tree measurements. This study advances our understanding of the accuracy of conventional field-derived and ALS-derived individual tree inventories by evaluating these inventories with felled tree and log scaling data. The results provide key insights to forest managers on errors associated with conventional field and ALS-derived individual tree measurements.</span>","author":"","siteTitle":"Forest Science Current Issue","siteHash":"05e2fee9ae6a27cd288c89ae75adf607539d339849a171c4fab1eaa2f11b4162","entryHash":"e97f54cf7c2200f7f9fbd660a3509f03e166e3787da0032d13361e753db1b0f1","category":"Environment"}