{"title":"The Agoutis: A Future Model for Ecologically Relevant Neuroscience and Physiology In Natura","link":"https://onlinelibrary.wiley.com/doi/10.1111/eth.13514?af=R","date":1729314252000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1cc5e177-557a-4f89-9c76-490251df8200/eth13514-toc-0001-m.png\" alt=\"The Agoutis: A Future Model for Ecologically Relevant Neuroscience and Physiology In Natura\" />\n<p>Recent advances in behavioral monitoring and wireless physiology make neuroscience in the wild a viable option for larger animal models. Here we spotlight one such species, the agouti (<i>Dasyprocta spp.</i>) a large promising rodent model for the future of neuroscience <i>in natura</i>. The agouti is a large (3-6kg), diurnal rodent of the rainforest of central and south america known for sowing the forest via scatter hoarding</p>\n<br />\n<h2>ABSTRACT</h2>\n<p>The overarching goal of neurobiology is to understand how complex behaviors are generated by the nervous system. The behavior of each species, and the brain that controls it, is shaped by the historical and current state of the environment that they inhabit. This fact is juxtaposed with the reductionist approach of neuroscience that isolates animals from their natural environment. Understanding how brains evolved to orchestrate the myriads of natural behaviors an animal performs in response to its environment requires an integrative approach to neuroscience that considers ecology, ethology, and evolution. Current technological developments are leading us to an inflection point at which studying brain functions in the wild is now possible. Ecological studies on how the environment affects behavior of animals (i.e., hibernation, foraging, food hoarding, and nest building) have framed a plurality of questions to be answered mechanistically, and yet, only few studies have addressed the relationship between the environment and the brain's anatomy and physiology. Neuroscience needs new animal models that allow us to tackle such questions in the wild. Here, we propose a new animal model for wild neuroscience, the agouti (<i>Dasyprocta</i> spp.), a large wild rodent playing a critical seasonal role in the maintenance of the central and south American rainforest ecosystems. We focus on how a rodent model, like the agouti, will allow for the investigation of large-scale brain dynamics during seasonal behaviors of ecological importance: scatter-hoarding and retrieval. We describe agouti evolution, ecology, and physiology as well as neuro-anatomical and neurophysiological studies, which have set the foundation for future neuroscience in natura. We suggest agoutis have the potential to be a groundbreaking model for wild neuroscience.</p>","author":"J. I. Sanguinetti‐Scheck, \nD. Gálvez","siteTitle":"Wiley: Ethology: Table of Contents","siteHash":"7a94182f50d5fe321f60efa1a57eebe5c3e6a74d1fa25ba04a906a999025c0b6","entryHash":"e9932bc1ab10960335a019742235a2919068af15c00bb25c48013afe123017d5","category":"Environment"}