{"title":"Tesla’s “Full Self-Driving” sees pedestrian, chooses not to slow down","link":"https://arstechnica.com/?p=1939477","date":1684247588000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/FSD-screenshot-800x452.jpg\" alt=\"A screenshot of a video showing a Tesla detecting a pedestrian crossing at a crosswalk but not slowing down for them\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/FSD-screenshot-scaled.jpg\">Enlarge</a> <span>/</span> This Tesla can clearly detect the pedestrian as they appear on the infotainment display. But the car continues past them, only slowing from 26 mph to 24 mph after it passes the crosswalk. California law requires drivers to come to a complete stop for pedestrians at crosswalks.  (credit: Twitter/Whole Mars Blog)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Tesla released a new version of its controversial \"Full Self-Driving Beta\" software last month. <a href=\"https://www.notateslaapp.com/software-updates/version/2023.6.15/release-notes\">Among the updates in version 11.4</a> are new algorithms determining the car's behavior around pedestrians. But alarmingly, a video posted to Twitter over the weekend shows that although the Tesla system can see pedestrians crossing the road, a Tesla can choose not to stop or even slow down as it drives past.</p>\n<p>The video was posted by the Whole Mars Catalog account, a high-profile pro-Tesla account with more than 300,000 followers. <a href=\"https://twitter.com/WholeMarsBlog/status/1657807019703943169?s=20\">The tweet</a>, which has been viewed 1.7 million times, featured a five-second video clip with the accompanying text:</p>\n<figure>\n    <div>\n            </div>\n    </figure>\n<blockquote><p>One of the most bullish / exciting things I've seen on Tesla Full Self-Driving Beta 11.4.1.</p>\n<p>It detected the pedestrian, but rather than slamming on the brakes it just proceeded through like a human would knowing there was enough time to do so.</p></blockquote>\n<p>The person posting the video then clarified that it was filmed in San Francisco and that anyone not OK with this driving behavior <a href=\"https://twitter.com/WholeMarsBlog/status/1657940431026667520?s=20\">must be unfamiliar with city life</a>. (As someone who has lived in big cities all his life, I am definitely not OK with cars not stopping for pedestrians at a crosswalk.)</p></div><p><a href=\"https://arstechnica.com/?p=1939477#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1939477&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e99706125f17bb38fbe460c3a48303d02190023a7e4d238a6726e0899a2a7c4c","category":"Tech"}