{"title":"Apple ไตรมาสล่าสุด เติบโตสูง ยอดขาย iPhone เพิ่มขึ้น 50%","link":"https://www.blognone.com/node/123929","date":1627435243000,"content":"<div><div><div><p>แอปเปิลรายงานผลการดำเนินงานไตรมาสที่ 3 ตามปีการเงินบริษัท 2021 สิ้นสุดวันที่ 26 มิถุนายน 2021 รายได้รวมเพิ่มขึ้น 36% จากช่วงเดียวกันในปีก่อนเป็น 81,434 ล้านดอลลาร์ ซึ่งเป็นสถิติสูงสุดประจำไตรมาสเดือนมิถุนายน และมีกำไรสุทธิ 21,744 ล้านดอลลาร์</p>\n<p>Tim Cook ซีอีโอแอปเปิลกล่าวว่าในไตรมาสนี้ ทีมงานยังคงส่งมอบนวัตกรรมที่มีประสิทธิภาพให้กับผู้ใช้งาน บนช่วงเวลาที่เทคโนโลยีมีบทบาทต่อผู้คนมากขึ้นอย่างที่ไม่เคยมีมาก่อน แอปเปิลยังมองไปข้างหน้าเพื่อสร้างคุณค่าที่เท่าเทียม ไม่ว่าจะเป็นการสร้างนักพัฒนารุ่นใหม่ จนถึงเป้าหมายด้านสิ่งแวดล้อมในปี 2030</p>\n<p>ยอดขายของแอปเปิลเติบโตสูงระดับสองหลักในทุกกลุ่มสินค้า โดย iPhone เพิ่มขึ้น 49.8% เป็น 39,570 ล้านดอลลาร์, ธุรกิจ Service เพิ่มขึ้น 33% เป็นสถิติใหม่สูงสุดอีกไตรมาสที่ 17,486 ล้านดอลลาร์, กลุ่ม Wearables และอื่น ๆ เพิ่มขึ้น 40% เป็น 8,775 ล้านดอลลาร์, Mac เพิ่มขึ้น 16% 8,235 ล้านดอลลาร์ และ iPad เพิ่มขึ้น 12% เป็น 7,368 ล้านดอลลาร์</p>\n<p>มีประเด็นเพิ่มเติมที่น่าสนใจจากช่วงแถลงผลประกอบการ โดยซีอีโอ Tim Cook‌ และซีเอฟโอ Luca Maestri ดังนี้</p>\n<ul>\n<li>จำนวนลูกค้าที่จ่ายเงิน subscription ผ่านแพลตฟอร์มของแอปเปิลมีมากกว่า 700 ล้านคน เพิ่มขึ้นกว่า 4 เท่าจาก 4 ปีก่อน</li>\n<li>กลุ่มสินค้า Wearable ยังเติบโตดี จากไลน์สินค้าใหม่ที่เพิ่มมาอย่าง Apple TV 4K ตัวใหม่ และ AirTag</li>\n<li>ยอดขาย Mac ยังเติบโตสูง จากรุ่นที่เป็นชิป M1</li>\n<li>มากกว่าครึ่งหนึ่งของลูกค้า Apple Watch, Mac และ iPad ในไตรมาสที่ผ่านมา เป็นลูกค้าใหม่</li>\n<li>ปัญหาซัพพลายการผลิตในไตรมาสปัจจุบันสูงกว่าไตรมาสก่อนหน้า โดยเฉพาะใน iPad และ Mac</li>\n<li>ปัญหาชิปขาดแคลนยังมีอยู่ แต่จะกระทบกับไลน์สินค้ารุ่นเก่ามากกว่า</li>\n<li>ยอดขาย iPhone ในหลายประเทศทำสถิติสูงสุดของไตรมาสมิถุนายน</li>\n</ul>\n<p>ที่มา: <a href=\"https://www.apple.com/newsroom/2021/07/apple-reports-third-quarter-results/\">แอปเปิล</a> และ <a href=\"https://www.macrumors.com/2021/07/27/apple-3q-2021-earnings/\">MacRumors</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c7381acabe83a67d668409aa613c938d.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e9a2b31167dfe552fa2d05c355a53120f702eb42fe809681eb59fd68be66a0ba","category":"Thai"}