{"title":"Sources of stress, coping strategies and associated factors among Vietnamese first-year medical students","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308239","date":1722434400000,"content":"<p>by Tan Nguyen, Christy Pu, Alexander Waits, Tuan D. Tran, Yatan Pal Singh Balhara, Quynh Thi Vu Huynh, Song-Lih Huang</p>\r\nObjectives <p>This study aims to examine the sources of stress among first-year medical students; the frequency of their coping strategies; the factors associated with specific stressors and specific coping strategies adopted by the participants.</p> Methods <p>We conducted a cross-sectional study with 409 first-year students at the University of Medicine and Pharmacy, Vietnam. The Vietnamese versions of the Higher Education Stress Inventory (V_HESI) and Brief Coping Orientation to Problems Experienced (V_Brief COPE) were validated and were used as measurement instruments for participants’ sources of stress and coping strategies frequencies. The survey comprised questions of socioeconomic status, stress-related issues, the six sources of stress (using the V_HESI), and the nine coping strategies (using the V_Brief COPE).</p> Results <p>Among the six sources of stress, “Worries about future competence/endurance” had the highest mean score (3.02±0.64), while “Mismatch in professional role expectations” had the lowest score (1.60±0.53). “Financial concerns” and “Academic workloads” were also significant sources of stress. Regarding coping strategies, Self-distraction was most frequently adopted by the participants (2.80 ± 0.68). Problem-solving (2.72±0.53) and seeking Social support (2.62±0.70) were also common adaptive strategies. Avoidance (1.87±0.55) and substance-use (1.27±0.55) were the least frequent strategies. Students who experienced acute stress event were more likely to have financial concerns compared to others. Substance use was positively associated with stressors from “Mismatch in professional role expectations”, “Non-supportive educational environment”, “Having physical issues” and “Having part-time job”. Self-blame was more frequent among students with “Worries about future competence/endurance”, “Financial concerns”, and “Academic workload”. Male student tended to adopt humor strategy (β = 0.19, p = 0.02), while less likely to utilize religious practices (β = -0.21, p = 0.01).</p> Conclusions <p>Two-thirds of the participants reported moderate to high levels of stress. “Worries about future competence/endurance” was the most concerned stressor, followed by “Academic workload”, and “Financial concerns”. The first-year medical students reported high frequency of utilization “Self-distraction”, “Problem-solving” and “Social support” when confronting stress. The findings may help inform the school management to better support students’ well-being.</p>","author":"Tan Nguyen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e9af27f674b0ee6df008d11693ed3900491de2f4ec18a3f52b36988cb0b96faa","category":"Interdisciplinary"}