{"title":"Effects of Probiotics, Prebiotics, and Synbiotics as an Alternative to Antibiotics on Growth and Blood Profile of Nile Tilapia (Oreochromis niloticus)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/2798279?af=R","date":1685775600000,"content":"<p>The purpose of this study is to compare the effects of probiotics, prebiotics, and their synergism against antibiotics on the growth performance and hematology of Nile tilapia (<i>Oreochromis niloticus</i>). The study was designed by using five treatments over 75 days in which <i>T</i>\n<sub>Con</sub> (control), <i>T</i>\n<sub>Ant</sub> (antibiotics: Cotrim vet), <i>T</i>\n<sub>Pro</sub> (commercial probiotics: pond care), <i>T</i>\n<sub>Pre</sub> (prebiotics: spirulina), and <i>T</i>\n<sub>Syn</sub> (synbiotic: probiotic and prebiotic) were used. All the treatments showed significant (<i>P</i> &lt; 0.05) improvements in growth and feed utilization parameters. The highest mean final growth was found in <i>T</i>\n<sub>Syn</sub> (13.79 ± 0.11) and then in <i>T</i>\n<sub>Pre</sub> (13.61 ± 0.02), <i>T</i>\n<sub>Pro</sub> (13.22 ± 0.12), <i>T</i>\n<sub>Ant</sub> (10.04 ± 0.7), and <i>T</i>\n<sub>Con</sub> (8.89 ± 0.19). Weight gain and specific growth rate were significantly (<i>P</i> &lt; 0.05) different between treatments. The food conversion ratio varied significantly (<i>P</i> &lt; 0.05) across treatments and the lowest value was observed in <i>T</i>\n<sub>Pro</sub> (1.13 ± 0.021). The protein efficiency ratio (PER) was significantly (<i>P</i> &lt; 0.05) different between treatments and the highest value was in <i>T</i>\n<sub>Pro</sub> (3.1 ± 0.05). The survival rate was not significantly (<i>P</i> &lt; 0.05) different between treatments. The highest white blood cell (WBC) counts were found in <i>T</i>\n<sub>Syn</sub> (12.63 ± 0.11) followed by <i>T</i>\n<sub>Pre</sub> (12.6 ± 0.2), <i>T</i>\n<sub>Pro</sub> (12.32 ± 0.12), <i>T</i>\n<sub>Con</sub> (12.16 ± 0.105), and <i>T</i>\n<sub>Ant</sub> (11.03 ± 0.46). The values of red blood cells and platelets were not statistically significant (<i>P</i> &lt; 0.05) among the different treatments. However, all treatments showed normal hepatocyte structure in liver tissue histology, and intense hepatic lipid vacuoles in <i>T</i>\n<sub>Syn</sub> indicated improved growth. The higher growth performance and feed utilization values were observed in probiotics, prebiotics, and their synergism units compared to antibiotic treatment. Therefore, probiotics, prebiotics, and their synergism can be used as an alternative to antibiotics in tilapia aquaculture.</p>","author":"Marjana Jannat Munni, \nKazi Rabeya Akther, \nShamim Ahmed, \nMohammad Amzad Hossain, \nNirmal Chandra Roy, \nHamed Ghafarifarsani","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"e9b4fb735cd67c2996bfd6eef5425870d0f2d1dcbb2e4bf0581f99d59e0f3fea","category":"Environment"}