{"title":"Genetic Predisposition to Hippocampal Atrophy and Risk of Amnestic Mild Cognitive Impairment and Alzheimer&rsquo;s Dementia","link":"https://www.preprints.org/manuscript/202410.1707/v1","date":1729590234000,"content":"Background: There is paucity of evidence on the association of genetic propensity for hippocampal atrophy with cognitive outcomes. Therefore, we examined the relationship of a Polygenic Risk Score for hippocampal atrophy (PRShp) with the incidence of amnestic mild cognitive impairment (aMCI) and Alzheimer’s disease (AD) as well as the rates of cognitive decline. Methods: Participants were drawn from the population based HELIAD cohort. Comprehensive neuropsychological assessments were performed at baseline and follow-up. PRShp was derived from the summary statistics of a large GWAS for hippocampal volume. Cox proportional hazards models as well as generalized estimating equations (GEEs) were used to evaluate the association of PRShp with the combined incidence of aMCI/AD and cognitive changes over time, respectively. All models were adjusted for age, sex, education, and Apolipoprotein E (APOE) genotype. Results: Our analysis included 618 older adults, among whom 73 developed aMCI/AD after an average follow-up of 2.96±0.8 years. Each additional SD of PRShp elevated the relative hazard for incident aMCI/AD by 46%. Participants at the top quartile of PRShp had almost three times higher risk of converting to aMCI/AD compared to the lowest quartile group. Higher PRShp scores were also linked to steeper global cognitive and memory decline. The impact of PRShp was greater among women and younger adults. Conclusions: Our findings support the association of PRShp with aMCI/AD incidence and with global cognitive and memory decline over time. PRS association was sex and age dependent, suggesting that these factors should be considered in genetic modelling for AD.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e9bbd3b82dd869f11411d89b85c5c97191f4746459a66518918b1cc6928559c5","category":"Interdisciplinary"}