{"title":"Recovery of Rare Earth Elements (REEs) from Different Sources of E-waste and Their Potential Applications: A Critical Review","link":"https://www.preprints.org/manuscript/202404.1659/v1","date":1714032985000,"content":"To be used in cutting-edge green and other technologies, rare earth elements (REEs) are in great demand. Rare earth elements (REEs) include the following elements: La, Ce, Pr, Nd, Pm, Sm, Eu, Gd, Tb, Dy, Ho, Er, Tm, Yb, and Lu; additionally, they include Sc. Computers, laptops, TVs, generators, DVD players, cell phones, refrigerators, and other electronic equipment that are usually thrown away by their original owners because of their limited lifespan are examples of outdated or end-of-life electronics that make up e-waste. At the moment, these metals are essential to many contemporary devices, from LED light bulbs and wind turbines to cell phones and televisions. The development of new, cutting-edge technologies, especially in the field of electronics, depends on the availability of rare earth elements (REEs), sometimes referred to as the \"vitamins\" of modern industry. Since e-waste frequently has high concentrations of rare earth elements and is handled in hazardous ways, e-waste may be a significant contributor to the contamination of rare earth elements. Apart from their detrimental effects on the environment, these wastes also result in the loss of precious materials and rare earth elements such as gold, silver, copper, platinum, palladium, and rare earth, among other things. Every year, 50 million tonnes of e-waste are created globally. An enormous amount of e-waste is wasted since only 20% of it is handled correctly worldwide. There have been numerous reports on the recovery and separation of rare earth elements (REEs) from e-waste using various techniques, such as the hydrometallurgical process, siderophores, pyrometallurgical process, bioleaching, and biosorption. According to reports, the demand for rare earth elements (REEs) from clean technologies is expected to reach 51.9 thousand metric tons (kt) of REO in 2030. Nd and Dy, on the other hand, make up 75% and 9% of the world's REE deposits, respectively. REE levels in aquatic settings are rising, particularly in urban areas, in tandem with the growing demand for high-tech applications. Urban wastewater from open sewers and the entrance of a wastewater treatment facility in Cotonou, Benin, was collected, and its rare earth element (REE) contamination was evaluated.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e9d360879b504493152d63644218cee714d773b45c293dbd9e22e88a4e949bcb","category":"Interdisciplinary"}