{"title":"Prevalence and Partial Geo-Mapping of Schistosomiasis in Eastern Cape: A Retrospective Study.","link":"https://www.preprints.org/manuscript/202410.0311/v1","date":1728014578000,"content":"This study aimed to determine the prevalence and demographic distribution of schistosomiasis in the Eastern Cape Province of South Africa through a cross-sectional retrospective analysis using secondary data from patients with microscopically confirmed schistosomiasis collected between 2019 and 2020. The study focused on both rural and semi-urban areas, including Bizana, Butterworth, Centane, Elliotdale, Flagstaff, Idutywa, Lusikisiki, Libode, Mqanduli, Port St. Johns, Willowvale, and Mthatha. Data were obtained from three districts: Alfred Nzo, Amatole, and OR Tambo, covering both rural and semi-urban regions. The study included patients of all ages who submitted urine samples for schistosomiasis testing in the specified districts. A simple random sampling method was used to select 337 clinical records from the National Health Laboratory Service (NHLS) of Mthatha. Hospital records from the NHLS Microbiology Department of Mthatha were analyzed using SPSS version 20. Statistical tests, including Fisher’s exact test, Pearson’s Chi-squared test, and Wilcoxon rank sum test, were employed to compare demographic variables. The Shapiro-Wilk test was used to assess the normality of quantitative data. St Barnabas Laboratory had the highest frequency of cases (34.1%), followed by Greenville Depot (17.8%) and Willowvale Laboratory (11.3%). Most cases were in the 10-19 age group (63.4%), followed by those under 10 years (24.9%). Males constituted 76.4% of the cases, while females accounted for 23.6%. Viable ova were observed in 98.2% of the samples. The study highlights a significant prevalence of schistosomiasis in the Eastern Cape Province, with a higher incidence in rural areas and among males aged 10-19. These findings underscore the need for targeted public health interventions and continuous monitoring to control and prevent schistosomiasis in the region.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"e9d45ed2766904da60bbc83426387e8df76ce5d24c1a271190ed504e37b7ade6","category":"Interdisciplinary"}