{"title":"Dynamics of serum anion gaps with in-hospital mortality: Analysis of the multi-open databases","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302206","date":1713276000000,"content":"<p>by Dong Eun Yang, Sua Jo, Dong Hyun Lee, Won Suk An, Min Jae Jeong, Minkook Son</p>\r\nBackground <p>Few studies have investigated the relationship between the anion gap, including the corrected anion gap, and patient mortality in intensive care units (ICUs) without restricting the analysis to specific diseases or medical specialties. Our primary objective was to investigate the association between the anion gap and ICU mortality using multiple open-access databases.</p> Methods <p>We identified 4229 subjects from the Medical Information Mart for Intensive Care IV (MIMIC-IV) database, whose entries were from between 2008 and 2019. For each patient, the anion gap and corrected anion gap were calculated, and the study sample was divided into tertile groups (T) according to these levels. The association between the anion gap and in-hospital mortality was assessed using hazard ratios (HRs) and 95% confidence intervals (CIs) derived from a multivariable-adjusted Cox proportional hazards model. Besides MIMIC-IV, we also incorporated study samples from two other databases (MIMIC-III and electronic ICU) to calculate summary HRs using a random-effects meta-analysis.</p> Results <p>Within MIMIC-IV, 1015 patients (24%) died during an average follow-up period of 15.5 days. The fully adjusted HRs and 95% CIs for T2 and T3, relative to T1, were 1.31 (95% CI 1.08–1.58) and 1.54 (95% CI 1.24–1.90), respectively. When grouped by corrected anion gap, the results remained statistically significant. In the meta-analysis, the summary HRs and 95% CIs for T2 and T3 were 1.24 (95% CI 1.08–1.43) and 1.55 (95% CI 1.33–1.82), respectively.</p> Conclusions <p>Both the anion gap and corrected anion gap were associated with in-hospital mortality regardless of specific diseases or medical specialties.</p>","author":"Dong Eun Yang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e9dc0e245f7e7a2aa2e0ca07b0f51329d9bfa3eed2ddf295aeb65d0fa9c6c48c","category":"Interdisciplinary"}