{"title":"Tesla เตรียมเปิดเครือข่าย Supercharger ให้รถยนต์ไฟฟ้ายี่ห้ออื่นใช้ด้วยภายในปีนี้","link":"https://www.blognone.com/node/123847","date":1626966200000,"content":"<div><div><div><p>Tesla เป็นผู้ผลิตรถยนต์ไฟฟ้าที่มีเครือข่ายสถานีชาร์จของตัวเองที่ครอบคลุมมากที่สุดในโลก และได้รับการอัพเกรดใหญ่มาแล้ว 2-3 ครั้งเพื่อให้ชาร์จไฟได้เร็วยิ่งขึ้น</p>\n<p>อย่างไรก็ตาม ด้วยความที่เป็นผู้เล่นในตลาดรถยนต์ไฟฟ้าแบบจริงจังรายแรก ทำให้ต้องพัฒนาหัวชาร์จแบบเฉพาะของตนเองขึ้นมา ซึ่งเคยมีการเปิดเผยว่ามาตรฐานของหัวชาร์จรถยนต์ไฟฟ้าในสมัยนั้นไม่ดีพอสำหรับ Tesla จึงต้องพัฒนาขึ้นมาเอง แต่ประเด็นนี้ก็ถูกนำมาวิจารณ์ Tesla อยู่เรื่อยๆ ว่ามีเครือข่ายสถานีชาร์จที่ครอบคลุม แต่รถยนต์ไฟฟ้ายี่ห้ออื่นกลับใช้ด้วยไม่ได้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d34a88d869ce93341c8aae47b3b7ba0c.png\" /></p>\n<p>ล่าสุดก็มีคนทวีตวิจารณ์เรื่องนี้อีกและเสนอให้แบน Tesla แต่ Elon Musk ตอบกลับไปว่า Tesla จะเปิดเครือข่ายสถานี Supercharger ให้รถยนต์ไฟฟ้ายี่ห้ออื่นเข้ามาใช้บริการได้ด้วยภายในปีนี้ ทั้งนี้ ยังไม่มีรายละเอียดว่าเงื่อนไขการใช้บริการจะเป็นอย่างไร</p>\n<p>ขณะนี้หลายประเทศก็พยายามผลักดันการขยายเครือข่ายสถานีชาร์จรถยนต์ไฟฟ้ากันเรื่อยๆ อย่างในเยอรมนี รัฐมนตรีคมนาคมก็เคยโน้มน้าว Tesla ให้เปิดสถานีชาร์จของตนให้รถยนต์ยี่ห้ออื่นเข้ามาใช้ด้วยได้ หรือด้านสหรัฐอเมริกาก็สนับสนุนงบประมาณถึง 7.5 พันล้านดอลลาร์สหรัฐ (ราว 2.4 แสนล้านบาท) เพื่อพัฒนาสาธารณูปโภคพื้นฐานด้านรถยนต์ไฟฟ้ารวมถึงสถานีชาร์จด้วย นอกจากนี้ผู้เล่นภาคเอกชนก็พยายามขยายเครือข่ายสถานีชาร์จกันอยู่เช่นกัน</p>\n<p>ที่มา - <a href=\"https://www.reuters.com/business/autos-transportation/tesla-plans-open-up-its-charging-network-other-evs-later-this-year-2021-07-20/\">Reuters</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tesla-motors\">Tesla Motors</a></div><div><a href=\"/topics/electric-car\">Electric Car</a></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"e9e510f8c120344e5f00f78b1e6d28de340d6b51199dc0d5967f241e658bff49","category":"Thai"}