{"title":"375 The effects of protease supplementation on weaned piglet performance and intestinal function fed greater amounts of lower digestible protein sources","link":"https://academic.oup.com/jas/article/102/Supplement_3/243/7757117?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The present study investigated the impact of dietary protease supplementation on the growth performance and intestinal function of weaned piglets when fed a diet comprising high levels of low digestible protein sources, in comparison with a standard commercially representative piglet diet. A total of 180 weaned piglets, 21 d old, of Duroc × Large White × Landrace crossbreeds, with an initial body weight (BW) of 6.27 ± 0.45 kg, were randomly assigned to three dietary treatments: 1) a standard commercial positive control (PC) diet comprising 22.2% soy protein, 5% whey protein, and 3% fish meal, 2) a negative control (NC) diet comprising 30.1% soy protein without whey protein and fish meal, and 3) a NC diet supplemented with 0.02% protease (NC + PROT). The diets were formulated to be iso-nitrogenous and iso-caloric and were pelleted at conditions of 0.4 MPa and 75°C. The experimental design employed a completely randomized design with 6 replicate pens per treatment, each pen containing 10 piglets. Statistical analysis was conducted using one-way ANOVA, with differences between means assessed using Duncan’s Multiple Range Test (<span>P</span> &lt; 0.05). In terms of piglet performance, feeding the NC diet, containing high levels of low digestible protein sources, resulted in a significant decrease (<span>P</span> &lt; 0.05) in final BW, average daily gain (ADG), and average daily feed intake (ADFI) by 3.1%, 8.2%, and 5.2%, respectively, compared with piglets fed the PC diet. Conversely, the NC diet significantly increased (<span>P</span> &lt; 0.05) the feed-to-gain ratio and incidence of diarrhea by 3.4% and 88.3%, respectively, relative to PC. However, the supplementation of protease in the NC + PROT diet restored final BW, feed-to-gain ratio, and incidence of diarrhea to the same level as PC, while ADG and ADFI were increased (<span>P</span> &lt; 0.05) by 4.6% and 4.3%, respectively. Regarding intestinal function, relative to PC, piglets fed the NC diet exhibited significantly less (<span>P</span> &lt; 0.05) duodenal villus height, crude protein digestibility, and gene expressions of duodenal peptide transporter PepT1 and jejunal amino acid transporter b0,+AT, while blood urea nitrogen and diamine oxidase concentrations were greater (<span>P</span> &lt; 0.05). However, the addition of protease in the NC diet reinstated measures of intestinal function, as NC + PROT-fed piglets showed similar duodenal villus height, crude protein digestibility, gene expressions of duodenal peptide transporter PepT1 and jejunal amino acid transporter b0,+AT, as well as blood urea nitrogen and diamine oxidase concentrations to PC. In conclusion, dietary supplementation of protease in weaned piglets fed higher levels of lower digestible protein sources mitigated losses in growth performance and intestinal functionality by enhancing intestinal development, protein digestibility, nutrient transport efficiency, and overall health status of piglets.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"e9e73320e6b5dcda391d38a1f38f4b7de108d793ae78e82a88ea0d8ce875e828","category":"Environment"}