{"title":"Performance of low impact development on peak flow reduction in an urban system","link":"https://onlinelibrary.wiley.com/doi/10.1111/1752-1688.13188?af=R","date":1712164485000,"content":"<h2>Abstract</h2>\n<p>This study proposes an approach to evaluate the efficiency of low impact development (LID) in reducing urban runoff using a rainfall generator to disaggregate daily rainfall into sub-hourly rainfall data, which are used as input of a hydrological model at the urban watershed scale. Twelve scenarios are analyzed combining four percentages of impervious area retrofitted with LIDs (25%, 50%, 75% and 100%), and three LID combinations of green roofs (GRs) and rain gardens (RGs). The rainfall generator Rainsim V.3 is used to generate 500 years of rainfall data with a 15-min time step to analyze the performance of LIDs in the long-term with the LID module of the Soil and Water Assessment Tool hydrological model. An urban watershed of 3 km<sup>2</sup> located in Florence (Italy) is selected as a case study. Results show the performances of GRs and RG on peak flow reduction, highlighting a maximum flow reduction of single facilities ranging between 15% and 60% that can improve in case of their combination. The hydrological performances of LID combinations are very sensitive to the intensity of rainfall events, as well as percentages of area treated underlining the importance of simulating multiple scenarios of intervention to determine the most efficient combination of LIDs for a given case study and support their proper design from a urban water hydrology perspective.</p>","author":"M. Pampaloni, \nA. Sordo‐Ward, \nM. Lompi, \nT. Pacetti, \nS. Zubelzu, \nL. Rodríguez‐Sinobas, \nP. Bianucci, \nE. Caporali, \nL. Garrote","siteTitle":"Wiley: JAWRA Journal of the American Water Resources Association: Table of Contents","siteHash":"b7070794a350c180e68e2251d6fc4f4ad5be669c5d24d82d3d55b25b0dce7a23","entryHash":"e9ed0e9684dbec906fd15c9e24148cc56bd99024f78d54c0f0d8c35751de7913","category":"Environment"}