{"title":"Comparison of hospitalization events among residents of assisted living and nursing homes during COVID-19: Do settings respond differently during public health crises?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306569","date":1720792800000,"content":"<p>by Colleen J. Maxwell, Eric McArthur, David B. Hogan, Hana Dampf, Jeffrey Poss, Joseph E. Amuah, Susan E. Bronskill, Erik Youngson, Zoe Hsu, Matthias Hoben</p>\r\nBackground <p>COVID-19 and resulting health system and policy decisions led to significant changes in healthcare use by nursing homes (NH) residents. It is unclear whether healthcare outcomes were similarly affected among older adults in assisted living (AL). This study compared hospitalization events in AL and NHs during COVID-19 pandemic waves 1 through 4, relative to historical periods.</p> Methods <p>This was a population-based, repeated cross-sectional study using linked clinical and health administrative databases (January 2018 to December 2021) for residents of all publicly subsidized AL and NH settings in Alberta, Canada. Setting-specific monthly cohorts were derived for pandemic (starting March 1, 2020) and comparable historical (2018/2019 combined) periods. Monthly rates (per 100 person-days) of all-cause hospitalization, hospitalization with delayed discharge, and hospitalization with death were plotted and rate ratios (RR) estimated for period (pandemic wave vs historical comparison), setting (AL vs NH) and period-setting interactions, using Poisson regression with generalized estimating equations, adjusting for resident and home characteristics.</p> Results <p>On March 1, 2020, there were 9,485 AL and 14,319 NH residents, comparable in age (mean 81 years), sex (&gt;60% female) and dementia prevalence (58–62%). All-cause hospitalization rates declined in both settings during waves 1 (AL: adjusted RR 0.60, 95%CI 0.51–0.71; NH: 0.74, 0.64–0.85) and 4 (AL: 0.76, 0.66–0.88; NH: 0.65, 0.56–0.75) but unlike NHs, AL rates were not significantly lower during wave 2 (and increased 27% vs NH, January 2021). Hospitalization with delayed discharge increased in NHs only (during and immediately after wave 1). Both settings showed a significant increase in hospitalization with death in wave 2, this increase was larger and persisted longer for AL.</p> Conclusions <p>Pandemic-related changes in hospitalization events differed for AL and NH residents and by wave, suggesting unique system and setting factors driving healthcare use and outcomes in these settings in response to this external stress.</p>","author":"Colleen J. Maxwell","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"e9f669c3647abd68e1a35d3c8a6316d5c9f64cb2cc87f6693dd99d8b5285fd7f","category":"Interdisciplinary"}