{"title":"EU wants “readily removable” batteries in devices soon—but what does that mean?","link":"https://arstechnica.com/?p=1948877","date":1687294331000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/fairphone_repair-800x600.jpg\" alt=\"Fairphone 4 disassembled on a table\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/fairphone_repair.jpg\">Enlarge</a> <span>/</span> Very few modern smartphones can be considered to have a \"readily removable\" battery, but <a href=\"%22https://arstechnica.com/gadgets/2021/09/fairphone-4-has-an-incredible-5-year-warranty-aims-for-6-years-of-updates/%22\">the Fairphone 4</a> is one of them. (credit: Fairphone)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Whenever regulation passes that seems to herald the dawn of a new age of repairable devices, there is almost always a catch, a loophole, or at least an \"it depends.\" In the case of recent headline-grabbing battery legislation out of the European Union, we're waiting to see what counts as \"readily\" when it comes to removing and replacing device batteries.</p>\n<p>Last week, the European Parliament voted overwhelmingly in favor of <a href=\"https://www.europarl.europa.eu/news/en/press-room/20230609IPR96210/making-batteries-more-sustainable-more-durable-and-better-performing\">new rules for handling batteries of all sizes in the EU</a>, due to be implemented within 3.5 years of passage or as early as 2027. Along with measures addressing carbon footprints for electric vehicle and industrial batteries and stricter waste and recycling targets, there was <a href=\"https://www.europarl.europa.eu/RegData/docs_autres_institutions/commission_europeenne/com/2020/0798/COM_COM(2020)0798_EN.pdf\">a particular line in Article 11</a> regarding the \"Removability and replaceability of portable batteries,\" that likely got smartphone, tablet, and laptop manufacturer lobbyists moving:</p>\n<blockquote><p>Portable batteries incorporated in appliances shall be readily removable and replaceable by the end-user or by independent operators during the lifetime of the appliance, if the batteries have a shorter lifetime than the appliance, or at the latest at the end of the lifetime of the appliance.</p></blockquote>\n<p>\"Readily replaceable,\" as addressed in the next paragraph, is when, after removing a battery, you can substitute a similar battery \"without affecting the functioning or the performance of that appliance.\" For all the things specifically defined, outlined, and estimated in the 129-page \"COM(2020) 798 final,\" there's not much more about what the phrase exactly means.</p></div><p><a href=\"https://arstechnica.com/?p=1948877#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1948877&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ea0537bda76492414a1c8688ba3f0bcfba163f6771db33df7a9d499c28aaedfe","category":"Tech"}