{"title":"First Results From a Calibrated Network of Low‐Cost PM2.5 Monitors in Mombasa, Kenya Show Exceedance of Healthy Guidelines","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024GH001049?af=R","date":1726906809000,"content":"<h2>Abstract</h2>\n<p>The paucity of fine particulate matter (PM<sub>2.5</sub>) measurements limits estimates of air pollution mortality in Sub-Saharan Africa. Well calibrated low-cost sensors can provide reliable data especially where reference monitors are unavailable. We evaluate the performance of Clarity Node-S PM monitors against a Tapered element oscillating microbalance (TEOM) 1400a and develop a calibration model in Mombasa, Kenya's second largest city. As-reported Clarity Node-S data from January 2023 through April 2023 was moderately correlated with the TEOM-1400a measurements (<i>R</i>\n<sup>2</sup> = 0.61) and exhibited a mean absolute error (MAE) of 7.03 μg m<sup>−3</sup>. Employing three calibration models, namely, multiple linear regression (MLR), Gaussian mixture regression and random forest (RF) decreased the MAE to 4.28, 3.93, and 4.40 μg m<sup>−3</sup> respectively. The <i>R</i>\n<sup>2</sup> value improved to 0.63 for the MLR model but all other models registered a decrease (<i>R</i>\n<sup>2</sup> = 0.44 and 0.60 respectively). Applying the correction factor to a five-sensor network in Mombasa that was operated between July 2021 and July 2022 gave insights to the air quality in the city. The average daily concentrations of PM<sub>2.5</sub> within the city ranged from 12 to 18 μg m<sup>−3</sup>. The concentrations exceeded the WHO daily PM<sub>2.5</sub> limits more than 50% of the time, in particular at the sites nearby frequent industrial activity. Higher averages were observed during the dry and cold seasons and during early morning and evening periods of high activity. These results represent some of the first air quality monitoring measurements in Mombasa and highlight the need for more study.</p>","author":"M. N. Njeru, \nE. Mwangi, \nM. J. Gatari, \nM. I. Kaniu, \nJ. Kanyeria, \nG. Raheja, \nD. M. Westervelt","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"ea087b32fd5e238668621177978b7c2b1ca5b0d92d097ba43d29072159917680","category":"Environment"}