{"title":"Influence of Hydrological and Climatic Changes on Tree Growth in Narew National Park over the Past 50 Years","link":"https://www.preprints.org/manuscript/202408.0510/v1","date":1723033221000,"content":"Aim of the study was to determine the influence of climatic and hydrological changes on the growth of Scotch pine (Pinus sylvestris L.) and Black alder (Alnus glutinosa (L.) Gaertn) in the Narew National Park over past 50 years. The researches were based on tree increment cores extracted from 42 pine trees and 57 alder trees ranging in age from 25 to 88 years and climatic (temperature and precipitation for Bialystok) and hydrological (water level of the Narew River) data. Standardized data (5-year index) were analysed by species, generation (Y - 21-40 years, M - 41-60, O - 61-90) and decade using correlation analysis. The results of the study show that pine responded more strongly to changes in air temperature and changes in precipitation totals, while alder growth was more strongly related to fluctuations in the water level of the Narew River. The most variable climatic and hydrological conditions and the most difficult conditions for tree growth prevailed in the first and last decades (1971-1980, 2011-2020). The decrease in the water level of the Narew River that occurred over the last 50 years did not adversely affect the condition of the trees. Analysis of DBH growth rates showed that the younger generations (Y, M) grow faster than the older generation (O). One of the reasons for the accelerated tree growth and increased resistance to the decline in the water level of the Narew River may be the increase in CO2 concentration in the atmosphere. Accelerated tree growth and increased resistance to drought may have certain consequences like increased damage from wind as a result of the decrease in wood density or decline in the sensitivity of trees to climate and hydrological changes. However, less sensitivity to changes in climatic conditions may only apply to older trees.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ea0b339cc55f498bda6156444ae78e7e9f6542770eb6e71cd993b54fc574d82a","category":"Interdisciplinary"}