{"title":"Fabio Aru will retire after the Vuelta a España","link":"https://cyclingtips.com/2021/08/fabio-aru-will-retire-after-the-vuelta-a-espana/","date":1628780299000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/fabioaru-650x480.jpg\" /></div><h2>Fabio Aru will retire after the Vuelta a España</h2><p>\n</p><p>Six years after he won the 2015 Vuelta a España, Fabio Aru is set to retire following the 2021 edition of the race, Qhubeka-NextHash announced on Thursday.</p>\n\n\n\n<p>“Reaching this decision has not been easy but it is something that I’ve been thinking about and discussing with my family for some time,” Aru said via a press release from the team. “I’ve been racing my bike for 16 years and for more than a decade as a professional, but the time has come now to prioritize other things in my life, my family.”</p>\n\n\n\n<p>The 31-year-old Italian has decided to hang up the wheels after a challenging few years following an extremely promising early career as a pro. Aru joined Astana as a stagiaire in 2012 and then joined the squad full-time in 2013, and the very next year he rode to third overall at the Giro d’Italia and fifth at the Vuelta a España, also winning stages at both. The following season was the best of his career: He won two stages and took second overall at the Giro, and then claimed the overall win at the Vuelta a España.</p>\n\n\n\n<p>From that point on, however, Aru was unable to reach the heights many had expected for him after the strong start to his career. He rode to a stage win and fifth overall at the Tour de France in 2017, and then left Astana for UAE Team Emirates, but health issues derailed his next few seasons. In 2019, he had surgery to treat an iliac artery issue in his left leg.</p>\n\n\n\n<p>UAE Team Emirates senior adviser Giuseppe Saronni publicly criticized Aru during the 2020 Tour, and Aru left the team at the end of that season to sign a one-year deal with the squad now known as Qhubeka-NextHash. After a quiet start to the year, he has enjoyed success in his last two race starts, finishing second at both the Sibiu Cycling Tour and the Vuelta a Burgos in the run-up to the Vuelta a España.</p>\n\n\n\n<p>As it turns out, the upcoming race will be his last.</p>\n\n\n\n<p>“After a tough few years, in 2021 I was able to race my bike again and ride at a level that I knew I was capable of, while smiling on the bike,” Aru said. “That is a victory in itself, and something that I will forever be grateful for.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/fabio-aru-will-retire-after-the-vuelta-a-espana/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ea0c45d009808be92fe2e19b568de90220913bb7d4cef6c69e1ea9f9e92f8f76","category":"Cycling"}