{"title":"Cancerous Stem Cells and Meningioma Development","link":"https://www.preprints.org/manuscript/202410.0333/v1","date":1728040498000,"content":"BackgroundThe first histogenetic concepts favored dural origin of meningioma which was based on its dural attachment and thus meningiomais thought to arise from arachnoidal cap cells (meningiothelial) The    micro environment which contains cancerous stem cell, is called cellular environment which  is essential for tumor survival. Cancerous stem cell (CSC) is capable of initiating tumor growth and metastasis and  stem cell marker are known to used by scientists to isolate and identify certain stem cell.This study aims to describe the stem cell markers CD44, CD73 and CD 105 in meningioma among Sudanese patients and to isolate cancerous stem cells (CSCs) from meningioma tissues samples and test its in-vivo growth in Albino-Wister rats Material and methodsThis is a prospective cross-sectional experimental study done at the National Center of Neurological Sciences (NCNS) Khartoum, from 2019 to 2021. All established cranial meningioma patients were included. Tumor specimens were processed for RNA extraction and PCR. Tumor specimens were processed for RNA extraction and PCR. Twelve tissue samples were further processed for stem cells isolation and identificationTumor genesis of the isolated CSCs was tested through in-vivo application of the cells on brains of Albino Wister rats. The animals were sacrificed 3 months later and slices of the fixed brains were stained with H&amp;E and studied microscopically for histopathology verification of the growing cells and further confirmed by immune-histochemistry using epithelial membrane antigen and progesterone receptor as specific cell markers for meningioma.ResultsA total of 23  meningioma cases were enrolled in the study. All sample expressed CD44, but  CD73 and CD 105 expression was variable not on the different subtype, but within the same type .Successful isolation of cultured cells with cardinal features of mesenchymal stem cells was obtained. The implanted cells showed tumor growth consistent histologically and immune-histochemicaly with meningioma.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ea10389dd4a1ad8e524697e02c26bb2168f4517a9c22d951e878f5ef8851e781","category":"Interdisciplinary"}