{"title":"A Week of Sunshine Swim/Bike/Run/Hike in Mallorca","link":"https://www.dcrainmaker.com/2023/04/a-week-of-sunshine-swim-bike-run-hike-in-mallorca.html","date":1680638306000,"content":"<p>Last week was a busy one, packed with cycling, running, swimming, hiking, and all sorts of other things. I was down on the Spanish island of Mallorca, a short 2ish hour flight from home in Amsterdam, putting in the miles. Over the last decade-plus living in Europe, I’ve often used Mallorca as testing grounds for all sorts of gear. From action cams to drones, bike computers to power meters, GPS watches to other sensor types. It offers pretty much everything I need in a testing location, while doing so at usually a very cheap price.</p>\n<p>This time of year cyclists flock to the island by the thousands, for both casual riding as well as training camps (both cycling and triathlon). The hotel I usually stay at was packed full of cyclists and triathletes, and even has an onsite bike shop, outdoor lap pool, and more. It even has an all-you-can-eat buffet, though the food quality has notably declined post-COVID. But hey, after a 5-hour ride, most people aren’t noticing anyway I guess. More on that later, since so many people have asked about it.</p>\n<p>In any case, here’s what I was up to. I posted a bunch of stories on Instagram this past week, and many asked for a more detailed post. Thus…this post.</p>\n<h3><span>Monday:</span></h3>\n<p>We actually got in late Sunday night, so we stayed closer to the city for this one night. I say ‘we’, because it’d be both myself and my wife. We had a few meetings in the earlier portion of the week sprinkled about, plus she wanted to get in some sunnier weather training. The kids had their regular sitter for a few days, who happened to be on school break – which worked out perfect.</p>\n<p>For Monday morning, we both had long runs slated – roughly 2 hours or so. I was a wee bit nervous about this run. Not so much the duration, but the heat. Long-time readers know that I am not a hot-weather runner. And while the temps in Mallorca are not ‘hot’ by their normal definitions, they are ‘hot’ by Amsterdam’s definitions.</p>\n<p>We decided on an out-and-back course, to keep things simple – and ultimately just ran along the ocean.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0221.jpg\"><img title=\"IMG_0221\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0221_thumb.jpg\" alt=\"IMG_0221\" width=\"720\" height=\"480\" /></a></p>\n<p>It was a great morning. A bit of a breeze, which was somewhat thankfully a headwind, and then changed directions over the course of the run to also become a headwind on the way back. Normally I wouldn’t be a fan of this, but it kept my body temp at a pretty comfy level. There were also water fountains to fill up our water bottles along the way.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0211.jpg\"><img title=\"IMG_0211\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0211_thumb.jpg\" alt=\"IMG_0211\" width=\"720\" height=\"540\" /></a></p>\n<p>I turned around a bit after the 1-hour marker, and ultimately clocked in 25.5km/16mi in a touch over 2 hours at a nice easy heart rate. Here’s the <a href=\"https://www.strava.com/activities/8787353375\">route/file up on Strava</a>.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0254.jpg\"><img title=\"IMG_0254\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0254_thumb.jpg\" alt=\"IMG_0254\" width=\"720\" height=\"540\" /></a></p>\n<p>After the run we grabbed lunch, and then had some meetings in-town the rest of the day before making our way up to the other end of the island where we’d stay the remainder of the time.</p>\n<h3><span>Tuesday:</span></h3>\n<p>Tuesday morning was planned as a longer ride day, with both myself and The Girl riding together. We had initially planned on riding a large loop/climb up to Lluc, then back down to Alcúdia, before heading out/back on Cap de Formentor. However, that plan got dorked up two different ways. First, due to the big snowstorm a month ago, they had the road closed up to Lluc for tree damage cutting/removal. So that killed the main loop plan. And then, out on the cap, there was both tree damage removal and road works at the very end. A double whammy.</p>\n<p>So, we tweaked things as we went along. First were some nice quiet rolling roads – packed with just cyclists.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0307.jpg\"><img title=\"IMG_0307\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0307_thumb.jpg\" alt=\"IMG_0307\" width=\"720\" height=\"540\" /></a></p>\n<p>Then from there, it was onto the flatlands across toward Alcúdia. There are better ways to cross this section with less busy roads, but for a last-second detour, this was a popular route with cyclists. From there it was past the hotel’s front door along the beach towards the Cape.</p>\n<p>And then, up into Cap de Formentor. We weren’t really sure how far we’d be able to go. We knew about the construction at the very end likely blocking a bit, but we also knew that we’d be otherwise able to cycle out the majority of it (usually about a 2hr ride round-trip).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0341.jpg\"><img title=\"IMG_0341\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0341_thumb.jpg\" alt=\"IMG_0341\" width=\"355\" height=\"266\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0330.jpg\"><img title=\"IMG_0330\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0330_thumb.jpg\" alt=\"IMG_0330\" width=\"355\" height=\"266\" /></a></p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0336.jpg\"><img title=\"IMG_0336\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0336_thumb.jpg\" alt=\"IMG_0336\" width=\"720\" height=\"540\" /></a></p>\n<p>Sadly, tree trimming got in the way of that just after the beach turnoff (where the road now closes to cars). We could have waited out the tree trimming in what looked like 10-15 minute batches to get through, but then we’d only have ridden another 5-10 minutes before having to turn back around again and wait again. So we meandered back instead and added time/distance elsewhere.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0331.jpg\"><img title=\"IMG_0331\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0331_thumb.jpg\" alt=\"IMG_0331\" width=\"720\" height=\"480\" /></a></p>\n<p>All of these tree-trimming acts are done as of this past weekend on these routes, but if you’re headed there, you can look up <a href=\"http://www.conselldemallorca.info/sit/incidencies/mobile/index.html\">road maintenance on this site here</a>, which helps plan a little bit.</p>\n<p>Oh, and here’s our ride file on Strava. Well, <a href=\"https://www.strava.com/activities/8791302635\">my ride file anyway</a>.</p>\n<h3><span>Wednesday:</span></h3>\n<p>Wednesday morning we had meetings back in Palma, before I dropped off The Girl at the airport mid-afternoon. After which, by the time I got back, it was about 5PM and I wanted to get a ride in. So, I headed up the roads to Lluc that were closed the day before. In fact, they were closed this day too – but only till 4PM. After that, it was open season. And since most people didn’t pay attention to the exact closing times, it was awesomely desolate of cars (or even cyclists).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0383.jpg\"><img title=\"IMG_0383\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0383_thumb.jpg\" alt=\"IMG_0383\" width=\"720\" height=\"540\" /></a></p>\n<p>I headed up past Lluc, a climb that takes about an hour from the hotel, and then went a bit further till I figured I should get back before it was dark-dark. Plus, it was getting a bit chilly by that point.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0399.jpg\"><img title=\"IMG_0399\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0399_thumb.jpg\" alt=\"IMG_0399\" width=\"355\" height=\"266\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0393.jpg\"><img title=\"IMG_0393\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0393_thumb.jpg\" alt=\"IMG_0393\" width=\"355\" height=\"266\" /></a></p>\n<p>Because Cannondale hadn’t swung by yet to pick up their <a href=\"https://www.dcrainmaker.com/2023/02/cannondale-smartsense-synapse-1-rle.html/\">loaner Synapse bike</a> with the lights built into it, I figured I’d “test it” a tiny bit more. This is one of those scenarios/weeks that works exceptionally well for that bike. I did a number of sunset rides. And not having to worry about the sun/light is awesome. I just went out and rode, and knew I had lights if I needed it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0432.jpg\"><img title=\"IMG_0432\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0432_thumb.jpg\" alt=\"IMG_0432\" width=\"355\" height=\"266\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0423.jpg\"><img title=\"IMG_0423\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0423_thumb.jpg\" alt=\"IMG_0423\" width=\"355\" height=\"266\" /></a></p>\n<p>Overall <a href=\"https://www.strava.com/activities/8798880166\">this ride clocked in a bit over two and a half hours</a>.</p>\n<h3><span>Thursday:</span></h3>\n<p>As much fun as cycling Mallorca is, there are actually other things to do. Namely, hiking. And swimming. But for today, we’ll start with hiking. I did a loop around the peninsula near Alcúdia. It was mountainous at first, and then more tame for the second half.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0497.jpg\"><img title=\"IMG_0497\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0497_thumb.jpg\" alt=\"IMG_0497\" width=\"355\" height=\"266\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0502.jpg\"><img title=\"IMG_0502\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0502_thumb.jpg\" alt=\"IMG_0502\" width=\"355\" height=\"266\" /></a></p>\n<p>I was giving the newly released <a href=\"https://www.amazon.com/Amazfit-Freediving-Mud-Resistant-Water-Resistant-Military-Grade/dp/B0BV2SM914?keywords=amazfit+t-rex+ultra&amp;qid=1680637142&amp;sprefix=amazfit+t%2Caps%2C225&amp;sr=8-1-spons&amp;ufe=app_do%3Aamzn1.fos.c3015c4a-46bb-44b9-81a4-dc28e6d374b3&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyUVpHNVZXSDdBUkM4JmVuY3J5cHRlZElkPUEwODI5MjgxMzlPVjdTVFZMUlFQVCZlbmNyeXB0ZWRBZElkPUEwMzE2OTk3MkxIWkVBTVdZSk9ERiZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU%3D&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=47ca88b545ccdb1def9d1580159d26b4&amp;language=en_US&amp;ref_=as_li_ss_tl\">Amazfit T-Rex Ultra a whirl</a>, including with mapping and navigation. More in that review very shortly. It’s exceeding my expectations in some areas, but falling short in others.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0508.jpg\"><img title=\"IMG_0508\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0508_thumb.jpg\" alt=\"IMG_0508\" width=\"720\" height=\"540\" /></a></p>\n<p>After about an hour, the views were absolutely epic:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0541.jpg\"><img title=\"IMG_0541\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0541_thumb.jpg\" alt=\"IMG_0541\" width=\"720\" height=\"540\" /></a></p>\n<p>Albeit, it took a little bit to get up to this point to look down, I started this section down at the water.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0535.jpg\"><img title=\"IMG_0535\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0535_thumb.jpg\" alt=\"IMG_0535\" width=\"720\" height=\"540\" /></a></p>\n<p>After the views simmered down, I had hoped to eventually go to the end of the peninsula, but couldn’t quite make it that far. It was slated as about a 30km hike, but this shorted that. I had wondered why when I created the route on Strava, it kept failing to go beyond a certain point when the trails clearly showed going beyond that point. Turns out, this is that reason:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0570.jpg\"><img title=\"IMG_0570\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0570_thumb.jpg\" alt=\"IMG_0570\" width=\"720\" height=\"533\" /></a></p>\n<p>Sigh. Bummer. Looked stunning that way.</p>\n<p>Instead, I had lunch I brought with me on a cliff here:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0589.jpg\"><img title=\"IMG_0589\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0589_thumb.jpg\" alt=\"IMG_0589\" width=\"355\" height=\"473\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0592.jpg\"><img title=\"IMG_0592\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0592_thumb.jpg\" alt=\"IMG_0592\" width=\"355\" height=\"473\" /></a></p>\n<p>Also stunning, so, it worked out. Though, the beach that I had intended on going to would have been nice. Here’s my <a href=\"https://www.strava.com/activities/8803893491\">full route on Strava for that</a>, it lasted about 4-5 hours.</p>\n<p>Later that evening I decided to head back up that way for a ride. The col/climb is known as Victoria, and despite having been in that area countless times, I’ve somehow never done it before.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0654.jpg\"><img title=\"IMG_0654\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0654_thumb.jpg\" alt=\"IMG_0654\" width=\"355\" height=\"266\" /> </a><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0650.jpg\"><img title=\"IMG_0650\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0650_thumb.jpg\" alt=\"IMG_0650\" width=\"355\" height=\"266\" /></a></p>\n<p>After which I went and found a very short/steep section of road on a small dead-end farm road that included a 20% incline to test a few more things. Finally, my day was done. <a href=\"https://www.strava.com/activities/8803838373\">Strava link here</a>.</p>\n<h3><span>Friday:</span></h3>\n<p>For Friday morning, I dedicated that to trying to catch-up on e-mails, etc… But once that was set, it was off for a swim.</p>\n<p>I’ve previously just swam either across the street from the hotel (when I’m really lazy, it’s not pretty), or in Port de Pollença, a short little 5-minute pedal/drive from the hotel. However, this time I decided to drive about 10-15 minutes to go swimming. Merely cause it looked pretty on the satellite maps. Which, is basically how I figure out all my swims.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0725.jpg\"><img title=\"IMG_0725\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0725_thumb.jpg\" alt=\"IMG_0725\" width=\"720\" height=\"540\" /></a></p>\n<p>My plan was to just make a loop around the two bays. I had brought my wetsuit with me, as the water temp was only 60°F/15°C. This is actually the coldest time of year for the water in Mallorca, but it’ll quickly heat back up over the next 4-8 weeks. The water temp basically spikes in September, and then slowly cools all winter, to a low in late March.</p>\n<p>In any case, there were plenty of people in the water sans-wetsuits just splashing around. Thus, it was kinda hard to put on the wetsuit and head in. And honestly, after a strong 15 seconds of swearing, it was all good, and off I went.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/GPTempDownloadA.jpg\"><img title=\"GPTempDownloadA\" src=\"https://media.dcrainmaker.com/images/2023/04/GPTempDownloadA_thumb.jpg\" alt=\"GPTempDownloadA\" width=\"720\" height=\"405\" /></a></p>\n<p>The water visibility/clarity was great – with a surprising number of fish around. No sharks. No stingrays. And no gators. So, a win. There was a handful of small jellyfish I saw towards one corner of the swim, but they were all a bit lower than me, so I kept chugging. These were relatively small ones, so it wouldn’t have been the end of the world, more just annoying. I manage to get stung by jellies every few years – with the last time being last fall in Honolulu. Sigh.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/GPTempDownloadB.jpg\"><img title=\"GPTempDownloadB\" src=\"https://media.dcrainmaker.com/images/2023/04/GPTempDownloadB_thumb.jpg\" alt=\"GPTempDownloadB\" width=\"720\" height=\"405\" /></a></p>\n<p>In any case, my lazy swim wrapped up a bit over 2,000m. Here’s <a href=\"https://www.strava.com/activities/8807779095\">the Strava for that</a>. Also, the nifty picture:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/SatelliteSwimMap.png\"><img title=\"SatelliteSwimMap\" src=\"https://media.dcrainmaker.com/images/2023/04/SatelliteSwimMap_thumb.png\" alt=\"SatelliteSwimMap\" width=\"720\" height=\"340\" /></a></p>\n<p>Afterward, I went back to the hotel to get a sweat test done. This was mostly due to wanting to cross-validate some of the numbers I’m seeing on the Nix Hydration sensor (a review process that’s gone on FAAAR too long for something that simply doesn’t work – but hey, I guess I’m thorough).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0735.jpg\"><img title=\"IMG_0735\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0735_thumb.jpg\" alt=\"IMG_0735\" width=\"355\" height=\"266\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0739.jpg\"><img title=\"IMG_0739\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0739_thumb.jpg\" alt=\"IMG_0739\" width=\"355\" height=\"266\" /></a></p>\n<p>I’ll cover how the test works in that Nix review post. But this medical-grade/certified data only further cemented my position on Nix. The test was done by Precision Hydration, cost 120EUR, and also gave me a bunch of data for actual training/racing. The lady doing the test seemed moderately horrified at my current hydration/nutrition strategy for long training/racing (which, was basically one gel an hour and maybe half a bottle of water).</p>\n<p>With that set, I headed out for another sunset ride. This included some countryside rolling hills, eventually a climb up to a monastery, and then looping back around the flatlands. All in about 3 hours, coming in a wee bit more on the darker side of sunset. This shot earlier on at the start of the ride.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/GPTempDownload.jpg\"><img title=\"GPTempDownload\" src=\"https://media.dcrainmaker.com/images/2023/04/GPTempDownload_thumb.jpg\" alt=\"GPTempDownload\" width=\"720\" height=\"405\" /></a></p>\n<p>Here’s <a href=\"https://www.strava.com/activities/8809313182\">that Strava ride.</a></p>\n<h3><span>Saturday:</span></h3>\n<p>This was my last day on the island, and it’d be absolutely jam-packed. After haphazardly collecting all the crap strewn about my room and squishing it into plastic Jumbo and Albert Heijn grocery bags and suitcases, I checked out and drove about thirty minutes to the start of my first ride. This morning ride would be the famed Sa Calobra. But first, I’d have to climb for an hour to get there.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0867.jpg\"><img title=\"IMG_0867\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0867_thumb.jpg\" alt=\"IMG_0867\" width=\"720\" height=\"540\" /></a></p>\n<p>Here’s a photo from one of the various photo services taking photos that you can buy online later on for 7EUR, you’ll find these services along a number of popular cycling routes:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/CsB-0104323-695.jpg\"><img title=\"CsB-0104323-695\" src=\"https://media.dcrainmaker.com/images/2023/04/CsB-0104323-695_thumb.jpg\" alt=\"CsB-0104323-695\" width=\"720\" height=\"480\" /></a></p>\n<p>Then, once you reach the top, you actually descend down 10KM to a tiny seaside village at the end of a one-way road – surrounded by staggering cliffs. The road twists and turns, just as you’d expect from something etched into a landscape it wasn’t designed for.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraDescent.png\"><img title=\"SaCalobraDescent\" src=\"https://media.dcrainmaker.com/images/2023/04/SaCalobraDescent_thumb.png\" alt=\"SaCalobraDescent\" width=\"720\" height=\"509\" /></a></p>\n<p>The road includes favorites like this gap in the rocks, or these switchbacks:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0933.jpg\"><img title=\"IMG_0933\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0933_thumb.jpg\" alt=\"IMG_0933\" width=\"355\" height=\"473\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0911.jpg\"><img title=\"IMG_0911\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0911_thumb.jpg\" alt=\"IMG_0911\" width=\"355\" height=\"473\" /></a></p>\n<p>Once at the base, you can enjoy generally horrific tourist-trap food (trust me, I’ve tried in the past), but – beer seems totally viable. Albeit, that’s the rub: Now you’ve got yourself down there, you’ve gotta get yourself out. That’s the *actual* Sa Calobra climb. There’s only one way out, going up that road. I mean, I suppose you could hire a boat, but it’d be a heck of a boat ride as there’s nothing else nearby on that coastline.</p>\n<p>In any case, the actual climb really isn’t that bad. A touch under 10KM, and about 650m of elevation gain, it averages about 7% grade, with no meaningfully long steep/spicy sections. By epic European climb standards, it’s actually pretty tame.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0899.jpg\"><img title=\"IMG_0899\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0899_thumb.jpg\" alt=\"IMG_0899\" width=\"355\" height=\"266\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0893.jpg\"><img title=\"IMG_0893\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0893_thumb.jpg\" alt=\"IMG_0893\" width=\"355\" height=\"266\" /></a></p>\n<p>For today I kept it chill, and just enjoyed a nice easy cruise up, lasting about 50 minutes. This photo was taken a minute or two from the top:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/SCr-0104323-554.jpg\"><img title=\"SCr-0104323-554\" src=\"https://media.dcrainmaker.com/images/2023/04/SCr-0104323-554_thumb.jpg\" alt=\"SCr-0104323-554\" width=\"720\" height=\"480\" /></a></p>\n<p>Once that was set, you’ve got some descending followed by another short ascent before more descending back to town. All in, my ride was about 4 hours, inclusive of a bunch of photo/video time.</p>\n<p>Oh, and I stopped at two different “fresh orange juice” stands on the way back. The first, with a parking lot and plenty of people around, was questionable. The cup was brought out from the back, and the oranges were clearly not ripe – if freshly pressed at all. The second, a tiny hole in the wall – literally, a cutout in the cave on the side of a road, was amazing. The lady cut the oranges and pressed it, all right in front of me.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0954.jpg\"><img title=\"IMG_0954\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0954_thumb.jpg\" alt=\"IMG_0954\" width=\"355\" height=\"473\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0962.jpg\"><img title=\"IMG_0962\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0962_thumb.jpg\" alt=\"IMG_0962\" width=\"355\" height=\"473\" /></a></p>\n<p>With <a href=\"https://www.strava.com/activities/8812963713\">that ride complete</a>, I threw the bike in the car and drove towards the airport. Well, actually, past the airport – to the town of Andratx. From there, I pedaled up into the hills again, this time on a super quiet stretch of roadway. I ascended for about 30 minutes or so, before descending into a section of rolling roadway along the northern coastline.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Coastline.png\"><img title=\"Coastline\" src=\"https://media.dcrainmaker.com/images/2023/04/Coastline_thumb.png\" alt=\"Coastline\" width=\"720\" height=\"331\" /></a></p>\n<p>Then I got some drone shots. Which…ended poorly when the drone got stuck in a tree above the roadway while in Active Track. Technically it had paused in ActiveTrack, and then while trying to get out of the pickle, it went into the tree. Either way, I spent the next 30 minutes throwing stones at it to try and dislodge it (it was just barely caught). While I managed to get it on the second throw, it only moved to a different branch. The remaining 30 minutes were spent trying to re-enact that second throw.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/StuckDrone.png\"><img title=\"StuckDrone\" src=\"https://media.dcrainmaker.com/images/2023/04/StuckDrone_thumb.png\" alt=\"StuckDrone\" width=\"292\" height=\"521\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_1170.jpg\"><img title=\"IMG_1170\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_1170_thumb.jpg\" alt=\"IMG_1170\" width=\"416\" height=\"521\" /></a></p>\n<p>But fear not, persistence won out, and it fell down without any obvious external damage. Internally there appears to be a ribbon cable somewhere that’s dislodged, causing the GPS and a few other systems to report as not present (though everything else acts fine), but despite taking it apart, I can’t figure out which one isn’t happy. No worries, I paid for the premium warranty replacement service, so I might as well use it. Filled that out last night and it arrives tomorrow (so much better than the old days of DJI replacement services, which were a nightmare).</p>\n<p>With <a href=\"https://www.strava.com/activities/8814155281\">that ride finally done</a>, I packed my bike bag on the side of the road, then took a shower on the side of the road, and then bolted for the airport. Somewhere in there I also stuffed everything else floating around the rental car into either the bike bag or my carry-on roller bag. This was very non-optimized.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/BagPack.png\"><img title=\"BagPack\" src=\"https://media.dcrainmaker.com/images/2023/04/BagPack_thumb.png\" alt=\"BagPack\" width=\"720\" height=\"424\" /></a></p>\n<p>My plane had been showing as 2.5 hours delayed. So…umm…I used some of that time to ride. Then, on the way to the airport, it was showing as on-time. Obviously, I know better than to assume it’ll stay delayed. But frankly, this is the first time in a decade of European flights where the substantially delayed flight actually got back on-time (at an out-station no less). Go figure.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_1063.jpg\"><img title=\"IMG_1063\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_1063_thumb.jpg\" alt=\"IMG_1063\" width=\"718\" height=\"570\" /></a></p>\n<p>By the time I got home, it was near midnight – but a solidly successful week for sure!</p>\n<h3><span>Oh, that hotel:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0850.jpg\"><img title=\"IMG_0850\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0850_thumb.jpg\" alt=\"IMG_0850\" width=\"720\" height=\"479\" /></a></p>\n<p>A lot of people have asked on Instagram about the hotel I stayed at, as it “looks Amazing”, and yes, it largely is. I’ve been staying there a number of years, all the way back to <a href=\"https://www.dcrainmaker.com/2017/03/wahoo-elemnt-bolt-in-depth-review.html\">2017 when Wahoo held their</a> media launch event for the first Wahoo BOLT computer there. Since then, it’s become my go-to place to stay. For the most part, I only tend to go to Mallorca in the fall (Sept-December, mostly Oct/Nov), and then again in the spring (Feb-March). I don’t usually go during the summer, merely because the weather is quite nice elsewhere in Europe by then.</p>\n<p>Anyways, the name is PortBlue Club Pollentia Resort &amp; Spa, and it is located near Port de Pollença on the eastern end of the island. As I learned this past December, they close from December till February due to lack of customers. The resort is a sprawling ground full of smaller two-story buildings with perhaps a dozen units per building, and I’d imagine dozens of buildings. The entire resort length approaches nearly 1KM long, and is across from the ‘beach’. I put ‘beach’ in quotations because it’s not a beach you’ll go into. This particular spot lacks sand, though you can go just 2KM up the road in front of Port de Pollença for nice sandy beaches. However, people do kite/windsurf here, and I have done openwater swims here (but again, they’re better to do elsewhere).</p>\n<p>Here you can see the outdoor lap pool – they also have an indoor one too – packed with triathlon teams doing training camps.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0747.jpg\"><img title=\"IMG_0747\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0747_thumb.jpg\" alt=\"IMG_0747\" width=\"720\" height=\"479\" /></a></p>\n<p>The main pros of this hotel:</p>\n<p>A) Huge rooms, with equally huge covered balconies where you can leave your bikes/bike bags outside, as well as drying racks for your cycling gear<br />\nB) The grounds are really nice, backs up against some sort of reserve, and water across the street<br />\nC) Directly on one of the busiest cycling thoroughfares<br />\nD) Quick access to some of the main/big cycling routes/destinations<br />\nE) A 25m multi-lane lap swimming pool outdoors (heated)<br />\nF) A bike shop/rental place onsite, as well as a secondary bike maintenance area<br />\nG) It’s really cheap, especially for all-inclusive food</p>\n<p>There’s plenty of other benefits and things like a spa and whatever else I’ve never used. Same goes for the onsite windsurfing stuff/etc – looks cool, but never used it.</p>\n<p>The main cons of this hotel:</p>\n<p>A) Front desk staff are friendly, but not so much restaurant/room staff<br />\nB) The food has notably declined post-COVID<br />\nC) The food is basically the same at all the restaurants, which are buffet only<br />\nD) The road it’s on is busy with not just bikes, but also cars/trucks<br />\nE) No sandy beach across the street</p>\n<p>Like the pros, I’m sure there are other cons, but the main one to me is the food. Basically, they have two buffet restaurants that offer breakfast/lunch/dinner, plus one pool-side place you can order à la carte lunch items (mostly pasta/burgers/pizza). As one who is a foodie, someone who has spent thousands of nights in hotel rooms over the years (including my previous job), and one who has come to this place for years, the food is my main sticking point. Keeping in mind, most people pay the extra 10-15EUR a day to have all the food included.</p>\n<p>Previously, the buffet food was mostly ‘just fine’. Nothing special, nothing to write home above, but good enough to do the trick. That’s especially notable for me, where most of the time I’m there I’m slammed with work and tight schedules. So sitting down for a multi-hour meal just isn’t in the cards. In this case, it’s mostly just calories-in. And, there are usually plenty of fruit/veg options to keep it mostly healthy. Plus a good bread selection. Drinks are extra – including water.</p>\n<p>And all that’s true today, except post-COVID the quality of the food is basically approaching school cafeteria levels on some meals. This is fine if that’s your expectation, but it’s just something to keep in mind. The good news is going to town is just a couple minute pedal or drive away, and there’s plenty of good (and reasonably priced) restaurants there. Plus, if you do the half-board option, you get breakfast plus a second meal of your choice – either lunch or dinner (which is the meal-plan option I choose). So you could do lunch at the hotel after a ride, and dinner in town, or vice-versa – changing it on a daily basis as you see fit.</p>\n<p>Speaking of which, we ran into some of our friends there, and did dinner nearby at BISTRO in the Son Brull Hotel &amp; Spa. It was awesome.</p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/IMG_0879.jpg\"><img title=\"IMG_0879\" src=\"https://media.dcrainmaker.com/images/2023/04/IMG_0879_thumb.jpg\" alt=\"IMG_0879\" width=\"720\" height=\"540\" /></a></p>\n<p>Ok, I didn’t set out for this post to be so long. My bad. In any case, as is usually the case around these parts, quiet weeks on the site are usually followed by crazy busy weeks on the site. The usual ebb and flow of managing the time to actually test the things I write about, rather than just writing or publishing reviews after a single use of a device.</p>\n<p>So while the days are exhausting, my goal is to cover as much ground and edge cases as possible – especially in either new features, or areas where past devices have been problematic.</p>\n<p>However, devices and data aside, Mallorca continues to be a stunning place to ride/swim/bike/hike. Sure, there’s a crazy amount of touristy things that occur closer to the city, but thankfully with a sports focus on my trips there, I’m able to completely avoid all that and just enjoy the outdoor aspects.</p>\n<p>Feel free to drop any travel/logistics-type questions below, and I’ll do my best to answer (though, I’m sure many locals can also answer too). Speaking of which, thanks to everyone that said Hi, or sent over suggestions for things to check out on Instagram.</p>\n<p>Thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"ea12d1b86848301d80d7eff5cf0faf1782484db295635ed152b02644de58ac36","category":"Cycling"}