{"title":"Preanalytical considerations for clinical assays of circulating human miRNA-451a, miRNA-423-5p and miRNA-199a-3p for diagnostic purposes","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303598","date":1716213600000,"content":"<p>by Dinesh S. Chandel, Wesley A. Tom, Chao Jiang, Gary Krzyzanowski, Nirmalee Fernando, Appolinaire Olou, M. Rohan Fernando</p>\r\n\r\nCirculating miRNA has recently emerged as important biomolecules with potential clinical values as diagnostic markers for several diseases. However, to be used as such, it is critical to accurately quantify miRNAs in the clinic. Yet, preanalytical factors that can affect an error-free quantification of these miRNAs have not been explored. This study aimed at investigating several of these preanalytical factors that may affect the accurate quantification of miRNA-451a, miRNA-423-5p and miRNA-199a-3p in human blood samples. We initially evaluated levels of these three miRNAs in red blood cells (RBCs), white blood cells (WBCs), platelets, and plasma by droplet digital PCR (ddPCR). Next, we monitored miRNA levels in whole blood or platelet rich plasma (PRP) stored at different temperatures for different time periods by ddPCR. We also investigated the effects of hemolysis on miRNA concentrations in platelet-free plasma (PFP). Our results demonstrate that more than 97% of miRNA-451a and miRNA-423-5p in the blood are localized in RBCs, with only trace amounts present in WBCs, platelets, and plasma. Highest amount of the miRNA-199a-3p is present in platelets. Hemolysis had a significant impact on both miRNA-451a and miRNA-423-5p concentrations in plasma, however miRNA-199a levels remain unaffected. Importantly, PRP stored at room temperature (RT) or 4°C showed a statistically significant decrease in miRNA-451a levels, while the other two miRNAs were increased, at days 1, 2, 3 and 7. PFP at RT caused statistically significant steady decline in miRNA-451a and miRNA-423-5p, observed at 12, 24, 36, 48 and 72 hours. Levels of the miRNA-199a-3p in PFP was stable during first 72 hours at RT. PFP stored at -20°C for 7 days showed declining stability of miRNA-451a over time. However, at -80°C miRNA-451a levels were stable up to 7 days. Together, our data indicate that hemolysis and blood storage at RT, 4°C and -20°C may have significant negative effects on the accuracy of circulating miRNA-451a and miRNA-423-5p quantification.","author":"Dinesh S. Chandel","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ea1b29ba5b7134e11490f2a2433d5b96d183ad5cf1a25ea1ecb277bd3028a45e","category":"Interdisciplinary"}