{"title":"Six Tour de France debutants to look out for","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-top-tour-de-france-debutants","date":1624301131000,"content":"\n      <p>In professional cycling, no stage is bigger than the Tour de France. For those making their debut at the Tour, it is a chance to shine like no other. We look at some of the Tour de France debutants you should be keeping an eye on over the next three weeks.</p>\n<div></div>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Related – Tour de France 2021 Guide</a></strong></em></p>\n<h4><strong>Mathieu van der Poel</strong></h4>\n<p><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Van_der_poel_4971d33a-3671-4f0f-8153-15493aa2fee1_1024x1024.jpg?v=1624298061\" /></em></p>\n<p><em>Image credit: Alex Broadway/SWpix.com</em></p>\n<p>Where else can we start? At the age of 26, Mathieu van der Poel will participate in the first Grand Tour of his career at the 2021 Tour de France. Van der Poel has enjoyed a successful 2021 campaign so far which is highlighted by a stunning victory at Strade Bianche. He has demonstrated supreme form more recently too, winning two stages at the Tour de Suisse.</p>\n<p>Van der Poel will not stand out as usual in the Dutch national champions jersey, he recently lost that to Timo Roosen of Jumbo-Visma who won’t be participating at the Tour de France.</p>\n<p>Van der Poel could have a range of targets for the Tour de France. He has the skills to chase the green jersey, but he will probably lead-out his teammates Jasper Philipsen and Tim Merlier on the flattest stages, making green less realistic. The first couple of stages suit the punchers, providing a great opportunity for Van der Poel to wear the yellow jersey on his Tour de France debut.</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/under-the-radar-riders-to-watch-at-the-tour-de-france\">Under the Radar: Riders to watch at the Tour</a></em></strong></p>\n<h4><strong>Stefan Bissegger</strong></h4>\n<p><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1322696680_1024x1024.jpg?v=1624300132\" /></em></p>\n<p><em>Image credit: Tim de Waele/Getty Images</em></p>\n<p>Stefan Bissegger is one of the breakout riders of 2021 so far. The 22-year-old has only been a WorldTour rider for a year but is already proving himself as one of the best time-trialists in the world. Bissegger has started six time-trials in 2021 and been in the top five on five occasions. He won the 14-kilometre race against the clock at Paris-Nice ahead of Remi Cavagna and Primoz Roglic — not bad company at all.</p>\n<div></div>\n<p>Bissegger is far more than just a time-trialist though. This was on full display at the Tour de Suisse earlier this month, where Bissegger won stage four from the breakaway ahead of Benjamin Thomas and Joey Rosskopf, who both have become national champions in the past week. Bissegger demonstrated climbing skills on his way to Gstaad, before unleashing a powerful sprint which Thomas and Rosskopf couldn’t match. </p>\n<p>Look out for Bissegger throughout, and not just on the stage 5 and 20 time trials, as his stock continues to sky-rocket.</p>\n<h4><strong>Ide Schelling</strong></h4>\n<p><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1313123854_1024x1024.jpg?v=1624300216\" /></em></p>\n<p><em>Ide Schelling attacks at the Amstel Gold Race (Image credit: Bas Czerwinski/Getty Images)</em></p>\n<p>Ide Schelling has one Grand Tour under his belt — the 2020 Vuelta España — but will depart from Brest as a Tour de France rookie.</p>\n<p>Despite that, like Bissegger, the 23-year-old is another rising quickly to prominence. Schelling has been a key member of Bora - Hansgrohe’s classics team this season, which culminated in a fine fourth place at Brabantse Pijl. Schelling bridged to the front of the race at a moment where such a feat seemed impossible, and although he missed the winning move, it was a supreme performance from Schelling. He is a strong sprinter which helped him win the Grosser Preis des Kantons Aargau, a 1.1 category race in Switzerland, sprinting ahead of Rui Costa and Esteban Chaves. Schelling is also a capable time-trialist, he has recorded numerous top-10s already in 2021 on the time-trial bike.</p>\n<p>Schelling is a versatile rider who is improving with every race he starts. He will be a key ally for both Peter Sagan and Wilco Kelderman, but could be given his own opportunities in the breakaway.</p>\n<h4><strong>Tao Geoghegan Hart</strong></h4>\n<p><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Tao-newsletter_1024x1024.jpg?v=1624299869\" /></em></p>\n<p><em>Image credit: William Cannarella/Cor Vos/SWPix</em></p>\n<p>There is not much explanation required here. Tao Geoghegan Hart enters his first Tour de France as a Grand Tour winner. The Brit wasn’t the favourite ahead of the Giro d’Italia last year, but was the strongest in the third week which catapulted the Brit into pink.</p>\n<p>Again, Geoghegan Hart enters the Tour de France without being branded as the Ineos leader. In fact, Richard Carapaz, Geraint Thomas and Richie Porte could all feasibly be considered ahead of Tao in the Ineos pecking order. Tao’s 2021 form has been largely unspectacular. He came close to winning a stage at the Criterium du Dauphine but was pipped to the line by Alejandro Valverde. </p>\n<p>However, if we have learnt one thing from the 2020 Giro, never count out Tao Geoghegan Hart. </p>\n<h4><strong>Tim Merlier</strong></h4>\n<p><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Italy_Photo_Press_1030063_1024x1024_cbf23c26-8ece-4a2e-b595-000156e35bf0_1024x1024.jpg?v=1624281775\" />Image credit: Getty Images</em></p>\n<p>Tim Merlier had never started a Grand Tour at the turn of the year. However, the Belgian sprinter entered the Giro d’Italia in May and didn’t hesitate to make an impression either, winning the first sprint stage of the race in emphatic style.</p>\n<p>Now, Merlier enters the Tour de France with Jasper Philipsen and Mathieu van der Poel, two riders who are both capable of winning mass sprints. This does put Merlier’s position as Alpecin’s lead sprinter in jeopardy, though we can look to the Elfstedenronde for guidance. Here, it was Philipsen who led out Merlier, which indicates that Merlier could be their first option in France.</p>\n<p>He will be up against the likes of Arnaud Demare, Caleb Ewan and Mark Cavendish who returns to the Tour de France after a three-year absence. However, don’t let Merlier’s relative inexperience at Grand Tours put you off. With a strong lead-out train, Merlier will be among the very top favourites on the pure sprint stages.</p>\n<h4><strong>Brent Van Moer</strong></h4>\n<p><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1320804890_1024x1024.jpg?v=1624299741\" /></em></p>\n<p><em>Image credit: Bas Czerwinski/Getty Images</em></p>\n<p>Brent Van Moer could be the new Thomas de Gendt. Don’t take our word for it?</p>\n<blockquote>\n<p>You heard it here first. <a href=\"https://twitter.com/Brentvanmoer?ref_src=twsrc%5Etfw\">@Brentvanmoer</a> is the new Thomas De Gendt.</p>\n— Thomas De Gendt (@DeGendtThomas) <a href=\"https://twitter.com/DeGendtThomas/status/1399017831002411010?ref_src=twsrc%5Etfw\">May 30, 2021</a>\n</blockquote>\n\n<p> </p>\n<p><span>Van Moer is quickly gaining a reputation as a breakaway specialist. That theory increased further when Van Moer won stage one of the Criterium du Dauphine. Van Moer had been a part of the early breakaway and left his remaining comrades with 16km left and with a 90 second advantage over the peloton. Van Moer held on for his first professional win, only to be dubbed the new Thomas de Gendt by Thomas de Gendt himself.</span></p>\n<p>Van Moer makes up part of a Lotto Soudal team led by Caleb Ewan, whose quest in 2021 is to win a stage at each of the three Grand Tours. Van Moer can play a role in the early phases of Ewan’s leadout, but with no GC leader in their ranks, Van Moer and co will be given the freedom to attack early and often. However, after his victory at the Dauphine, he’ll be marked a little more closely by the peloton.</p>\n<p><em>Cover image: Tim de Waele/Getty Images</em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"ea2c4f4eee37aa9a2057a596ed8607e3fbf19b3b2e67fc99036c2c90cb4325f7","category":"Cycling"}