{"title":"Characteristics of Cu-Au-Bearing Quartz Veins at Danyore Valley Area, Kohistan Terrane, Northern Pakistan: Evidence from Geological, Geochemical, and Geochronological Studies","link":"https://www.preprints.org/manuscript/202405.0851/v1","date":1715594924000,"content":"Danyore Valley area is a new prospect of copper-gold mineralization in the Gilgit-Baltistan province, Kohistan terrane, northern Pakistan. The mineralization is Cu-Au vein-type, localized within quartz veins and controlled by a fracture system mainly trending NW and NE. The host units belong to the Ladakh-Kohistan arc terrane, which covers northern Pakistan and north-western India and mainly comprises Precambrian basement units, Paleozoic to Cenozoic magmatic rocks, and sedimentary strata. The mineralized wall rocks consist of Mesozoic gabbro and diorite, which have undergone an intensive hydrothermal alteration. The study area, Danyore Valley, has yet to be explored. The geological background and mineralization type in literature are scarce. Moreover, the tectonic setting, petrogenesis, age, and magmatic evolution of the gabbro-diorite hosting unit still need to be better understood. Furthermore, the sources of metals and mineralized fluids and the types of mineralization and alteration are also unexplored. This research's contribution presents the field investigation, microscopic observations, whole rock geochemistry (major, trace, and REE), mineral analysis (EPMA), in situ LA–ICP–MS zircon U–Pb age dating, and zircon trace elements data for Danyore Valley Cu-Au prospect of Kohistan Batholith. The current research work's objectives are to (a) constrain the emplacement ages of the Danyore Valley host rocks, (b) determine the petrogenesis and tectonic environment of the gabbro-diorite wall rocks, and (c) identify the mineralization style and alteration patterns of Cu-Au occurrences. The U-Pb isotopic data of studied zircons from Danyore Valley diorite specimens yielded concordia ages from 111.60 ± 0.90 Ma to 112.18 ± 0.74 Ma. Correspondingly, the gabbro rock sample displayed a concordia age of 110.21 ± 0.99 Ma, indicating the crystallization time of the host bodies is mainly the early cretaceous period (∼110 Ma). The findings of this study reveal that the calc-alkaline affinity and arc-like geochemical characteristics of the gabbro and diorite rocks have been characterized by a significant enrichment in large-ion lithophile elements and an apparent depletion in high-field strength elements. The parent magma probably originated from a partial melting process of mantle depletion, and geochemical traits are characteristic of magmas associated with subduction zones. The Danyore Valley area of Kohistan terrane is defined by the existence of several mineralized quartz veins, which are mainly sulfide assemblages. The sulfide ore is mainly comprised of chalcopyrite, pyrite, and bornite, with a smaller amount of covellite and sphalerite and significant traces of gold, which are distributed mainly in sulfides. Copper and gold mineralization of Danyore Valley is associated with phyllic, propylitic, and carbonatization alteration assemblages. Metal-rich quartz veins exhibit a spatial correlation with diorite and gabbro rocks. The discovery of several surface Cu-Au vein-type mineralized areas accompanying outcrops of copper supergene enrichment at the Danyore Valley prospect is significant evidence (predictor patterns) of porphyry-style deposits in the Gilgit district, Kohistan terrane, northern Pakistan. This work also advocates the importance of the Danyore Valley prospect and Kohistan Batholith region for further detailed geological studies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ea3393aac2dd092631b63f0449957e150e55f6b7b4b1f9a197b6998cb0a88841","category":"Interdisciplinary"}