{"title":"สุดท้ายก็ยอม ซีอีโอ SIE ระบุ PlayStation สนับสนุน cross-play เตรียมเพิ่มเกมที่เล่นได้ในอนาคต","link":"https://www.blognone.com/node/123326","date":1624342109000,"content":"<div><div><div><p>Jim Ryan ซีอีโอของ Sony Interactive Entertainment ให้สัมภาษณ์กับเว็บไซต์ <a href=\"https://www.axios.com/playstations-fortnite-minecraft-sony-22acafe7-86c7-4a37-b6cd-b1789fd40c46.html\">Axios</a> ระบุว่า Sony สนับสนุนให้เกมแบบผู้เล่นหลายคนบนแพลตฟอร์ม PlayStation รองรับการเล่นแบบ cross-play ได้มากขึ้นในอนาคต พร้อมกับบอกว่าการเปิด cross-play ที่ผ่านมา เช่นในเกม Fortnite, Call of Duty, Rocket League, Minecraft ส่งผลดีต่อแพลตฟอร์มของบริษัท</p>\n<p>ส่วนประเด็นที่ข้อมูลจากศาลในคดี Epic Vs. Apple เปิดเผยว่า Sony <a href=\"https://www.blognone.com/node/122495\">เคยเป็นอุปสรรคใหญ่ต่อการพยายามเปิด cross-play ของเกม Fortnite</a> โดยมีการเรียกเก็บเงินส่วนแบ่งเพิ่ม หาก Epic Games ต้องการให้เปิดฟีเจอร์นี้</p>\n<p>เรื่องนี้ Jim Ryan บอกว่าเขาไม่อยากออกความเห็นเรื่องปัญหาการทำธุรกิจ live service อย่างเช่นการให้บริการเกม Fortnite กับพาร์ทเนอร์ที่ทำงานร่วมกันมานาน แต่ก็ระบุว่านโยบายของ Sony นั้น ถูกบังคับใช้อย่างเท่าเทียมกันทุกบริษัท</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1d7603f72b1ca5a57681592779fd5af7.jpg\" /></p>\n<p>Sony เป็นเจ้าท้ายๆ ที่เปิดให้เล่นเกมออนไลน์แบบ cross-play โดยเปิดให้เล่น <a href=\"https://www.vg247.com/2018/09/26/ps4-xbox-one-cross-play-fortnite/\">Fortnite ได้เป็นเกมแรกในเดือนกันยายนปี 2018</a> แต่ก็ยังมีข้อจำกัดด้านการโอนย้ายข้อมูลในบัญชี เช่นของตกแต่งหรือเลเวลของผู้เล่นแบบข้ามแพลตฟอร์มอยู่ ทำให้ผู้เล่นเหมือนต้องเริ่มเล่นใหม่ หากต้องการย้ายมาเล่นบน PlayStation</p>\n<p>ถือเป็นเรื่องดีของเกมเมอร์ที่ได้เห็นซีอีโอของ SIE อย่าง Jim Ryan ออกมาพูดเรื่องการสนับสนุนการเล่นข้ามแพลตฟอร์มของ PlayStation มากขึ้น และอาจทำให้ความหวังที่ข้อจำกัดด้านอื่นๆ ของการโอนย้ายบัญชี หรือการเซฟเกมข้ามแพลตฟอร์มจะหายไปในอนาคต ดูเป็นไปได้มากขึ้น</p>\n<p>ที่มา - <a href=\"https://www.axios.com/playstations-fortnite-minecraft-sony-22acafe7-86c7-4a37-b6cd-b1789fd40c46.html\">Axios</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/playstation\">PlayStation</a></div><div><a href=\"/topics/sony\">Sony</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ea3532317ff04f36f48543e2b3da0de3d24676a25b2626d08ac13634106710cd","category":"Thai"}