{"title":"Genome-wide RNA sequencing of ocular fibroblasts from glaucomatous and normal eyes: Implications for glaucoma management","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307227","date":1720706400000,"content":"<p>by Anton W. Roodnat, Breedge Callaghan, Chelsey Doyle, Neeru A. Vallabh, Sarah D. Atkinson, Colin E. Willoughby</p>\r\n\r\nPrimary open angle glaucoma is a leading cause of visual impairment and blindness which is commonly treated with drugs or laser but may require surgery. Tenon’s ocular fibroblasts are involved in wound-healing after glaucoma filtration surgery and may compromise a favourable outcome of glaucoma surgery by contributing to fibrosis. To investigate changes in gene expression and key pathways contributing to the glaucomatous state we performed genome-wide RNA sequencing. Human Tenon’s ocular fibroblasts were cultured from normal and glaucomatous human donors undergoing eye surgery (n = 12). mRNA was extracted and RNA-Seq performed on the Illumina platform. Differentially expressed genes were identified using a bioinformatics pipeline consisting of FastQC, STAR, FeatureCounts and edgeR. Changes in biological functions and pathways were determined using Enrichr and clustered using Cytoscape. A total of 5817 genes were differentially expressed between Tenon’s ocular fibroblasts from normal versus glaucomatous eyes. Enrichment analysis showed 787 significantly different biological functions and pathways which were clustered into 176 clusters. Tenon’s ocular fibroblasts from glaucomatous eyes showed signs of fibrosis with fibroblast to myofibroblast transdifferentiation and associated changes in mitochondrial fission, remodeling of the extracellular matrix, proliferation, unfolded protein response, inflammation and apoptosis which may relate to the pathogenesis of glaucoma or the detrimental effects of topical glaucoma therapies. Altered gene expression in glaucomatous Tenon’s ocular fibroblasts may contribute to an unfavourable outcome of glaucoma filtration surgery. This work presents a genome-wide transcriptome of glaucomatous versus normal Tenon’s ocular fibroblasts which may identify genes or pathways of therapeutic value to improve surgical outcomes.","author":"Anton W. Roodnat","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ea36ec137fdfc52e91332a1514829a6872c438f653d5c236edbb48d699e6955c","category":"Interdisciplinary"}