{"title":"Here’s what happens if you simulate the 2021 Tour de France 100 times","link":"https://cyclingtips.com/2021/07/heres-what-happens-if-you-simulate-the-2021-tour-de-france-100-times/","date":1625639277000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/Screen-Shot-2021-07-07-at-3.26.49-pm-650x406.jpg\" /></div><h2>Here's what happens if you simulate the 2021 Tour de France 100 times</h2><p>\n</p><p>Predicting the outcome of bike races is a fraught business. It’s something we do regularly here at CyclingTips when we write our <a href=\"https://cyclingtips.com/2021/06/heres-whats-going-to-happen-we-think-at-the-tour-de-france/\" target=\"_blank\">race previews</a> and while we’re sometimes on the money, we usually aren’t. Bike racing is just too complex, with too many confounding variables, to predict anything with any real certainty.</p>\n\n\n\n<p>But what if there was another way to predict how a bike race might unfold? What if we could run a simulation to do that job for us? And if we could do that, what would that simulation tell us about how the 2021 <a href=\"https://cyclingtips.com/tag/tour-de-france\" target=\"_blank\">Tour de France</a> was going to unfold?</p>\n\n\n\n<p>Well, wonder no more.</p>\n\n\n\n<h2>Simulating the Tour de France</h2>\n\n\n\n<p>Pro Cycling Manager (PCM) is a videogame series that puts you in the shoes of a team manager. Over the course of a racing season (or multiple seasons) you pick your riders for each race then take control of those riders as they tackle each event on the calendar. (If you’re keen to learn more about the PCM franchise, follow the links for our reviews of the <a href=\"https://cyclingtips.com/2013/08/pro-cycling-manager-2013-review/\" target=\"_blank\">2013</a>, <a href=\"https://cyclingtips.com/2014/10/pro-cycling-manager-2014-review/\" target=\"_blank\">2014</a>, <a href=\"https://cyclingtips.com/2018/10/pro-cycling-manager-2018-review/\" target=\"_blank\">2018</a> and <a href=\"https://cyclingtips.com/2020/07/pro-cycling-manager-2020-videogame-review/\" target=\"_blank\">2020</a> editions.)</p>\n\n\n\n<p>PCM can also be used to simulate races. That is, for any given race, you have a choice: play out that race by controlling your riders, or let the game simulate what would happen, taking into accounts the strengths of each rider, the race situation, and the terrain.</p>\n\n\n\n<p>Which brings us to what Reddit user “ser-seaworth” put together over the past week or so. In <a href=\"https://www.reddit.com/r/peloton/comments/oe3scl/one_hundred_simulations_of_the_tour_de_france_can/\" target=\"_blank\">a post in the Peloton subreddit</a> – a Reddit community focused on the pro racing scene – ser-seaworth explained the project as follows:</p>\n\n\n\n<p>“Inspired by every single rider who makes the early break on a flat stage, I decided to embark on a futile journey of my own: to simulate the entire Tour de France 100 times.”</p>\n\n\n\n<p>Ser-seaworth took last season’s version of PCM and added a community-created mod – “<a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=2333242215\" target=\"_blank\">WorldDB 2021</a>” – to update the game’s database to reflect the 2021 racing season. Then, over the course of a week, they simulated the Tour 100 times over, using the same course and startlist as the real thing. That’s 2,100 simulated stages, many, many hours of waiting for various loading screens, and plenty of time spent cataloguing all the results the game generated.</p>\n\n\n\n<p>Let’s dive into some of the more interesting results.</p>\n\n\n\n<figure><img /><figcaption>Each rider in PCM is given a rating out of 100 for a total of 13 different skills. In the case of the WorldDB 2021 mod, these stats are determined by members of the PCM community who helped create the mod.</figcaption></figure>\n\n\n\n<h2>The race overall</h2>\n\n\n\n<p>Over the course of 100 simulations, nine different riders took at least one overall victory:</p>\n\n\n\n<ul><li><strong>Tadej Pogačar:</strong> 58 wins</li><li><strong>Primož Roglič:</strong> 24 wins</li><li><strong>Richard Carapaz:</strong> 4 wins</li><li><strong>Richie Porte: </strong>4 wins</li><li><strong>Enric Mas:</strong> 3 wins</li><li><strong>Geraint Thomas:</strong> 3 wins</li><li><strong>Pello Bilbao:</strong> 2 wins</li><li><strong>Miguel Ángel López</strong>: 1 win</li><li><strong>Simon Yates:</strong> 1 win</li></ul>\n\n\n\n<p>You’ll note that only 18 of the 100 Tours weren’t won by Pogačar or Roglič. Of those 18, 11 were won by an Ineos rider. </p>\n\n\n\n<p>Based on how the real-life Tour is unfolding, Pogačar’s dominance in these simulations doesn’t feel too far removed from reality.</p>\n\n\n\n<h2>The podium</h2>\n\n\n\n<p>In the 18 Tours that Pogačar or Roglič didn’t win, they were very likely to finish on the podium. In fact, Pogačar was in the top three in 87 of the 95 simulated Tours he finished, and Roglič was on the podium 78 times.</p>\n\n\n\n<p>Others with a high number of podium finishes were:</p>\n\n\n\n<ul><li><strong>Richie Porte: </strong>36 times</li><li><strong>Richard Carapaz:</strong> 24 times</li><li><strong>Geraint Thomas:</strong> 15 times</li><li><strong>Enric Mas: </strong>11 times</li></ul>\n\n\n\n<p>As ser-seaworth noted, this simulation seems to answer the question that was on many people’s lips pre-Tour: who should lead Ineos Grenadiers? “Now the Ineos picking order becomes apparent: Richie Porte, Richard Carapaz, and Geraint Thomas, in that order,” they wrote. “His 19 second-place finishes are where Porte makes the difference, making him the most reliable Ineos leader in this simulation.”</p>\n\n\n\n<p>As we know, the real-life 2021 Tour hasn’t quite gone as planned for Porte (or indeed for Thomas). Carapaz seems a good bet for the overall podium though.</p>\n\n\n\n<h2>The Average Tour</h2>\n\n\n\n<p>If we average out the results from all 100 of ser-seaworth’s simulations, we get what they call “The Average Tour”. By removing the variance that affects any individual simulation, this gives us something approaching the “correct” result for a simulated 2021 Tour, based on the stats of every rider in the race. </p>\n\n\n\n<p>Taking into account how often each rider finished in each position across 100 simulations, here’s the top 10 in The Average Tour:</p>\n\n\n\n<p>1. Tadej Pogačar<br />2. Primož Roglič<br />3. Richie Porte<br />4. Richard Carapaz<br />5. Enric Mas/Simon Yates<br />6. Wout Poels/Enric Mas<br />7. Geraint Thomas<br />8. Miguel Ángel López<br />9. Bauke Mollema/Simon Yates<br />10. Rigoberto Uran</p>\n\n\n\n<p>Here are the riders that aren’t listed above, but that sit within the top 10 overall in the real Tour (after 10 stages):</p>\n\n\n\n<ul><li>Ben O’Connor (second)</li><li>Jonas Vingegaard (fourth)</li><li>Wilco Kelderman (seventh)</li><li>Alexey Lutsenko (eighth)</li><li>Guillaume Martin (ninth)</li><li>David Gaudu (10th)</li></ul>\n\n\n\n<p>It will be interesting to see how much the real-world Tour and Average (simulated) Tour top-10s converge by the time the real riders reach Paris.</p>\n\n\n\n<h2>Green jersey</h2>\n\n\n\n<p>Ser-seaworth didn’t just look at the race overall. Here’s who won the green jersey across the 100 simulations:</p>\n\n\n\n<ul><li><strong>Caleb Ewan:</strong> 55 times</li><li><strong>Arnaud Démare:</strong> 26 times</li><li><strong>Wout van Aert:</strong> 8 times</li><li><strong>Mads Pedersen: </strong>5 times</li><li><strong>Tim Merlier:</strong> 3 times</li><li><strong>Mathieu van der Poel:</strong> 1 time</li><li><strong>Peter Sagan:</strong> 1 time</li></ul>\n\n\n\n<p>We’ll never know if Ewan would have won green in this year’s Tour but based on the sprinter-friendly parcours, it seems likely he was a very good chance, had he not <a href=\"https://cyclingtips.com/2021/06/caleb-ewan-is-out-of-the-tour-de-france-with-a-fractured-collarbone/\" target=\"_blank\">crashed out early</a>.</p>\n\n\n\n<p>The fact that seven-time points classification winner Sagan only won the green jersey once in 100 simulations is noteworthy. Ser-seaworth offered this explanation: “PCM can’t factor in Sagan’s intrinsic motivation to spend four hours in the break on a mountain stage for 15 intermediate sprint points, as he did in previous years.” </p>\n\n\n\n<h2>KOM jersey</h2>\n\n\n\n<p>There was more weirdness afoot in the battle for polka dots. There, Wout van Aert won the climber’s classification a total of 38 times out of 100 – easily the most prolific winner. Guillaume Martin was second with eight wins, ahead of Alexey Lutsenko with six.</p>\n\n\n\n<p>“I have no idea how or why this happens, but seeing Wout win several sprint stages as well as the KOM jersey is pretty much par for the course,” ser-seaworth wrote. “Perhaps PCM’s simple analysis of Wout’s stats has come to a conclusion that we haven’t been able to see yet. [Michael] Matthews and [Mathieu van der Poel] also managed to win the climber’s jersey, so it’s definitely not just a Wout thing either.”</p>\n\n\n\n<h2>White jersey</h2>\n\n\n\n<p>The best young rider classification was all about Tadej Pogačar. The 22-year-old Slovenian won white 91 times out of a 100 … or 91 times out of 95 when you consider the five simulations in which Pogačar didn’t finish the Tour (riders can crash in PCM, suffering injuries of various kinds).</p>\n\n\n\n<p>Others to win white were Sergio Higuita (four times), David Gaudu (three times), and Lucas Hamilton (twice).</p>\n\n\n\n<p>These results feel pretty spot on. It’s hard to imagine a scenario where Pogačar finishes the Tour de France but doesn’t win the white jersey.</p>\n\n\n\n<h2>Stage wins</h2>\n\n\n\n<p>Over the course of 2,100 simulated stages, 107 different riders won at least one stage. The riders with the most wins were:</p>\n\n\n\n<ul><li><strong>Caleb Ewan:</strong> 334 wins (15.9% of all stages)</li><li><strong>Tadej Pogačar:</strong> 270 wins (12.9% of all stages)</li><li><strong>Wout van Aert:</strong> 189 wins (9% of all stages)</li></ul>\n\n\n\n<p>Ser-seaworth notes that, interestingly, in 100 simulated editions of the Tour, Mark Cavendish won a grand total of just one stage. “Eddy Merckx’ record is very safe in the virtual world of PCM,” they wrote. “Davide Ballerini, [Cavendish’s] teammate at Deceuninck, was the chosen son and achieved 14 stage wins instead.”</p>\n\n\n\n<h2>Oddities</h2>\n\n\n\n<p>When you’re simulating more than 2,000 days of racing, you’re bound to come across a few anomalies and oddities. Here’s a selection of what ser-seaworth found.</p>\n\n\n\n<ul><li>Anthony Delaplace (Arkéa Samsic) winning a total of five stages.</li><li>Omar Fraile (Astana-Premier Tech) winning on the Champs-Élysées.</li><li>Lorenzo Rota (Intermarché-Wanty-Gobert Matériaux) taking yellow in one simulation by winning stage 1.</li><li>Magnus Cort Nielsen (EF Education-First) finishing seventh overall in one simulation.</li><li>Team B&amp;B Hotels being the only team to miss out on a single stage win across the entire 100 simulations.</li></ul>\n\n\n\n<h2>So what?</h2>\n\n\n\n<p>So what can we take from this whole project? Does it contain any useful data that can help us predict the outcome of real-world bike races?</p>\n\n\n\n<p>Well, probably not. In PCM, each rider’s performance is governed by their 13 skill scores and while this level of granularity <em>does</em> paint a fairly detailed picture of each rider and their strengths, it’s far from a complete picture. There are countless other variables in bike racing that a simulation will never be able to account for. Things like the complex suite of human emotions, which fluctuate from moment to moment, and can significantly affect a rider’s motivation on a given day. Or the effect weather conditions can have on a race.</p>\n\n\n\n<p>And even if every single variable in a bike race was accounted for in the game, it would be impossible to assign the right values to every single variable, for every single rider. It’s difficult enough to accurately rank each rider across 13 skills relative to each other rider in the race.</p>\n\n\n\n<p>But if we’re judging the value of this project by how it compares to reality, we’re kind of missing the point. Ser-seaworth summed it up eloquently at the bottom of <a href=\"https://www.reddit.com/r/peloton/comments/oe3scl/one_hundred_simulations_of_the_tour_de_france_can/\" target=\"_blank\">their Reddit post</a>:</p>\n\n\n\n<p>“No single simulation has been able to get more than a few correct predictions,” they wrote. “Does this mean reality is too crazy to be simulated? Am I disappointed that PCM couldn’t get it right? Not at all.</p>\n\n\n\n<p>“What I found between the lines of my spreadsheet, was a newfound appreciation for the complexity of cycling. Reducing each rider to 13 numbers gives a fair approximation, but the result is about as accurate as your average SWL [<a href=\"https://www.reddit.com/r/peloton/comments/o5ny7b/stage_winners_league_le_tour_de_france_2021/\" target=\"_blank\">Stage Winners League</a>] entry or <a href=\"https://www.reddit.com/r/peloton/comments/oezn6l/prediction_thread_2021_tour_de_france_stage_11/\" target=\"_blank\">PelotonMod Prediction Thread</a>: not very accurate. There has to be more.</p>\n\n\n\n<p>“Cycling, and especially the Tour, is just much more than PCM can ever hope to accurately simulate. It’s hopes and dreams, and life-long goals. It’s fatigue, and motivation, and fighting the elements. It’s teamwork, until suddenly you’re all alone. It’s crashing, and getting back up.</p>\n\n\n\n<p>“In how many simulations did Roglic get back on his bike after a crash? In how many simulations would Philipsen ever get a chance to sprint for his own chances? How often did a rider like Colbrelli suffer all day for 15 points at the finish line? Are these digital avatars also motivated to glory by lost loved ones? How many PCM characters cried after beating the time limit?”</p>\n\n\n\n<p>Projects like this don’t have to offer some hyper-realistic reproduction of reality to be worthwhile. They don’t have to help us predict what’s going to happen in the real-life Tour. It’s enough for it to just be cool, and interesting, and to provide a different perspective on things.</p>\n\n\n\n<p>Chapeau, ser-seaworth.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/heres-what-happens-if-you-simulate-the-2021-tour-de-france-100-times/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ea3a44bfaf8261078895de2d2dab7bb0c7ecbc5545c9cc31647d5c5c4d9bfe86","category":"Cycling"}