{"title":"Netflix เผยมีสมาชิกสมัครแพ็คเกจราคาถูกแบบมีโฆษณาแล้ว 15 ล้านบัญชี หลังเปิดตัวครบ 1 ปี","link":"https://www.blognone.com/node/136531","date":1698887270000,"content":"<div><div><div><p>Netflix รายงานความก้าวหน้าหลัง<a href=\"https://www.blognone.com/node/130925\">ครบรอบ 1 ปี</a> ของการให้บริการแพ็คเกจแบบใหม่ที่คิดราคาถูกลงแต่แสดงโฆษณา ซึ่งเพิ่มเป็นตัวเลือกให้กับลูกค้าในหลายประเทศ (ยังไม่มีไทย) และมีแนวโน้มเป็นช่องทางรายได้ใหม่ของแพลตฟอร์มสตรีมมิ่งต่าง ๆ จากเดิมต้องพึ่งค่าบริการสมาชิกอย่างเดียว</p>\n<p>โดย Netflix บอกว่าตอนนี้มีสมาชิกที่สมัครแพ็คเกจแบบมีโฆษณามากกว่า 15 ล้านบัญชีทั่วโลก (จาก<a href=\"https://www.blognone.com/node/136296\">ทั้งหมด</a> 247 ล้านบัญชี) ให้บริการใน 12 ประเทศ นอกจากนี้ยังเพิ่มเครื่องมือใหม่ ๆ ให้กับผู้ลงโฆษณา เช่น ฟอร์แมตเวลาตั้งแต่ 10 15 20 30 และ 60 วินาที หรือรูปแบบ Binge Ad ที่หากผู้ชมดูคอนเทนต์เดียวกันต่อเนื่อง 3 ตอน อาจให้ดูตอนที่ 4 ได้แบบไม่มีโฆษณาแทรก และบอกว่าได้รับการสนับสนุนจากแบรนด์นั้น ๆ</p>\n<p>Netflix ยังเตรียมแผนรองรับโฆษณามากขึ้น เช่น คอนเทนต์แบบมีผู้สนับสนุน ซึ่งตอนนี้เริ่มแล้วใน Love is Blind ซีซันล่าสุด (ขนม Smartfood) และเตรียมขยายไปยัง เรียลลิตี้ Squid Game: The Challenge และซีรี่ส์ The Crown ซีซันสุดท้าย เช่นเดียวกับรายการถ่ายทอดสด<a href=\"https://www.blognone.com/node/136300\">กอล์ฟ Netflix Cup</a> ที่มีผู้สนับสนุนการแข่งขันหลายราย</p>\n<p>ที่มา: <a href=\"https://about.netflix.com/en/news/one-year-into-netflix-ads\">Netflix</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c5bbff8deba62bfbd6c4079bcb45e381.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/video-streaming\">Video Streaming</a></div><div><a href=\"/topics/advertising\">Advertising</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ea3b8630227fbe004ff6b7e6df6eb333aa1366b5547daeddf01462e656128a2e","category":"Thai"}