{"title":"Where rim brakes thrive: Itzulia Women tech 2023","link":"https://www.cyclingtips.com/2023/05/where-rim-brakes-thrive-itzulia-women-tech-2023/","date":1684345907000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Screenshot-2023-05-17-at-14.46.18.jpg?width=1200\" alt=\"Where rim brakes thrive: Itzulia Women tech 2023\" /></figure><p>Itzulia Women was pretty much like the rest of the season, dominated by Team SD Worx with teammate Marlen Reusser and Demi Vollering sharing the spoils; Vollering took the first two stages in style, with Reusser rolling across the finish line in San Sebastian on the final stage over two minutes ahead of second place, and in the process taking the leaders jersey with it.</p>\n<p><strong>Also read: <a href=\"https://www.velonews.com/race-results/itzulia-women/\" target=\"_blank\">Itzulia Women Stage 3: Marlen Reusser rides away with overall</a></strong></p>\n<p>The three-day stage race has gone from strength to strength over the past few seasons, but it’s a race that doesn’t forget its roots. The organizers always seem to recognize the smaller squads from not just Spain but the rest of Europe.</p>\n<p>It’s also a race that does lean into its regional culture, remembering to have a healthy dose of local teams in the mix. With there being a healthy dose of Continental teams in the mix and it being the women’s side of the sport, it results in the tech being far more interesting than the men’s side of the sport.</p>\n<p>There are plenty of reasons for this, with the obvious one being smaller budgets. But that doesn’t mean kit is lesser — ok, maybe a little — but it means that we get a solid smattering of bikes and equipment from brands that we wouldn’t usually highlight here at <em>CyclingTips</em>.</p>\n<p>There’s gear from brands with wild names. There’s brands you may have forgotten about backed by people who want to develop great products for the elite riders amongst us, yet they don’t have wallets deep enough for the sport’s top tier. And because of that, it’s a treasure trove of tech delight.</p>\n<p>I hope you enjoy the tech as much as I did while wandering the pits of stage 3. I just wish the organizers had informed me that the race was to roll out 40 minutes earlier than what was printed in the roadbook; it would have allowed maybe a part two to the series. Still, it’s a perfect excuse to hit a few more women’s races later in the season.</p>\n<div></div>\n<p> </p>","author":"Dave Everett","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ea3c52f7b0b63969201cd791c4cdda6c6d69b7b1a32f7cea9a3bb5d11e0f9313","category":"Cycling"}