{"title":"Projecting Surface Water Area Under Different Climate and Development Scenarios","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004625?af=R","date":1721372400000,"content":"<h2>Abstract</h2>\n<p>Changes in climate and land-use/land-cover will impact surface water dynamics throughout the 21st century and influence global surface water availability. However, most projections of surface water dynamics focus on climate drivers using local-scale hydrological models, with few studies accounting for climate and human drivers such as land-use/land-cover change. We used a data-driven, machine learning model to project seasonal surface water areas (SWAs) in the southeastern U.S. from 2006 to 2099 that combined land-cover and climate projections under eight different development and emissions scenarios. The model was fitted with historic Landsat imagery, land-use/land-cover, and climate observation data (mean squared error 0.14). We assessed the change in SWA for each scenario, and we compared the surface water projections from our data-driven model and a process-based model. We found that the scenario with the largest forest-dominated land cover loss and most extreme climate change had watersheds with the greatest projected increases (in the South Atlantic Gulf) and decreases (in the Lower Mississippi) in SWA. When compared to the increase or decrease in surface water projected by the process-based model, most of the watersheds across scenarios agreed on the direction of change. Our findings highlight the importance of forest-dominated land cover in maintaining stable surface water availability throughout the 21st century, which can inform land-use management policies for adaptation and water-stress mitigation as well as strategies to prepare for future flood and drought events.</p>","author":"Mollie D. Gaines, \nMirela G. Tulbure, \nVinicius Perin, \nRebecca Composto, \nVarun Tiwari","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"ea3ca2cbb33fc249215384a710dd19583ea02eb873e16fbb85e18fdd1bcab528","category":"Environment"}