{"title":"DETERMINISTIC QUANTUM MECHANICS – Part II – The Linearized Temporal-Azimuthal Wave Solution","link":"https://www.preprints.org/manuscript/202405.1096/v1","date":1715854592000,"content":"This is the second paper in a series introducing a deterministic quantum mechanics theory that is shown to be consistent with the current mainstream statistical quantum theory as well as with classical physics. The first paper in this series demonstrated how causality, physical reality, and determinism are restored and concerns that were raised by results from the current mainstream statistical quantum theory were explained in simple form. The meaning of particle-wave duality and complementarity, the possibility of a particle, like the electron, to cross through the nucleus as it does when the angular momentum of the electron is zero, the possibility of a point-size particle to have an “intrinsic spin”, the possibility of “quantum jumps” as the electron transitions instantaneously from one stable orbital to another and does that at irregular time intervals, the natural collapse of the wave function as part of the solution, as well as consistency with the phenomenon of entanglement were some of the results that emerged from the proposed deterministic quantum mechanics theory. While the first paper presented overwhelming evidence of the latter, the present paper is the first to produce actual solutions that are consistent with current mainstream quantum theory as well as with classical physics. Analytical solutions are presented via a linear stability method. The Bohr-Schrödinger energy levels leading to the experimentally confirmed spectral lines, as well as the fine structure constant emerge directly from the solution of the equations governing the proposed deterministic quantum mechanics. Recommended follow-up solutions as well as generalizations are being presented at the end of the paper.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ea42feeef83ba92524c277df4dd9bd557761f5d943d0dfd029029ea8c43f72ea","category":"Interdisciplinary"}