{"title":"Apple Rivals Unite to Promote Open Ecosystems Using EU Law","link":"https://www.macrumors.com/2023/12/13/apple-rivals-unite-to-promote-open-ecosystems/","date":1702473554000,"content":"Google, Meta, Qualcomm, Nothing, Lenovo, Opera and several other tech companies have announced a collaborative effort to push for \"open digital ecosystems\" in what appears to be a pointed move against Apple (via <em><a href=\"https://www.reuters.com/technology/google-meta-qualcomm-team-up-push-open-digital-ecosystems-2023-12-13/\">Reuters</a></em>).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/02/Google-Logo-Feature-Slack.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe group, calling itself the Coalition for Open Digital Ecosystems (CODE), seeks to encourage more open platforms and systems in Europe. Other members include Motorola, Chinese smartphone brand Honor, French augmented reality start-up Lynx, and German messaging service provider Wire. Apple is noticeably absent from the organization's members.\r<br />\n\r<br />\nCODE's formation comes in response to new EU rules such as the Digital Markets Act (DMA), which designates major tech companies as \"<a href=\"https://www.macrumors.com/2023/09/06/app-store-safari-and-ios-designated-gatekeepers/\">gatekeepers</a>\" and compels them to open up their various services and platforms to other companies and developers. The DMA is expected to force Apple to make significant changes to the way the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>, and <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> work in Europe. For example, Apple will next year be obliged to allow users to install third-party app stores and <a href=\"https://www.macrumors.com/2023/04/17/app-sideloading-support-coming-ios-17/\">sideload apps</a>, as well as give developers the ability to promote their offers outside the ‌‌‌‌App Store‌‌‌‌ and use third-party payment systems.\r<br />\n\r<br />\nCODE plans to work with companies, legislators, and academics to promote digital openness and present pathways for this to be achieved in Europe using the DMA and future EU legislation. Members have discussed how digital ecosystems should work in Europe and what positively impacts competitiveness and openness. The organisation aims to open up major digital ecosystems using cross-industry collaboration to promote seamless connectivity and interoperability between systems.\r<br />\n\r<br />\nWhile the likes of Google and Meta have been officially designated as gatekeepers by the EU just like Apple, rivals are increasingly attempting to use EU law to prompt major changes to Apple's ecosystem. For example, last month, Google and European telecom groups <a href=\"https://www.macrumors.com/2023/11/08/google-asks-eu-to-force-open-imessage/\">urged EU regulators</a> to designate iMessage a \"core\" service that would force Apple to make the communications platform interoperable with competing chat services.<div>Tags: <a href=\"https://www.macrumors.com/guide/google/\">Google</a>, <a href=\"https://www.macrumors.com/guide/motorola/\">Motorola</a>, <a href=\"https://www.macrumors.com/guide/qualcomm/\">Qualcomm</a>, <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/lenovo/\">Lenovo</a>, <a href=\"https://www.macrumors.com/guide/europe/\">Europe</a>, <a href=\"https://www.macrumors.com/guide/opera-browser/\">Opera Browser</a>, <a href=\"https://www.macrumors.com/guide/nothing/\">Nothing</a>, <a href=\"https://www.macrumors.com/guide/meta/\">Meta</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/13/apple-rivals-unite-to-promote-open-ecosystems/\">Apple Rivals Unite to Promote Open Ecosystems Using EU Law</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-rivals-unite-to-promote-open-ecosystems-using-eu-law.2413595/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ea479db9616b5e1d0a3ce64988f06a4162bd6e0c2407f5228999c61c94d5f04c","category":"Apple"}