{"title":"Promoting effects of aluminum addition on chlorophyll biosynthesis and growth of two cultured iron‐limited marine diatoms","link":"https://onlinelibrary.wiley.com/doi/10.1002/lno.12558?af=R","date":1716913718000,"content":"<h2>Abstract</h2>\n<p>Aluminum (Al) may play a role in the ocean's capacity for absorbing atmospheric CO<sub>2</sub> via influencing carbon fixation, export, and sequestration. Aluminum fertilization, especially in iron (Fe)-limited high-nutrient, low-chlorophyll ocean regions, has been proposed as a potential CO<sub>2</sub> removal strategy to mitigate global warming. However, how Al addition would influence the solubility and bioavailability of Fe as well as the physiology of Fe-limited phytoplankton has not yet been examined. Here, we show that Al addition (20 and 100 nM) had little influence on the Fe solubility in surface seawater and decreased the Fe bio-uptake by 11–22% in Fe-limited diatom <i>Thalassiosira weissflogii</i> in Fe-buffered media. On the other hand, the Al addition significantly increased the rate of chlorophyll biosynthesis by 45–60% for Fe-limited <i>T. weissflogii</i> and 81–102% for Fe-limited <i>Thalassiosira pseudonana</i>, as well as their cell size, cellular chlorophyll content, photosynthetic quantum efficiency (<i>F</i>\n<sub>v</sub>/<i>F</i>\n<sub>m</sub>) and growth rate. Under Fe-sufficient conditions, the Al addition still led to an increased growth rate, though the beneficial effects of Al addition on chlorophyll biosynthesis were no longer apparent. These results suggest that Al may facilitate chlorophyll biosynthesis and benefit the photosynthetic efficiency and growth of Fe-limited diatoms. We speculate that Al addition may enhance intracellular Fe use efficiency for chlorophyll biosynthesis by facilitating the superoxide-mediated intracellular reduction of Fe(III) to Fe(II). Our study provides new evidence and support for the iron–aluminum hypothesis.</p>","author":"Linbin Zhou, \nFengjie Liu, \nEric P. Achterberg, \nAnja Engel, \nPeter G.C. Campbell, \nClaude Fortin, \nLiangmin Huang, \nYehui Tan","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"ea483ee12c8dbf5a3fcba486755b5c12d93728a0dd60a8b21dec202e84057fbc","category":"Environment"}