{"title":"กูเกิลส่งคำเตือนให้ผู้ใช้ 50,000 ราย ผู้ตกเป็นเป้าของแฮกเกอร์ที่มีรัฐบาลหนุนหลัง โดยเฉพาะในอิหร่าน","link":"https://www.blognone.com/node/125286","date":1634276785000,"content":"<div><div><div><p>ทีม Threat Analysis Group (TAG) ของกูเกิล เผยว่าได้ส่งคำเตือนไปยังผู้ใช้งานกว่า 50,000 ราย ผู้ซึ่งตกเป็นเป้าหมายของกลุ่มแฮ็กเกอร์ที่ได้รับการสนับสนุนจากรัฐบาล ด้วยวิธีฟิชชิ่งและฝังมัลแวร์</p>\n<p>กูเกิลระบุว่าคนที่ได้รับคำเตือน ไม่ได้หมายความว่าบัญชีถูกแฮ็กไปแล้ว เพราะกูเกิลได้จัดการเพื่อหยุดการโจมตีบางอย่างไปแล้ว แต่เป็นการส่งคำเตือนให้รู้ว่าผู้ใช้งานนั้นๆ กำลังตกเป็นเป้าหมาย</p>\n<p>โดยตัวเลขเป้าหมายโจมตีในปีนี้เพิ่มขึ้นจากช่วงเวลาเดียวกันของปีที่แล้วเกือบ 33% ซึ่งที่ผ่านมา กลุ่มแฮกเกอร์ส่วนใหญ่มาจากรัสเซีย อย่างเช่นกลุ่ม Fancy Bear แต่ล่าสุดไม่ใช่แค่รัสเซีย แต่มีถึงราวๆ 50 ประเทศที่มีกลุ่มแฮกเกอร์ทำงานกันในแต่ละวัน</p>\n<p>ตัวอย่างกลุ่มแฮกเกอร์ที่กูเกิลหยิบยกมาในครั้งนี้คือ APT35 จากอิหร่าน ที่ทำการฟิชชิ่งเป้าหมายอย่างต่อเนื่อง โดยเฉพาะช่วงเลือกตั้งสหรัฐฯ 2020 เป้าหมายคือบุคคลที่ทำหน้าที่หาเสียง หรือทำงานเป็นส่วนหนึ่งในแคมเปญหาเสียงเลือกตั้ง เพื่อทำการจารกรรมข้อมูลที่ส่งผลประโยชน์ต่อรัฐบาลอิหร่าน วิธีการคือ อัพโหลดแอป VPN ปลอมบน Google Play Store ซึีงฝังสปายแวร์ เอาข้อมูลจำพวก การโทร ข้อความ ผู้ติดต่อ โลเคชัน ซึ่งกูเกิลบอกว่าได้ลบแอปดังกล่าวทิ้งไปก่อนจะมีใครดาวน์โหลดมันไปใช้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ed3c2021fdeae3cedd65c4c431428f89.png\" /></p>\n<p>APT35 ยังใช้ API Telegram ให้เป็นประโยชน์ด้วยการสร้างบอทแจ้งเตือนเมื่อผู้ใช้โหลดหน้าฟิชชิ่งหน้าใดหน้าหนึ่ง ทำให้กลุ่มแฮกเกอร์รู้ข้อมูลอุปกรณ์ได้เรียลไทม์ ซึ่งทางกูเกิลได้รายงานเรื่องนี้ไปยัง Telegram แล้ว</p>\n<p>อีกวิธีของกลุ่ม APT35 คือการแอบอ้างเป็นเจ้าหน้าที่จัดการประชุม สัมมนาเพื่อทำการล้วงเอาข้อมูล เช่นอ้างว่าเป็นผู้จัดงานประชุม Munich Security and the Think-20 (T20) ในอิตาลีเพื่อจะส่งลิงค์ฟิชชิงให้เป้าหมายในอีเมลอีกต่อหนึ่ง</p>\n<p>ที่มา - <a href=\"https://blog.google/threat-analysis-group/countering-threats-iran/\">กูเกิล</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/cybersecurity\">Cybersecurity</a></div><div><a href=\"/topics/iran\">Iran</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ea4b479cbb4261697dd1ed0facce6ed2836eb3b2f1d43b5059a55ce66571f5ea","category":"Thai"}