{"title":"Slow drawdown, fast recovery: Stream macroinvertebrate communities improve quickly after large dam decommissioning","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14656?af=R","date":1713957590000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/8ae5b064-23d9-42fc-a98e-fd48d296a412/jpe14656-toc-0001-m.png\" alt=\"Slow drawdown, fast recovery: Stream macroinvertebrate communities improve quickly after large dam decommissioning\" />\n<p>Dam decommissioning helps restore instream habitats and facilitates the recovery of invertebrate communities in a very short time frame if there are nearby sources of potential colonizers. Slow drawdown reduces the transport of the sediments accumulated in the reservoir and their potential downstream impacts, even more if prior to drawdown the reservoir is kept full for years to promote the deposition of sediments in marginal areas that will later be readily colonized by trees.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nDam removal is increasingly considered as a river restoration tool for impoundments that harm the environment or have exceeded their lifespan. However, few studies report the ecological consequences of large dam removal.\n\nWe performed a multiple before-after/control-impact (mBACI) study to investigate the consequences of the decommissioning of a large dam (42 m high) on instream habitat and invertebrate communities in a temperate, forested catchment of northern Spain.\n\nBefore decommissioning, lack of fine sediments and high concentrations of manganese and iron occurred below the dam but decreased downstream. Invertebrate taxa richness and diversity were reduced, and pollution-sensitive taxa were missing just below the dam.\n\nThe drawdown of the reservoir, the first step towards its decommissioning, mobilized stored sediments causing frequent turbidity peaks downstream, which nevertheless, caused no detrimental effects on macroinvertebrate communities. One year after drawdown, the communities downstream from the dam, as well as those in the newly formed stream in the area formerly impounded by the reservoir, became very similar to those in control reaches, showing a successful restoration project.\n\n<i>Synthesis and applications</i>. Dam decommissioning helps restore instream habitats and facilitates the recovery of invertebrate communities in a very short time frame if there are nearby sources of potential colonizers. Slow drawdown reduces the transport of the sediments accumulated in the reservoir and their potential downstream impacts, even more if prior to drawdown the reservoir is kept full for years to promote the deposition of sediments in marginal areas that will later be readily colonized by trees.\n</p>","author":"Miren Atristain, \nLibe Solagaistua, \nAitor Larrañaga, \nDaniel von Schiller, \nArturo Elosegi","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"ea51051777a647e01d7002f5de87b9c054ed45ff3310c17cc1420b72723f70d9","category":"Environment"}