{"title":"Efficacy of three pheromone lures on trapping the palm weevils Rhynchophorus palmarum and Dynamis borassi (Coleoptera: Curculionidae)","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12931?af=R","date":1724923492000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3b40e94a-0e99-4e22-8941-902c6396dfc2/aab12931-toc-0001-m.png\" alt=\"Efficacy of three pheromone lures on trapping the palm weevils Rhynchophorus palmarum and Dynamis borassi (Coleoptera: Curculionidae)\" />\n<p>Here, we evaluated the attractiveness of three pheromone lures on two species of palm weevils, and whether these species show preferences when two lures are deployed simultaneously. Our results suggest that two of the lures tested are effective at attracting both species of palm weevils, but they attract more individuals of the species they were designed for. One of the lures tested had a repellent effect for both species, probably because of the presence of a minor pheromone component in the lure. Our results have important implications for the management of palm weevils in multiple palm crops across the Americas.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>In the Americas, the palm weevils <i>Rhynchophorus palmarum</i> and <i>Dynamis borassi</i> are two of the most economically important palm pests, attacking crops including oil palms, coconut palms, Canary Islands date palms and peach palms. Mass trapping with aggregation pheromone-baited traps has been used for several decades as the main way to monitor and manage palm weevil populations worldwide. Given that several species of palm weevils have the same main aggregation pheromone and that one species can be attracted to the aggregation pheromones of other species, it is important to compare the efficacy of multiple pheromone lures on several species of palm weevils. Here, we tested the commercial pheromone lure Dynalure (ferruginol) independently, and the lures Rhyncolure (rhynchophorol) and Metalure (89% ferruginol and 11% 2-methyl-4-heptanol) jointly, for their efficacy at attracting <i>R. palmarum</i> and <i>D. borassi</i> in a palm growing area of Tumaco, Colombia. We found that Dynalure and Rhyncolure are effective at attracting both species, but traps with Dynalure attract more <i>D. borassi</i>, while traps with Rhyncolure attract more <i>R. palmarum</i>. Metalure had a repellent effect for both species, highlighting the importance of minor components in pheromone lures. For <i>R. palmarum</i>, captures were female-biased in traps with the lures Rhyncolure and Metalure, while for <i>D. borassi</i> captures were male-biased with all lures tested. While both species showed similar numbers of captures per trap at the beginning of the experiment, at the end of the 14-month observation period, <i>R. palmarum</i> was the most abundant species captured in traps. Our results highlight the importance of evaluating the field efficacy of lures with different aggregation pheromones for mass trapping of palm weevils and to consider the effect of minor components in the lures, especially with the potential invasion of the red palm weevil to the Americas, and the urgent need to develop an integrated pest management programme that covers multiple species of sympatric palm weevils.</p>","author":"Mario S. Pinilla‐Gallego, \nJenny M. Santos‐Holguín, \nJulián Roberto Mejía‐Salazar, \nVanessa Moncayo, \nFélix Alberto Guzmán","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"ea5514e997db2b5735fdd155d2500bace8b6b734297c7e2512eeed166441d82c","category":"Environment"}