{"title":"Google and ADT have a new security system with lots of subscription fees","link":"https://arstechnica.com/?p=1927612","date":1680111715000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/4-1-800x369.jpg\" alt=\"Google and ADT's security package: Google screens and cameras and ADT's software, sensors, and hub.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/4-1.jpg\">Enlarge</a> <span>/</span> Google and ADT's security package: Google screens and cameras and ADT's software, sensors, and hub. (credit: ADT)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google's plans for a security system are starting to take shape. Google invested <a href=\"https://arstechnica.com/gadgets/2020/08/adt-will-exclusively-install-nest-hardware-in-450-million-google-deal/\">$450 million</a> in ADT in 2020, buying a 6.6 percent stake in the security monitoring company. Two months later Google<a href=\"https://arstechnica.com/gadgets/2020/10/google-kills-the-nest-secure-its-500-home-security-system/\"> killed its in-house security system</a>, the Nest Secure, which had a monitoring deal with ADT rival Brinks. The two companies promised to build \"the next generation of smart home security solutions,\" and that's apparently here now as the \"<a href=\"https://newsroom.adt.com/corporate-news/adt-and-google-announce-availability-of-first-integrated-smart-home-security-system-for-diy-customers\">ADT Self Setup smart home security system</a>.\"</p>\n<p>Since the Nest Secure is dead, the brains of the system is the ADT Smart Home Hub. This is a 4.1×4.1×5.9-inch box with a keypad on top and a few other buttons for arming and disarming the security system. It's a sizable unit that's basically the size of a smart speaker, thanks to needing to fit an integrated 24-hour battery backup and a speaker grille on the front for the alarm siren, which ADT says hits 85 dB at 10 feet. Instead of a more common smart home protocol like Wi-Fi, Z-Wave, Zigbee, Google's Thread, or Matter, ADT's devices run over \"DECT/ULE,\" an old-school wireless home security standard. I don't think that acronym means anything anymore, but officially it stands for \"Digital Enhanced Cordless Telecommunications/Ultra Low Energy\" (it has roots in <a href=\"https://en.wikipedia.org/wiki/Digital_enhanced_cordless_telecommunications\">cordless phone technology</a>). The hub still has Z-Wave, but that's only for automation of third-party products. It also has Bluetooth for setup, and assuming this is the same hub used for ADT's old \"Blue\" security system, it connects to the Internet over Wi-Fi with a cellular backup.</p>\n<p>ADT also has <a href=\"https://newsroom.adt.com/corporate-news/adt-self-setup-device-choices-for-your-custom-diy-system\">various security widgets</a> you can place around the house. It's not very handy to have the control keypad on top of the hub, away from the door, so there's also a remote keypad that presumably you can wall mount next to the door and use as you come and go. ADT is also handling the door and window sensors, motion sensors, flood and temperature sensors, a car-style key fob, and surprisingly, the smoke detector. Nest famously has some extremely expensive smoke detectors, but ADT's press release <a href=\"https://newsroom.adt.com/corporate-news/adt-and-google-announce-availability-of-first-integrated-smart-home-security-system-for-diy-customers#:~:text=The%20ADT%20Self%20Setup%20system%20can%20include%3A\">calls out</a> every compatible Google product by name, and the Nest Protect smoke detector is not listed.</p></div><p><a href=\"https://arstechnica.com/?p=1927612#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1927612&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ea5b6e8b40e20a7b0cc194f6a657f06386774911fe774507a62f17393af95a22","category":"Tech"}