{"title":"Lefevere: ‘Remco is not allowed to ride the Tour in 2022’","link":"https://cyclingtips.com/2021/06/lefevere-remco-is-not-allowed-to-ride-the-tour-in-2022/","date":1624800055000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/CORVOS_00033147-005-650x417.jpg\" /></div><h2>Lefevere: 'Remco is not allowed to ride the Tour in 2022'</h2><p>\n</p><p>Deceuninck-QuickStep team boss, Patrick Lefevere, says that Remco Evenepoel will not be allowed to make his Tour de France debut before 2023.</p>\n\n\n\n<p>“Remco is not allowed to ride the Tour in 2022,” Lefevere told RTBF, Belgium’s French-speaking public broadcaster. “We’re going to let him ride a good Giro first, in normal conditions, with normal preparation and winter, and with a few races in his legs before the start. It’s actually an easy, logical decision.”</p>\n\n\n\n<p>The 21-year-old went to the 2021 Giro d’Italia as team leader, despite having not raced since his <a href=\"https://cyclingtips.com/2020/08/remco-evenepoel-falls-from-bridge-on-il-lombardia-descent/\">horrifying crash</a> at the 2020 Il Lombardia. His maiden Grand Tour got off to a good start, with two top 5 stage finishes in the first week and five days in second on GC. He started stage 11 wearing the white jersey (on behalf of race leader Egan Bernal), but he began to fade on the white roads of Tuscany. He steadily slipped down the standings from that point on, and after crashing and losing even more time, he eventually <a href=\"https://cyclingtips.com/2021/05/remco-evenepoel-is-out-of-the-giro-ditalia-after-crashing-on-stage-17/\">left the race</a> after stage 17.</p>\n\n\n\n<p>The young Belgian has picked up some great results since the Giro, including a stage win and overall victory at the Tour of Belgium. His next goal is the Olympic Games in Tokyo, after which he is expected to start the Vuelta a España in August.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/06/lefevere-remco-is-not-allowed-to-ride-the-tour-in-2022/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ea5f3c37ffa348c5273ca631c48244a93c9318b9b5f2a510c64eb536af2c2692","category":"Cycling"}