{"title":"Incorporation of Nano-Zinc Oxide as a Strategy to Improve the Barrier Properties of Biopolymer-Suberinic Acid Residues Films – A Preliminary Study","link":"https://www.preprints.org/manuscript/202406.1807/v1","date":1719387831000,"content":"Finishing coatings in the wood-based composites industry not only influence the final appearance of the product but also serve to protect against fungi, and molds, and reduce the release of harmful substances, particularly formaldehyde and volatile organic compounds (VOCs). Carbon-rich materials, such as those derived from birch bark extraction, specifically suberin acids, can fulfil this role. Previous research has demonstrated that adding suberin acid residues (SAR) at 20% and 50% by weight significantly enhances the gas barrier properties of surface finishing materials based on poly(lactide) (PLA) and polycaprolactone (PCL), particularly in terms of Total VOC (TVOC) and formaldehyde emissions. This study aims to explore whether these properties can be further improved through the incorporation of nano-zinc oxide (nano-ZnO). Previous research has shown that these nanoparticles possess strong resistance to biological factors and can positively affect the characteristics of nanofilms applied as surface protection. The study employed PLA and PCL finishing layers blended with SAR powder at 10% w/w and included 2% and 4% nano-zinc oxide nanoparticles. The resulting blends were milled to create a powder, which was subsequently pressed into 1 mm thick films. These films were then applied to raw particleboard surfaces. TVOC and formaldehyde emission tests were conducted. Additionally, the fungal resistance of the coated surfaces was assessed. The results showed that PLA/SAR and PCL/SAR composites with the addition of nano-zinc oxide nanoparticles exhibited significantly improved barrier properties, offering a promising avenue for developing biodegradable, formaldehyde-free coatings in the furniture industry with enhanced features. Furthermore, by utilizing SAR as a post-extraction residue, this project aligns perfectly with the concept of upcycling.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ea5f1050760aa08a0093e654f5fca093811d5c0737f7ab62dd5fe540d9f6fe74","category":"Interdisciplinary"}