{"title":"Conducting tobacco control surveys among schoolchildren in Bangladesh, India and Pakistan: A feasibility study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003784","date":1727964000000,"content":"<p>by Masuma Pervin Mishu, Cath Jackson, Ann McNeill, Suneela Garg, Amod Borle, Chetana Deshmukh, M. Meghachandra Singh, Nidhi Bhatnagar, Ravi Kaushik, Rumana Huque, Fariza Fieroze, Sushama Kanan, S. M. Abdullah, Laraib Mazhar, Zohaib Akhter, Khalid Rehman, Safat Ullah, Lu Han, Anne Readshaw, Aziz Sheikh, Paramjit Gill, Kamran Siddiqi, Mona Kanaan, Romaina Iqbal</p>\r\n\r\nMost of the world’s 300 million smokeless tobacco (ST) users live in South Asia but ST policies for that region are poorly researched, developed and implemented. Longitudinal studies to understand the uptake and use of ST and smoking, and influences on these, such as health promotion strategies, are lacking. We planned to conduct longitudinal surveys among secondary school students in three countries with the highest ST burden: Bangladesh, India and Pakistan to explore ST and smoking uptake, use and health promoting strategies. Before running that longitudinal study, we assessed the feasibility of conducting such a multi country survey using a mixed-methods design. The survey (and feasibility study) was conducted in 24 secondary schools (eight per country, three classes per school). Three data sources, researcher records/fieldnotes, survey data of 1179 students, and interview/focus group discussion data from 24 headteachers, 64 teachers and 76 students, were used to understand the feasibility of three study tasks: 1) selecting, recruiting, and retaining schools and student participants; 2) survey administration; and 3) robustness of the data collection instruments. The datasets were analysed separately and triangulated. Overall, we could select and recruit schools and students using consistent methods across countries although recruitment was challenged by securing higher authority permissions and parental consent. Recommended improvements were for permission/consent processes. Survey administration was generally feasible and acceptable with recommendations for scheduling and researcher-student ratios. Questionnaire completion was 83%-100% across countries, with suggestions to improve readability and understanding, addressing students’ queries and questionnaire simplification. Due to COVID-19, we could not conduct follow-up surveys, so were unable to assess school or student retention. In conclusion, incorporating the lessons learnt from this study would improve the feasibility of conducting such a multi-country survey in the future. Reported benefits included increasing tobacco health risks’ knowledge with potential for increased tobacco control support.","author":"Masuma Pervin Mishu","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"ea613e7588d1aa6fea1ceb5f601439dbbce188e57978c7ea5ec68f008e267f34","category":"Environment"}