{"title":"Modelling and in situ observation of broadband acoustic scattering from the Silver cyprinid (Rastrineobola argentea) in Lake Victoria, East Africa","link":"https://academic.oup.com/icesjms/article/81/7/1385/7258309?rss=1","date":1693526400000,"content":"<span><div>Abstract</div>Lake Victoria is the second-largest freshwater lake in the world, and fish from the lake are a vital food resource for millions of people living around it. The silver cyprinid (<span>Rastrineobola argentea)</span>, a small schooling pelagic species known in Tanzania as “dagaa” contributes ca. 55% to the total annual catch (ca. 0.51 million tonnes (MT) in 2014). The acoustic target strength (TS, dB re 1 m<sup>2</sup>) of dagaa, a key factor for biomass estimation, is however not well described, and is a major source of uncertainty in biomass estimation. In this study, we developed a Kirchhoff-ray mode (KRM) model to predict the TS of dagaa at standard fisheries survey frequencies. The model was based on the morphology of the body and the dual-chambered swimbladder, as obtained from X-ray images of fish ranging in total length (TL) between 2.8 and 5.4 cm. The results suggested that the swimbladder (which comprises 2.6 to 8.2% of body volume) accounts for ca. 65 to 90% of the total backscattering at 120 kHz. The predicted TS was highly dependent on tilt angle, varying by 14.0 dB at 120 kHz across the tilt range 65–115˚ (where 0˚ is head up and 180˚ is tail up), and TS variability with tilt generally increased with increasing frequency. The tilt angle of acoustically tracked individual fish indicated a distribution of tilt angles with a mean and s.d. of 93.5 and 15.1°. Our model suggested a new tilt-averaged TS–TL relationship for dagaa [$T{S}_{120\\ kHz} = 19.49\\log ( {TL} ) - 70.3$], which leads to a TS 1.5 dB higher than the value in the relationship presently used to estimate stock biomass. The new relationship will lead to a substantial reduction (by ca. 30%) in estimated biomass. The discrepancies between the mean relative frequency response of the <span>in situ</span> measurements of backscatter from dagaa and the KRM model predictions were in the range of -2.9–3.1 dB at frequencies from 45 to 250 kHz. The KRM modelling and <span>in situ</span> broadband measurements of dagaa will be beneficial for acoustic identification and behavioural studies of dagaa, and will enable improved biomass assessment, thereby underpinning sustainable long-term management.</span>","author":"","siteTitle":"ICES Journal of Marine Science Current Issue","siteHash":"54f8cca1acc450a23f886e7003c55f387c2b0793320a665b1e27fbbf191461e5","entryHash":"ea6f516ae365e46f7583451ff569d04c6d0240d6fd76b0ea30fde7001763fc69","category":"Environment"}