{"title":"Apple's Orders for Key iPhone 13 Camera Component Expected to Outstrip Entire Android Market","link":"https://www.macrumors.com/2021/06/09/iphone-13-camera-component-orders-outstrip-android/","date":1623224831000,"content":"Major camera upgrades coming to the <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> series are putting increased pressure on suppliers to meet Apple's demand for key lens components, according to a new <em>DigiTimes</em> report.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/10/iphone12protriplelenscamera.jpg\" />\r\n<br />\r\nApple has reportedly put Taiwan-based makers of voice coil motor (VCM) components on notice to increase their capacity by 30-40% in order to meet the company's demand, which is expected to outstrip the entire Android market this year.\r\n<br />\r\n<blockquote>The sources pointed out that the next-generation iPhones are expected to have upgrades in camera modules and 3D sensors for Face ID, resulting in increasing use of VCMs, said the sources adding that Apple has also asked related component suppliers to increase their capacities by 30-40% in order to meet its demand.</blockquote>Apple's order pull-ins for VCMs are expected to turn strong as soon as this month and begin surging in July. Meanwhile, the reduced demand from Android makers for VCMs is said to be partly due to the impact of Huawei's US-imposed sanctions. Be that as it may, successive <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> models have required more and more VCM components, which are involved in camera lens focus functions, because Apple keeps increasing the number and quality of lenses in its camera modules. \r\n<br />\r\n\r\n<br />\r\nThis year, Apple is expected to make several notable camera improvements in the ‌iPhone 13‌. The new \"Pro\" models are likely to feature an <a href=\"https://www.macrumors.com/2021/03/01/iphone-13-pro-120hz-kuo/\">upgraded Ultra Wide camera lens </a>with a wider f/1.8 aperture and a six-element lens, with some rumors suggesting that the Ultra Wide upgrade could come to <a href=\"https://www.macrumors.com/2021/02/02/iphone-13-upgraded-ultra-wide-lens-rumor/\">all four iPhone 13 models</a>.\r\n<br />\r\n\r\n<br />\r\nSensor-shift stabilization is expected to be expanded <a href=\"https://www.macrumors.com/2021/05/27/sensor-shift-stabilization-all-iphone-13-models/\">across the entire iPhone lineup</a>, introducing improvements in low light performance and stabilization by reducing camera shake, with the feature rumored to be available for the Wide lens and the Ultra Wide lens of the Pro models. One rumor claims the new ‌iPhone‌ models will also be able to take Portrait Mode videos.\r\n<br />\r\n\r\n<br />\r\nIn addition, there are also claims that the ‌iPhone 13‌ models will have <a href=\"https://www.macrumors.com/2021/02/15/iphone-13-always-on-display-stronger-magesafe/\">astrophotography camera capabilities</a> for capturing the sky. This could involve a special mode that activates when the ‌iPhone‌ is pointed at the sky, allowing the device to detect the moon, stars, and other artifacts and adjust exposure. \r\n<br />\r\n\r\n<br />\r\nIf the rumors are accurate, all of these improvements are likely to require a <a href=\"https://www.macrumors.com/2021/01/08/iphone-13-thinner-notch/\">slightly larger camera bump</a>, although individual lenses may protrude less from the device's body, according to <a href=\"https://www.macrumors.com/2021/03/26/iphone-13-matt-black-stainless-steel-coating/\">one source</a>.\r\n<br />\r\n\r\n<br />\r\nApple's ‌iPhone 13‌ lineup will be unveiled in the fall of 2021, with the company likely aiming to return to its traditional September launch timeline.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/digitimes-com/\">digitimes.com</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/09/iphone-13-camera-component-orders-outstrip-android/\">Apple's Orders for Key iPhone 13 Camera Component Expected to Outstrip Entire Android Market</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-orders-for-key-iphone-13-camera-component-expected-to-outstrip-entire-android-market.2300026/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=VtQ51ojB4co:AoVjtDr2x_4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=VtQ51ojB4co:AoVjtDr2x_4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/VtQ51ojB4co\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ea718112e533385c3ada18ce163e90a5adff125a269bd46a90d262261fd77664","category":"Apple"}