{"title":"Whey filtration: a review of products, application, and pretreatment with transglutaminase enzyme","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13248?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<p>In the cheese industry, whey, which is rich in lactose and proteins, is underutilized, causing adverse environmental impacts. The fractionation of its components, typically carried out through filtration membranes, faces operational challenges such as membrane fouling, significant protein loss during the process, and extended operating times. These challenges require attention and specific methods for optimization and to increase efficiency. A promising strategy to enhance industry efficiency and sustainability is the use of enzymatic pre-treatment with the enzyme transglutaminase (TGase). This enzyme plays a crucial role in protein modification, catalyzing covalent cross-links between lysine and glutamine residues, increasing the molecular weight of proteins, facilitating their retention on membranes, and contributing to the improvement of the quality of the final products. The aim of this study is to review the application of the enzyme TGase as a pretreatment in whey protein filtration. The scope involves assessing the enzyme's impact on whey protein properties and its relationship with process performance. It also aims to identify both the optimization of operational parameters and the enhancement of product characteristics. This study demonstrates that the application of TGase leads to improved performance in protein concentration, lactose permeation, and permeate flux rate during the filtration process. It also has the capacity to enhance protein solubility, viscosity, thermal stability, and protein gelation in whey. In this context, it is relevant for enhancing the characteristics of whey, thereby contributing to the production of higher quality final products in the food industry. © 2023 Society of Chemical Industry.</p>","author":"Marieli Rosseto, \nCesar Vinicius Toniciolli Rigueto, \nKarolynne Sousa Gomes, \nDaniela Dal Castell Krein, \nRaquel Aparecida Loss, \nAline Dettmer, \nNeila Silvia Pereira dos Santos Richards","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"ea7a68eea13c4662a0eab35f4a4052539680254dacb9a1367a0175cb50b353fd","category":"Environment"}