{"title":"Geographical epidemiology of <i>Hyalomma anatolicum</i> and <i>Rhipicephalus microplus</i> in Pakistan: A systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309442","date":1724421600000,"content":"<p>by Abrar Hussain, Sabir Hussain, Ao Yu, Csaba Varga, Giulio A. De Leo, Rebecca L. Smith</p>\r\n\r\nThe livestock sector contributes almost 11% of Pakistan’s GDP and is crucial to 35 million people’s livelihoods. Ticks are a major economic threat, as over 80% of livestock, such as bovines, are tick-infested with <i>Hyalomma</i> and <i>Rhipicephalus</i> tick species. <i>Hyalomma anatolicum</i> and <i>Rhipicephalus microplus</i> are the most common tick species collected from livestock, transmitting primarily anaplasmosis, babesiosis, and theileriosis. We aimed to identify the geographical distribution of these two tick species and hot spot areas where the risk of these diseases being transmitted by these ticks is high. Following the PRISMA guideline, two authors conducted an independent review of literature sourced from various databases. We screened 326 research articles published between January 1, 1990, and December 31, 2023, focused on identifying the tick species at the district level. Thirty studies from 75 districts, representing 49.3% of the country’s total area, detected at least one tick species through collection from animals. <i>R</i>. <i>microplus</i> was present in 81% (n = 61) and <i>H</i>. <i>anatolicum</i> in 82% (n = 62) of these sampled districts. We employed spatial and conventional statistical methods with Geographic Information Systems (GIS) after mapping the weighted distribution of both ticks (the number of ticks per standard unit of sampling effort). We identified northwestern and northcentral regions of the country as hotspots with the highest tick distribution, which aligned with the documented high prevalence of anaplasmosis, babesiosis, Crimean-Congo hemorrhagic fever (CCHF), and theileriosis in these regions. This underscores the urgent need for robust tick control measures in these districts to safeguard animal health and boost the livestock economy.","author":"Abrar Hussain","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ea7b71d99c37dfb9d545e1117f82721fe3446caa4889d2c84adfb4cb82abc4f4","category":"Interdisciplinary"}