{"title":"How to pump up a bike tyre in five simple steps | Plus, everything you need to know about pumps, valves, pressure and more","link":"https://www.bikeradar.com/advice/workshop/how-to-pump-up-a-bike-tyre/","date":1687881600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/How-to-pump-up-a-bicycle-tyre-step-by-step-guide-6-of-12-151cb58.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/How-to-pump-up-a-bicycle-tyre-step-by-step-guide-6-of-12-151cb58.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/How-to-pump-up-a-bicycle-tyre-step-by-step-guide-6-of-12-151cb58.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/How-to-pump-up-a-bicycle-tyre-step-by-step-guide-6-of-12-151cb58.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/How-to-pump-up-a-bicycle-tyre-step-by-step-guide-6-of-12-151cb58.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/How-to-pump-up-a-bicycle-tyre-step-by-step-guide-6-of-12-151cb58.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/How-to-pump-up-a-bicycle-tyre-step-by-step-guide-6-of-12-151cb58.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/How-to-pump-up-a-bicycle-tyre-step-by-step-guide-6-of-12-151cb58.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/How-to-pump-up-a-bicycle-tyre-step-by-step-guide-6-of-12-151cb58.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Inflating an inner tube\" title=\"How to pump up a bicycle tyre step-by-step guide (6 of 12)\" />                                            <p>Being able to pump up your bike’s tyres is an essential skill for any cyclist.</p>\n<p>If your tyres are insufficiently inflated, they’ll feel sluggish to ride, lack grip on the road or trail and you also run the risk of a <a href=\"https://www.bikeradar.com/advice/workshop/how-to-fix-a-puncture-video/\">puncture</a>.</p>\n<p>In this article, we’ll run you through a step-by-step guide on how to pump your tyres, the different valve types, pump options and the rough pressure you should inflate your tyres to.</p>\n<h2>How to pump up a bike tyre</h2>\n<h3>1. Find the right pump</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Inflating a Presta valve\" title=\"How to pump up a bicycle tyre step-by-step guide (4 of 12)\" /></div><div><figcaption><span><i></i> This pump works with both Presta and Schrader valves.</span></figcaption><span> <i>Jack Luke / Our Media </i></span></div>\n<p>Ascertain what valve you have and make sure you have a compatible pump. Most pumps will work with a Schrader or Presta valve and many work with both.</p>\n<p>If the valve has a plastic dust cap, the first step is to remove it. Don’t worry if your valve doesn’t have one – they are simply cosmetic.</p>\n<h3>2. Prepare the valve</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Inflating a Presta valve\" title=\"Inflating a Presta valve\" /></div><div><figcaption><span><i></i> It’s easy to bend a Presta valve core, so take care.</span></figcaption><span> <i>Jack Luke / Our Media </i></span></div>\n<p>If you’re working with a Schrader valve, you can move onto the next step.</p>\n<p>Once the dust cap is removed from a Presta valve, it will reveal another threaded lockring. This needs to be unscrewed before you can inflate or deflate your tyre.</p>\n<p>Gently unscrew the thread.</p>\n<h3>3. Attach the pump to the valve</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Inflating a Presta valve\" title=\"How to pump up a bicycle tyre step-by-step guide (7 of 12)\" /></div><div><figcaption><span><i></i> We need to flick the lever to lock it in place on the valve.</span></figcaption><span> <i>Jack Luke / Our Media </i></span></div>\n<p>Attach the head of your pump to the open valve.</p>\n<p>If you’re attaching the pump head to a Presta valve, take care not to push too tight because they are more delicate.</p>\n<p>Pump heads can differ in design. On some, you may need to flick a lever to lock the pump in position, whereas others simply lock into place by pushing the head firmly onto the valve.</p>\n<p>If your tyre is completely flat, you may find it’s initially difficult to fit the head because the valve has a tendency to push back on the rim. If that happens, hold the valve from behind by pushing on the outside of the tyre so you can lock the head on properly.</p>\n<p>Once the pump head is locked to the valve, the connection should be airtight. If you hear a little air escaping when attaching the pump, that’s normal.</p>\n<h3>4. Pump the tyre</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Inflating a Presta valve\" title=\"How to pump up a bicycle tyre step-by-step guide (8 of 12)\" /></div><div><figcaption><span><i></i> It’s now time to inflate the tyre.</span></figcaption><span> <i>Jack Luke / Our Media </i></span></div>\n<p>Inflate the tyre to the desired pressure. Make sure you use the full stroke of the pump and use your body weight as well as your arms on the downstroke if using a track pump because it will be much easier and quicker to inflate the tyre.</p>\n<p>If the tyre won’t inflate, check the head is attached correctly.</p>\n<p>If the tyre still isn’t inflating, no matter how much air you pump into it, or if it quickly loses air, the inner tube inside may be punctured.</p>\n<h3>5. Disengage</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Inflating a Presta valve\" title=\"How to pump up a bicycle tyre step-by-step guide (11 of 12)\" /></div><div><figcaption><span><i></i> Don’t worry if you hear a slight hiss when you remove the pump.</span></figcaption><span> <i>Jack Luke / Our Media </i></span></div>\n<p>Remove the pump head from the valve.</p>\n<p>If the pump head has a locking mechanism, you’ll first need to flick the lever back to the open position and then remove the pump quickly. You may hear a hissing noise, but don’t worry – this is just the pressured air escaping from the pump rather than the valve.</p>\n<h3>6. Close the valve</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Inflating a Presta valve\" title=\"Inflating a Presta valve\" /></div><div><figcaption><span><i></i> Close the valve and reattach the dust cap, if applicable.</span></figcaption><span> <i>Jack Luke / Our Media </i></span></div>\n<p>On a Presta valve, screw the threaded cap clockwise and then reinstall the dust cap. On a Schrader valve, you only need to replace the dust cap.</p>\n<h2>What valve does my bicycle have?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Presta and Schrader valved inner tubes against a white background\" title=\"Presta vs Schrader\" /></div><div><figcaption><span><i></i> Presta (top) and Schrader are the two main types of valve.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Before pumping up your tyre, you’ll need to establish what valves your bike has.</p>\n<p>If your pump isn’t compatible with your valve, you can buy an adaptor that threads onto the head.</p>\n<p>For a deeper dive into the different valve types, check out our <a href=\"https://www.bikeradar.com/advice/buyers-guides/presta-vs-schrader-valves/\">Presta vs Schrader guide</a>.</p>\n<h3>Presta valve</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Presta valve against a white background\" title=\"Presta valve\" /></div><div><figcaption><span><i></i> Presta valves are found on the majority of bikes.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>A Presta valve is bicycle-specific and found on the vast majority of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cheap-road-bikes/\">bikes over £500/$500</a>. It’s much thinner than a Schrader valve and it’s secured with a nut that holds the valve closed, so air doesn’t escape. Some feature a removable valve core, which can be useful for setting up tubeless tyres.</p>\n<h3>Schrader valve</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Schrader valve against a white background\" title=\"Schrader valve\" /></div><div><figcaption><span><i></i> Schrader valves are less common, but are still found on some entry-level bikes.</span></figcaption><span> <i>Kaden Gardener / Our Media </i></span></div>\n<p>Schrader valves were commonplace on bicycles before the Presta standard largely usurped them. However, they are still often found on older bikes and many cheaper bikes under £500/$500. The same valves are found on car tyres.</p>\n<h3>Dunlop/Woods valve</h3>\n<p> </p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Dunlop valve against a white background\" title=\"Dunlop valve against a white background\" /></div><div><figcaption><span><i></i> Dunlop/Woods valves are rare but still around.</span></figcaption><span> <i>Getty Images</i></span></div>\n<p>The Woods valve (originally known as Dunlop) is common on Dutch-style bikes but rarely found on production bikes anymore. It uses the same valve core as a Presta valve, with a locking nut keeping it in place to avoid the tube deflating.</p>\n<h3>Tubeless valve</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"The RX830s come with long tubeless valves\" title=\"1422838587619-u9rab7jjwhqu-6dbff3e\" /></div><div><figcaption><span><i></i> Tubeless valves come in all shapes and sizes.</span></figcaption><span> <i>David Rome / Immediate Media</i></span></div>\n<p>Valves for <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless setups</a> are attached directly to the rim via a threaded locknut, rather than being a part of an inner tube. Although Schrader examples exist, they are almost always Presta.</p>\n<h2>What pressure (psi) should my bike tyres be?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Silca Terra pump footplate\" title=\"Silca Terra pump footplate\" /></div><div><figcaption><span><i></i> A pressure gauge on a track pump is a must-have.</span></figcaption><span> <i>Tom Marvin / Our Media</i></span></div>\n<p>The correct tyre pressure will make a transformatory difference to your ride.</p>\n<p>Rock-hard tyres aren’t really good for anything and will transfer vibrations from the road or trail to your hands.</p>\n<p>This results in decreased comfort and wasted energy because the tyre cannot deform when you hit a rock, root or road imperfection.</p>\n<p>If the pressure is too low, it will take more effort to maintain your chosen speed and the tyres will squirm under you as you ride. You also risk pinch-flatting the tyre.</p>\n<p>As a general rule, your tyre should be solid enough to prevent it deflecting all the way to the rim, though compliant enough to provide some suspension. After all, the beauty of a pneumatic tyre is you don’t have to have a bone-jarringly hard ride.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Vittoria Corsa Pro tyre minimum and maximum tyre pressures\" title=\"Vittoria Corsa Pro tyre minimum and maximum tyre pressures\" /></div><div><figcaption><span><i></i> Minimum and maximum pressures will be printed somewhere on the tyre sidewall.</span></figcaption><span> <i>Simon von Bromley / Our Media </i></span></div>\n<p>Most tyres will have minimum and maximum pressure ratings printed on the tyre’s sidewall. It’s advisable not to go under or over those limits because manufacturers have specified them for a reason.</p>\n<p>Optimising your tyre pressures more minutely can be a process of trial and error, but it’s one we’d recommend because it’s a free upgrade and will make a huge difference to your ride.</p>\n<p>We have specific guides on how to optimise your <a href=\"https://www.bikeradar.com/advice/workshop/road-bike-tyre-pressure/\">road</a>, <a href=\"https://www.bikeradar.com/advice/workshop/gravel-tyre-pressure/\">gravel</a> and <a href=\"https://www.bikeradar.com/advice/workshop/trail-tech-mountain-bike-tyre-pressure-all-you-need-to-know/\">mountain bike tyre pressure</a>.</p>\n<h2>What type of pump do I need?</h2>\n<p>You should ideally own two <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-pump/\">bike pumps</a> – a track pump for home use because it’s efficient, quick and easy to use and a secondary mini-pump in case you need to pump your tyre when you are out on a ride.</p>\n<p>If you’re buying a pump, it’s important to check if it will work with the type of valve your bike has, or ideally, if it works with both Presta and Schrader valves.</p>\n<h3>Track pump</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Topeak Tubi 2Stage\" title=\"Topeak Tubi 2Stage\" /></div><div><figcaption><span><i></i> A track pump is a home essential.</span></figcaption><span> <i>Julia Broussier / Our Media</i></span></div>\n<p>A track pump (also known as a floor pump) offers a long flexible hose, a large camber for a quick air transfer and a base to put your weight on. Most, if not all, feature a pressure gauge so you can inflate your tyre to the correct pressure.</p>\n<div>\n    <h5>Latest deals on track pumps</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Mini pump</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Silca Gravelero gravel mini-pump\" title=\"Silca Gravelero gravel mini-pump\" /></div><div><figcaption><span><i></i> Try to opt for a mini pump with a hose.</span></figcaption><span> <i>Silca</i></span></div>\n<p>Mini pumps are best suited for taking out on rides in case you have to fix a puncture because they are lightweight and will fit in a jersey pocket or on your frame.</p>\n<p>We tend to prefer mini pumps with a hose because that reduces stress (and potential damage) to the valve.</p>\n<div>\n    <h5>Latest deals on mini pumps</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>CO2 inflator</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"LifeLine CNC co2 inflators\" title=\"best co2 inflators 04\" /></div><div><figcaption><span><i></i> CO2 inflators combine a head and cartridge to deliver air to your tyre.</span></figcaption><span> <i>Russell Burton / Our Media </i></span></div>\n<p>Another possibility if you happen to puncture when out on a ride is to inflate the tyre with one of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/6-of-the-best-co2-inflators/https://www.bikeradar.com/advice/buyers-guides/6-of-the-best-co2-inflators/\">best CO2 inflators</a>.</p>\n<p>These use compressed carbon dioxide in a small cartridge to inflate or top up a tyre really quickly.</p>\n<p>CO2 inflators are not a replacement for all your pumping needs because they tend to deflate overnight. We’d still recommend carrying a mini pump when you’re out on a ride, just in case you run out of inflators.</p>\n<div>\n    <h5>Latest deals on CO2 inflators</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>How does a pump work?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"SKS Air-X-Plorer Digi 10.0 handle\" title=\"SKS Air-X-Plorer Digi 10.0 handle\" /></div><div><figcaption><span><i></i> Some pumps feature rubberised handles for improved grip.</span></figcaption><span> <i>Nick Clark / Our Media</i></span></div>\n<p>A pump gets the air into your tyre. The operating principle is simple; you increase the pressure inside the pump until it exceeds that inside the tyre. This ‘overpressure’ forces air into the tyre, increasing its pressure too.</p>\n<p>A pump is just a manually actuated piston. On a pump’s downstroke, a check valve (that allows air flow in one direction) seals the piston chamber, resulting in air being pressurised as the pump is compressed. That pressure increases until it exceeds that inside the tyre.</p>\n<p>At this point, a second one-way valve will allow air to flow from the pressurised pump chamber into the tyre. You extend the pump again, the check valve opens to refill the chamber with air and you repeat the process.</p>\n<p>To prevent the pressure in the tyre leaking back out, the second check valve at the base of the pump closes. If it wasn’t there, the pump would just shoot open again.</p>\n<p>Presta valves will close automatically, but the sprung Schrader valves are usually held open by a pin in the pump valve attachment (this means you don’t need any extra effort when pumping to overcome the pressure exerted by the spring).</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Lezyne Gravel Floor Drive Pro head\" title=\"Lezyne Gravel Floor Drive Pro head\" /></div><div><figcaption><span><i></i> This is the head (or chuck) of the pump.</span></figcaption><span> <i>Nick Clark / Our Media</i></span></div>\n<p>The head of the pump is also known as the chuck.</p>\n<p>The pump head (or chuck) is the part that attaches the pump to the valve and forms an airtight seal over the valve. Two designs exist: threaded and push-on with a locking lever. Most pumps nowadays are also adaptable to either Schrader or Presta valves.</p>\n<p>They will either feature two different attachment points or an adjustable chuck that can be changed to suit both types.</p>\n<p>For larger pumps (and many mini pumps too), the chuck is often on a hose, preventing your pumping force from damaging the valve.</p>\n<p>Pumps will often include a pressure gauge to check the pressure inside your tyre.</p>\n<h2>How often should I pump up my tyres?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"We'd recommend checking your tyre pressure with a pump or gauge but you can pinch the tyre to check if you're in the rough ballpark.\" title=\"How to pump up a bicycle tyre step-by-step guide (12 of 12)\" /></div><div><figcaption><span><i></i> We’d recommend checking your tyre pressure with a pump or gauge, but you can pinch the tyre to check if you’re in the rough ballpark.</span></figcaption><span> <i>Jack Luke / Our Media </i></span></div>\n<p>We’d advise checking your tyre pressures before every ride.</p>\n<p>If you’re leaving a bike in storage, we’d recommend topping up the tyre pressure periodically because the inner tube can perish if it’s left deflated over time.</p>\n<p>At the very least, you should give the tyre a quick squeeze by hand to confirm it’s around a suitable pressure.</p>\n<p>No, it’s not super-accurate, but you’ll quickly get a feel for the pressure in your tyres and be able to tell whether they need pumping up or not.</p>\n<p>Alternatively, you could invest in one of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-tyre-pressure-gauges/\">best tyre pressure gauges</a>.</p>\n<div>\n    <h5>The latest deals on digital tyre pressure gauges</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Why do I need to pump up my bike tyres?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Scott-Solace-Gravel_Action_009\" title=\"Scott-Solace-Gravel_Action_009\" /></div><div><figcaption><span><i></i> Your tyres are the main connection between your bike and the road or trail.</span></figcaption><span> <i>Michal Červený / Scott</i></span></div>\n<p>Pneumatic tyres were invented to get over the bone-jarring ‘ride quality’ of solid wheels.</p>\n<p>The air inside acts as a spring, providing suspension for you and enabling the tyre to conform to the terrain, providing better traction and grip.</p>\n<p>Pumping up your tyres is a quick job that can easily improve your enjoyment while riding. Running the wrong tyre pressure will negatively affect the way your bike rides and can also make it more prone to punctures.</p>\n<h2>How does my tyre hold air?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Slime 29x47-55 inner tube\" title=\"Slime_29x47_55\" /></div><div><figcaption><span><i></i> In most cases, an inner tube lives between your tyre and rim.</span></figcaption><span> <i>Simon von Bromley / Immediate Media</i></span></div>\n<p>The vast majority of bikes will use an <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tube</a>. This is an airtight tube that fits inside the circumference of the tyre, with a valve for pumping it up that you see on the outside.</p>\n<p>The tyre, when inflated by the tube, is what grips the ground and provides protection from punctures.</p>\n<p>You may have heard of <a href=\"https://www.bikeradar.com/features/how-to-set-up-road-tubeless-tyres/\">tubeless tyres</a>, which forgo a tube and use a specific rim and tyre to seal air without the need for a tube. These usually require <a href=\"https://www.bikeradar.com/advice/buyers-guides/which-tubeless-sealant-works-the-best/\">tubeless sealant</a> inside, which is a liquid that plugs any points where air is escaping.</p>\n<p>Tubeless tyres are more commonly found on the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike/\">best mountain bikes</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">best gravel bikes</a>, but the technology is also becoming increasingly popular on the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">best road bikes</a>.</p>\n<p>The fact there is no inner tube means you remove the risk of pinch-flatting (when your inner tube is pinched by the rim, causing a puncture). This means you can run tubeless tyres at lower pressures than those with an inner tube setup, for improved comfort, speed and traction.</p>\n<p>You also get tubular tyres for road or cyclocross, although these are typically reserved for racing scenarios. This is <a href=\"https://www.bikeradar.com/advice/workshop/how-to-glue-a-tubular-tyre/\">essentially a tyre with the tube sewn into it, </a>but they are rarely seen or used outside of professional racing.</p>","author":"Oscar Huckle","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"ea7ecfee30262f832dba385c5047de7558956970b5af5c1ee4e5ff8732dac0bc","category":"Cycling"}