{"title":"Lockheed Martin makes a big bet on commercial space and the Moon","link":"https://arstechnica.com/?p=1930532","date":1681217044000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/12/moon1-800x453.jpg\" alt=\"Orion, the Moon, and a crescent Earth as seen during the Artemis I mission.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/12/moon1.jpg\">Enlarge</a> <span>/</span> Orion, the Moon, and a crescent Earth as seen during the Artemis I mission. (credit: NASA)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>For several years NASA has made it clear to the space industry that, wherever possible, it would like to move toward a services model of buying things.</p>\n<p>When he was administrator, Jim Bridenstine was fond of saying that NASA wanted to be \"one of many customers\" for companies that were building products and services for spaceflight. And with the success of the commercial cargo and crew programs for the International Space Station, the space agency has been aiming to extend this approach. It has done so in various forms, including for small and large lunar landers, as well as spacesuits for both the space station and surface of the Moon.</p>\n<p>This transition—which has saved NASA money and seeks to leverage entrepreneurial activity in the US commercial space industry—has not been particularly easy for some of the large, traditional aerospace contractors. Typically, they were accustomed to competing for cost-plus contracts, which paid a company's expenses, plus a fee. In this new era, NASA tries to buy services at a fixed price. This means that if a company ends up delivering under that price, they keep the profit. If they go over the price, it's their loss.</p></div><p><a href=\"https://arstechnica.com/?p=1930532#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1930532&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ea8947ab10d98cc283d42c5bb2b31f5607381cb43df9d862351cede5e9f808d7","category":"Tech"}