{"title":"Perceived school service quality and vocational students’ learning satisfaction: Mediating role of conceptions of vocational education","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307392","date":1724248800000,"content":"<p>by Tao Guo, Tianxin Li, Zhanyong Qi</p>\r\n\r\nThis study examined the relationships among vocational students’ perceptions of school service quality, their learning satisfaction, and their conceptions of vocational education in Chinese secondary vocational schools. Using a quantitative approach, data were collected from 10,721 students through multistage sampling. Perceived school service quality was assessed using the five-factor SERVPERF instrument, learning satisfaction was measured with the one-factor SSwLA scale, and conceptions of vocational education were evaluated using the one-factor SCoVE scale. These instruments were subjected to internal, convergent, discriminant, and construct validity tests, including exploratory and confirmatory factor analyses. Structural equation modeling (SEM) analyzed the relationships among the constructs. Additionally, mediation analysis was employed to explore the mediating role of students’ conceptions of vocational education in the relationship between perceived school service quality and learning satisfaction. Results indicated that learning satisfaction was positively influenced by students’ perceptions of school service quality, particularly responsiveness, assurance, reliability, and empathy, but negatively by tangibles. Furthermore, the association between students’ perceived school service quality and learning satisfaction was mediated by their conceptions of vocational education, highlighting the complex interaction between perceived service quality and students’ learning satisfaction. These findings provide critical insights for policymakers and educators seeking to enhance effectiveness and satisfaction within vocational education settings.","author":"Tao Guo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ea8ad4a6e6b5cd3269a43ff0cf13102a68150d80c2a18f257db3eed07b6c8ceb","category":"Interdisciplinary"}