{"title":"If you want to save the planet, you might have to live with a crap iPhone case","link":"https://www.macworld.com/article/2085933/finewoven-iphone-15-case-environmental-leather.html","date":1695931648000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>This just in: synthetic leather substitutes aren’t as good as actual leather. Now here’s Tom with the weather.</p>\n\n\n\n<p>Okay, I’m being unfair. The <a href=\"https://www.macworld.com/article/2081435/iphone-15-finewoven-cases-criticism.html\">complaints about FineWoven</a>, the new miracle material Apple came up with to fill the gap after it decided to stop making leather accessories, go further than it is simply worse than leather. By all accounts–Apple gave me a silicone case for my iPhone 15 Plus review sample, so I speak second hand–FineWoven both stains and scratches disastrously easily. The maker <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2023/09/25/iphone-15-finewoven-complaints-retail-stores/&amp;xcust=1-1-2085933-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">warns</a> that it “may look different and show wear over time,” but neglects to mention that the time in question is “within hours of opening the box.”</p>\n\n\n\n<p>None of this is remotely acceptable, particularly when you factor in the high cost of the cases, plus the small but annoying manufacturing defects that could leave the port cutouts misaligned. (That’s not new, incidentally. The Smart Case for my AirPods Max has a misaligned Lightning cutout, which means the cable always pinches when I plug it in. Annoying!) The FineWoven cases deserve to get a bad review, and customers should be advised not to buy them.</p>\n\n\n\n<p>But the reaction goes beyond that, as was perhaps inevitable as soon as Apple brought environmental activism into the equation. (The leather industry is bad for cows, obviously, but you don’t have to be a granola-munching vegan to recognize the wider environmental issues that affect humans too, from deforestation for cattle feed to the chemical dumping that follows many common tanning processes.) As soon as you go green, you enter the culture wars; questions of taste or quality become instead moral or tribal. You wouldn’t normally expect Twitter/X users to waste much of their time debating the merits of an iPhone case, but a <a href=\"https://www.macworld.com/article/2054876/apple-ditching-leather-accessories-environmental-reasons-2.html\">FineWoven leak</a> ahead of the iPhone 15 launch got a more emotive response—one person <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/beedub111111/status/1699275536193716293?s=61&amp;t=oVkoA34HlGSowU4sMde15Q&amp;xcust=1-1-2085933-1-0-0&amp;sref=https://www.macworld.com/feed\">said</a>, “If Apple makes this case that will be worse than anything they’ve done this year and that’s a low bar with the USB speed limiter”—than the average presidential debate.</p>\n\n\n\n<p>Oddly, however, there has been a visceral reaction to FineWoven from both sides of the aisle, perhaps because it cuts to the very heart of the capitalist experience. Apple has committed the ultimate crime: It has taken away a somewhat popular consumer product and replaced it with something that demonstrably isn’t as good, for a reason that doesn’t directly and immediately benefit the people buying it. That’s not how the system is supposed to work!</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3808399/diff_think.jpg?quality=50&amp;strip=all\" alt=\"Different Think artwork\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>A FineWoven mess</h2>\n\n\n\n<p>The thing is, while Apple has gamely tried to convince us all that FineWoven is a premium material that’s just as good as leather (and priced it accordingly), ethical alternatives generally involve sacrifice. When people left Twitter after Elon Musk took over, most of them understood that Mastodon would not provide the same experience. Nobody seriously argues that vegan bacon tastes as good as the real thing, or that the <a href=\"https://www.techadvisor.com/article/2063112/fairphone-5-review.html\" target=\"_blank\">Fairphone 5</a> has tech specs to rival the latest Apple or Samsung flagship. Life is about trade-offs, and “being ethical” is a benefit that needs to be paid for by compromises in other areas.</p>\n\n\n\n<p>Unfortunately, as we’re discovering in a small way with FineWoven, ethical principles are less of a priority than many of us would like to think, and the compromises we’re willing to accept for their sake are depressingly limited. Eco-conscious liberals suddenly join the hang ’em and flog ’em brigade when an oil protester <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://talksport.com/sport/cricket/1480661/jonny-bairstow-just-stop-oil-protestor-lords-second-ashes-test/&amp;xcust=1-1-2085933-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">interrupts a game of cricket</a>. Suburban parents agree that teachers are underpaid then explode with fury when they go on strike and cause us personal disruption. Our principles last until the moment when we experience inconvenience, and not one moment longer.</p>\n\n\n\n<p>It’s completely fine to think Apple’s new FineWoven cases are overpriced and underdesigned and not as good as leather. But it’s probably also worth trying to understand <em>why</em> they’re not as good as leather, and what the world gets in return. And maybe even recognize that there are things in life that are more important than a scuffed phone case.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ea8a4f2b4f841af11732dd758c09a80f99d9dbd62276b5e5ee7c547659075acc","category":"Apple"}