{"title":"Subacute cadmium exposure changes different metabolic functions, leading to type 1 and 2 diabetes mellitus features in female rats","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24306?af=R","date":1723027049000,"content":"<h2>Abstract</h2>\n<p>Cadmium (Cd) is a heavy metal that acts as endocrine disrupting chemical (EDC). Few studies have investigated the effects of Cd exposure on metabolic dysfunctions, such as type 1 and 2 diabetes mellitus (T1DM and T2DM). Thus, we assessed whether subacute Cd exposure at occupational levels causes abnormalities in white adipose tissue (WAT), liver, pancreas, and skeletal muscle. We administered cadmium chloride (CdCl<sub>2</sub>) (100 ppm in drinking water for 30 days) to female rats and evaluated Cd levels in serum and metabolic organs, morphophysiology, inflammation, oxidative stress, fibrosis, and gene expression. High Cd levels were found in serum, WAT, liver, pancreas, and skeletal muscle. Cd-exposed rats showed low adiposity, dyslipidemia, insulin resistance, systemic inflammation, and oxidative stress compared to controls. Cd exposure reduced adipocyte size, hyperleptinemia, increased cholesterol levels, inflammation, apoptosis and fibrosis in WAT. Cd-exposed rats had increased liver cholesterol levels, insulin receptor beta (IRβ) and peroxisome proliferator-activated receptor-gamma coactivator-1alpha (PGC1α) expression, karyomegaly, inflammation, and fibrosis. Cd exposure reduced insulin levels and pancreatic islet size and increased inflammation and fibrosis. Cd exposure reduced skeletal muscle fiber diameter and increased IR expression and inflammation. Finally, strong positive correlations were observed between serum, tissue Cd levels, abnormal morphology, tissue inflammation and fibrosis. Thus, these data suggest that subacute Cd exposure impairs WAT, liver, pancreas and skeletal muscle function, leading to T1DM and T2DM features and other complications in female rats.</p>","author":"Charles S. da Costa, \nThiago F. de Oliveira, \nFlavia C. F. Dos Santos, \nAlessandra S. Padilha, \nMaiara Krause, \nMaria Tereza W. D. Carneiro, \nLeandro Miranda‐Alves, \nJones B. Graceli","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"ea99e80f9d1a93d5d955bad31005a2625a8e03127023523a6609ca16dd9d9346","category":"Environment"}