{"title":"Apple ออกคำแถลงประเด็น EC สั่งปรับ 7 หมื่นล้าน - Spotify คือคนได้ประโยชน์สูงสุดจากเรื่องนี้","link":"https://www.blognone.com/node/138533","date":1709572706000,"content":"<div><div><div><p>แอปเปิลออกคำแถลงหลังจาก<a href=\"https://www.blognone.com/node/138530\">กรรมาธิการยุโรป (European Commission - EC) ออกคำสั่งปรับแอปเปิลเป็นเงิน 1,800 ล้านยูโร</a> ในประเด็นกีดกันการแข่งขันตลาดแอปฟังเพลงสตรีมมิ่งบน App Store ตามที่ Spotify ร้องเรียน โดยแอปเปิลบอกว่าคำตัดสินนี้ คนที่ได้ประโยชน์สูงสุดก็คือ Spotify บริษัทที่มีสำนักงานใหญ่ในสวีเดน บริษัทเพลงสตรีมมิ่งที่ใหญ่ที่สุดในโลก และเป็นบริษัทที่เข้าพบคณะกรรมาธิการยุโรปถึง 65 ครั้ง ระหว่างการสอบสวน</p>\n<p>แอปเปิลบอกว่าในยุโรป Spotify มีส่วนแบ่งตลาด 56% และมากกว่าคู่แข่งเบอร์สองเกือบสองเท่า บริษัทไม่เคยจ่ายค่าตอบแทนให้กับแอปเปิล แม้บริการและเครื่องมือของแอปเปิลจะมีส่วนต่อความสำเร็จ ที่ Spotify ใช้เข้าถึงผู้ใช้งานทั่วโลก</p>\n<p>แอปเปิลยังเปิดตัวเลขที่ Spotify ใช้งานบนแพลตฟอร์มของแอปเปิล โดยที่บริษัทไม่ต้องจ่ายค่าตอบแทนให้แอปเปิลเลย เช่น การเข้าถึง API, เครื่องมือเชื่อมต่อกับอุปกรณ์อื่น, TestFlight มากกว่า 500 เวอร์ชัน, กระบวนการอนุมัติแอป 421 เวอร์ชัน ฯลฯ</p>\n<p>แอปเปิลบอกว่าตั้งแต่ปี 2022 App Store ได้เพิ่มเงื่อนไข<a href=\"https://www.blognone.com/node/127856\">ใช้งานแอปกลุ่ม Reader</a> ให้แทรกลิงก์ไปจ่ายที่เว็บตนเองได้ ซึ่ง Spotify ก็สามารถทำแบบนี้ได้ แต่เลือกไม่ทำเพราะ Spotify ต้องการแก้ไขกฎให้มากกว่านั้น แทรกราคาสมาชิกในแอป ไม่ใช้ระบบจ่ายเงินของ App Store แม้จะใช้เทคโนโลยีแอปเปิลทั้งหมด แอปเปิลจึงสรุปว่า Spotify ไม่รู้จักพอ Spotify ต้องการมากกว่านั้น</p>\n<p>แอปเปิลบอกว่าคณะกรรมาธิการยุโรปไม่มีหลักฐานที่เพียงพอ ที่แสดงว่าสิ่งที่เกิดขึ้นเป็นอันตรายกับผู้บริโภค ในเมื่อผู้บริโภคมีทางเลือกในตลาดที่เติบโตตลอด และ Spotify ก็ยังเป็นผู้นำตลาด รวมทั้งไม่มีหลักฐานว่าแอปเปิลขัดขวางการแข่งขันอย่างไร จึงเตรียมอุทธรณ์กับ EC ต่อไป</p>\n<p>ที่มา: <a href=\"https://www.apple.com/th/newsroom/2024/03/the-app-store-spotify-and-europes-thriving-digital-music-market/\">แอปเปิล</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/268fce17e958bea85a396f714d8f3b51.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/european-commission\">European Commission</a></div><div><a href=\"/topics/spotify\">Spotify</a></div><div><a href=\"/topics/antitrust\">Antitrust</a></div><div><a href=\"/topics/music-streaming\">Music Streaming</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ea9d78e8d9a790d52c505c00ab5bf5cde93fca08fb1720d0d53695f3c26b4cf2","category":"Thai"}