{"title":"How To Automate Documentation Workflow For Developers","link":"https://smashingmagazine.com/2021/08/automate-documentation-workflow-for-developers/","date":1629810000000,"content":"<p>To get the most out of this tutorial, you should be familiar with: <a href=\"https://www.smashingmagazine.com/2011/07/modern-version-control-with-git-series/\">Git</a>, <a href=\"https://docs.github.com/en/get-started/quickstart/github-flow\">GitHub</a> and <a href=\"https://www.smashingmagazine.com/2012/01/introduction-to-linux-commands/\">Linux and the command line</a>.</p>\nWhy Should You Care About High-Quality Documentation?\n<p>Many teams struggle with <strong>writing documentation</strong>. When you go to check a framework, the documentation will often be out of date or unclear. This can lead to internal frustration when a team member tries to add a feature, but they don’t understand how the current feature works because of poor documentation. This can lead to unproductive hours on the job.</p>\n<p>Poor documentation also compromises a good customer experience. According to Jeff Lawson, author of <em>Ask Your Developer</em> and founder of Twilio, if you are selling an API as a product, documentation is the <strong>ultimate advertisement for technical stakeholders</strong>. IBM did a study on the importance of documentation, and 90% of respondents admitted that they made their purchasing decisions based on the quality of a product’s documentation.</p>\n<p>Writing good documentation is important for the developer and customer experiences.</p>\nIf Documentation Is So Important, Then Why Do Engineering Teams Deprioritize It?\n<p>Writing documentation can break developers out of the “flow”. Documentation <strong>often lives outside of the main code base</strong>, and it is cumbersome to find and update. Putting it in an Excel spreadsheet or a proprietary CMS is not uncommon.</p>\n<p>Automating documentation and improving documentation workflow fixes this.</p>\nAutomating Documentation From a High Level\n<p>What does <em>automating</em> documentation mean? It means adopting common software development practices. When you automate documentation, you are:</p>\n<ul>\n<li>writing your documentation in Markdown;</li>\n<li>using a continuous integration and continuous deployment (CI/CD) pipeline to run tasks such as correcting errors and deploying updates (in this tutorial, we are going to highlight GitHub Actions);</li>\n<li>implementing tools like Vale to enforce a style guide and to correct common grammatical mistakes.</li>\n</ul>\nThe Style Guides\n<p>Before you use tools such as <a href=\"https://docs.errata.ai/vale/about\">Vale</a> and GitHub Actions to automate the style guide, let’s take a moment to define what exactly is a style guide.</p>\n<p>You know that feeling when you are writing documentation and something seems a little off? Your explanations don’t fit the rest of the documentation, but you can’t quite describe why they’re wrong. The writing explains the concept, but it doesn’t seem to fit.</p>\n<p>When you get this feeling, your <strong>voice and tone might be off</strong>. Refining the voice and tone is a way to make writing sound cohesive even if you are developing documentation that has been edited by the QA, engineering, and product teams. Below is an example style guide from the city bus application TAPP, taken from the book <a href=\"https://www.oreilly.com/library/view/strategic-writing-for/9781492049388/\"><em>Strategic Writing for UX</em></a> by Torrey Podmajersky.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ba6be772-ef8f-41dc-a824-96d01ea7c68b/image-000.png\" /></p>\n<p>TAPP is a transit application (for buses and trains). The header of the table announces TAPP’s values as a company, being efficient, trustworthy, and accessible. The left side of the table lists the different parts covered by the style guide: concepts, vocabulary, verbosity, grammar, and punctuation.</p>\n<p>Together, these make a <strong>style guide</strong>. The header introduces the values, and the left side of the table shows the different components that you would find in any written material: vocabulary, grammar, and punctuation. The beauty of this style guide is that engineers and copywriters will clearly know what capitalization to use and which punctuation to use in order to promote Tapp’s brand identity.</p>\n<h3>Technical Writing Style Guide</h3>\n<p>Not all style guides come in tables. Microsoft has a <a href=\"https://docs.microsoft.com/en-us/style-guide/welcome/\">whole website</a> that serves as a comprehensive guide, covering everything from acronyms to bias-free communication to chatbots. Microsoft of course isn’t the only company that has a style guide. <a href=\"https://developers.google.com/style\">Google has one</a>, too.</p>\n<h3>The Trouble With Style Guides</h3>\n<p>Style guides are a great starting point for companies that are serious about documentation. They solve a lot of the confusion that developers might have about how exactly to write about a major feature that they are pushing out.</p>\n<p>The problem with style guides is that they add friction to the writing process. Many writers, including me, don’t bother to stop writing and look at the style guide every time they have a question. Sometimes, a style guide is cumbersome and too difficult to reference — for instance, the <a href=\"https://opdhsblobprod03-secondary.blob.core.windows.net/contents/1b0c5ed94a6a4332b3ded83a8000ec2c/6ca9ae2be2407c744532364a00b292ab?sv=2018-03-28&amp;sr=b&amp;si=ReadPolicy&amp;sig=6sDQt45S3L%2B0BUtizPO83H4uZX7wxbhfVPv3Ea4IyBY%3D&amp;st=2021-07-28T15%3A05%3A16Z&amp;se=2021-07-29T15%3A15%3A16Z\">Microsoft Style Guide</a> is over a thousand pages long!</p>\nLinters and CI/CD for Documentation\n<p>If you are a programmer, then you are probably familiar with linters. Linters are an ideal way to <strong>enforce coding standards</strong> on your team. The same is true with documentation. When you create a linter, you are setting a benchmark of quality for your documentation. In this tutorial, we are going to use the <a href=\"https://docs.errata.ai/vale/about\">Vale linter</a>.</p>\n<p>Using some sort of documentation automation alongside a linter is common. When we say automation in this context, we’re referring to the <a href=\"https://www.freecodecamp.org/news/the-real-difference-between-ci-and-cd/\">continuous integration and continuous deployment</a> (CI/CD) workflow. CI automates the <strong>building and testing of documentation</strong>. CD automates the release of code.</p>\n<p>You can use many different types of apps to implement a CI/CD workflow. In this tutorial, we are going to use GitHub Actions to run our documentation linter. GitHub Actions run CI directly in a GitHub repository, so there is no need to use a third-party application, such as CircleCI or Travis.</p>\n<p>Finally, GitHub Actions are <em>event-driven</em>, which means they are triggered when something happens, such as when someone writes a pull request or an issue. In our example, a GitHub action will occur when someone pushes changes to their main branch.</p>\nGitHub Actions\n<p>First, create a <a href=\"https://docs.github.com/en/get-started/quickstart/create-a-repo\">GitHub repository</a>. Then, locally, create a folder and <code>cd</code> into it.</p>\n<pre><code>mkdir automated-docs\ncd automated-docs</code></pre>\n\n<p>Once you are in the folder, initialize the directory for Git.</p>\n<pre><code>git init</code></pre>\n\n<p>Once you have initialized the repository, proceed to create a workflow directory to your folder.</p>\n<pre><code>mkdir .github/ &amp;&amp; cd .github/ &amp;&amp; mkdir workflows/ &amp;&amp; cd workflows/</code></pre>\n\n<p>Workflows are where we will store all of our GitHub actions. Once you’ve created a <code>workflows</code> folder, make a new workflow. We are going to name this workflow <code>vale.yml</code>.</p>\n<pre><code>touch vale.yml</code></pre>\n\n<p><code>Vale.yml</code> is a YAML file. In this workflow file, we will include actions and jobs.</p>\n<p>Now, open <code>vale.yml</code> in your favorite text editor.</p>\n<pre><code>nano vale.yml</code></pre>\n\n<p>Copy and paste the following into <code>vale.yml</code>, and let’s go over the context and syntax.</p>\n<pre><code># This is a basic workflow to help you get started with Actions\n\nname: CI\n\n# Controls when the workflow will run\non:\n  # Triggers the workflow on push or pull request events but only for the main branch\n  push:\n    branches: [ main ]\n  pull_request:\n    branches: [ main ]\n\n  # Allows you to run this workflow manually from the Actions tab\n  workflow_dispatch:\n\n# A workflow run is made up of one or more jobs that can run sequentially or in parallel\njobs:\n  # This workflow contains a single job called \"build\"\n  build:\n    # The type of runner that the job will run on\n    runs-on: ubuntu-latest\n\n    # Steps represent a sequence of tasks that will be executed as part of the job\n    steps:\n      # Checks-out your repository under $GITHUB_WORKSPACE, so your job can access it\n      - uses: actions/checkout@v2\n\n      # Runs a single command using the runners shell\n      - name: Run a one-line script\n        run: echo Hello, world!\n\n      # Runs a set of commands using the runners shell\n      - name: Run a multi-line script\n        run: |\n          echo Add other actions to build,\n          echo test, and deploy your project.\n        env:\n          GITHUB_TOKEN: ${{secrets.GITHUB_TOKEN}}</code></pre>\n\n<ul>\n<li><code>name</code><br />This is the name, or what we are calling our workflow. It is a string.</li>\n<li><code>on</code><br />This controls the workflow and the triggers.</li>\n<li><code>jobs</code><br />This is where we set up and control our actions. We select the environment where our actions will run — it is usually a good bet to go with Ubuntu. And this is where we will add our actions.</li>\n</ul>\n<p>GitHub has a guide on all of the other workflow <a href=\"https://docs.github.com/en/actions/reference/workflow-syntax-for-github-actions\">syntax and variables</a>, in case you’re curious.</p>\n<p>In this section, we have:</p>\n<ul>\n<li>learned what GitHub actions are,</li>\n<li>created our first GitHub workflow,</li>\n<li>identified the most important parts of a GitHub workflow YAML file.</li>\n</ul>\n<p>Next, we are going to customize our GitHub workflow to use Vale.</p>\nSet Up Vale in GitHub Actions File\n<p>Once we’ve copied the base workflow file, it is time to customize it, so that we can start using Vale actions. The first thing to do is change the name of the YAML file to <code>Docs-Linting</code>.</p>\n<pre><code># This is a basic workflow to help you get started with Actions.\n\nname: Docs-Linting</code></pre>\n\n<p>Next, we want to run the Vale test once someone <strong>has pushed their changes</strong> to the main branch on GitHub. We don’t want the test to run when someone creates a pull request, so we’ll delete that part of the YAML file.</p>\n<pre><code>on:\n  # Triggers the workflow on push or pull request events but only for the main branch\n  push:\n    branches: [ main ]\n</code></pre>\n\n<p>The <code>jobs</code> section is the main part of the workflow file, and it is responsible for running the GitHub actions.</p>\n<pre><code>jobs:\n  build:\n    runs-on: ubuntu-latest\n    steps:\n    - name: Checkout\n      uses: actions/checkout@master</code></pre>\n\n<p>These actions are going to run on the latest version of Ubuntu. The <code>Checkout</code> action checks out the repository in order for the <a href=\"https://github.com/marketplace/actions/checkout\">GitHub workflow to access it</a>.</p>\n<p>Now it is time to add a Vale action to our GitHub workflow.</p>\n<pre><code>  - name: Vale\n      uses: errata-ai/vale-action@v1.4.2\n      with:\n        debug: true\n        styles: |\n          https://github.com/errata-ai/write-good/releases/latest/download/write-good.zip\n          https://github.com/errata-ai/Microsoft/releases/latest/download/Microsoft.zip\n\n      env:\n        GITHUB_TOKEN: ${{secrets.GITHUB_TOKEN}}</code></pre>\n\n<p>We have named our action <code>Vale</code>. The <code>uses</code> variable shows which version of Vale we’re going to implement — ideally, we should use the most recent version. In the <code>with</code> variable, we set <code>debug</code> to <code>true</code>.</p>\n<p>The <code>styles</code> section gives us the option to add a style guide to Vale. In this example, we are going to use <code>write-good</code> and Microsoft’s official style guide. Keep in mind that we can use <a href=\"https://github.com/errata-ai/styles#available-styles\">other style guides</a> as well.</p>\n<p>The final part of this GitHub action is <code>env</code>. In order to run this GitHub action, we need to include a <a href=\"https://docs.github.com/en/github/authenticating-to-github/keeping-your-account-and-data-secure/creating-a-personal-access-token\">secret token</a>.</p>\n<p>This is what the result should look like:</p>\n<pre><code># This is a basic workflow to help you get started with Actions.\n\nname: Docs-Linting\n\n# Controls when the action will run.\non:\n  # Triggers the workflow on push or pull request events but only for the main branch\n  push:\n    branches: [ main ]\n\n  # Allows you to run this workflow manually from the Actions tab\n  workflow_dispatch:\n\njobs:\n  prose:\n    runs-on: ubuntu-latest\n    steps:\n    - name: Checkout\n      uses: actions/checkout@master\n\n    - name: Vale\n      uses: errata-ai/vale-action@v1.4.2\n      with:\n        debug: true\n        styles: |\n          https://github.com/errata-ai/write-good/releases/latest/download/write-good.zip\n          https://github.com/errata-ai/Microsoft/releases/latest/download/Microsoft.zip\n\n      env:\n        GITHUB_TOKEN: ${{secrets.GITHUB_TOKEN}}</code></pre>\n\n<p>Once you’ve finished making changes, save the file, commit to Git, and push your changes to GitHub.</p>\n<pre><code>git add .github/workflows/vale.yml\ngit commit -m \"Added github repo to project\"\ngit push -u origin main</code></pre>\n\n<p>To recap, in this section, we have:</p>\n<ul>\n<li>triggered the action to occur when we push new code to the <code>main</code> branch;</li>\n<li>added a Vale action, setting <code>debug</code> to <code>true</code> and identifying style guides;</li>\n<li>added a GitHub token;</li>\n<li>committed changes and pushed to GitHub.</li>\n</ul>\n<p>In the next section, we are going to create a Vale configuration file.</p>\nSetting Up Vale Configuration File\n<p>Go to the root of your project’s directory, and then <code>touch .vale.ini</code>. Open <code>.vale.ini</code> in a text editor. Copy and paste the following into <code>.vale.ini</code>:</p>\n<pre><code>StylesPath = .github/styles\nMinAlertLevel = warning\n\n[formats]\nMarkdown = markdown\n\n[*.md]\nBasedOnStyles = write-good, Microsoft</code></pre>\n\n<ul>\n<li><code>StylesPath = .github/styles</code><br />The <code>StylesPath</code> gives the path of the Vale styles.</li>\n<li><code>MinAlertLevel = warning</code><br />The minimum alert level shows the scale of severity in alerts. The options are <code>suggestion</code>, <code>warning</code>, and <code>error</code>.</li>\n<li><code>[formats]</code><br /><code>Markdown = markdown</code> sets the format as Markdown.</li>\n<li><code>[*.md]</code><br />The configuration <code>BasedOnStyles = write-good, Microsoft</code> will run write-good and the Microsoft style guide on all Markdown files ending with <code>.md</code>.</li>\n</ul>\n<p>This set-up is the bare minimum. If you are interested in learning more about configuring Vale, head over to <a href=\"https://errata-ai.github.io/vale-server/docs/ini\">the documentation</a>.</p>\n<p>When you are finished making changes, save the file, and commit and push to GitHub.</p>\n<pre><code>git add .vale.ini\ngit commit -m \"Added Vale config file\"\ngit push -u origin main</code></pre>\n\n<p>In this part, we’ve learned the internals of a Vale configuration file. Now it’s time to create sample documentation.</p>\nCreating Documentation and Triggering the Vale GitHub Actions\n<p>Now it is time to see Vale and GitHub Actions in action! We are going to create a Markdown file and fill it with text. And we are going to get our text from <a href=\"https://satoristudio.net/delorean-ipsum/\">DeLorean Ipsum</a>.</p>\n<p>Go to the root of your project, and then <code>touch getting-started.md</code>. Once you’ve created the <code>getting-started</code> file, go to DeLorean Ipsum and create some dummy text for your documentation. Then, return to your text editor and paste the text in <code>getting-started-md</code>.</p>\n<pre><code># Getting Started Guide\n\nI can’t play. It’s my dad. They’re late. My experiment worked. They’re all exactly twenty-five minutes slow. Marty, this may seem a little foreward, but I was wondering if you would ask me to the Enchantment Under The Sea Dance on Saturday. Well, they’re your parents, you must know them. What are their common interests, what do they like to do together?\n\nOkay. Are you okay? Whoa, wait, Doc. What, well you mean like a date? I don’t wanna see you in here again.\n\nNo, Biff, you leave her alone. Jesus, George, it’s a wonder I was ever born. Hey, hey, keep rolling, keep rolling there. No, no, no, no, this sucker’s electrical. But I need a nuclear reaction to generate the one point twenty-one gigawatts of electricity that I need. I swiped it from the old lady’s liquor cabinet. You know Marty, you look so familiar, do I know your mother?</code></pre>\n\n<p>Save the file, commit it, and push it to GitHub.</p>\n<pre><code>git add getting-started.md\ngit commit -m \"first draft\"\ngit push -u origin main</code></pre>\n\n<p>Once you’ve pushed the changes, head over to GitHub where your repository is located. Go to the <code>Actions</code> tab.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/68266575-8f47-415b-9c91-7004a02944ee/action-github-1.png\" /></p>\n<p>You will see all of your workflows on the left side. We have only one, named <code>Docs-Linting</code>, the same name we put in the <code>vale.yml</code> file.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a6856ea8-673a-45ac-aa5b-41c85dca993b/3-automate-documentation-workflow-for-developers.png\" /></p>\n<p>When we push the documentation to GitHub, we will trigger the action.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7f83a888-de1c-4ebd-bad1-82ae70e01768/4-automate-documentation-workflow-for-developers.png\" /></p>\n<p>If the action has run without any problems, we will get a green checkmark.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bbfcbebe-ba94-43d8-8022-b6b489bc0581/5-automate-documentation-workflow-for-developers.png\" /></p>\n<p>Click on “Added docs” to get a full report.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a21c8644-a3a1-4aae-a4fe-25fb11a4ed15/weasel-word-1.png\" /></p>\n<p>You will see that we got 11 warnings. Let’s deal with the “<a href=\"https://www.merriam-webster.com/dictionary/weasel%20word\">weasel word</a>” warning. Go back to the text editor, open <code>getting-started.md</code>, and delete the word “exactly”.</p>\n<pre><code># Getting Started Guide\n\nI can’t play. It’s my dad. They’re late. My experiment worked. They’re all twenty-five minutes slow. Marty, this may seem a little foreward, but I was wondering if you would ask me to the Enchantment Under The Sea Dance on Saturday. Well, they’re your parents, you must know them. What are their common interests, what do they like to do together?\n\nOkay. Are you okay? Whoa, wait, Doc. What, well you mean like a date? I don’t wanna see you in here again.\n\nNo, Biff, you leave her alone. Jesus, George, it’s a wonder I was ever born. Hey, hey, keep rolling, keep rolling there. No, no, no, no, this sucker’s electrical. But I need a nuclear reaction to generate the one point twenty-one gigawatts of electricity that I need. I swiped it from the old lady’s liquor cabinet. You know Marty, you look so familiar, do I know your mother?</code></pre>\n\n<p>Save the changes, commit it to Git, and push the new version of the file to GitHub. It should <strong>trigger the GitHub action</strong>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/657f3547-d7a3-4642-b846-6e90fa9d217b/7-automate-documentation-workflow-for-developers.png\" /></p>\n<p>If we click on “Deleted the weasel word”, we will see that we have only 10 warnings now, and the “weasel word” warning is gone. Hooray!</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/337c2c6f-8195-42cb-b0c1-ff09b6eaded3/annotations-10-warnings-1.png\" /></p>\n<p>We are finished, and we’ve covered a lot of ground. In this section, we have:</p>\n<ul>\n<li>added documentation to our Vale GitHub Actions repository,</li>\n<li>triggered the Vale GitHub action,</li>\n<li>corrected an error produced by Vale and pushed the change back to GitHub.</li>\n</ul>\nConclusion\n<p>In a world that is increasingly going remote, prioritizing <strong>good documentation</strong> and good documentation workflow is important. You first have to define what “good” is by creating a style guide. Once you’ve figured out the rules of your documentation, then it’s time to automate.</p>\n<p>Documentation should be treated like your code base: a living body of work that is constantly being iterated and becoming a bit better than the last time you updated it.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"eaa0577d2a852f6a030827d17d4fd7868c90cc9b09098f8efb7384d40c034937","category":"Tech"}