{"title":"iOS 17.4 has arrived with major App Store changes, new emoji, and more","link":"https://www.macworld.com/article/2218208/ios-17-4-alternative-app-stores-emoji-fixes-security-updates-install.html","date":1709662586000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you live in the European Union, iOS 17.4 is a massive upgrade. Apple began beta-testing the update on January 25 and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2024/01/apple-announces-changes-to-ios-safari-and-the-app-store-in-the-european-union/&amp;xcust=1-1-2218208-1-0-0&amp;sref=https://www.macworld.com/feed\">outlined many of the changes</a> that affect the apps and App Store experience on the iPhone. The primary aim of this release is to comply with the Digital Markets Act in the EU, which has a deadline of March 6. Apple has released the update just before that date.</p>\n\n\n\n<p>There are some 600 new APIs, expanded app analytics, functionality for alternative browser engines, access to NFC for mobile payment systems, and options for processing app payments and distributing iOS apps outside the App Store. Apple has a new payment and commissions structure for apps released outside the App Store or who use payment systems other than Apple’s, which some developers have taken exception to.</p>\n\n\n\n<p><em><strong>Updated March 5:</strong> Everyone can now download and install the final release of iOS 17.4.</em></p>\n\n\n\n<h2>iOS 17.4: Big new app distribution changes for the EU</h2>\n\n\n\n<p>An <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2024/01/apple-announces-changes-to-ios-safari-and-the-app-store-in-the-european-union/&amp;xcust=1-1-2218208-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple press release</a> goes over all the changes meant for the EU and they are major, bringing alternative app stores and payments, along with a host of other changes, including:</p>\n\n\n\n<ul>\n<li><strong>New options for distributing iOS apps from alternative app marketplaces</strong>: New APIs and tools that enable developers to offer their iOS apps for download from alternative app marketplaces.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>New framework and APIs for creating alternative app marketplaces</strong>: Marketplace developers can install apps and manage updates on behalf of other developers from their dedicated marketplace app.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>New frameworks and APIs for alternative browser engines</strong>: Developers can use browser engines, other than WebKit, for browser apps and apps with in-app browsing experiences.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>Interoperability request form</strong>: Developers can submit additional requests for interoperability with iPhone and iOS hardware and software features.</li>\n</ul>\n\n\n\n<p>There are new app safety features as well, meant to mitigate the risks Apple says are inherent in getting apps from places other than the App Store:</p>\n\n\n\n<ul>\n<li><strong>Notarization for iOS apps</strong>: A baseline review that applies to all apps, regardless of their distribution channel, focused on platform integrity and protecting users. Notarization involves a combination of automated checks and human review. </li>\n</ul>\n\n\n\n<ul>\n<li><strong>App installation sheets</strong>: Use information from the Notarization process to provide at-a-glance descriptions of apps and their functionality before download, including the developer, screenshots, and other essential information.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>Authorization for marketplace developers</strong>: Ensures marketplace developers commit to ongoing requirements that help protect users and developers.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>Additional malware protections</strong>: Prevents iOS apps from launching if they’re found to contain malware after being installed on a user’s device.</li>\n</ul>\n\n\n\n<h2>iOS 17.4: General new features</h2>\n\n\n\n<p>Other features in the beta for U.S. users and the rest of the world include:</p>\n\n\n\n<p><strong>Apple Cash virtual card numbers:</strong> iOS 17.4 makes it easier to spend money from your <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2024/02/11/apple-cash-virtual-card-number-feature/&amp;xcust=1-1-2218208-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple Cash account</a> by assigning a virtual card number, which can be used as a prepaid debit card when Apple Pay isn’t available.</p>\n\n\n\n<p><strong>New emojis:</strong> A number of <a href=\"https://www.macworld.com/article/2218281/new-emoji-ios-17-4-broken-chain-mushroom-lime-right-facing.html\">new emojis</a>, from the Emoji 15.1 standard, are present in iOS 17.4.</p>\n\n\n\n<p><strong>Apple Music “Home” tab:</strong> The tab formerly labeled “Listen Now” has been renamed “Home.”</p>\n\n\n\n<p><strong>Stolen Device Protection:</strong> Users can now choose to <em>always</em> require a delay when changing security settings, not just when away from familiar locations.</p>\n\n\n\n<p><strong>Podcast transcripts:</strong> The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://podcasters.apple.com/support/5316-transcripts-on-apple-podcasts&amp;xcust=1-1-2218208-1-0-0&amp;sref=https://www.macworld.com/feed\">Podcast app will provide transcripts</a> in English, French, German, and Spanish for podcast episodes. They can be auto-generated, or podcast publishers can supply their own.</p>\n\n\n\n<p><strong>Stopwatch live activity:</strong> There’s now a Live Activity when you have a stopwatch running.</p>\n\n\n\n<p><strong>CarPlay instrument cluster experience:</strong> In supported vehicles, CarPlay will display information about upcoming maneuvers. Users will be able to swap between the main and instrument cluster screens by tapping the map configuration button on the upper right of the Maps app main screen.</p>\n\n\n\n<p><strong>Battery settings UI tweaks</strong>: For the iPhone 15 series, Apple is including a “Battery Health” listing that displays the battery’s condition. For example, if the battery has no issues, the listing displays “Normal.” Tapping the Battery Health listing shows a section that displays the Maximum Capacity, Cycle Count, Manufacture Date, and First Use.</p>\n\n\n\n<p><strong>iMessage post-quantum cryptography:</strong> Apple has <a href=\"https://www.macworld.com/article/2243580/imessage-security-protocol-post-quantum-cryptography-level-3.html\">announced</a> “the most significant cryptographic security upgrade in iMessage history” using PQ3, a groundbreaking post-quantum cryptographic protocol that advances the state of the art of end-to-end secure messaging.</p>\n\n\n\n<h2>iOS 17.4: Security updates</h2>\n\n\n\n<p>The release of iOS 17.4 contains <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT214081&amp;xcust=1-1-2218208-1-0-0&amp;sref=https://www.macworld.com/feed\">several security updates</a>. Apple has listed four of them affecting Accessibility, Kernel, RTKit, and Safari Private Browsing, but says additional CVE entries are coming soon, likely when macOS 14.4 arrives next week. The Kernel and RTKit entry both say Apple is aware of a report that this issue may have been exploited.</p>\n\n\n\n<h2>iOS 17.4: Release notes</h2>\n\n\n\n<blockquote>\n<p>Apple’s official release notes for iOS 17.4 in the U.S. describe several new features coming to the iPhone.</p>\n\n\n\n<p><strong>Emoji</strong></p>\n\n\n\n<ul>\n<li>New mushroom, phoenix, lime, broken chain, and shaking heads emoji are now available in the emoji keyboard</li>\n\n\n\n<li>18 people and body emoji add the option to face them in either direction</li>\n</ul>\n\n\n\n<p><strong>Apple Podcasts</strong></p>\n\n\n\n<ul>\n<li>Transcripts let you follow an episode with text that highlights in sync with the audio in English, Spanish, French and German</li>\n\n\n\n<li>Episode text can be read in full, searched for a word or phrase, tapped to play from a specific point and used with accessibility features such as Text Size, Increase Contrast, and VoiceOver</li>\n</ul>\n\n\n\n<p><strong>This update includes the following enhancements and bug fixes:</strong></p>\n\n\n\n<ul>\n<li>Music recognition lets you add songs you have identified to your Apple Music Playlists and Library, as well as Apple Music Classical</li>\n\n\n\n<li>Siri has a new option to announce messages you receive in any supported language</li>\n\n\n\n<li>Stolen Device Protection supports the option for increased security in all locations</li>\n\n\n\n<li>Battery Health in Settings shows battery cycle count, manufacture date, and first use on iPhone 15 and iPhone 15 Pro models</li>\n\n\n\n<li>Call Identification displays Apple-verified business name, logo, and department name when available</li>\n\n\n\n<li>Business updates in Messages for Business provide trusted information for order status, flight notifications, fraud alerts or other transactions you opt into</li>\n\n\n\n<li>Apple Cash virtual card numbers enable you to pay with Apple Cash at merchants that don’t yet accept Apple Pay by typing in your number from Wallet or using Safari AutoFill</li>\n\n\n\n<li>Fixes an issue where contact pictures are blank in Find My</li>\n\n\n\n<li>Fixes an issue for Dual SIM users where the phone number changes from primary to secondary and is visible to a group they have messaged</li>\n</ul>\n</blockquote>\n\n\n\n<p>The release will also include several security updates that will be published when the public release arrives next week.</p>\n\n\n\n<h2>How to install iOS 17.3</h2>\n\n\n\n<p>You will probably be prompted to install iOS 17.4 eventually, but that can take days or even weeks. If you want to update right away, follow these steps:</p>\n\n\n\n<ol>\n<li>Open <em>Settings</em>.</li>\n\n\n\n<li>Tap <em>General</em>.</li>\n\n\n\n<li>Tap <em>Software Update</em>.</li>\n\n\n\n<li>You’ll see the update appear, tap <em>Download and Install</em> (or <em>Install Now</em> if your iPhone has already downloaded it).</li>\n\n\n\n<li>You’ll need to enter your passcode and your iPhone will restart after the installation downloads and installs.</li>\n</ol>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"eaa53520732e4cc1b1399ae70252941fe8c0e9805376ef93a7d0c4cabaaa4261","category":"Apple"}