{"title":"A common chord: to what extent can small urban green space support people and songbirds?","link":"https://academic.oup.com/jue/article/doi/10.1093/jue/juae009/7696411?rss=1","date":1718755200000,"content":"<span><div>Abstract</div>Large, vegetatively diverse, and connected green space is often considered essential to conservation. Yet, these criteria can be impractical when applied to densely populated or under-resourced urban areas and evoke mixed sentiments from people. Conventional urban green space is often smaller, minimally vegetated, and contains open mowed areas that are inadequate for many wildlife species and fail to provide opportunities for nature connection in biodiverse environments. As songbirds are well liked and globally distributed, they present an opportunity to rethink urban green spaces, particularly small urban green spaces, that contain landscape qualities where the needs of people and songbirds converge. We conducted a comprehensive search of peer-reviewed publications to examine the natural, structural, and anthropogenic factors associated with songbird richness in small (&lt;2 ha) urban green spaces. Overall, small urban green spaces that incorporated a variety of habitats and native plant species, particularly trees, supported songbird richness. In some cases, songbird richness in small green spaces was equivalent to richness reported in larger green spaces. Interestingly, connectivity between green spaces was not significant in the majority of articles that examined the factor. This outcome removes a possible obstruction to green space allocation and has the potential to jumpstart the placement of green space into historically and perpetually under-resourced communities. Finally, associations with anthropogenic factors had few positive associations with songbird richness, but this category of factors was also reported the least often. Collectively, these results provide feasible options to improve human health, nature connections, and songbird conservation.</span>","author":"","siteTitle":"Journal of Urban Ecology Current Issue","siteHash":"b2629340d80db12a388ca36fcbfe9116474ee0004e4144e67708fd2b8d69c975","entryHash":"eaa95eafbe78294313642553c844801c46638397e709b981e0d27df0e2da1cce","category":"Environment"}