{"title":"Abiotic factors that prompt major ecological transitions: Are fish on land to escape an intolerable aquatic environment?","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14672?af=R","date":1729235034000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/59ef31f0-0851-4890-bd1a-b1ba28b5c09b/fec14672-toc-0001-m.png\" alt=\"Abiotic factors that prompt major ecological transitions: Are fish on land to escape an intolerable aquatic environment?\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/01/abiotic-factors-that-prompt-major-ecological-transitions-are-fish-on-land-to-escape-an-intolerable-aquatic-environment/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nColonisation of novel habitats are important events in evolution, but the factors that initially prompt such ecological transitions are often unknown. The invasion of land by fish is an extreme habitat transition that offers an opportunity to empirically investigate the causes of major ecological transitions.\n\nThe intertidal ecotone—and rock pools in particular—have been an important staging ground for transitions onto land. Classic hypotheses focus on the adverse abiotic conditions of rock pools at low tide as the instigator of fish voluntarily stranding themselves out of water, which can then lead to the evolution of an amphibious lifestyle. To test these hypotheses, we studied the abiotic conditions of 54 rock pools on the island of Guam where there are various species of aquatic, amphibious and terrestrial blenny fishes.\n\nWe found little support for the expected deterioration of abiotic conditions in standing pools at low tide (salinity, pH and oxygen), and fish were not seen to be excluded from those pools that were found to exhibit poor abiotic conditions (temperature, salinity and pH). Hypoxia was the only factor that might account for the absence of blennies from certain rock pools.\n\nNext, we experimentally measured oxygen depletion by an aquatic, mildly amphibious and highly amphibious species of blenny found on Guam in a simulated rockpool to infer the proportion of rock pools at low tide outside the tolerable range of blennies. Rock pools were found to have oxygen levels within the requirements of most blennies and those of other marine fishes reported in the literature.\n\nWe conclude that the abiotic environment of rock pools alone was unlikely to have instigated the evolution of amphibious behaviour in blennies, at least on Guam. Instead, the broad range of abiotic conditions experienced in rock pools suggests these conditions could have primed amphibious blennies to better endure the novel conditions on land. Any ecotone typified by fluctuations or gradients in abiotic conditions is likely a key transitional environment for the invasion of novel habitats and, as such, are an important location for adaptive evolution and species diversification.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/10/01/abiotic-factors-that-prompt-major-ecological-transitions-are-fish-on-land-to-escape-an-intolerable-aquatic-environment/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Terry J. Ord, \nElizabeth A. Surovic, \nDiego F. B. Vaz, \nIker Irisarri","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"eab418ab9ae89f8a7fc2745b03336bd48b8bfd8f37fe51fe13e42907fc87b706","category":"Environment"}