{"title":"Apple Reportedly Demoed Mixed-Reality Headset to Executives in the Steve Jobs Theater Last Week","link":"https://www.macrumors.com/2023/03/26/apple-demoed-headset-in-the-steve-jobs-theater/","date":1679835213000,"content":"Apple showcased its mixed-reality headset to the company's top 100 executives in the Steve Jobs Theater last week, according to <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a>.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/02/apple-mixed-reality-headset-concept-by-david-lewis-and-marcus-kane.jpg\" alt width=\"1600\" height=\"900\" /><em>Apple headset concept by <a href=\"https://twitter.com/Dtalkingtech\">David Lewis</a> and <a href=\"https://twitter.com/marcusckane\">Marcus Kane</a></em></div>\r<br />\nIn the latest edition of his <a href=\"https://www.bloomberg.com/authors/AS7Hj1mBMGM/mark-gurman\">\"Power On\" newsletter</a>, Gurman explained that the \"momentous gathering\" is a \"key milestone\" ahead of the headset's public announcement planned for June. The event was intended to rally Apple's top members of staff around the company's next major platform.\r<br />\n\r<br />\nSenior Apple executives have apparently got a peek at the headset every year since 2018, but these demonstrations were discreet looks at the project's progress rather than showcases of the complete device. Situated at the Steve Jobs Theater, latest preview was reportedly a far more significant event, being \"polished, glitzy, and exciting.\"\r<br />\n\r<br />\nWhile anticipation of the device's launch is growing inside Apple, Gurman added that the device is likely to launch with several potential issues:<blockquote>Moreover, the device will start at around $3,000, lack a clear killer app, require an external battery that will need to be replaced every couple of hours and use a design that some testers have deemed uncomfortable. It's also likely to launch with limited media content. </blockquote>As a result, Apple executives are said to be \"striking a realistic tone within the company\" with the understanding that \"this isn't going to be a hit product right out of the gate,\" potentially following a similar trajectory as the Apple Watch instead.\r<br />\n\r<br />\nThe first version of the device \"will look like a dud next to the company's existing products,\" Gurman believes, but it is still \"likely to make Apple the market leader in mixed reality within a few months.\" Executives expect consumer interest to grow as subsequent iterations of the headset launch at lower price points in the future.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ar-vr/\">AR/VR Headset</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">Bloomberg</a>, <a href=\"https://www.macrumors.com/guide/steve-jobs-theater/\">Steve Jobs Theater</a>, <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/26/apple-demoed-headset-in-the-steve-jobs-theater/\">Apple Reportedly Demoed Mixed-Reality Headset to Executives in the Steve Jobs Theater Last Week</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-reportedly-demoed-mixed-reality-headset-to-executives-in-the-steve-jobs-theater-last-week.2384826/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"eabf96425c5417e80d1879710d6f6a88aa6e5071a08577c6da68fd852f58860f","category":"Apple"}