{"title":"Exploring the Potential of Seed‐Based Dwarf Eelgrass (Zostera noltii) Restoration","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4235?af=R","date":1726238397000,"content":"<h2>ABSTRACT</h2>\n<p>\n\nDwarf eelgrass, <i>Zostera noltii</i>, is an important ecosystem engineer that creates dense meadows along the coasts of Europe and Northwest Africa. During the last century, this seagrass species suffered severe population declines, and to counteract these losses, restoration has emerged as an important management tool. Thus far, restoration efforts with <i>Z. noltii</i> have only been performed with shoot- and core-based methods, which are challenging to upscale sustainably.\n\nHere, we explored if <i>Z. noltii</i> can be restored with seeds, thus potentially offering an upscalable solution for future restoration efforts. With the newly developed dispenser injection seeding (DIS) method, we tried seed-based <i>Z. noltii</i> restoration in the intertidal Wadden Sea. With a field experiment, we investigated how seeding depth (1.5 and 3 cm) and seed amount (5, 10 and 20 seeds/injection) affected <i>Z. noltii</i> recruitment success and efficiency.\n\nMost importantly, our results show that <i>Z. noltii</i> can be restored with seeds, as 3 months after seeding, 184 individual patches had emerged from our 7000 seeds (2.6% recruitment). Recruitment success (number of restored patches/plot) was enhanced by higher seed amounts (20 &gt; 5 seeds/injection), while the opposite was true for recruitment efficiency (number of restored patches/seed), which was reduced by higher seed amounts (20 &lt; 5 seeds/injection). Restored <i>Z. noltii</i> survived the first winter in all experimental plots, but seagrass cover (square metre/plot) reduced in two-thirds of the plots compared to the first growing season.\n\nIn conclusion, our findings show the potential of seed-based <i>Z. noltii</i> restoration and provide insights on how upscaling of restoration efforts for this species can be performed more efficiently and sustainably in the future.\n</p>","author":"Max L. E. Gräfnings, \nNadia Hijner, \nJannes H. T. Heusinkveld, \nMaarten Zwarts, \nGabriela Maldonado, \nHenk Wiersema, \nRaven Cammenga, \nQuirin Smeele, \nTjisse van der Heide, \nLaura L. Govers","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"eac15316d47f36a90e3c58f7d69c493dc8e7d33807e6e40c520e39e5388866fd","category":"Environment"}