{"title":"Analysts say Mac sales are down 40% as post-pandemic PC sales slump continues","link":"https://arstechnica.com/?p=1930357","date":1681136273000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/IMG_0919-800x400.jpeg\" alt=\"Apple's M2 Pro Mac mini.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/IMG_0919.jpeg\">Enlarge</a> <span>/</span> Apple's M2 Pro Mac mini. (credit: Andrew Cunningham)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The analysts at IDC have released their worldwide PC sales numbers for the first quarter of 2023, and <a href=\"https://www.idc.com/getdoc.jsp?containerId=prUS50565723\">the news isn't good for PC companies</a>. IDC says that all the companies combined shipped 56.9 million PCs in Q1 of 2023, down 29 percent from Q1 of 2022, when pandemic-era demand for new computers <a href=\"https://www.idc.com/getdoc.jsp?containerId=prAP49019122\">was just beginning to fade</a>. Apple's Mac sales are often immune to these kinds of fluctuations, but IDC says the company was hit particularly hard this quarter, with shipments falling from 6.9 million units in Q1 of 2022 to 4.1 million units in Q1 of 2023. That's a drop of 40.5 percent, more than that seen by Lenovo, HP, Dell, Asus, and all the companies lumped in with \"Others\" in IDC's data.</p>\n<p>IDC <a href=\"https://www.idc.com/getdoc.jsp?containerId=prUS50031623\">has noted</a> that PC demand through 2022 was still higher than pre-pandemic levels, despite falling from the highs seen in 2020 and 2021. But the first quarter of 2023 shows \"at least a temporary return to pre-COVID patterns.\" That pattern, for those who don't remember, was one of a long, slow decline as people replaced PCs less often and did more of their computing on smartphones and other devices. IDC says PC makers shipped 60.6 million PCs in Q1 of 2018 and 59.2 million PCs in Q1 of 2019.</p>\n\n<p>IDC data should be taken with a grain of salt; these are guesses about sales based on available data. Apple doesn't release Mac unit sales as part of its financial reports anymore, but its Mac revenue numbers usually don't quite line up with IDC's unit sales figures, even though the broad trendlines are similar.</p></div><p><a href=\"https://arstechnica.com/?p=1930357#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1930357&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"eac4db0f56b2fd643b891a11f219a1b1d4431f8a2260c30fd1c44cd5a4b9d411","category":"Tech"}