{"title":"Xiaomi Smart Glasses ก็มา แว่นตาอัจฉริยะพร้อมจอ MicroLED รับสาย ถ่ายรูป แปลภาษาได้","link":"https://www.blognone.com/node/124733","date":1631587090000,"content":"<div><div><div><p>เปิดตัว Xiaomi Smart Glasses แว่นตาอัจฉริยะตัวแรกของแบรนด์ Xiaomi รูปลักษณ์เป็นแว่นดำคลาสสิค น้ำหนัก 51 กรัมตัวแว่นมีหน้าจอ  MicroLED ขนาดเล็ก พอดีกับพื้นที่แว่น แสดงการแจ้งเตือนต่างๆ เช่น ข้อความเข้า สายเข้า ดูพิกัดสถานที่ หรือแม้แต่ถ่ายรูปก็ได้</p>\n<p>Xiaomi Smart Glasses มาพร้อมชิปแสดงผลขนาด 2.4 มม. x 2.02 มม. ตัวจอแสดงผล MicroLED นั้นทาง Xiaomi ระบุว่าใช้เทคโนโลยีการหักเหแสงในแบบโครงสร้างกล้องจุลทรรศน์ เพื่อส่งข้อมูลมายังสายตาของเรา นอกจากนี้ยังมีผู้ช่วยอัจฉริยะ XiaoAI ที่ช่วยคัดกรองการแจ้งเตือนที่จำเป็นสำหรับผู้ใช้งานจริงๆ ไม่แสดงการแจ้งเตือนทั้งหมด เช่น แสดงการแจ้งเตือนจากระบบ Smart Home, ข้อความด่วนจากที่ทำงาน เป็นต้น</p>\n<p>ตัวแว่นตาติดตั้งไมโครโฟนและลำโพงในตัว ผู้ใช้งานจึงสามารถรับสายเข้าและพูดคุยได้ ด้านหน้ามีกล้องความละเอียด 5 MP และยังมีระบบแปลงเสียงเป็นข้อความ แปลภาษาเรียลไทม์ได้ด้วยตามที่ Xiaomi บอก</p>\n<p>Xiaomi Smart Glasses ใช้ชิป ARM แบบ Quad-core, มีแบตเตอรี่ในตัว, มีทัชแพด, Wi-Fi/Bluetooth, ระบบปฏิบัติการ Android OS ยังไม่ระบุราคา การวางจำหน่ายว่าจะมีจำหน่ายนอกจีนหรือไม่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/81564735a703b43272cd238125969811.jpg\" /><br />\nภาพจาก @leijun</p>\n<blockquote><p>Introducing Xiaomi Smart Glasses! Though at first glance these seem just ordinary glasses, MicroLED optical waveguide imaging technology puts a display in front of your eyes, for our smartest viewing experience yet. <a href=\"https://t.co/CoP8t5GNH6\">pic.twitter.com/CoP8t5GNH6</a></p>\n<p>— leijun (@leijun) <a href=\"https://twitter.com/leijun/status/1437596967811620865?ref_src=twsrc%5Etfw\">September 14, 2021</a></p></blockquote>\n<p>ที่มา - <a href=\"https://www.xda-developers.com/xiaomi-smart-glasses-announced/\">XDA Developer</a>, <a href=\"https://www.gsmarena.com/xiaomi_announces_smart_glasses_as_a_wearable_device_concept-news-50910.php\">GSMArena</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/xiaomi\">Xiaomi</a></div><div><a href=\"/topics/smartglass\">SmartGlass</a></div><div><a href=\"/topics/hardware\">Hardware</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"eac686c900a74538a1e72d980bfb0f87fa39d15dbdd918fc255a9dcd11165ebc","category":"Thai"}