{"title":"Continental-scale migration patterns and origin of Helicoverpa zea (Lepidoptera: Noctuidae) based on a biogeochemical marker","link":"https://academic.oup.com/ee/article/53/3/487/7650014?rss=1","date":1713398400000,"content":"<span><div>Abstract</div>Insect migrations have ecological and economic impacts, particularly in agriculture. However, there is limited knowledge about the migratory movements of pests at the continental scale, which is an important factor influencing the spread of resistance genes. Understanding the migratory patterns of economic pests, like <span>Helicoverpa zea</span> (Boddie), is essential for improving Integrated Pest Management (IPM) and Insect Resistance Management (IRM) strategies. In this study, we used stable hydrogen isotopic ratios in wing tissue as a biogeochemical marker to examine migratory patterns and estimate the native origins of <span>H. zea</span> individuals collected across a wide latitudinal gradient in North America. Samples collected at higher latitudes (Ontario, Canada and Minnesota, USA) exhibited a greater proportion (60%–96%) of nonlocal individuals, with an increased probability of origin from the southeastern United States. Populations from mid-latitudes (Florida, North Carolina, and South Carolina) showed a blend of local and nonlocal (40%–60%) individuals. Finally, 15% of the southernmost population individuals (Puerto Rico) were classified as migratory, with some having a probability of origin at higher latitudes (&gt;30°). Overall, our results provide evidence of a northward spring/summer migration of <span>H. zea</span> in North America and underscore the significance of the southeastern United States as a hub for genetic flow. In addition, based on stable hydrogen isotopic ratios, there is strong evidence of reverse (southward) migration of <span>H. zea</span> from the continental United States to Puerto Rico. Our study highlights the implications for IPM and IRM programs and the need for management strategies that account for both northward and southward migration patterns.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"eac901146c8e58a2f67216a7f2ccfe9b1b54726862ed0a100540b595295414e4","category":"Environment"}