{"title":"Vision TC 40 Disc wheelset review","link":"https://www.cyclist.co.uk/reviews/9941/vision-tc-40-disc-wheelset-review","date":1627568157000,"content":"<span>\n      <span><a href=\"/authors/marc-abbott\">Marc Abbott</a></span>\n  </span><div>  \n  <div>      <div><span>Thursday, August 5, 2021 - 07:50</span></div>    </div></div><p>\nVision's TC 40 disc wheelset offer an aero carbon upgrade for sensible money</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/07/vision_tc_40_disc_wheelset_1.jpg?itok=63cEmteZ\" />  </div>\n<div>  \n  <div>      <div><div>  \n  <div>\n    <div>\n      <div></div>\n    </div>\n  </div>\n      <span>\n      <strong>4.5</strong>\n      / <span>5</span>\n    </span>\n  \n</div>\n</div>    </div></div><div>  \n  <div>      <div>£799.90</div>    </div></div><div>\n      <p> I’m old enough to remember the days when a set of aero carbon wheels would cost the same as a complete carbon road bike does in 2021. But, as advances in manufacturing efficiency make carbon-fibre more ‘affordable’, and as bike component manufacturers trickle down their learnings from higher end products to entry-level wheelsets, the world of ‘strong yet light’ becomes more accessible to a growing number of cyclists.</p>\n<p>The Vision TC 40 Disc carbon wheelset that’s been rolling on the thru-axles of a Giant TCR Advanced Pro 0 testbed over the past two months comes in at £799.90 – on paper, that looks like very decent value for money. But only if it’s improved the performance of the bike, the enjoyment of the rider, and has proved to be less brittle than the carbon wheels of yore.</p>\n<h3>Easy setup</h3>\n<p>Setting up the 1,650g, Vision TC 40 Disc wheelset was as close to child’s play as you get in my garage. Torquing up 140mm Shimano Ultegra centrelock rotors to the hubs took a matter of seconds, although the fitment of a set of 28c Pirelli P Zero clinchers (the wheels are tubeless-ready, by the way) was ever so slightly more fraught – the supple beading popped into the rim hook easily by hand, but some cack-handed tyre lever wielding ripped an inner tube (thankfully, I’m also old enough to know my way around a puncture repair kit).</p>\n<p><strong><em><a href=\"https://www.bikeinn.com/bike/vision-tc-40-carbon-cl-disc-tubeless-road-wheel-set/137809929/p\" target=\"_blank\">Buy Vision TC 40 Disc wheels from BikeInn now</a></em></strong></p>\n<p>Arguably, the 19mm inner diameter and 25.5mm outer would be perfectly suited to a 25c tyre, allowing the optimum combined aero profile of truncated aero-profile rim and tyre, but opting for 28c tyres didn’t cause any noticeable ballooning and allowed the running of lower pressures for maximum comfort.</p>\n<h3>Upgraded all-rounder</h3>\n<p>The Vision TC 40 Disc wheelset is one of three in the firm’s ‘Team Course’ range, and its 40mm profile is in the sweetspot between the 30 and 55mm options. They’re very well suited to everyday rides as well as hilly sortees.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/2104/vuelta-a-espana-route-race-reports-tv-guide-and-all-you-need-to-know\">Vuelta a Espana 2021: Route, start list, live TV guide and all we know so far</a></div>      <div><a href=\"/news/9958/peter-sagan-sidekicks-specialized-and-sportful-sign-with-team-totalenergies\">Peter Sagan, sidekicks, Specialized and Sportful sign with Team TotalEnergies</a></div>      <div><a href=\"/news/9954/bora-hansgrohe-sign-sam-bennett-and-new-sprint-train\">Bora-Hansgrohe sign Sam Bennett and new sprint train</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 116: on sale now!</a></div>    </div></div><p>\nWhat has been evident during testing is the way in which they offer a discernibly more stable ride than the 50mm profile Scribe Aero Wide+ wheelset they replaced on this bike. This difference is keenly felt in crosswinds and headwinds on local loops, where the wheels have stayed unflustered. Plus, they shine on group rides on rolling roads, offering a little help in keeping up with the climbers of the group on steeper climbs.</p>\n<p>Where their stiffness and stability has been most keenly felt is on descents, where a good eye for racing lines, allied to grippy tyres, have allowed riding buddies to quickly be hauled in, and overtaken.</p>\n<h3>Tough customers</h3>\n<p>The Vision TC 40 Disc wheelset actually passed the sternest of tests at a café stop, when one member of the ride accidentally put his full weight through the rim when accidentally standing on it (note to self: don’t lay bike on grass). The robust nature of these rapid wheels has been further evidenced by their willingness to take the knocks of potholes on local back roads, as well as the odd bunnyhop over humpback bridges.</p>\n<p><strong><em><a href=\"https://www.bikeinn.com/bike/vision-tc-40-carbon-cl-disc-tubeless-road-wheel-set/137809929/p\" target=\"_blank\">Buy Vision TC 40 Disc wheels from BikeInn now</a></em></strong></p>\n<p>Also of note is that, while not super-quiet, the freehub of the Vision rear wheel is noticeably less of a giveaway on a group ride that you’re freewheeling.</p>\n<h3>Take the plunge</h3>\n<p>The Vision TC 40 Disc wheelset is not the lightest, nor the quickest, example of a carbon-fibre upgrade to your bike’s rotational mass. But, it is very competitively priced, will make you ride quicker, imbue you with the confidence to corner hard, provide stability in windy conditions, and it’s built to last. Handbuilt to last, in fact.</p>\n<p>For less than £800, these wheels represent an incredibly tempting first pair of carbon wheels for anyone thinking of ditching the alloys. Think of them as near-ideal for most kinds of riding, rather than race-ready mountain-flatteners – low on compromise yet high on performance, they’re easy to recommend. </p>\n  </div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"eacaf67b89b0b14e15ea0c192493f6405444996258e249462cd05b3e8147ed5a","category":"Cycling"}