{"title":"Assessment of synthetic food dye erythrosine induced cytotoxicity, genotoxicity, biochemical and molecular alterations in Allium cepa root meristematic cells: insights from in silico study","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae126/7730553?rss=1","date":1723161600000,"content":"<span><div>Abstract</div><div>Background</div>Synthetic food dyes are being exponentially used in food products and scarce studies regarding their toxicities and safety raise concern. Erythrosine is one of the synthetic food dyes being used in jams, fig, pineapple marmalades, dairy products, soft drinks, pickles, relishes, smoked fish, cheese, ketchup, maraschino cherries and a variety of other foods.<div>Methodology</div>In this study the cyto-genotoxic effect of erythrosine was evaluated, using root meristematic cells of <span>Allium cepa</span> for the cellular and molecular alternations at concentrations 0.1, 0.25, 0.5 and 1 mg/mL.<div>Results</div>The results revealed a significant decrease of 57.81% in the mitotic index after 96 h at the 0.1 mg/mL concentration. In biochemical analysis, the malondialdehyde content increased significantly (5.47-fold), while proline content, catalase activity and superoxide dismutase activity decreased gradually in a concentration-dependent manner showing a maximum decrease of 78.11%, 64.68% and 61.73% respectively at the highest concentration after 96 h duration. The comet assay revealed increased DNA damage with increasing concentration and attenuated total reflectance- Fourier transform infrared spectroscopy (ATR-FTIR) analysis showed significant alterations in biomolecules as indicated by multivariate analysis, i.e. Principal Component Analysis (PCA). Furthermore, molecular docking demonstrated a strong binding energy (G<sub>best</sub> = −11.46 kcal/mol) and an inhibition constant (Ki) of 3.96 nM between erythrosine and the DNA minor groove.<div>Conclusion</div>The present study’s findings revealed the cytotoxic and genotoxic potential of erythrosine on <span>A. cepa</span> root cells. Further, the study also proposed the usefulness of <span>A. cepa</span> as a model system for studying the toxicity of food additives.<div><div>Highlights</div><ul><li>Erythrosine showed prominent cytotoxicity with complete inhibition of mitosis at 0.25 mg/mL conc.</li><li>High level of genotoxicity revealed by 3.68-fold increment in chromosomal aberrations (CAs) frequency at lowest concentration (0.1 mg/mL).</li><li>The increased MDA level, reduced CAT, SOD activity and proline content showed significant biochemical changes in antioxidant system.</li><li>Alternations in biomolecules viz. protein, lipid and nucleic acid region showed by ATR-FITR spectrum and confirmed statistically by multivariate analysis of spectrum.</li><li>In silico model supports the finding as the lower binding free energy of −11.46 kcal/mol between erythrosine and DNA structure was calculated.</li></ul></div></span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"ead08e1cde72555ef8f573e5887527fdb936c7a322d35c8cadfbf9bc272bebb5","category":"Environment"}