{"title":"Genetic diversity and population structure of <i>Piper nigrum</i> (black pepper) accessions based on next-generation SNP markers","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305990","date":1719410400000,"content":"<p>by Nilni A. Wimalarathna, Anushka M. Wickramasuriya, Dominik Metschina, Luiz A. Cauz-Santos, Dharshani Bandupriya, Kahandawa G. S. U. Ariyawansa, Bhathiya Gopallawa, Mark W. Chase, Rosabelle Samuel, Tara D. Silva</p>\r\n\r\nDespite the economic importance of <i>Piper nigrum</i> (black pepper), a highly valued crop worldwide, development and utilization of genomic resources have remained limited, with diversity assessments often relying on only a few samples or DNA markers. Here we employed restriction-site associated DNA sequencing to analyze 175 <i>P</i>. <i>nigrum</i> accessions from eight main black pepper growing regions in Sri Lanka. The sequencing effort resulted in 1,976 million raw reads, averaging 11.3 million reads per accession, revealing 150,356 high-quality single nucleotide polymorphisms (SNPs) distributed across 26 chromosomes. Population structure analysis revealed two subpopulations (<i>K</i> = 2): a dominant group consisting of 152 accessions sourced from both home gardens and large-scale cultivations, and a smaller group comprising 23 accessions exclusively from native collections in home gardens. This clustering was further supported by principal component analysis, with the first two principal components explaining 35.2 and 12.1% of the total variation. Genetic diversity analysis indicated substantial gene flow (<i>Nm</i> = 342.21) and a low fixation index (<i>F</i><sub>ST</sub> = 0.00073) between the two subpopulations, with no clear genetic differentiation among accessions from different agro-climatic regions. These findings demonstrate that most current black pepper genotypes grown in Sri Lanka share a common genetic background, emphasizing the necessity to broaden the genetic base to enhance resilience to biotic and abiotic stresses. This study represents the first attempt at analyzing black pepper genetic diversity using high-resolution SNP markers, laying the foundation for future genome-wide association studies for SNP-based gene discovery and breeding.","author":"Nilni A. Wimalarathna","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ead29730ba988e40cff1669546dded0ffe321f384a30b310f01df56d554add58","category":"Interdisciplinary"}