{"title":"Ford F-150 Lightnings will soon offer home AC power, possibly cheaper than grid","link":"https://arstechnica.com/?p=1989623","date":1702058574000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/ford_charging_resize-800x600.jpg\" alt=\"It's a hefty plug, but it has to be so that an F-150 Lightning can send power back to the home through an 80-amp Ford Charge Station Pro.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/ford_charging_resize.jpg\">Enlarge</a> <span>/</span> It's a hefty plug, but it has to be so that an F-150 Lightning can send power back to the home through an 80-amp Ford Charge Station Pro. (credit: Ford)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Modern EVs have some pretty huge batteries, but like their gas-powered counterparts, the main thing they do is sit in one place, unused. The <a href=\"https://arstechnica.com/cars/2022/05/the-most-important-ev-of-the-decade-we-drive-the-f-150-lightning/\">Ford F-150 Lightning</a> was built with two-way power in mind, and soon it might have a use outside emergency scenarios.</p>\n<p>Ford and Resideo, which makes the Honeywell Home smart thermostat, recently announced the <a href=\"https://media.ford.com/content/fordmedia/fna/us/en/news/2023/12/07/ford-and-resideo-launch-ev-home-power-partnership-project-drivin.html\">EV-Home Power Partnership</a>. It's still in the testing phases, but it could help make EVs a more optimal purchase. Put simply, you could charge your EV when it's cheap, and when temperatures or demand make grid power time-of-use expensive (or pulled from less renewable sources), you could use your truck's battery to power the AC. That would also help with grid reliability, should enough people implement such a backup.</p>\n<p>The F-150 Lightning already offers <a href=\"https://www.ford.com/trucks/f150/f150-lightning/features/intelligent-backup-power/\">a whole-home backup power option</a>, one that requires the professional installation of an 80-amp Ford Charge Station Pro and a home transfer switch to prevent problems when the grid switches back on. Having a smart thermostat allows for grid demand response, so the F-150 would be able to more actively use its vehicle-to-home (V2H) abilities.</p></div><p><a href=\"https://arstechnica.com/?p=1989623#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1989623&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ead3ee6b6e9ddde82d3e36ba1ce111ce1984c43e23c5d4755b0598a7f2624d9e","category":"Tech"}