{"title":"‘It’s challenging at times but that’s competitive sport’: Lora and Neil Fachie interview","link":"https://www.cyclist.co.uk/in-depth/neil-lora-fachie-paracycling","date":1692894336000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/neil-lora-fachie-paracycling\">‘It’s challenging at times but that’s competitive sport’: Lora and Neil Fachie interview</a></p>\n\n<p>The first combined UCI Cycling World Championships wrapped up recently in Glasgow, and few could argue against the fact that it was a true celebration of everything cycling represents, from traditional events on the road and track through more niche disciplines like artistic cycling and <a href=\"https://www.cyclist.co.uk/in-depth/cycle-ball\" target=\"_blank\">cycle-ball</a>, and a full range of paracycling events.</p>\n\n\n\n<p>Great Britain topped the medals table with an incredible 100 medals in total, of which 44 were in paracycling. And of those, four medals were claimed on the track by Lora and Neil Fachie, with Lora taking silver in the kilometre pursuit and Neil a trio of gold medals in the 1km time-trial, sprint and team sprint.</p>\n\n\n\n<p>We spoke to the couple just before the Championships to find out more about their path into paracycling, balancing training and parenting and much more.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/uci-world-championships-2023-highlights\">Pro Log: 5 things to remember from the 2023 UCI World Championships</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/cycle-ball\">Where cycling meets football: Inside the world of Cycle-Ball</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 143: on sale now!</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p><strong>Tell us about your sight-loss conditions</strong></p>\n\n\n\n<p><strong>Lora Fachie:</strong> Mine’s a hereditary condition that I’ve had since birth. My whole family have it, so my mum and two brothers. Now I have just perception, but when I was born I had a little more useful vision.</p>\n\n\n\n<p><strong>Neil Fachie:</strong> Mine is also a hereditary condition and I got it from my mum. It’s degenerative so is worsening over time. At some point, it looks like I’ll be totally blind but I have usable sight at this point, although not enough to race a bike at speed by myself.</p>\n\n\n\n<p><strong>The relationship between yourselves and your pilots must be important?</strong></p>\n\n\n\n<p><strong>LF: </strong>It is, although I’m just hoping my pilot will be Corinne [Hall]. I’ve been riding off and on with Corinne for around ten years now. It’s important to get on with the pilot as you must communicate and work effectively. You don’t necessarily need to like the person but it does make the whole thing a lot more fun and enjoyable if you do.</p>\n\n\n\n<p><strong>NF:</strong> My pilot is Matt Rotherham, although it’s worth pointing out that British Cycling decides who we ride with, not us. But Matt’s great and we’ve enjoyed a lot of success together. We first got on the tandem around 2018. Matt was on the British Cycling Sprint Academy but didn’t quite make it onto the Olympic programme. Over time, that trust grows. Once you share rooms with someone, you get to know them very well. Of course, it’s challenging at times but that’s competitive sport.</p>\n\n\n\n<p><strong>How often do you and your respective pilots train together?</strong></p>\n\n\n\n<p><strong>LF:</strong> I train six times a week but haven’t trained with Corinne since the road race at the Tokyo Paralympics, which didn’t go well as we endured a mechanical. She underwent knee surgery post-Tokyo and has been rehabbing from that, while I had baby Fraser last year. I’d liked to have trained with her sooner but she’s been away racing with another stoker [who rides behind the pilot]. I’m hoping to get back on the bike with her in the next couple of weeks, which makes it a tight turnaround for an opportunity to qualify for Glasgow.</p>\n\n\n\n<p><strong>NF:</strong> I’m in the Manchester Velodrome with Matt two or three times a week and we also see each other in gym sessions.</p>\n\n\n<div>\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/neil-and-lora-fachie-2-970x647.jpg\" alt=\"Neil Fachie\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/neil-and-lora-fachie-2-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/neil-and-lora-fachie-2-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/neil-and-lora-fachie-2-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/neil-and-lora-fachie-2-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/neil-and-lora-fachie-2-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/neil-and-lora-fachie-2-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/neil-and-lora-fachie-2-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/neil-and-lora-fachie-2-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/08/neil-and-lora-fachie-2.jpg 1200w\" /><figcaption>Great Britain’s Neil Fachie celebrates with pilot Matthew Rotherham after beating Germany’s Thomas Ulbricht and Robert Förstemann in the men’s paracycling B sprint final race. The pair also won the mixed B team sprint alongside Elizabeth Jordan and pilot Amy Cole. Fachie now has 19 track world titles. </figcaption><figcaption>Getty Images</figcaption></figure></div>\n\n\n<p><strong>Presumably you complement the track work with indoor-trainer efforts?</strong></p>\n\n\n\n<p><strong>NF: </strong>Yeah, we have smart trainers that are hooked up to Zwift. During lockdown we had our conservatory converted into an indoor gym, featuring turbos plus freestanding weights and gym matting. Before that, I left a fair few dents in the floor.</p>\n\n\n\n<p><strong>How’s life balancing training and parenthood?</strong></p>\n\n\n\n<p><strong>NF:</strong> It’s been interesting. We have to share when we train and when we look after our wee lad. That has been a challenge and the lack of sleep has taken its toll. But it does make you appreciate that some of the struggles of training aren’t that bad.</p>\n\n\n\n<p><strong>LF: </strong>The first three months were very tough, especially as I struggled to breastfeed. I’m a determined person and don’t give up easily, so tried everything possible to breastfeed him and ran myself into the ground. Looking back, I struggled mentally post-birth for a while, which I think impacted my ability to breastfeed. He had a late diagnosis of tongue tie, which didn’t help either.</p>\n\n\n\n<p><strong>This parental theme stretched to making TV history, didn’t it?</strong></p>\n\n\n\n<p><strong>LF</strong>: It did, because I was the first person to read a CBeebies bedtime story in braille. I read <em>The Secret Code</em>, a story about a boy whose friends think he can read in a secret code only to discover it’s in braille.</p>\n\n\n\n<p>It was special sitting in the chair that some famous people had sat in, especially as I was 38 weeks pregnant. It was amazing how intense filming was. To read a book that takes five minutes to read took over three hours to film. We think we’re picky about aerodynamics and power but it was interesting to see it in other walks of life. Ultimately though, I keep thinking I sat in the same seat as Dave Grohl!</p>\n\n\n\n<p><strong>What was your path to paracycling?</strong></p>\n\n\n\n<p><strong>NF: </strong>I’m from near Aberdeen. My mum took me along to sport camps in swimming and fencing as she wanted me to burn off energy. I found athletics at ten and loved the simplicity of it. I was a slow developer so pretty much finished last in every race from 12 to 16. But things started to click. I made it to the 2008 Beijing Paralympics as a 100m and 200m runner. I didn’t make the final, had my funding cut and thought my sporting career was done. Thankfully I found cycling and it turns out that was the sport I should have been doing all along.</p>\n\n\n\n<p><strong>LF</strong>: I’m from a sporty family and first entered sport when I was around eight or nine and found my mum’s running spikes in her wardrobe. I competed in athletics through my teenage years and it took until 21 before I really found cycling, when someone suggested I get on the back of a tandem. And here I am.</p>\n\n\n\n<p><strong>How could prospective paracyclists enter the sport?</strong></p>\n\n\n\n<p><strong>NF: </strong>Get in touch with a development squad and go along to a talent day. Derby is particularly good for this and has paracycling focus days where experienced pilots take you on the track on the tandem. Also, from a leisure point of view your local cycling club usually has someone who’ll be happy to go out with you on a tandem. Someone at a club always seems to have a tandem sitting around in a garage.</p>\n\n\n\n<p>Finally, such has been your success and dedication to paracycling that you have both recently been awarded OBEs. How was the Palace?<strong>LF:</strong> We haven’t had a chance to collect them yet. They’ve asked us twice already to head to Windsor but Fraser was too young, so it has been delayed until the autumn. However, at separate points we’ve both been awarded MBEs and both visited Buckingham Palace. Neil’s was in 2013 and he was awarded an MBE by the Queen. I got mine four years after, post-Rio. Prince Charles gave me mine, but he’s gone onto bigger and better things now.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/neil-lora-fachie-paracycling\">‘It’s challenging at times but that’s competitive sport’: Lora and Neil Fachie interview</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"eada710c391c0ec6af14134f6d1c323d078af83fbc1608a769a17af91a6f75be","category":"Cycling"}