{"title":"Effect of feeding frequency on growth performance, feed transit and digestive enzyme activity of Acipenser dabryanus juveniles","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16056?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>Dabry's sturgeon (<i>Acipenser dabryanus</i>) is critically endangered in China. However, the lack of research on the feeding strategy of this species is detrimental to its conservation management. The present study evaluated the effects of feeding frequency (1, 2, 3, 4 and 5 times per day) on the growth performance, feed transit and digestive enzyme activity of juvenile Dabry's sturgeons (initial weight 0.42 ± 0.09 g) in a continuous flow culture system at a water temperature of 18.2–18.5°C. Single-meal and normal-feeding (1, 2, 3, 4 and 5 times per day) experimental methods were adopted to assess the effect of different feeding frequencies on feed transit. The fish in each treatment of the normal-feeding experiment were fed normally according to the original feeding frequency (1, 2, 3, 4 and 5 times per day). The optimum feeding frequency for juvenile Dabry's sturgeons was determined to be 4 times per day based on the growth performance, feed conversion rate and digestive enzyme activity. The results of the single-meal experiment demonstrated that changes in daily feeding frequency modified residence time in the stomach (S1–S5: 27.2–10.4 h) and intestine (S2–S5: range from 14 to 29.85 h). However, the obtained gastric emptying time varied significantly depending on the experimental approach. The single-meal experiment approach resulted in a longer gastric emptying time of fish fed 1 and 2 times per day (S1: &gt;35 h; S2: 35 h) than those in the normal-feeding experiment (N1: 16 h; N2: 24 h), demonstrating that the single-meal method might change the gastrointestinal emptying strategy of fish. Furthermore, the digestive enzyme activity had daily rhythmic changes and the average digestive enzyme activity was affected by feeding frequency. The average digestive enzyme activity of the fish in N3 or N4 was higher than those of fish in other groups (<i>p</i> &lt; 0.05). In summary, this study provides much useful information for the healthy farming of juvenile Dabry's sturgeons and towards the understanding of digestive physiology, which is of great significance for the protection of Dabry's sturgeon.</p>","author":"Min Guan, \nDezhi Zhang, \nXiangang Sun, \nDebin Shu, \nJun Rao, \nDaming Tang","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"eaf5712aa08730f990f9c320c0d5643368f62a75387971827b2645a6ed2c71cc","category":"Environment"}