{"title":"Fasted 500 | Meet the cyclists riding 500km through Ramadan","link":"https://www.bikeradar.com/features/long-reads/fasted-500/","date":1620754208000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Fasted-500-roundel-779c7a0.jpg?quality=90&amp;resize=620,413\" />                                            <p>The Rapha Festive 500 sees tens of thousands of cyclists worldwide ride 500km between Christmas Eve and New Year’s Eve. Now a new event – the Fasted 500 – has challenged cyclists to ride 500km through the month of Ramadan.</p>\n<p>The Fasted 500 was the brainchild of Zahir Nayani, a lawyer and cyclist from Swindon, who saw the impact of the Covid-19 pandemic on Muslim communities and a need to encourage an active lifestyle. The Fasted 500 has required participants to ride an average of 17km a day through the holy month of Ramadan, from 12 April to 12 May.</p>\n<p>“Having personally completed Rapha’s iconic Festive 500 on a couple of occasions, a challenge of a similar vein was the obvious choice,” says Nayani.</p>\n<p>“Open-source data confirms the pandemic has had a disproportionate impact on BAME communities, with some pointing to potential factors such as many of us being from communities of extended families, to perhaps having more presence on the NHS frontline, to even having genetic predispositions to Covid-19. There’s not much we can do about any of those, but one thing we do have control over is our lifestyle choices.</p>\n<p>“While Muslims don’t tend to drink or smoke, boy can we eat! In light of that backdrop, it became apparent just how overdue a targeted challenge of this sort was.”</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Fasted 500, created by Zahir Nayani (pictured), requires cyclists to ride 500km through Ramadan.</span></figcaption><span> <i>Zahir Nayani</i></span></div>\n<p>Ramadan involves a month of fasting and requires Muslims to abstain from eating or drinking anything during daylight. “The main challenge is ensuring we’re geared up nutritionally to undertake the challenge by consuming sufficient fluids and balanced meals between sunset and sunrise,” says Nayani.</p>\n<p>“By breaking up the distance over the month, it becomes pretty achievable and a great way to get some headspace for an hour or so. Outside of the pandemic, Ramadan can be a pretty busy month with congregational night prayers and hosting evening meals for friends and family, so there’s also the practical aspect that needs to be carefully managed to ensure that we’re able to fit cycling into our busy diaries.”</p>\n<p>Nayani describes the response to “what began as a passing idea in the midst of the third lockdown” as “staggering”, with the challenge garnering support from Komoot, Adventr.cc, Wizard Works and Bristol Bicycles, as well as endorsement from Rapha.</p>\n<p>Riders can <a href=\"https://fasted500.bigcartel.com/product/fasted-500-roundel\">buy a commemorative Fasted 500 roundel</a>, with all profits donated to <a href=\"https://www.instagram.com/cyclingsistersbristol/\">Cycling Sisters Bristol</a>, an initiative to encourage more women to start cycling.</p>\n<p>“Perhaps even more impressive is the sheer extent of our participant base,” says Nayani. “We have people taking part in Malaysia, Indonesia, Holland, Australia and the USA.”</p>\n<h2>Global appeal</h2>\n<p>Musa Akinosho, Meena Aladdin and Izzat Roslan are among those riding the Fasted 500, based in the UK, USA and Malaysia respectively.</p>\n<p>Akinosho has been riding for more than ten years, first cycling to work but now riding as a member of his local club. He says he signed up to the challenge to get his cycling “mojo” back.</p>\n<p>“I’ve been working from home since the start of the pandemic, so haven’t had much consistent exercise and have slowly been putting on some weight,” says Akinosho. “So when I heard of this, I thought it would be the perfect kick-start I needed to enjoy riding my bike again.”</p>\n<p>The Midlands-based rider is on track to ride double the distance – 1,000km – during Ramadan. Despite that, Akinosho says the key to his success has been in understanding his limits.</p>\n<p>“It’s important that I don’t overstep my boundary,” he says. “I have more energy to ride first thing in the morning so I usually aim to leave the house just after sunrise when there’s visible light – it also means there’s no traffic either.”</p>\n<blockquote><div> <a href=\"https://www.instagram.com/p/CNyvCpuFaj3/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CNyvCpuFaj3/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Fasted 500 (@fasted500)</a></p></div></blockquote><p>Washington DC-based Aladdin is a long-distance runner turned “endurance junkie” cyclist, who switched to cycling three years ago and found her calling in gravel racing. She’s completed two half-Everest rides and made an Everesting attempt in October 2020 but withdrew after falling sick, having climbed 24,000ft (7,315m) of the 29,028ft (8,848m) target.</p>\n<p>Aladdin is targeting 800 fasted miles (1,288km) through Ramadan and has called on her experience as a long-distance runner, having previously continued racing through the month, albeit at limited distances (predominantly 5km and 10km races).</p>\n<p>“Ramadan training is unique in that a lot of observers scale exercise down or completely take the month off, and most coaches won’t come near it, as it’s a different type of challenge,” says Aladdin.</p>\n<p>“Many coaches have no exposure to athletes undertaking a month long fasted and they don’t know what can push athletes into the danger zone,” she says. “Fasting is a stressor, without a doubt, and the only thing I liken it to is altitude training, in that you’re forcing your body to adapt under less than ideal conditions.”</p>\n<p>Aladdin has adapted her training by reducing the intensity through the month of Ramadan. “If I want to go long – and long is relative here, 40 to 50 miles in Ramadan, whereas my normal long is 80+ miles with moderate climbing – I simply need to cut my efforts way down,” she says.</p>\n<p>“I watch my heart rate and keep my heart rate at <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">zones 1-2</a> – right in that fat burning zone. I know from long-distance running that I have about 2 to 3 hours before I use up my glycogen stores. It’s likely similar in cycling but I start at an even lower heart rate and effort.”</p>\n<p>Aladdin says she hasn’t followed a training plan through the month and takes one day at a time. “I plan my ride after seeing how my body feels on a particular given day,” she says. “Perceived exertion is also a really good indicator, most of my efforts have been at conversational pace.”</p>\n<p>While Akinosho and Aladdin have continued to ride in a fasted state, Roslan – who started riding while living in Brisbane, Australia, in 2015 before returning to Malaysia, where he competes in road races and criteriums – has taken the opposite approach and mostly rides at night.</p>\n<p>“For the last five years, I have been riding while fasting, but it’s been counterproductive to my performance,” he says. “I did lose weight, but just couldn’t climb despite being 2 to 3kg lighter than my ideal racing weight. So this Ramadan I switched to night riding so I can fuel before, during and after.”</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The challenge has attracted global participants, including Malaysia-based Izzat Roslan.</span></figcaption><span> <i>Fiz Said</i></span></div>\n<p>Roslan says riding during Ramadan requires an acceptance that he won’t hit the numbers he is used to seeing. While he focuses on high-quality foods and lots of fluids during the window he can eat and drink, the challenge has become less about fuelling his riding and more about adjusting to the demands of riding at night.</p>\n<p>“My body clock just went haywire,” he says. “You don’t go to bed until midnight or so, and then you have to wake up [before sunrise] at around 5.30am for early breakfast before fasting starts for the day.”</p>\n<p>Getting enough sleep and recovery time has also been a challenge for Akinosho and Aladdin. During Ramadan, Muslims have pre-dawn meals, referred to as suhoor or sehri, before breaking fast after sunset for the evening meal, known as iftar or ftoor.</p>\n<p>This year, Ramadan coincides with the approach of summer (in the Northern Hemisphere) and the days gradually getting longer, with the fast more than two hours longer at the end of the month than at the start in the UK.</p>\n<p>“Napping after rides helps a ton with recovery,” says Aladdin, “especially because I can’t replenish my calories or hydrate until after my rides.”</p>\n<p>She adds: “Ramadan is difficult and, even fasted, easy efforts can take their toll.”</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Roslan has taken to riding at night through Ramadan.</span></figcaption><span> <i>Fiz Said</i></span></div>\n<p>Akinosho and Aladdin’s longest rides during Ramadan have approached 100km, while Roslan’s rides have included a fast, flat-out Friday night group ride.</p>\n<p>“It’s called the ‘Friday corpse’ because it makes you feel like one after the ride,” he says. “You are racing for 86km out and back to KL International Airport and the average speed has been nothing short of 40km/h. That was good fun and hurts a lot.”</p>\n<h2>Breaking down barriers</h2>\n<p>Akinosho, Aladdin and Roslan have all found inspiration in the stories shared by other riders during the Fasted 500, and the community of like-minded riders established through the challenge.</p>\n<p>“I always thought I was alone and never met anyone who continued training during the month of Ramadan,” says Aladdin. “I was really pleasantly surprised to stumble upon Fasted 500 and it afforded me a community of like-minded people. It didn’t change my training – I put in a similar volume of miles last year – but it just introduced me to a lot of rad cyclists.”</p>\n<p>Creating a global community of cyclists has been key to the Fasted 500, Nayani says, and has helped participants find common ground with riders around the world.</p>\n<p>“For me, the feedback has been the best,” he says. “Many have commented how engaging with our content on social media platforms, such as Instagram, has made them feel part of a genuine community of Muslim cyclists that they have not previously experienced or known to be possible.</p>\n<p>“I’m all for equal representation too and have made a point to showcase the breadth of inspirational female Muslim cyclists who are often heavily underrepresented in mainstream media outlets.”</p>\n<p>Fasted 500 founder Nayani highlights increased investment in cycling infrastructure, community initiatives, representation in cycling media and normalising cycling as a mode of transport as key hurdles to overcome to increase the uptake of cycling among riders from diverse backgrounds.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Musa Akinosho says groups like the Brothers on Bikes play a key role in encouraging a wider uptake of cycling.</span></figcaption><span> <i>Matt Grayson / Immediate Media</i></span></div>\n<p>As one of the Fasted 500’s global participants, Roslan says he was inspired to take part in the event to challenge stereotypes. He also uses his Instagram account, <a href=\"https://www.instagram.com/thatmuslimcyclist/\">@thatmuslimcyclist</a>, to share his story.</p>\n<p>“It’s really about trying to defeat the negative stereotype among people, Muslim or non-Muslim, that being a practicing Muslim doesn’t hold you back,” says Roslan.</p>\n<p>Meanwhile, Akinosho points to clubs like <a href=\"https://www.brothersonbikes.cc/\">Brothers on Bikes</a>, which operates a network of group rides  to promote cycling among the British Muslim community and the role they play in encouraging greater participation in cycling. “There are many groups out there doing great work and there is certainly a feeling of belonging and companionship,” he says.</p>\n<p>“Representation is key as it gives others a [chance to see] people who look like them cycling. It is also important to highlight to Muslims the benefit of doing regular exercise, eating healthily and accomplishing tasks they probably wouldn’t have thought was possible.”</p>\n<blockquote><div> <a href=\"https://www.instagram.com/p/COYX8dABK-r/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/COYX8dABK-r/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Fasted 500 (@fasted500)</a></p></div></blockquote><p>Before this year, Aladdin says she wore a headscarf (hijab) for more than 20 years and was the “only very visibly Muslim woman at races”, for both cycling and running. (“While I support the hijab, I decided to try life without it for a bit – that’s a different story,” she says).</p>\n<p>Aladdin would encourage more Muslims – and, in particular, Muslim women – to embrace cycling and look past any pre-conceived notions of what the sports entails.</p>\n<p>“I was only able to ride and run as much as I did because I showed up and ignored stares and, on the rare occasions, inappropriate comments – that’s just noise,” she says. “Luckily, there were infinitely more supportive and welcoming words.</p>\n<p>“Cycling can be a difficult sport to break into because you’re judged not only on your abilities (namely speed) but also how ‘pro’ you look. To Muslims and, in particular, Muslim women who cover, I hope they can find peace in looking ‘different’ but focus on the joy cycling brings.”</p>\n<h2>Looking ahead</h2>\n<p>With Ramadan coming to an end, what’s next for both Akinosho, Aladdin and Roslan? For Akinosho, he will continue riding with his club, hopes to embark on a season of racing in the future and plans to dip his toe into the world of audax. For Roslan, the Etape du Tour is heading to Malaysia for the first time in November 2021.</p>\n<p>“I’m hoping it will happen but, at the same time, I’m not getting too excited about it due to the volatile Covid-19 situation,” he says. “The plan is to get into training for that. If it happens, great, I’m prepared. If not, that’s fine too because riding a bike always feels great when you are fit anyway.”</p>\n<p>Aladdin, meanwhile, has a year of gran fondos, gravel racing and randonneuring planned, aiming for 400 to 500km rides for the latter. She also has one piece of unfinished business to take care of – Everesting.</p>\n<p>“I’m back to Everest training, with the goal date being some time in October,” she says. “I can’t seem to get Everest out of my head, it’s my own Moby Dick!”</p>\n<ul><li>Follow <a href=\"http://instagram.com/fasted500/\">@fasted500</a> on Instagram</li>\n<li>Follow <a href=\"https://www.instagram.com/thatmuslimcyclist/\">@thatmuslimcyclist</a> on Instagram</li>\n<li>Follow <a href=\"https://www.instagram.com/musa_theblackcyclist/\">@musa_theblackcyclist</a> on Instagram</li>\n<li>Follow <a href=\"https://www.instagram.com/maladdin1/\">@maladdin1</a> on Instagram</li>\n</ul>","author":"George Scott","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"eaf7185ef969d184afbbcc2960cfb2ee4b92bb1ccef3d1038fe43b6b303698a9","category":"Cycling"}