{"title":"Chemical, structural and antioxidant properties of melanoidins in fish sauce","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13917?af=R","date":1726801768000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Melanoidins, as a functional component, exhibit antioxidant properties. However, the antioxidant mechanism of melanoidins in fish sauce remains poorly understood. The present study focused on the structural characteristics, microstructure and antioxidant activity of melanoidin substances in fish sauce.</p>\n<h2>RESULTS</h2>\n<p>Ultrafiltration and color difference analysis were utilized to confirm the main molecular weight composition of melanoidins. The ultrafiltration component &gt; 10 kDa in fish sauce exhibited the darkest and reddest color, along with the highest content of melanoidins (699.5 mg g<sup>−1</sup>). The spectral characteristics were consistent with typical melanoidins. Gas chromatography–tandem mass spectrometry and Fourier transform infrared spectroscopy analyses revealed that the melanoidins contained a significant number of oxygen-containing groups, amino compounds, carbohydrates, aromatic compounds and carbonyl compounds (CO), pyrrole (C<span></span>N), among others. In total, 129 alkanes, 71 esters, nine olefins and two alkynes were identified. The melanoidins (&gt; 10 kDa component) had the strongest antioxidant activity, including a reducing power of 0.8, 2,2′-azino-bis(3-ethylbenzothiazoline-6-sulfonic acid) radical scavenging activity of 67.7% and 2,2-diphenyl-1-picrylhydrazyl radical scavenging activity of 92.4%. Additionally, the melanoidins (&gt; 10 kDa component) had the highest total phenolic content at 48.2 μg gallic acid equivalents mL<sup>−1</sup>.</p>\n<h2>CONCLUSION</h2>\n<p>Melanoidins are important factors affecting the antioxidant activity of fish sauce. There were differences in the structural properties of melanoidin fractions with different molecular weights. © 2024 Society of Chemical Industry.</p>","author":"Wenhui Zhu, \nWenxuan Wang, \nYingnan Liu, \nYing Bu, \nJianrong Li, \nXuepeng Li","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"eafa5032f49461e057abc3eee102738cbd1cdd899852e8dfba761bf37f36f4ff","category":"Environment"}