{"title":"Exploring the preferred integration approach for HIV, diabetes and hypertension care and associated barriers and facilitators in Central Tanzania: An exploratory qualitative study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003510","date":1721829600000,"content":"<p>by Tiffany E. Gooden, Mkhoi L. Mkhoi, Lusajo J. Mwalukunga, Mwajuma Mdoe, Elizabeth Senkoro, Stephen M. Kibusi, G. Neil Thomas, Krishnarajah Nirantharakumar, Semira Manaseki-Holland, Sheila Greenfield</p>\r\n\r\nTimely diagnosis and management of diabetes and hypertension among people living with HIV (PLWH) is imperative; however, many barriers exist within the current model of care for these comorbidities. We aimed to understand how HIV, diabetes, and hypertension care should be delivered and the associated barriers and facilitators for the preferred delivery approach. We conducted semi-structured interviews with 16 PLWH with comorbidities of diabetes and/or hypertension (referred to hereafter as non-communicable diseases [NCDs]), 10 healthcare professionals (HCPs) that provide care for NCDs, and 10 HCPs that provide care for HIV. Participants were recruited from two healthcare facilities in Dodoma, Tanzania and interviewed in Swahili. Interviews were audio recorded, transcribed verbatim and translated into English. We used the differentiated service delivery building blocks as a framework to determine where, who, what and when care should be provided. We applied the Theoretical Domains Framework (TDF) to HCP transcripts to determine barriers and facilitators for the preferred integration approach. There was a consensus among participants that all care for NCDs should be provided for PLWH at HIV clinics (known as care and treatment centres [CTCs]) by either CTC doctors or NCD specialists. Participants preferred flexible follow-up care for NCDs and for it to be aligned with HIV follow-up appointments. The main barriers were mapped to the TDF domains of environmental context and resources, and social influences; the former included the lack of NCD medications, NCD diagnostic equipment, space, staff and guidelines whereas the latter included negative influences from peers and traditional healers. Several facilitators were mentioned regarding CTC HCPs’ knowledge, skills, optimism and beliefs regarding their capabilities to care for PLWH with NCDs. The preferred integration approach should be tested, utilising the enabling factors described. The barriers described must be addressed with or without integration to achieve optimal care for PLWH with NCDs.","author":"Tiffany E. Gooden","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"eafbc6dd6130478e6a495dc320816ff7a48c0392319fcfebb27bbac03752cd4d","category":"Environment"}