{"title":"Superior In Vitro Differentiation of Antigen-Presenting Cells with GM-CSF Compared to L-929 Supernatant in Mouse Bone Marrow Cultures","link":"https://www.preprints.org/manuscript/202407.1376/v1","date":1721184750000,"content":"Antigen-presenting cells (APCs) are essential for modulating immune responses, and optimizing their differentiation protocols is critical for cell-based immunotherapies. This study compares eight different protocols for differentiating APCs from C57BL/6J mice using GM-CSF and L-929 supernatant. Four groups treated with GM-CSF and four with L-929 supernatant at various concentrations, alongside a control group were evaluated. Flow cytometry was used to analyze the expression of key markers, including MHC II, CD11c, F4/80, and CD11b. Our findings show that GM-CSF resulted in superior differentiation outcomes compared to L-929 supernatant, with higher expression levels of the analyzed markers. This study underscores the importance of considering both cell yield and protein expression quality in selecting differentiation protocols. For researchers developing therapies targeting specific cell populations, these findings demonstrate how different culture conditions influences both the quantity and phenotypic characteristics of differentiated cells. Balancing efficiency and phenotypic fidelity is crucial for optimizing cell-based immunotherapy strategies. Our data provide a valuable reference for future studies and applications involving APC differentiation from bone marrow precursors, ensuring robust foundations for developing advanced immunotherapies. This comprehensive comparison of differentiation protocols offers insights essential for enhancing the effectiveness and cost-efficiency of cell-based therapies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"eafd18547bf7a07009fcb963c6c68ce4f9d01cc216626b1ca74acf762ba5f55b","category":"Interdisciplinary"}