{"title":"Investigating the role of obesity, circadian disturbances and lifestyle factors in people with schizophrenia and bipolar disorder: Study protocol for the SOMBER trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306408","date":1720447200000,"content":"<p>by Mikkel EI Kolind, Rikke Kruse, Anni S. Petersen, Charlotte S. Larsen, Lasse K. Bak, Kurt Højlund, Christoph P. Beier, Elsebeth Stenager, Claus B. Juhl</p>\r\n\r\nThe aim of this study is to investigate circadian rhythms in independently living adults with obesity and mental disease, exploring the interplay between biological markers and lifestyle factors. Eighty participants divided equally into four groups; (i) people with obesity and schizophrenia; (ii) people with obesity and bipolar disorder; (iii) people with obesity without mental disease or sleep disorders, and (iv) people without obesity, mental disease or sleep disorders. Over two consecutive days, participants engage in repeated self-sampling of hair follicle and saliva; concurrently, data is collected on diet, body temperature, light exposure, sleep parameters, and physical activity by accelerometry. Hair follicles are analyzed for circadian gene expression, saliva samples for cortisol and melatonin concentrations. Circadian rhythms are investigated by cosinor analysis. The study employs a participant-tailored sampling schedule to minimize disruptions to daily routine and enhance ecological validity. The methodology aims to provide a comprehensive insight into the factors contributing to circadian disruptions in people with obesity, bipolar disorder and schizophrenia, potentially informing strategies for future management and mitigation.\r\nTrial registration: (ClinicalTrials.gov Identifier: NCT05413486).","author":"Mikkel EI Kolind","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"eafe72ac78d017ad3bd594e523433192a41960c253fbe2c973fc11621ab71039","category":"Interdisciplinary"}