{"title":"Arcane Season 1","link":"https://markpeak.net/arcane-season-1/","date":1637920069000,"content":"<p><em>warning: สปอยล์เนื้อหาบางส่วนของซีรีส์</em></p>\n<p>เป็นคนไม่เคยเล่นเกม League of Legends มาก่อนเลย (จริงๆ คือไม่เล่น MOBA ทุกเกม รวมถึงเกมออนไลน์ทุกเกมด้วย เพราะเป็นคนไม่มีเพื่อนนั่นเอง) แต่เห็นซีรีส์ Arcane ที่ดัดแปลงมาจาก LoL ได้รับเสียงชื่นชมอย่างมาก (<a href=\"https://www.ign.com/tv/arcane-league-of-legends\">IGN ให้ 10/10</a>, <a href=\"https://www.metacritic.com/tv/arcane\">Metacritic user score 9.4</a>) เลยทำให้สนใจ</p>\n<p>พอลองหาข้อมูลดู พบว่าสามารถดูโดยไม่ต้องรู้จัก LoL มาก่อน บวกกับช่วงที่ผ่านมาพอมีเวลาว่างอยู่บ้าง เลยลองมานั่งดู</p>\n<p>พบว่าดีสมคำร่ำลือจริงๆ</p>\n<p>แถมพลังอิทธิพลจาก Arcane ทำให้เราสนใจไปตามอ่านเรื่องในจักรวาล Runeterra (โลกในเกม LoL) ต่อด้วย แม้จะไม่ถึงขั้นจูงใจให้ไปเล่นเกม LoL ก็ตามที</p>\n<p>ตอนนี้ดูจบเรียบร้อยแล้ว (ซีซัน 1 จำนวน 9 ตอน) ย่อมได้เวลาเขียนถึง</p>\n<h2>เรื่องย่อของ Arcane</h2>\n<p>เนื้อเรื่องของ Arcane (ภาษาไทยแปลว่า อาถรรพ์ ซึ่งหมายถึงพลังเวทย์มนตร์ในเรื่อง) เป็นจักรวาลแฟนตาซีแนวๆ steampunk สีสันค่อนข้างสดใส ในความคิดแวบแรกผมนึกถึง Final Fantasy IX ผสมกับ Bioshock Infinite</p>\n<p>เหตุการณ์ของภาคซีรีส์เกิดขึ้นก่อนภาคเกมเล็กน้อย เป็นการเล่าว่าตัวละครสำคัญๆ บางตัวในเกม LoL (ในเกมเรียกว่า <a href=\"https://universe.leagueoflegends.com/en_US/champions/\">แชมเปี้ยน</a> มีถึงประมาณ 150 ตัว) มีที่มาที่ไป มี backstory อย่างไรบ้าง</p>\n<p>สถานที่ในภาคซีรีส์เป็นนครรัฐ (city state) ที่เป็น 2 นครติดกัน อยู่คนละฝั่งแม่น้ำ ฝั่งเหนือคือ Piltover นครแห่งความก้าวหน้าทางวิทยาการ (“city of progress”) ส่วนฝั่งใต้เป็นสลัมชื่อ Zaun (อ่านว่า ซอน) ที่อยู่ใต้การปกครองของ Piltover</p>\n<div><img src=\"https://markpeak.net/wp-content/uploads/2021/11/Homepage_Story_Piltover.jpg\" /><p>Piltover เมืองแห่งวิทยาการ เรือเหาะ เวทย์มนตร์</p></div>\n<p>แกนเรื่องหลักของ Arcane เป็นการปะทะกันระหว่างสองนคร เป็นเรื่องเล่าคลาสสิก การต่อสู้ระหว่างคนรวยกับคนจน ชนชั้นที่รุ่มรวย ทรงอำนาจ มีชีวิตดีๆ สร้างงานค้นคว้าวิจัยเพื่อมนุษยชาติ กับคนจนที่ถูกทอดทิ้งและกดขี่ เป็นการปะทะกันระหว่าง “คนข้างบน” (ในเรื่องใช้คำว่า topsider) และ “คนข้างล่าง” (the undercity) พูดง่ายๆ คือเป็นสงครามชนชั้น (class war)</p>\n<p>ทั้งหมดเล่าผ่านสายตาของตัวละครหลัก สองพี่น้องชาว Zaun คือ พี่สาว Vi (ย่อมาจาก Violet) และน้องสาว Powder ที่เข้าไปพัวพันกับการชิงอำนาจกันเองของมาเฟียใน Zaun ที่ขยายวงจนไปปะทะกับ Piltover ทำให้ทั้งสองคนต้องพลัดพรากจากกันไป และต้องมาปะทะกันอีกครั้งในขั้วที่ตรงข้ามกัน</p>\n<div><img src=\"https://markpeak.net/wp-content/uploads/2021/11/wild-rift-key-art-riot-regions.jpg\" /><p>Jinx และ Vi สองสาวตัวละครหลักของเรื่อง</p></div>\n<h2>ตัวละคร</h2>\n<p>ในฉากเปิดเรื่อง Vi และ Powder รวมถึงเพื่อนๆ เข้าไปขโมยของในอพาร์ทเมนต์ของนครฝั่งเหนือ Piltover แต่เกิดอุบัติเหตุทำให้สิ่งประดิษฐ์ในห้องระเบิดขึ้น ทำให้ตำรวจใน Piltover ตื่นตัว (ในเรื่องใช้คำเรียกตำรวจว่า enforcer) และกลายเป็นปัญหาการเมืองระหว่างนครเหนือและนครใต้</p>\n<p>เหล่าผู้มีอำนาจใน Piltover กดดันให้ตามหาตัวคนร้ายให้ได้ หัวหน้าตำรวจของ Piltover จึงมากดดัน Vander พ่อบุญธรรมของ Vi/Powder ให้มอบตัวคนร้ายออกมา แต่ในขณะเดียวกันก็ถูกสอดแทรกโดย Silco หัวหน้าแก๊งใต้ดิน ที่ผลิตยาสีม่วง Shimmer เป็นยาเสพติดกระตุ้นให้คนมีพลังเหนือมนุษย์ ซึ่ง Silco ก็มีความหลังกับ Vander มาก่อน และต้องการล้างแค้น</p>\n<p>ในอีกด้าน เจ้าของห้องที่ Vi ไปขโมยของคือ นักประดิษฐ์หนุ่ม Jayce ที่อยู่ระหว่างการค้นคว้าพลังคริสตัล Hextech ที่เปรียบเสมือนพลังงานเวทย์มนตร์ของเรื่องนี้ สิ่งประดิษฐ์ของ Jayce นั้นยิ่งใหญ่พอๆ กับการค้นพบดินปืนหรือเครื่องจักรไอน้ำ เพราะเป็นพลังงานประเภทใหม่ที่ขับเคลื่อนโลก ทำให้เขาก็ได้เข้าไปพัวพันกับชนชั้นปกครองของ Piltover ที่ใช้ระบบคณะมนตรี (council ที่มีสมาชิก 7 คน) จากชนชั้นสูงกลุ่มต่างๆ ของ Piltover</p>\n<p>เนื้อเรื่องของ Arcane มีตัวละครค่อนข้างหลากหลาย โดยมีทั้งกลุ่มที่เป็นแชมเปี้ยนในเกม และตัวละครใหม่อื่นๆ อีกมาก</p>\n<p>ถ้าให้สรุปสั้นๆ ตัวละครที่เป็นแชมเปี้ยนจากเกมทั้งหมด 8 คนคือ</p>\n<ul>\n<li>ฝั่ง Piltover\n<ul>\n<li><strong>Jayce</strong> ตัวเอกฝั่ง Piltover นักประดิษฐ์ผู้ล้ำหน้ายุคสมัย</li>\n<li><strong>Caitlyn</strong> ตำรวจสาว คุณหนูจากตระกูลไฮโซ</li>\n<li><strong>Heimerdinger</strong> หนึ่งในมนตรีผู้ปกครอง และอาจารย์ของ Jayce/Viktor</li>\n<li><strong>Viktor</strong> เพื่อนนักประดิษฐ์ของ Jayce ที่ร่างกายอ่อนแอ</li>\n</ul>\n</li>\n<li>ฝั่ง Zaun\n<ul>\n<li><strong>Vi</strong> พี่สาวผู้แข็งแกร่ง แต่โดนโชคชะตากลั่นแกล้ง</li>\n<li><strong>Powder/Jinx</strong> น้องสาวผู้อ่อนไหว และมีปมในใจ</li>\n<li><strong>Ekko</strong> เพื่อนสมัยเด็กอีกคนของ Powder</li>\n<li><strong>Singed</strong> นักเคมีผู้สันโดษ อาจารย์อีกคนของ Viktor</li>\n</ul>\n</li>\n</ul>\n<p>จุดเด่นของ Arcane คือตัวละครทุกคนมีมิติมาก โดยเฉพาะตัวละครหลักของเรื่องนี้คือ Jinx ที่เป็นแกนกลางของเรื่องเลยก็ว่าได้ เราได้เห็นเบื้องหลังว่า Jinx มีปมตอนเด็กอย่างไร และเหตุการณ์ต่างๆ เข้ามาเปลี่ยนตัวเธอในมุมต่างๆ อย่างไร จนกลายเป็นตัวแปรสำคัญในความขัดแย้งระหว่างสองนคร</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/11/jinx.jpg\" /></p>\n<p>ตัวละครในเรื่องนี้มีมิติ การกระทำต่างๆ มีเหตุมีผลมีแรงจูงใจ ถ้าให้เลือกตัวละครที่ดูแบนๆ ไปหน่อยน่าจะเป็น Jayce ตัวเอกชายของเรื่องที่จับพลัดจับผลูได้ขึ้นมาเป็นผู้นำของ Piltover แบบงงๆ และการที่เขาอายุยังน้อย (อายุในตอนเปิดเรื่องคือ 24) แต่ต้องมาแบกรับภาระแห่งยุคสมัย ทำให้ช่วงหลังเขาสับสนและตัดสินใจทำอะไรแปลกๆ ไม่ค่อยสมเหตุสมผลไปบ้าง (เอาเข้าจริง ภัยคุกคามจาก Zaun ก็ไม่เยอะ แต่ Jayce ตระหนกไปเองเลยทำอะไรโอเวอร์เกินไปมาก)</p>\n<p>ในเว็บ IGN มีการโหวตตัวละครที่ชอบใน Arcane โดยในบรรดา 5 ตัวละครหลัก Jinx มาอันดับหนึ่ง (ตามคาด) ในขณะที่ Jayce ได้ที่โหล่ (ตามคาด) ที่เซอร์ไพร์สคือ Viktor ติดอันดับสองเลยทีเดียว</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/11/arcane-characters-poll.jpg\" /></p>\n<p>ตัวละครที่ผมชอบมี 2 ตัวคือ Caitlyn ซึ่งเป็นลูกสาวของหนึ่งในคณะมนตรี แต่ต้องการพิสูจน์ตัวเองว่ามีความสามารถ โดยไม่ได้ใช้อิทธิพลของแม่ เลยมารับบทเป็นตำรวจที่จริงจังกับงาน ในขณะเดียวกันก็มีโอกาสได้มาจับคู่ผจญภัยกับ Vi จนกลายเป็นอีกหนึ่งคู่จิ้นของเรื่องนี้ด้วย (Vi ชอบล้อ Caitlyn ว่าเป็น “ยัย cupcake” ก็น่ารักดี)</p>\n<p>https://twitter.com/arcaneshow/status/1462189085133475847</p>\n<p>อีกตัวที่ชอบคือ Mel Medarda มุขมนตรีสาวที่ชาญฉลาด และมองเห็นศักยภาพในตัว Jayce จึงคอยผลักดันเขาขึ้นมาเป็นบุคคลแถวหน้าของ Piltover</p>\n<p>ช่วงหลังเรายังเห็น backstory ของเธอที่มีพื้นเพจากจักรวรรดิ Noxus และมีปมเรื่องแม่ของเธอที่เป็นหนึ่งในผู้ปกครองนคร Noxus ยิ่งทำให้มิติของตัวละครนี้ลึกเข้าไปกว่าเดิม</p>\n<h2>การดำเนินเรื่อง</h2>\n<p>ซีรีส์ซีซันแรกมีทั้งหมด 9 ตอน ใช้วิธีเล่าเรื่องเป็น 3 องค์ (Act) องค์ละ 3 ตอน ความยาวตอนละประมาณ 40 นาที โดย Netflix ใช้วิธีปล่อยออกมาทีละ 3 ตอน ค่อนข้างต่างจากซีรีส์แบบดั้งเดิมที่ปล่อยสัปดาห์ละตอน หรือโมเดลมาตรฐานของ Netflix ที่ปล่อยมาตูมเดียวทั้งซีซัน</p>\n<p>วิธีการเล่าเรื่องแบบ 3 องค์ น่าสนใจตรงที่การหักมุมตอนท้ายของทุกๆ องค์ ทำให้น่าติดตาม เนื้อเรื่ององค์แรก (3 ตอนแรก) คือการปูชีวิตในวัยเด็กของ Vi/Powder ก่อนเหตุการณ์สำคัญที่ทำให้ทั้งสองคนพลัดพราก หลังจากนั้น องค์ที่สองเป็น timeskip จากองค์แรกที่ทุกคนในเรื่องเติบโตขึ้น (อย่างน้อยก็ 4-5 ปี) และต้องโคจรมาพบกันใหม่ ส่วนองค์ที่สามเป็นการขมวดปมทั้งหมด แต่ก็จบแบบสุดยอดแห่งความค้างคา (บางเว็บเรียก cliffhanger of cliffhanger) และคงอีกนานกว่าจะได้ดูซีซัน 2 กัน</p>\n<p>ในแต่ละตอนเป็นการตัดสลับมุมมองของตัวละครสำคัญๆ ของแต่ละฝั่ง (ตามสไตล์ซีรีส์สมัยใหม่) โดยเป็นการเดินเรื่องในมุมของ Vi/Powder และ Jayce/Viktor/Caitlyn เป็นหลัก เนื้อเรื่องมีความลึก แต่ก็เล่าด้วยวิธีการค่อนข้างตรงไปตรงมา เข้าถึงง่ายไม่ต้องตีความอะไรเยอะมากมายนัก</p>\n<p>บทสนทนาในเรื่องเขียนมาได้คมคาย น่าจดจำหลายอัน ที่ชอบคือฉากย้อนอดีตตอนที่ Mel ยังอยู่ใน Noxus แล้วถามแม่ของเธอ (ซึ่งเป็นผู้ยึดอำนาจ โค่นราชวงศ์เก่า) ว่าจะยกบัลลังก์ให้เธองั้นเหรอ คำตอบก็คือ ยกโลกทั้งใบให้ก็ได้ ถ้าเธอพิสูจน์ตัวเองว่ามีความสามารถมากพอ</p>\n<h2>World Building</h2>\n<p>จักรวาลของ Arcane ซีซันแรก ยังโฟกัสเฉพาะความขัดแย้งใน Piltover/Zaun ผ่านตัวละครหลักๆ ที่เป็นมนุษย์แทบทั้งหมด (ยกเว้น Heimerdinger ซึ่งเป็นเผ่าคนตัวเล็กที่เรียกว่า Yordle)</p>\n<p>แต่จริงๆ แล้ว โลกของ Runeterra ยังมีภูมิภาคอื่นๆ อีกมาก (ซึ่ง Riot Games ทำ<a href=\"https://map.leagueoflegends.com/en_US\">แผนที่โลกเตรียมไว้ให้สวยงาม</a>)</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/11/map-runeterra.jpg\" /></p>\n<p>ถ้าให้เล่าคร่าวๆ โลกของ Runeterra แบ่งออกเป็น 2 ทวีปหลักคือ ทวีปเหนือที่เรียกว่า Valoran และทวีปใต้ที่เรียกว่า Shurima</p>\n<p>ทวีปทั้งสองแห่งมีจุดเชื่อมกันที่บริเวณ Piltover และ Zaun เท่านั้น ทำให้สถานะของ Piltover/Zaun ไม่ได้เป็นแค่สองนครที่อยู่ตรงข้ามแม่น้ำกัน แต่เป็นจุดแบ่งของทวีปเหนือใต้ด้วย (ยังกับอิสตันบูลในโลกจริง)</p>\n<p>การที่ Piltover ครอบครองเทคโนโลยีเปลี่ยนโลกอย่าง Hextech ย่อมทำให้ Piltover กลายเป็นศูนย์กลางแห่งความขัดแย้งของโลก ช่วงปลายซีซันแรก เราจึงเห็น Ambessa Medarda แม่ของ Mel ที่เดินทางมาจากจักรวรรดิ Noxus ทางตอนเหนือ เพื่อเข้ามาครอบครองเทคโนโลยี Hextech ไปใช้ในการทหาร รับมือกับศัตรูของเธอใน Noxus อีกเช่นกัน เรื่องตรงนี้น่าจะขยายต่อไปในซีซัน 2 (<a href=\"https://www.polygon.com/22801096/arcane-season-2-speculation-league-of-legends-locations-lore\">เว็บ Polygon ถึงกับมีบทความคาดเดาว่าซีซัน 2 จะมีภูมิภาคใดมาเอี่ยว</a>)</p>\n<p>ช่วงนี้ Riot Games ยังออกเกมใหม่ชื่อ <a href=\"https://ruinedking.com/en-us/\">Ruined King</a> ซึ่งเป็นเหตุการณ์ในอีกภูมิภาคคือ หมู่เกาะโจรสลัด Bilgewater และเกาะลี้ลับ Shadow Isles โดยใช้ตัวละครแชมเปี้ยนอีกชุดที่อยู่ในภูมิภาคนั้นด้วย</p>\n<p>Riot Games ลงทุนกับการสร้าง lore ของเกมมายาวนาน ทำให้เรื่องเล่าและตำนานต่างๆ ค่อนข้างรุ่มรวย หยิบจับมาใช้ในเกมได้มาก แต่ก็ต้องชื่นชมทีมผู้สร้าง โดยเฉพาะคนเขียนบทและคุมธีมของเรื่อง ที่ทำออกมาได้ดีมากๆ</p>\n<h2>งานภาพ</h2>\n<p>Arcane ใช้งานภาพแบบ 3D ผสม 2D ทำให้งานภาพเป็นเอกลักษณ์มากๆ ไม่เหมือนใคร เห็นแล้วจดจำได้ งานภาพเป็นผลงานของสตูดิโอ Fortiche Productions ในฝรั่งเศส ที่เป็นมือทำแอนิเมชั่นคู่บุญ LoL มายาวนาน มองตาแล้วรู้ใจ แต่ผลงานเรื่องภาพใน Arcane ก็ต้องบอกว่ายกระดับไปอีกขั้น</p>\n<p>การที่ซีซันแรกมีเพียง 9 ตอน ทำให้ผู้สร้าง (ไม่ว่าจะเป็น Netflix, Riot, Fortiche) สามารถลงทุนเรื่องงานภาพได้มาก ไม่ใช่เฉพาะแค่การวาด แต่การออกแบบฉากต่อสู้ มุมกล้อง สีและสัญลักษณ์ ยังสัมผัสได้ชัดถึงคุณภาพและความตั้งใจในการเล่าเรื่องด้วยภาพ ที่พิเศษไปกว่าแอนิเมชันทั่วไป</p>\n<p>ที่ผมชอบคือการออกแบบฉากต่อสู้ (มันเป็นซีรีส์แอคชั่นนี่เนอะ) ให้ดูเหมือนเป็นตัวแทนของสองนคร ผ่านคู่สีสองสีคือ ฟ้า (hextech ของ Piltover) และม่วง (Shimmer ของ Zaun) เมื่อใดที่สองเทคโนโลยีต้องมาปะทะกัน (โดยเฉพาะในช่วงท้ายๆ) ก็ทำให้เราเห็นการปะทะกันระหว่างสองคู่สีนี้ชัดเจนขึ้น</p>\n<p></p>\n<h2>เพลงและดนตรีประกอบ</h2>\n<p>Riot Games เป็นค่ายเกมที่ลงทุนเรื่องเพลงอย่างมาก โปรดิวเซอร์ของ Arcane มีทั้งหมด 4 คน โดย Marc Merrill กับ Brandon Beck เป็นสองผู้ก่อตั้ง Riot Games จึงมีชื่อโดยปริยายอยู่แล้ว แต่คนดูแลหลักของซีรีส์อีก 2 คนคือ Christian Linke เป็นคนทำเพลงในเกม LoL ด้วย (อีกคนคือ Alex Yee เป็นคนเขียนบทและการเล่าเรื่องในเกม) จึงไม่แปลกใจที่ Arcane จะโดดเด่นทั้งเรื่องเล่าและเพลง</p>\n<p>เรื่องเพลงประกอบหลักเคยเขียนไปแล้วในตอน <a href=\"https://markpeak.net/everybody-wants-to-be-my-enemy/\">Everybody Wants to Be My Enemy</a> แต่ในเรื่องก็ยังมีการใช้เพลงอื่นๆ ประกอบการเล่าเรื่องบ้าง เช่น ฉากละครเพลงที่บรรดามุขมนตรีในเรื่องไปรับชมที่โรงละคร</p>\n<p>นอกจากนี้ คนพากย์เสียงตัวละครก็ทำได้ดี (ผมดูพากย์ภาษาอังกฤษ) โดยเฉพาะ Ella Purnell ที่พากย์เสียง Jinx ซึ่งตามบทแล้วยากมากๆ แต่ก็ทำได้ดี และได้รับคำชมมากมาย</p>\n<h2>บทสรุป</h2>\n<p>Arcane ถือเป็นหนึ่งในซีรีส์แอนิเมชันที่ดีที่สุดเท่าที่เคยดูมา (หวังว่าซีซันต่อๆ ไปคุณภาพจะไม่ดร็อป) ทำออกมาดีทุกด้าน ไม่ว่าจะเป็น ตัวละครที่น่าจดจำ รายละเอียดของโลกในเรื่องที่น่าเชื่อถือ บทละครที่เขียนมาลงตัว งานภาพที่สวยงาม โดดเด่นมีเอกลักษณ์ เสียงประกอบ-ดนตรีที่สอดแทรกมาได้ดี ฯลฯ (แต่สิ่งที่ต้องชมที่สุดก็คือบท ถ้าบทไม่ดีแล้ว อย่างอื่นจะดีแค่ไหน ภาพรวมมันก็ห่วย)</p>\n<p><a href=\"https://www.ign.com/articles/arcane-season-1-review-league-of-legends\">เว็บไซต์ IGN</a> บอกว่านี่คือตัวอย่างที่พิสูจน์ให้เห็นว่า หนังที่ดัดแปลงจากเกมไม่จำเป็นต้องห่วยเสมอไป (this League of Legends adaptation puts the final nail in the coffin of the “video game adaptation curse”) และให้คะแนนรีวิว 10/10 ระดับ Masterpiece</p>The post <a href=\"https://markpeak.net/arcane-season-1/\">Arcane Season 1</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"eb00a315468539c604e0308ad48471bf874d133005691f2ed24d6105d30de16b","category":"Thai"}