{"title":"iOS 17 to Include Mood Tracker and Health App for iPad, AI-Based Health Coaching Service Coming in 2024","link":"https://www.macrumors.com/2023/04/25/ios-17-health-app-updates/","date":1682448230000,"content":"The <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> update that Apple plans to show off in June will include several new health-related features, according to <em><a href=\"https://www.bloomberg.com/news/articles/2023-04-25/apple-aapl-developing-ai-health-coaching-service-ipados-17-health-app\">Bloomberg</a></em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a>. There will be a feature for tracking mood, plus Apple plans to bring the Health app to the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> for the first time.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/apple-health-app.jpg\" alt width=\"2048\" height=\"1145\" />\r<br />\nApple has long had a Health app, but it has been exclusively available on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, something that could change with the launch of ‌iOS 17‌. The Health app on ‌iPad‌ would give users more screen real estate for viewing health metrics, electrocardiogram results, prescriptions, lab tests from doctors, and more. Apple's aim is to improve the popularity of the Health app in healthcare settings, where tablets are widely used.\r<br />\n\r<br />\nIn addition to bringing the Health app to the ‌iPad‌, Apple plans to introduce a new emotion tracker, which will let users keep track of their mood, answer questions about their day, and view the results over time. In the future, algorithms could be used to determine a user's mood through their speech patterns, what they've typed, and other data, but Apple will start with mood tracking.\r<br />\n\r<br />\nThe mood tracking function that Apple has in mind for the Health app in ‌iOS 17‌ will be <a href=\"https://www.macrumors.com/2023/04/21/apple-launching-journaling-app/\">separate from the journaling app</a> that was rumored last week. According to Gurman, the journaling app will not be a health feature, but will instead serve as an extension of the <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> service and other location features, as Apple wants to expand the social networking capabilities of ‌Find My‌.\r<br />\n\r<br />\nThe Health app is also set to gain new features for managing vision conditions like nearsightedness. As previously rumored, the AR/VR headset Apple has in the works will include health-centric features, such as a meditation app that will walk users through calming meditations.\r<br />\n\r<br />\nNext year, Apple will expand its health offerings with a new health coaching service. Codenamed Quartz, the AI-based service will help encourage users to exercise, improve their eating habits, and take steps to improve their sleep. The service will use data from the Apple Watch to make personalized suggestions and create tailored coaching programs, with Apple planning to charge a monthly fee. While the service is planned for 2024, Gurman cautions that it could be \"canceled or postponed.\"\r<br />\n\r<br />\nOther major future health plans include blood pressure monitoring for the Apple Watch and noninvasive glucose monitoring, both functions that Apple has been working on for many years.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">Bloomberg</a>, <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/25/ios-17-health-app-updates/\">iOS 17 to Include Mood Tracker and Health App for iPad, AI-Based Health Coaching Service Coming in 2024</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-to-include-mood-tracker-and-health-app-for-ipad-ai-based-health-coaching-service-coming-in-2024.2387788/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"eb09bb12e422c5801d777e50f92fcd8c3fc844dc766d528d75a397a045e9ddaa","category":"Apple"}