{"title":"Nano ZnO and bioinoculants mitigates effects of deficit irrigation on nutritional quality of green peppers","link":"https://www.preprints.org/manuscript/202407.1351/v1","date":1721183331000,"content":"Green peppers (Capsicum annuum L.) is a fruit vegetable with great culinary versatility, and present important nutritional properties for human health. Water deficit negatively affects nutritional quality of green peppers fruits. This study aimed to investigate the influence of zinc oxide nanoparticles (ZnONPs), associated with plant growth-promoting bacteria (PGPB), on the post-harvest quality nutritional of green peppers subjected to water deficit. In an open-field ex-periment, two irrigation levels (50 and 100% of crop evapotranspiration - Etc), four treatments composed by combination of ZnONPs, zinc sulfate (ZnSO4) and PGPB (T1 = ZnSO4, T2 = foliar ZnONPs, T3 = foliar ZnONPs + PGPB, T4 = ZnSO4 via soil + PGPB via soil) and a control treatment (Check) were tested. Water deficit or water deficit mitigation treatments did not interfere with the physical-chemical parameters (except vitamin C content) and physical color parameters (except L*) of green pepper. The water deficit reduced the levels of Ca, Mg, P, K, Mn, Fe, B, and Zn in the fruits. The foliar application of ZnONPs in association with PGPB provided better nutritional quality of green pepper in terms of vitamin C and mineral nutrients. Under water deficit, ZnONPs or ZnSO4 via foliar, associated or not with PGPB, increased the levels of Ca, P, Mg, and Fe in the fruits. Applying Zn via foliar as ZnONPs or ZnSO4 mitigated the negative effects of water deficit on the quality of pepper fruits that was enhanced by the Bacillus subtilis and B. amyloliquefaciens inoculation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"eb0f904e70a30979cb362bf0d91996f1f0a36934dc0b9bdec31ebd94f15f89a6","category":"Interdisciplinary"}