{"title":"The influence of diagnostic subgroups, patient- and hospital characteristics for the validity of cardiovascular diagnoses–Data from a Norwegian hospital trust","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302181","date":1713276000000,"content":"<p>by Cathrine Sæthern Rye, Anne Pernille Ofstad, Bjørn Olav Åsvold, Pål Richard Romundstad, Julie Horn, Håvard Dalen</p>\r\nBackground <p>Cardiovascular discharge diagnoses may serve as endpoints in epidemiological studies if they have a high validity. Aim was to study if diagnoses-specific characteristics like type, sub-categories, and position of cardiovascular diagnoses affected diagnostic accuracy.</p> Methods <p>Patients (n = 7,164) with a discharge diagnosis of acute myocardial infarction, heart failure or cerebrovascular disease were included. Data were presented as positive predictive values (PPV) and sensitivity.</p> Results <p>PPV was high (≥88%) for acute myocardial infarction (n = 2,189) (except for outpatients). For heart failure (n = 4,026) PPV was 67% overall, but higher (&gt;99%) when etiology or echocardiography was included. For hemorrhagic (n = 257) and ischemic (n = 1,034) strokes PPVs were 87% and 80%, respectively, with sensitivity of 79% and 75%. Transient ischemic attacks (n = 926) had PPV 56%, but sensitivity 86%. Primary diagnoses showed higher validity than subsequent diagnoses and inpatient diagnoses were more valid than outpatient diagnoses (except for transient ischemic attack). The diagnoses of acute myocardial infarction and heart failure where most valid when placed at cardiology units, while ischemic stroke when discharged from an internal medicine unit.</p> Conclusions <p>The diagnoses of acute myocardial infarction and stroke had excellent validity when placed during hospital stays. Similarly, heart failure diagnoses had excellent validity when echocardiography was performed before placing the diagnosis, while overall the diagnoses of heart failure and transient ischemic attack were less valid. In conclusion, the results indicate that cardiovascular diagnoses based on objective findings such as acute myocardial infarction and stroke have excellent validity and may be used as endpoints in clinical epidemiological studies with less rigid validation.</p>","author":"Cathrine Sæthern Rye","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"eb14d0e850bb1565b0a3d8223248512b4443334b2c7f897e62801fb5d2e163c5","category":"Interdisciplinary"}