{"title":"องค์กรกว่า 90 แห่ง รวมตัวกันประท้วง Slack ให้เพิ่มการเข้ารหัสแบบ end-to-end","link":"https://www.blognone.com/node/134119","date":1685615510000,"content":"<div><div><div><p>องค์กรมากกว่า 90 องค์กรได้ร่วมกันประท้วงหน้าสำนักงานใหญ่ Slack ที่ซานฟรานซิสโกเมื่อวันพุธที่ผ่านมา มีการนำป้ายมาประท้วงรอบๆ บริษัท เพื่อเรียกร้องให้บริษัทเปิดใช้การเข้ารหัสแบบ end-to-end และเพิ่มฟีเจอร์การบล็อกและการรายงานข้อความไม่เหมาะสม</p>\n<p>Caitlin Seeley George ผู้อำนวยการของ Fight for the Future หนึ่งในองค์กรที่รวบรวมผู้ประท้วงกล่าวว่า Slack แพลตฟอร์มที่ให้คนสามารถสื่อสารทางออนไลน์ มีผู้ใช้หลายล้านคนใช้ Slack ทุกวันในการทำงาน แต่ทาง Slack กำลังทำให้ผู้ใช้ตกอยู่ในความเสี่ยงจากการไม่มีฟีเจอร์การเข้ารหัส, บล็อก และฟีเจอร์รายงานข้อความหรือผู้ใช้ไม่เหมาะสม</p>\n<p>Slack ให้สัมภาษณ์กับทาง Gizmodo ว่าคำนึงถึงประโยชน์ของผู้ใช้งานเป็นหลักและได้ดำเนินการเพื่อป้องกัน แต่ไม่ได้ตอบคำถามถึงแผนที่จะมีการเข้ารหัสแบบ E2EE ในอนาคต แต่ระบุว่าทุกวันนี้ข้อความใน Slack ก็เข้ารหัสระหว่างส่งข้อมูลไปยังเซิร์ฟเวอร์ (data in transit) และเข้ารหัสขณะที่เก็บในดิสก์ (data at rest) อยู่แล้ว รวมถึงว่าผู้ใช้สามารถเปิดฟีเจอร์ลบข้อความอัตโนมัติได้</p>\n<p>ทางโฆษก Slack กล่าวว่า Slack จะไม่แชร์ข้อมูลลูกค้ากับหน่วยงานของรัฐหรือบุคคลที่สาม เว้นแต่มีข้อกำหนดทางกฎหมายที่จะต้องทำเช่นนั้น และบริษัทจะพยายามต่อสู้กับคำขอของรัฐที่กว้างเกินไปหรือไม่เหมาะสม แต่สำหรับฟีเจอร์การความปลอดภัยเพิ่มเติมนั้นบริษัทก็พิจารณาตลอดเวลาเวลาว่ามีฟีเจอร์ใดเหมาะกับการใช้งานของลูกค้าหรือไม่</p>\n<p>ความขัดแย้งในสหรัฐฯ ว่าการทำแท้งสามารถทำได้อย่างถูกกฎหมายหรือไม่เป็นประเด็นที่โต้แย้งกันในหลายรัฐ Fight for the Future แสดงความกังวลว่าหน่วยงานบังคับกฎหมายบางรัฐอาจจะพยายามดึงข้อความในแชตเพื่อดำเนินคดีกับการทำแท้ง การเปิดใช้งานการเข้ารหัสข้อความแบบ end-to-end เป็นทางหนึ่งที่บริษัทจะปฏิเสธคำร้องขอให้บริษัทเปิดเผยข้อความ เพราะไม่มีข้อความที่อ่านได้อยู่บนเซิร์ฟเวอร์ ก่อนหน้านี้แอปแชตหลายตัวก็รองรับการเข้ารหัสแบบ end-to-end เช่น WhatsApp และ Signal</p>\n<p>Reem Suleiman หัวหน้าทนายของ Mozilla กล่าวว่า “Slack ต้องปกป้องผู้ใช้งาน โดยเพิ่มฟังก์ชันด้านความปลอดภัยทั่วไป เช่น การเข้ารหัสแบบ end-to-end”</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5299320e6f7908df2ec2cddf79370810.jpg\" /><em>source: Twitter @fightfortheftr</em></p>\n<p>ที่มา: <a href=\"https://gizmodo.com/slack-abortion-encryption-protest-sf-office-1850492088\">Gizmodo</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/slack\">Slack</a></div><div><a href=\"/topics/encryption\">Encryption</a></div><div><a href=\"/topics/security\">Security</a></div><div><a href=\"/topics/privacy\">Privacy</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"eb163c36e53eb1ba78df0ad9de0113ea2c1017d5aa20485d13a59dfdcaf983b2","category":"Thai"}