{"title":"Mini-LED is nice but Center Stage is the iPad Pro feature the Mac needs","link":"https://www.macworld.com/article/352572/ipad-pro-center-stage-mac-ultra-wide-camera-apple-tv-camera-accessory.html","date":1628084415000,"content":"<div>\n<section><div></div></section><p>The iPad Pro has frequently been an incubator for technology that Apple ultimately plans on rolling out to the rest of its product line. Last year, the iPad Pro got a LiDAR scanner months before it appeared in the iPhone 12. This year’s 12.9-inch model introduced the mini-LED screen technology that will probably be showing up very soon in <a href=\"https://www.macworld.com/article/346129/2021-macbook-pro-14-inch-16-inch-mini-led-m1x-touch-bar-card-reader-webcam-magsafe-price-release.html\">a new line of MacBook Pro laptops</a>. And this fall’s iPhone Pro models are rumored to come with high-refresh-rate displays, pioneered years ago <a href=\"https://www.macworld.com/article/230177/105-inch-ipad-pro-review.html\">on the iPad as ProMotion</a>.</p>\n\n\n\n<p>But there’s another core Apple technology of the future that’s currently available only on the newest iPad Pro. And I’m confident that, in the next couple of years, you’ll see it spread across most (but not all) of Apple’s products: Center Stage.</p>\n\n\n\n<figure><div>\n<div>\n<a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/105/media/us/ipad-pro/2021/08087f4b-7539-4b1e-ae8a-adc18f4242ae/anim/cameras/large_2x.mp4&amp;subid1=1-1-352572-1-0-0\">https://www.apple.com/105/media/us/ipad-pro/2021/08087f4b-7539-4b1e-ae8a-adc18f4242ae/anim/cameras/large_2x.mp4</a></div>\n</div></figure><p>Center Stage uses machine-learning technology to pan and zoom in a camera’s field of view to get the perfect shot during a FaceTime call or other videoconference. It will zoom in on a single subject, or zoom out to find every person in the frame. If you haven’t tried Center Stage, you’ll need to trust me: It’s great. And having experienced it for months on my iPad Pro, I now want it everywhere. It’s too good a feature not to be, and as soon as possible.</p>\n\n\n\n<h2>The obvious destination: Mac</h2>\n\n\n\n<p>I like the new 24-inch M1 iMac, which was announced on the same day as the new iPad Pro. But it’s so frustrating that Apple introduced Center Stage on the iPad Pro and omitted it from the iMac. (Chalk that one up to parallel product development, I guess—I suspect that the iMac’s design predates the iPad’s, despite them arriving simultaneously.)</p>\n\n\n\n<p>Really, it’s only a matter of time until Center Stage appears on the Mac. The technology is perfect for any device that generally stays still while people position themselves around its front-facing camera. The iMac is perfect for this, which is why I’d expect that the next iMac we see–presumably a replacement for the 27-inch Intel iMac that Apple is still selling–will support Center Stage. And that eventually the 24-inch model will be updated to support it, too. It just makes too much sense in a device that will be stuck on a desk or kitchen counter.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/iPad-center-stage.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Center Stage follows you as you move around the camera.</figcaption></figure><p>Apple</p></div>\n\n\n\n<p>But I think Center Stage will make sense on Apple’s laptops too. While I will occasionally take part in a videoconference with a MacBook on my lap, most of the time I’ll set the laptop on a table or chair. Families with Mac laptops enabled with Center Stage can turn them into great FaceTime devices just by placing them on the coffee table.</p>\n\n\n\n<p>To me, the only question is <em>when</em> Center Stage will arrive. On the software side, I suspect Apple’s already got this covered—the code that’s running on the iPad Pro is, after all, already optimized for Apple Silicon. The real question is hardware. Center Stage takes advantage of an ultra-wide front-facing camera, so it can capture as much of a room as possible and then dynamically crop and remove distortion to give you the sense that there’s a camera operating zooming and panning. Apple’s been slow to upgrade the front-facing cameras on Macs, but I very much hope that this next round of redesigned laptops leaves space for a high-resolution ultra-wide camera capable of being an excellent source for Center Stage.</p>\n\n\n\n<h2>Other anchored devices could benefit</h2>\n\n\n\n<p>A few months back, there were rumors that Apple was testing out a future HomePod that would have a screen. As a user of an Amazon Echo Show, I can see the appeal of such a device. But once Center Stage came on the scene, the shape of an Apple product strategy came into view.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/iPad-Pro-2021-front-camera.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The iPad Pro’s ultra-wide camera is what makes Center Stage possible.</p></figcaption></figure><p>Dominik Tomaszewski/IDG</p></div>\n\n\n\n<p>An Echo Show, HomePod, or any other device that might be parked in a kitchen or living area has a real liability: it’s probably not going to get picked up and moved around. And yet, when you consider a device in this class, it’s hard not to imagine video calls being a key use case. I’ve tried video calls on my Echo Show, but the angle is lousy and Amazon’s calling software isn’t worth my time.</p>\n\n\n\n<p>But when I imagine a similar device, built by Apple and with a camera equipped with Center Stage, it gets a lot more interesting. That device, anchored in one position, can follow you around the room as you talk. It’s a perfect match. (I also think this would be a great match for a future Apple TV model or Apple TV camera accessory that sits atop the TV screen, to enable FaceTime calls on the big screen—while keeping the actual picture it’s shooting dynamic and interesting.)</p>\n\n\n\n<h2>Dynamic devices? Not so much</h2>\n\n\n\n<p>As for the rest of Apple’s product line, I’m not so sure. I don’t really see how most iPhone use cases would work with Center Stage since you hold an iPhone in your hands and can position it as you like. You’re the camera operator, in that case.</p>\n\n\n\n<p>And then there’s the Apple Watch, which obviously doesn’t need Center Stage—or does it? Maybe not the Center Stage we know now, but I wonder if the same techniques that Center Stage uses to remove distortion from a wide-angle lens might allow a camera mounted somewhere on an Apple Watch to create a more pleasing image that looks more like a professionally shot video and less like a camera pointing up someone’s nose. Apple can only do so much, but the power of this technology is strong.</p>\n</div>","author":"Jason Snell","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"eb208ebba53bdc9f4c203b32ddeae461789a53a6dcff8ce87f5016691e01cf88","category":"Apple"}