{"title":"The Integral Nature of the Scientific Enterprise","link":"https://www.preprints.org/manuscript/202408.1674/v1","date":1724403841000,"content":"Science seeks to explicate truths about our reality.  But what is truth?  How do we know things?  Given our ignorance, and our fallibility, why should scientists be trusted? \nA theory of knowledge that addresses these human questions is sketched, in conversation with recent advances in thermodynamics which underline the seminal importance of unity by demonstrating (i) a definite physical meaning of the idea of “unitary entity”, (ii) the commensurability of the local and the non-local (resolving the Loschmidt Paradox), and (iii) the applicability of this entropic physics to entities at all scales, whether small (“quantum mechanical”) or large (subject to “general relativity”).  Similarly, integrity is indispensable to the scientific enterprise, whether at the level of the mathematico-physical, the practising scientist, the scientific community, or the public.\nAs a human activity aimed at touching reality, it is fundamental that the scientific enterprise necessarily also has an irreducibly poetic component.  Although in principle it cannot be completely specified, this enterprise is a cluster of procedures designed to increase our understanding of the natural world.  Our apprehension of knowledge is irreducibly personal, depending both on our own individual integrity as well as on the integrity of the scientific community. \nBelieving that “reality” exists and can be grasped (however incompletely), scientists look for coherence and value unified accounts.  Strictly speaking, although reality can be known truly (if only in part) the idea of “objective” knowledge is an oxymoron, even if such an idea is often a useful approximation.  Knowledge is necessarily personal.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"eb20bc22f3b756d5297db8ba02ba2256fc8f5dc2c9b881b9a1a07070d8259663","category":"Interdisciplinary"}