{"title":"Natural resources, a curse or blessing for international trade? Empirical evidence from CAREC nations","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12560?af=R","date":1726466891000,"content":"<h2>Abstract</h2>\n<p>There is a huge pile of literature, accessible on economic growth (GDP), natural resource rents (NR), mineral rents (MR), natural gas rents (GR), oil rents (OR), and forest rents (FR) but it does not address the association between trade openness (TO) and the availability of these resources. Thus, this study objectively probes the link among these resources and TO in CAREC nations (Georgia, China, Pakistan, Azerbaijan, Kazakhstan, Kyrgyzstan, Tajikistan, and Uzbekistan) from 2000 to 2022. Mongolia, Afghanistan, and Tajikistan from CAREC countries are exempted in this inquiry due to unavailability of the data for the variables, GR, MR, and OR. The key methods used in this inquiry include method of moment quantile regression (MMQR) followed by Westerlund analysis, slope heterogeneity, CIPS unit root test, cross-sectional dependence (CSD), and matrix correlation. The MMQR yields valid, trustworthy, and robust results. The empirical estimates demonstrate that MR and OR suggest significant positive impacts on TO. However, NR, GR, FR, and GDP have negative association with TO in CAREC countries. Besides, the research offers pertinent theoretical, and managerial blueprint proposals for global commerce by utilizing MR, OR, FR, and NR contributing to sustainable development goals (SDGs) by fostering economic development, promoting sustainable development, and addressing environmental and social challenges, and highlighting the real impact and association of these resources with TO based on empirical aftermath of the study.</p>","author":"Guojun Qian","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"eb25d35ccb71984ba58187c2a81a09c6b3d4c8d4c0703a5acbc403f5c9cb8e19","category":"Environment"}