{"title":"Investigation of the pangas (Pangasianodon hypophthalmus) cultivation sustainability in cages at the Ratargul Freshwater Swamp Forest of Bangladesh","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.193?af=R","date":1720768403000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6ca0464f-f7d8-4c90-a450-f31c47a057c0/aff2193-gra-0001-m.png\" alt=\"Investigation of the pangas (Pangasianodon hypophthalmus) cultivation sustainability in cages at the Ratargul Freshwater Swamp Forest of Bangladesh\" />\n<p>1. Aquaculture appears to be a rapidly expanding industry, and cage culture also offers an opportunity to utilize existing water resources.\n2. Economically, it is a low-impact farming practice with high returns and the least carbon emission activity.\n3. The benefit-cost analysis revealed that compared to other trails, the stocking density of 30 fish/m<sup>3</sup> had a much higher BCR value.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Determining the most appropriate stocking density for a specific fish species in an ambient condition is essential for successful cage aquaculture in terms of profitability which is mainly governed by growth. The current study was conducted to ascertain which stocking density gives the best result of widely cultured species in cage aquaculture, pangas (<i>Pangasianodon hypophthalmus</i>), at swamp forest environment of Ratargul Freshwater Swamp Forest, Bangladesh in terms of growth, production and economic return. Fish were reared for 93 days at three stocking densities, namely 30, 40 and 50 fish/m<sup>3</sup> which were denoted as FSD30, FSD40 and FSD50, respectively, containing three replications of each. Growth and yield comparisons indicated that the stocking density of fish had significant (<i>p</i> &lt; 0.05) effects on growth rate and productivity. Fish cultivated at the maximum density (FSD50) had lower mean weights than fish reared at lower densities. The significantly highest mean weights (376.58 ± 14.65 g) and benefit–cost ratio (BCR) (1.617 ± 0.035) obtained from FSD30 show the suitability of this density in terms of fish growth and profitability of pangas in swamp forest environment.</p>","author":"Mrityunjoy Kunda, \nMd. Abu Kawsar, \nDiponkor Adikari, \nSakib Tahmid Rishan, \nAhmed Harun‐Al‐Rashid, \nDebasish Pandit","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"eb2a3950001853c9e09391415b5bcdcc2f290cb8a1e0e02c0af00403c977fd85","category":"Environment"}