{"title":"News breaks of surprise cameo as Warner Bros. drops final The Flash trailer","link":"https://arstechnica.com/?p=1941742","date":1684954101000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Warner Bros has dropped the final trailer for <em>The Flash</em>, coming to theaters on June 16, 2023. </p></div>\n<p>We have one last trailer for <em>The Flash</em> in advance of the film's release on June 16, 2023. Its release coincides with some spoiler-y casting news. Apparently director Andy Muschietti spilled the beans about a surprise cameo in the forthcoming film, <a href=\"https://variety.com/2023/film/news/the-flash-cameo-nicolas-cage-superman-1235623843/\">according to Variety</a> (huge spoiler at link)—much to <a href=\"https://gizmodo.com/the-flash-movie-cameo-spoiler-nic-cage-superman-dc-1850469202\">the annoyance</a> of some fans.</p>\n<p><strong>(Some spoilers below and one major reveal toward the end. We'll give you another heads up when we get there.)</strong></p>\n<p>As <a href=\"https://arstechnica.com/gaming/2023/04/intense-new-trailer-for-the-flash-wows-the-crowd-at-cinemacon/\">previously reported</a>, earlier scripts focused on adapting the <a href=\"https://en.wikipedia.org/wiki/Flashpoint_(comics)\"><em>Flashpoint</em></a> crossover storyline from the comic books, in which the Scarlet Speedster goes back in time to keep his mother from being murdered, thereby altering the entire timeline. In that alternate world, a young Bruce Wayne is killed rather than his parents. Thomas Wayne becomes Batman, Martha Wayne becomes the Joker, Wonder Woman and Aquaman are bitter enemies, and Superman is a prisoner. Muschietti kept several of the <em>Flashpoint</em> story elements while acknowledging that this would be a different version. And he wanted to include not just Michael Keaton's Batman but Ben Affleck's, too, since he thought Barry's relationship with the latter would make Keaton's inclusion even more powerful.</p></div><p><a href=\"https://arstechnica.com/?p=1941742#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1941742&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"eb2a4eddf8851fa5932953b637fadd97215af42700a97f8a40d75895d9a09aca","category":"Tech"}