{"title":"The N-terminal activation function AF-1 domain of ERα interacts directly with the C-terminal AF-2-holding ligand-binding domain to recruit the coactivator proteins","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312276","date":1729519200000,"content":"<p>by Xiaohui Liu, Yutaka Matsuyama, Makiko Sugiyama, Keitaro Suyama, Takeru Nose, Miki Shimohigashi, Yasuyuki Shimohigashi</p>\r\n\r\nCryoelectron microscopy (cryo-EM) clarified the quaternary structure of the DNA complex of coactivator-bound estrogen receptor alpha (ER<i>α</i>), revealing the adjacency of the N-terminal domain (NTD) and C-terminal ligand-binding domain (LBD). ER<i>α</i>-NTD and LBD constitute activation function 1 (AF-1) and activation function 2 (AF-2), respectively. These domains are essential for transcription activation. Their spatial proximity was judged to be essential for ER<i>α</i> to recruit the SRC coactivator proteins. In the present study, we first evaluated untethered free ER<i>α</i>-NTD(AF-1) [residues 1–180] and its-truncated desNTD(AF-1)-ER<i>α</i> [residues 181–595] in a luciferase reporter gene assay. ER<i>α</i>-NTD(AF-1) was completely inactive, whereas desNTD(AF-1)-ER<i>α</i> exhibited 66% activity of wild-type ER<i>α</i>. Surprisingly, ER<i>α</i>-NTD(AF-1) was found to inhibit desNTD(AF-1)-ER<i>α</i> markedly. Therefore, assuming that ER<i>α</i>-NTD(AF-1) must also inhibit wild-type full-length ER<i>α</i>, we co-expressed ER<i>α</i>-NTD(AF-1) and full-length ER<i>α</i>. As expected, ER<i>α</i>-NTD(AF-1) inhibited ER<i>α</i> in a dose-dependent manner, but non-competitively for 17<i>β</i>-estradiol. When their intracellular transport was examined immunocytochemically, ER<i>α</i>-NTD(AF-1) showed a distinct translocation from the cytoplasm to the nucleus, despite being expressed solely in the cytoplasm without full-length ER<i>α</i>. This nuclear translocation was attributable to a direct interaction between ER<i>α</i>-NTD(AF-1) and full-length ER<i>α</i> consisting of the nuclear localization signal. The present results demonstrated that, in full-length ER<i>α</i>, the N-terminally tethered NTD(AF-1) domain collaborates with the C-terminal LBD(AF-2) for coactivator recruitment.","author":"Xiaohui Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"eb30540d9571a4ed8d91fb996604ecae989bf1448593dd49b4b4cd2cf3a3d93a","category":"Interdisciplinary"}