{"title":"Idaho begins rationing care as hospitals crumple under COVID load","link":"https://arstechnica.com/?p=1792595","date":1631052167000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1225590830-800x533.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1225590830.jpeg\">Enlarge</a> <span>/</span> A coronavirus preparedness tent setup outside a hospital emergency room entrance at Gritman Medical Center in the northern Idaho city of Moscow in March 2020. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/coronavirus-preparedness-tent-set-up-outside-hospital-news-photo/1225590830?adppopup=true\">Getty | Education Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The Idaho Department of Health and Welfare on Monday activated its \"crisis standards of care\" in 10 northern hospitals hard-hit by staff shortages, hospital bed shortages, and a \"massive increase in patients with COVID-19 who require hospitalization,\" the department announced Tuesday.</p>\n<p>The <a href=\"https://arstechnica.com/science/2020/03/who-lives-who-dies-guidelines-for-hospitals-in-the-time-of-covid-19/\">crisis standards</a> mean that the quality of care in those hospitals will be reduced for all patients. Resources will be rationed, and patients with the best chances of survival may be prioritized.</p>\n<p>In practice, that could mean that: emergency medical services may prioritize which 911 calls they respond to; some people who would normally be admitted to the hospital will instead be turned away; some admitted patients may be sent home earlier than typical or may find their hospital bed in a repurposed area of the hospital, like a conference room; and, in the worst cases, hospital staff might not be able to provide an intensive care unit bed or a ventilator to a patient who has a relatively low chance of survival.</p></div><p><a href=\"https://arstechnica.com/?p=1792595#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1792595&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"eb3c96d1c6ef37aed25a7106a75a7183858b17b781af4284dbb67cea34c08257","category":"Tech"}