{"title":"There’s new evidence of a large cold spot partly causing dimming of Betelgeuse","link":"https://arstechnica.com/?p=1786831","date":1628797126000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/02/eso2003c-800x400.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/02/eso2003c.jpg\">Enlarge</a> <span>/</span> Astronomers continue to ponder the strange, dramatic dimming in the light from Betelgeuse, a bright red star in the Orion constellation, first observed in December 2019. (credit: <a href=\"https://www.eso.org/public/images/eso2003c/\">ESO/M. Montargès et al.</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Back in June, <a href=\"https://arstechnica.com/science/2021/06/astronomers-explain-mysterious-dimming-of-betelgeuse-stardust/\">we reported</a> on a likely explanation for the strange, dramatic dimming of <a href=\"https://en.wikipedia.org/wiki/Betelgeuse\">Betelgeuse</a>, a bright red star in the Orion constellation: The star burped out a massive gas bubble, resulting in lower temperatures that condensed heavier elements into dust that temporarily obscured the starlight. Now, a team of Chinese scientists has found evidence of a large, dark, cooler spot on the star—consistent with those earlier findings—based on spectral analysis, according to <a href=\"https://www.nature.com/articles/s41467-021-25018-3\">a recent paper</a> published in the journal Nature Communications.</p>\n<p>As Ars' John Timmer <a href=\"https://arstechnica.com/science/2020/08/astronomers-kill-all-the-fun-blame-dust-for-betelgeuses-dimming/\">reported last year</a>, Betelgeuse is one of the closest massive stars to Earth, about 700 light-years away. It's an old star that has reached the stage where it glows a dull red and expands, with the hot core only having a tenuous gravitational grip on its outer layers. The star has something akin to a heartbeat, albeit an extremely slow and irregular one. Over time, the star cycles through periods when its surface expands and then contracts.</p>\n<p>Astronomers noticed the pronounced dimming of the light from <a href=\"https://en.wikipedia.org/wiki/Betelgeuse\">Betelgeuse</a> in December 2019; the difference was even visible to the naked eye. And the dimming persisted, decreasing in brightness by 35 percent in mid-February before brightening again in April 2020. Astronomers puzzled over the phenomenon and wondered whether it was a sign that the star was about to go supernova. </p></div><p><a href=\"https://arstechnica.com/?p=1786831#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1786831&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"eb40bf031a76715f9c60fee96f4aa8ab4624dd5410ddbcfea34ad14d56fb5cd4","category":"Tech"}