{"title":"Announcing the Beta Release of Consul Service Mesh for Amazon ECS","link":"https://www.hashicorp.com/blog/announcing-the-beta-release-of-consul-service-mesh-for-amazon-ecs","date":1632931200000,"content":"<p>We are pleased to announce the public beta for <a href=\"https://www.consul.io/\">HashiCorp Consul</a> service mesh on <a href=\"https://aws.amazon.com/ecs/\">Amazon Elastic Container Service</a> (ECS). AWS users can now select Consul  as their service mesh for secure ECS deployments.</p>\n<p>In May 2021, we <a href=\"https://www.hashicorp.com/blog/announcing-consul-service-mesh-for-amazon-ecs\">introduced Consul service mesh for Amazon ECS</a> as a tech preview. Today’s beta release includes several new enhancements since the tech preview:</p>\n<ul>\n<li><strong>Secure deployment</strong>: Consul can now be deployed in secure mode, enabling defense-in-depth security mechanisms using access control lists (ACLs), Transport Layer Security (TLS), and <a href=\"https://www.consul.io/docs/security/encryption\">gossip encryption</a>. ACLs are used to provide secure access to Consul’s UI, API, CLI, service communications, and agent communications. Gossip communication between agents is secured and encrypted with a symmetric key, and TLS is used to secure the RPC calls between agents.</li>\n<li><strong>Support for Amazon ECS launch types</strong>: You can now deploy Consul client agents on both <a href=\"https://docs.aws.amazon.com/AmazonECS/latest/developerguide/launch_types.html\">Fargate and EC2 launch types</a>. The HashiCorp Consul AWS ECS Terraform module helps deploy applications seamlessly on both launch types.</li>\n<li><strong>HashiCorp Cloud Platform deployments</strong>: You can now deploy Consul client agents on ECS and peer these with Consul server agents on <a href=\"https://cloud.hashicorp.com/\">HashiCorp Cloud Platform</a> (HCP).</li>\n<li><strong>Self-managed deployment on EC2 servers</strong>: You also have the option to deploy self-managed Consul server agents on EC2 instances and client agents on ECS instances.</li>\n</ul>\n<h2><a href=\"#deploying-consul-server-s-on-hcp-with-clients-on-ecs\">»</a><a></a>Deploying Consul Server(s) on HCP with Clients on ECS</h2>\n<p>Let’s take a look at how you can securely deploy Consul service mesh on ECS with a HCP Consul server cluster.</p><img src=\"https://www.datocms-assets.com/2885/1631809552-consul-ecs-prod-secure-hcp.png\" /><p>First, you need to create a HCP Consul server cluster. You can do so by following the <a href=\"https://learn.hashicorp.com/tutorials/cloud/terraform-hcp-consul-provider\">Deploy HCP Consul with Terraform</a> HashiCorp Learn guide. After completing the guide, you should have the server cluster running and the AWS peering between the HashiCorp Virtual Network (HVN) and your AWS VPC established.</p>\n<p>Consul uses ACLs to securely communicate between agents and servers. Consul on ECS helps you automatically provision ACL tokens for the Consul clients and services on the service mesh using an ACL controller. The controller is an ECS task that runs in your ECS cluster. It watches for any new tasks that are coming up and creates ACL tokens with Consul. Here’s how to instantiate the ACL controller with Terraform:</p><pre><code>module \"acl_controller\" {\n  source \t= \"hashicorp/consul-ecs/aws//modules/acl-controller\"\n  consul_bootstrap_token_secret_arn = aws_secretsmanager_secret.bootstrap_token.arn\n  consul_server_http_addr = hcp_consul_cluster.example_hcp.consul_public_endpoint_url\n  name_prefix  = “example”\n  ...\n}</code></pre><p>Now you can deploy a service using the <a href=\"https://registry.terraform.io/modules/hashicorp/consul-ecs/aws/latest/submodules/mesh-task\"><code>mesh-task</code> module</a> with secure features enabled. To configure the <code>mesh-task</code> module, reference the needed credentials from AWS Secrets Manager and enable TLS and gossip encryption.</p><pre><code>module \"example_app\" {\n  source = \"hashicorp/consul-ecs/aws//modules/mesh-task\"\n  family = \"example-app\"\n  container_definitions = ...\n  ...\n  tls                        \t= true\n  consul_server_ca_cert_arn  \t= aws_secretsmanager_secret.consul_ca_cert.arn\n  gossip_key_secret_arn      \t= aws_secretsmanager_secret.gossip_key.arn\n  acls                       \t= true\n  consul_client_token_secret_arn = module.acl_controller.client_token_secret_arn\n  acl_secret_name_prefix     \t= “example”\n}</code></pre><p>After the <code>example-app</code> task starts, the ACL controller will automatically create the ACL token for the service. Now the communication between the <code>example-app</code> task and the Consul cluster is secure.</p>\n<h2><a href=\"#learn-more\">»</a><a></a>Learn More</h2>\n<p>For additional information about Consul on ECS, please visit our <a href=\"http://consul.io/docs/ecs\">documentation</a> and check out our HashiCorp Learn tutorial on <a href=\"https://learn.hashicorp.com/tutorials/cloud/consul-ecs-hcp?in=consul/cloud-production\">how to get started with HCP Consul and ECS</a>, which includes a sample application and code repository. HashiCorp Learn also offers <a href=\"https://learn.hashicorp.com/search?product=consul&amp;edition=hcp&amp;page=1\">many other HCP Consul related tutorials</a>.</p>\n<p>If you want to see live demos, here are some upcoming opportunities to see Consul on ECS in action and ask questions:</p>\n<ul>\n<li>Webinar: <a href=\"https://www.hashicorp.com/events/webinars/how-comcast-runs-consul-service-mesh-on-amazon-ecs\">How Comcast Runs Consul Service Mesh on Amazon ECS</a>. Wednesday, October 6 at 9:30 a.m. PT</li>\n<li><a href=\"https://hashiconf.com/global/\">HashiConf Global 2021</a> (Tuesday - Wednesday, October 19-20):\n<ul>\n<li><a href=\"https://hashiconf.com/global/speakers/jez-halford/\">Adopting Consul on ECS</a>, Jaz Halford, Head of Cloud Engineering, Tide</li>\n<li><a href=\"https://hashiconf.com/global/speakers/ruoran-wang/\">Consul Use Cases At Stripe: Service Mesh and More,</a> Ruoran Wang, Software Engineer, Stripe</li>\n</ul>\n</li>\n</ul>\n<h2><a href=\"#try-consul-on-ecs-now\">»</a><a></a>Try Consul on ECS Now</h2>\n<p>To get started deploying Consul on ECS via Terraform, use our <a href=\"https://registry.terraform.io/modules/hashicorp/consul-ecs/aws/latest\">Consul on ECS Terraform module</a>.</p>\n<p>As is typical with a beta release, we recommend against using this build in a production environment, but we encourage you to experiment with the new features in a controlled environment. We are eager to see how this support for ECS enhances your service mesh experience. If you encounter an issue, please file a new <a href=\"https://github.com/hashicorp/consul-ecs/issues\">bug report in GitHub</a> and we'll take a look.</p>","author":"Usha Kodali","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"eb4615056331d539127c5ebaa44e7ea27c558235528d13e587c3edec2afb3642","category":"Tech"}