{"title":"Evaluation of Elnady preserved tissues as a teaching aid for undergraduate animal science courses","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae077/7665983?rss=1","date":1715040000000,"content":"<span><div>Abstract</div>The use of tissue specimens for undergraduate instruction is a very valuable tool. However, fresh tissue specimens are not always available and many common preservation techniques can result in discoloration, offensive odors, and/or dangerous chemical residues. The Elnady Technique was developed as a means to produce tissue specimens that “are realistic, durable, have no offensive odor, and are dry, soft and flexible” (<a href=\"#CIT0002\">Elnady, F.A. 2016</a> The Elnady Technique: An innovative, new method for tissue preservation. <span>Altex.</span> 33:237-242. doi:10.14573/altex.1511091). Briefly for soft tissue, specimens were preserved by fixing in formalin. The tissue specimen was then dehydrated with a series of acetone baths. Once the tissue was fully dehydrated, the specimen was impregnated in glycerin. Excess glycerin was then removed by draining followed by immersion in cornstarch. Cornstarch residue was removed with a soft brush, and the specimen was stored in a plastic bag. Multiple specimens (including the female reproductive tract of the cat, goat, horse, and sow; digestive tract of cat, chicken, and dog; 1-day-old lamb stomach; goat rumen, reticulum, omasum, and abomasum; and sheep heart and kidney) have been preserved and used in various animal science course laboratories (126 laboratory sections and 1,696 students at Berry College). Some of the specimens have been in use for seven years and are still in usable condition. Anonymously surveyed Berry College Animal Science Faculty strongly agreed or agreed that Elnady preserved tissues are a useful teaching aid (<span>n</span> = 5). The Elnady Technique has proven to be a useful means of preserving tissue samples used in undergraduate animal science courses.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"eb47784fb554d9bc325694034487534ba6d045b21267bf1fe7279bd1ebc2a612","category":"Environment"}