{"title":"New – Amazon FSx for NetApp ONTAP","link":"https://aws.amazon.com/blogs/aws/new-amazon-fsx-for-netapp-ontap/","date":1630597136000,"content":"<p>Back in 2018 I wrote about the first two members of the <a href=\"https://aws.amazon.com/fsx/\">Amazon FSx</a> family of fully-managed, highly-reliable, and highly-performant file systems, <a href=\"https://aws.amazon.com/blogs/aws/new-amazon-fsx-for-lustre/\">Amazon FSx for Lustre</a> and <a href=\"https://aws.amazon.com/blogs/aws/new-amazon-fsx-for-windows-file-server-fast-fully-managed-and-secure/\">Amazon FSx for Windows File Server</a>. Both of these services give you the ability to use popular open source and commercially-licensed file systems without having to deal with hardware provisioning, software configuration, patching, backups, and so forth. Since those launches, we have added many new features to both services in response to your requests:</p> \n<p><strong>Amazon FSx for Lustre </strong>now supports Persistent file systems with SSD- and <a href=\"https://aws.amazon.com/blogs/aws/new-high-performance-hdd-storage-for-amazon-fsx-for-lustre-file-systems/\">HDD-based</a> storage for longer-term storage and workloads, <a href=\"https://aws.amazon.com/about-aws/whats-new/2020/11/amazon-fsx-for-lustre-now-enables-you-to-grow-storage-on-your-file-system/\">storage capacity scaling</a>, <a href=\"https://aws.amazon.com/about-aws/whats-new/2020/06/amazon-fsx-lustre-provides-highly-durable-file-system-backups/\">crash-consistent backups</a>, <a href=\"https://aws.amazon.com/about-aws/whats-new/2021/05/amazon-fsx-for-lustre-now-supports-data-compression/\">data compression</a>, and <a href=\"https://aws.amazon.com/about-aws/whats-new/2020/11/amazon-fsx-lustre-supports-storage-quotas/\">storage quotas</a>.<strong><br /> </strong></p> \n<p><strong>Amazon FSx for Windows File Server </strong>now supports many <a href=\"https://aws.amazon.com/blogs/aws/amazon-fsx-for-windows-file-server-update-new-enterprise-ready-features/\">enterprise-ready features</a> including Multi-AZ file systems, self-managed Active Directories, fine-grained file restoration, <a href=\"https://aws.amazon.com/blogs/aws/file-access-auditing-is-now-available-for-amazon-fsx-for-windows-file-server/\">file access auditing</a>, storage size and capacity throughput scaling, and a <a href=\"https://aws.amazon.com/blogs/aws/new-low-cost-hdd-storage-option-for-amazon-fsx-for-windows-file-server/\">low cost HDD storage option</a>.<strong><br /> </strong></p> \n<p>Because these services support the file access and storage paradigms that are already well understood by Lustre and Windows File Server users, it is easy to migrate existing applications and to fine-tune existing operational regimens when you put them to use. While migration is important, so are new applications! All of the Amazon FSx systems make it easy for you to build applications that need high-performance fully managed storage along with the rich set of features provided by the file systems.</p> \n<p><span><strong><span>Amazon FSx for NetApp ONTAP</span></strong></span><br /> <img src=\"https://media.amazonwebservices.com/blog/2021/fsx_ontap_choice_1.png\" />As I often tell you, we are always looking for more ways to meet the needs of our customers. To this end, we are launching <span>Amazon FSx for NetApp ONTAP</span> today. You get the popular features, performance, and <a href=\"https://docs.netapp.com/us-en/ontap-automation/index.html\">APIs</a> of ONTAP file systems with the agility, scalability, security, and resiliency of AWS, making it easier for you to migrate on-premises applications that rely on network-attached storage (NAS) appliances to AWS.</p> \n<p><a href=\"https://www.netapp.com/data-management/ontap-data-management-software/\">ONTAP</a> (a <a href=\"https://www.netapp.com/\">NetApp</a> product) is an enterprise data management offering designed to provide high-performance storage suitable for use with Oracle, SAP, VMware, Microsoft SQL Server, and so forth. ONTAP is flexible and scalable, with support for multi-protocol access and file systems that can scale up to 176 PiB. It supports a wide variety of features that are designed to make data management cheaper and easier including inline data compression, deduplication, compaction, thin provisioning, replication (<a href=\"https://docs.netapp.com/ontap-9/index.jsp?topic=%2Fcom.netapp.doc.pow-dap%2FGUID-90A46DC2-C432-43D7-A890-EE342FC8C382.html\">SnapMirror</a>), and point-in-time cloning (<a href=\"https://docs.netapp.com/ontap-9/index.jsp?topic=%2Fcom.netapp.doc.dot-cm-concepts%2FGUID-54F78C62-B4D5-46FF-AE25-7440A3E65185.html\">FlexClone</a>).</p> \n<p><span>FSx for ONTAP</span> is fully managed so you can start to enjoy all of these features in minutes. AWS provisions the file servers and storage volumes, manages replication, installs software updates &amp; patches, replaces misbehaving infrastructure components, manages failover, and much more. Whether you are migrating data from your on-premises NAS environment or building brand-new cloud native applications, you will find a lot to like! If you are migrating, you can enjoy all of the benefits of a fully-managed file system while taking advantage of your existing tools, workflows, processes, and operational expertise. If you are building brand-new applications, you can create a cloud-native experience that makes use of ONTAP’s rich feature set. Either way, you can scale to support hundreds of thousands of IOPS and benefit from the continued, behind-the-scenes evolution of the compute, storage, and networking components.</p> \n<p>There are two storage tiers, and you can enable intelligent tiering to move data back and forth between them on an as-needed basis:</p> \n<p><strong>Primary Storage</strong> is built on high performance solid state drives (SSD), and is designed to hold the part of your data set that is active and/or sensitive to latency. You can provision up to 192 TiB of primary storage per file system.</p> \n<p><strong>Capacity Pool Storage</strong> grows and shrinks as needed, and can scale to pebibytes. It is cost-optimized and designed to hold data that is accessed infrequently.</p> \n<p>Within each <span>Amazon FSx for NetApp ONTAP</span> file system you can create one or more Storage Virtual Machines (SVMs), each of which supports one or more Volumes. Volumes can be accessed via NFS, SMB, or as iSCSI LUNs for shared block storage. As you can see from this diagram, you can access each volume from AWS compute services, VMware Cloud on AWS, and from your on-premises applications:</p> \n<p><img src=\"https://media.amazonwebservices.com/blog/2021/ontap_block_2.png\" /></p> \n<p>If your on-premises applications are already making use of ONTAP in your own data center, you can easily create an ONTAP file system in the cloud, replicate your data using <a href=\"https://www.netapp.com/data-protection/backup-recovery/snapmirror-data-replication/\">NetApp SnapMirror</a>, and take advantage of all that <span>Amazon FSx for NetApp ONTAP</span> has to offer.</p> \n<p><span><strong>Getting Started with <span>Amazon FSx for NetApp ONTAP</span></strong></span><br /> I can create my first file system from the command line, <a href=\"https://console.aws.amazon.com\">AWS Management Console</a>, or the <a href=\"https://cloud.netapp.com/cloud-manager\">NetApp Cloud Manager</a>. I can also make an API call or use a CloudFormation template. I’ll use the <span>Management Console</span>.</p> \n<p>Each file system runs within a Virtual Private Cloud (VPC), so I start by choosing a VPC and a pair of subnets (preferred and standby). Every SVM has an endpoint in the Availability Zones associated with both of the subnets, with continuous monitoring, automated failover, and automated failback to ensure high availability.</p> \n<p>I open the Amazon FSx Console, click <strong>Create file system</strong>, select <strong>Amazon FSx for NetApp ONTAP</strong>, and click <strong>Next</strong>:</p> \n<p><img src=\"https://media.amazonwebservices.com/blog/2021/fsx_ontap_select_fs_2.png\" /></p> \n<p>I can choose <strong>Quick create</strong> and use a set of best practices, or <strong>Standard create</strong> and set all of the options myself. I’ll go for the first option, since I can change all of the configuration options later if necessary. I select <strong>Quick create,</strong> enter a name for my file system (<strong>jb-fsx-ontap-1</strong>), and set the storage capacity in GiB. I also choose the VPC, and enable ONTAP’s storage efficiency features:</p> \n<p><img src=\"https://media.amazonwebservices.com/blog/2021/fsx_ontap__create_fs_1.png\" /></p> \n<p>I confirm all of my choices, and note that this option will also create a Storage Virtual Machine (<strong>fsx</strong>) and a volume (<strong>vol1</strong>) for me. Then I click <strong>Create file system</strong> to “make it so”:</p> \n<p><img src=\"https://media.amazonwebservices.com/blog/2021/fsx_ontap_confirm_fs_2.png\" /></p> \n<p>The file system <strong>Status</strong> starts out as <strong>Creating</strong>, then transitions to <strong>Available</strong> within 20 minutes or so:</p> \n<p><img src=\"https://media.amazonwebservices.com/blog/2021/fsx_ontap_status_creating_1.png\" /></p> \n<p>My first SVM transitions from <strong>Pending</strong> to <strong>Created</strong> shortly thereafter, and my first volume transitions from <strong>Pending</strong> to <strong>Created</strong> as well. I can click on the SVM to learn more about it and to see the full set of management and access endpoints that it provides:</p> \n<p><img src=\"https://media.amazonwebservices.com/blog/2021/fsx_ontap_svm_details_1.png\" /></p> \n<p>I can click <strong>Volumes</strong> in the left-side navigation and see all of my volumes. The root volume (fsx_root) is created automatically and represents all of the storage on the SVM:</p> \n<p><img src=\"https://media.amazonwebservices.com/blog/2021/fsx_ontap_volumes_2.png\" /></p> \n<p>I can select a volume and click <strong>Attach</strong> to get customized instructions for attaching it to an EC2 instance running Linux or Windows:</p> \n<p><img src=\"https://media.amazonwebservices.com/blog/2021/fsx_ontab_attach_vol_inst_1.png\" /></p> \n<p>I can select a volume and then choose <strong>Update volume</strong> from the <strong>Action</strong> menu to change the volume’s path, size, storage efficiency, or tiering policy:</p> \n<p><img src=\"https://media.amazonwebservices.com/blog/2021/fsn_ontap_update_vol_1.png\" /></p> \n<p>To learn more about the tiering policy, read about Amazon FSx for NetApp ONTAP Storage.</p> \n<p>I can click <strong>Create volume</strong> and create additional volumes within any of my file systems:</p> \n<p><img src=\"https://media.amazonwebservices.com/blog/2021/fsx_ontap_create_vol_1.png\" /></p> \n<p>There’s a lot more than I have space to show you, so be sure to open up the Console and try it out for yourself.</p> \n<p><strong><span>Things to Know</span></strong><br /> Here are a couple of things to know about <span>Amazon FSx for NetApp ONTAP</span>:</p> \n<p><strong>Regions</strong> – The new file system is available in most AWS regions and in GovCloud; check out the <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">AWS Regional Service</a> list for more information.</p> \n<p><strong>Pricing</strong> – Pricing is based on multiple usage dimensions including the Primary Storage, Capacity Pool Storage, throughput capacity, additional SSD IOPS, and backup storage consumption; consult the Amazon FSx for NetApp ONTAP Pricing page for more information.</p> \n<p><strong>Connectivity</strong> – You can use <a href=\"https://aws.amazon.com/directconnect/\">AWS Direct Connect</a> to connect your on-premises applications to your new file systems. You can use <a href=\"https://aws.amazon.com/transit-gateway/?whats-new-cards.sort-by=item.additionalFields.postDateTime&amp;whats-new-cards.sort-order=desc\">Transit Gateway</a> to connect to VPCs in other accounts and/or regions.</p> \n<p><strong>Availability</strong> – As I mentioned earlier, each file system is powered by AWS infrastructure in a pair of Availability Zones. <span>Amazon FSx for NetApp ONTAP</span> automatically replicates data between the zones and monitors the AWS infrastructure, initiating a failover (typically within 60 seconds), and then replacing infrastructure components as necessary. There’s a 99.99% availability SLA for each file system.</p> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"eb51da15dce09e9f58599c50a65fa8e735287e600ed84bb5804c6ad7755ebc3b","category":"Tech"}