{"title":"COVID hospitalization averages $20K—and insurers want unvaccinated to pay up","link":"https://arstechnica.com/?p=1789890","date":1629930969000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-94969831-800x507.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-94969831.jpeg\">Enlarge</a> <span>/</span> Delta Air Lines plane taxis toward a gate between other Delta planes at John F. Kennedy International Airport in New York on Monday, July 20, 2009. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/delta-air-lines-plane-taxis-toward-a-gate-between-other-news-photo/94969831?adppopup=true\">Getty | Bloomberg</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Hospital care for seriously ill COVID-19 patients is costing the US health care system billions of dollars. And with vaccines highly effective at preventing hospitalization now widely and freely available to everyone over the age of 12, insurers and some businesses want the unvaccinated—who make up the vast majority of COVID-19 hospitalizations—to cover more of those costs.</p>\n<p>This past June and July alone, the estimated cost of caring for unvaccinated people who were hospitalized for preventable cases of COVID-19 reached about $2.3 billion, according to <a href=\"https://www.healthsystemtracker.org/brief/unvaccinated-covid-patients-cost-the-u-s-health-system-billions-of-dollars/\">a recent analysis</a> by the Peterson Center on Healthcare and Kaiser Family Foundation. The analysis estimated that in those two months there were 113,000 unvaccinated people who were hospitalized primarily for COVID-19 and that their infection would have been prevented with vaccination. They then multiplied that number by $20,000, a rough estimate of the average cost of hospital care for COVID-19 patients, bringing the total to $2.3 billion.</p>\n<h2>Waived waivers</h2>\n<p>Hospitalizations have only skyrocketed since then. On the last day of July, the country's seven-day rolling average of hospitalizations was around 40,000. Now, that average is nearly 86,000, according to the Centers for Disease Control and Prevention.</p></div><p><a href=\"https://arstechnica.com/?p=1789890#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1789890&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"eb5c3e472b412df7f4f2536e0cbdb8dd48d44faf953c55f6b8b4c1ff762feef2","category":"Tech"}