{"title":"476 Induced hindgut acidosis in sheep affected gut permeability and ruminal fermentation","link":"https://academic.oup.com/jas/article/102/Supplement_3/381/7757475?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Leaky gut may be caused by acidotic conditions in the hindgut and lead to systemic inflammation and negative effects on the gastrointestinal tract. The objective was to determine the effects of induced hindgut acidosis in sheep on cecal pH, ruminal fermentation, and gut permeability. Ruminally and cecally cannulated ewes [n = 11; body weight (BW) = 49 ± 4 kg] were assigned to one of two treatments: control (CON; n = 5) or induced hindgut acidosis (HGA; n = 6). To induce hindgut acidosis, 3 g wheat starch/kg BW per 24 h was continuously infused via the cecal cannula for 4 d. Control ewes received a constant infusion of deionized water. The diet contained 40% grass hay pellets, 35% whole shelled corn, 15% dried distillers grains, and 10% alfalfa cubes. Chromium EDTA was dosed once daily via the cecal cannula as a marker of gut permeability. Rumen, cecal, and fecal samples were collected to determine pH and volatile fatty acids (VFA). Rumen fluid was collected on d 4 for an ex vivo fermentation. Flasks were incubated for 24 h to determine pH, VFA, ammonia and in vitro dry matter digestibility. Tissue samples from the ileum, cecum, and colon were mounted in Ussing chambers to measure transepithelial electrical resistance (TEER). There was a treatment × time effect (<span>P</span> = 0.05) for cecal pH with HGA ewes having lesser cecal pH after d 1. By d 4, cecal pH had declined to 5.07 for HGA ewes compared with CON ewes which remained above 6.40 throughout the experiment. A treatment × time interaction was also observed (<span>P</span> &lt; 0.01) for fecal pH and followed the same trend as cecal pH. Rumen pH was not affected (<span>P</span> = 0.87) by the interaction of treatment and time but was affected (<span>P</span> &lt; 0.01) by treatment as ewes on the HGA treatment had a lesser rumen pH than CON ewes. Control ewes had lesser ruminal VFA and ammonia concentrations than HGA ewes (<span>P</span> &lt; 0.01). Urinary Cr recovery was not affected by the interaction of treatment and time, or treatment (<span>P</span> ≥ 0.13). In vitro dry matter disappearance was not affected by cecal infusion treatment (<span>P</span> = 0.60). There was no effect (<span>P</span> = 0.78) of treatment on ex vivo pH. There were no effects (<span>P</span> ≥ 0.11) of treatment, time, or their interaction on ex vivo ammonia or total VFA concentration. In cecal tissue, TEER tended (<span>P</span> = 0.09) to be greater in CON ewes than HGA ewes. In contrast, TEER was not different (<span>P</span> ≥ 0.83) in ileal or colonic tissues between treatments. Induced hindgut acidosis in sheep altered rumen fermentation and tended to increase ex vivo measures of cecal permeability, but did not affect ex vivo rumen fermentation.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"eb685f641c7c8364f8abea85e94d154f403aa61397290730f58fc65ac9a7d488","category":"Environment"}