{"title":"Reinterpretation of the results of randomized clinical trials","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305575","date":1718373600000,"content":"<p>by Farrokh Habibzadeh</p>\r\nBackground <p>Randomized clinical trials (RCTs) shape our clinical practice. Several studies report a mediocre replicability rate of the studied RCTs. Many researchers believe that the relatively low replication rate of RCTs is attributed to the high p value significance threshold. To solve this problem, some researchers proposed using a lower threshold, which is inevitably associated with a decrease in the study power.</p> Methods <p>The results of 22 500 RCTs retrieved from the Cochrane Database of Systematic Reviews (CDSR) were reinterpreted using 2 fixed p significance threshold (0.05 and 0.005), and a recently proposed flexible threshold that minimizes the weighted sum of errors in statistical inference.</p> Results <p>With p &lt; 0.05 criterion, 28.5% of RCTs were significant; p &lt; 0.005, 14.2%; and p &lt; flexible threshold, 9.9% (2/3 of significant RCTs based on p &lt; 0.05 criterion, were found not significant). Lowering the p cut-off, although decreases the false-positive rate, is not generally associated with a lower weighted sum of errors; the false-negative rate increases (the study power decreases); important treatments may be left undiscovered. Accurate calculation of the optimal p value thresholds needs knowledge of the variance in each study arm, <i>a posteriori</i>.</p> Conclusions <p>Lowering the p value threshold, as it is proposed by some researchers, is not reasonable as it might be associated with an increase in false-negative rate. Using a flexible p significance threshold approach, although results in a minimum error in statistical inference, might not be good enough too because only a rough estimation may be calculated <i>a priori</i>; the data necessary for the precise computation of the most appropriate p significance threshold are only available <i>a posteriori</i>. Frequentist statistical framework has an inherent conflict. Alternative methods, say Bayesian methods, although not perfect, would be more appropriate for the data analysis of RCTs.</p>","author":"Farrokh Habibzadeh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"eb6a5513d173d4deb7792597a7a775f8606053cec0e37a71728b38f0d720b80a","category":"Interdisciplinary"}