{"title":"Enhanced nitrous oxide emission factors due to climate change increase the mitigation challenge in the agricultural sector","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17472?af=R","date":1724050800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c9db7284-31dd-481c-9742-53de9eb43048/gcb17472-toc-0001-m.png\" alt=\"Enhanced nitrous oxide emission factors due to climate change increase the mitigation challenge in the agricultural sector\" />\n<p>Effective nitrogen fertilizer management is crucial for reducing nitrous oxide (N<sub>2</sub>O) emissions and ensuring food security. Our study provides a new modeling framework integrating machine learning with process-based models to project N<sub>2</sub>O emission factors (EFs) under different climate and nitrogen policy scenarios. We found that climate change significantly influences EFs, particularly in tropical and subtropical regions, potentially affecting the effectiveness of N<sub>2</sub>O mitigation efforts. This study highlights the urgent need for immediate action to mitigate N<sub>2</sub>O emissions.</p>\n<br />\n<h2>Abstract</h2>\n<p>Effective nitrogen fertilizer management is crucial for reducing nitrous oxide (N<sub>2</sub>O) emissions while ensuring food security within planetary boundaries. However, climate change might also interact with management practices to alter N<sub>2</sub>O emission and emission factors (EFs), adding further uncertainties to estimating mitigation potentials. Here, we developed a new hybrid modeling framework that integrates a machine learning model with an ensemble of eight process-based models to project EFs under different climate and nitrogen policy scenarios. Our findings reveal that EFs are dynamically modulated by environmental changes, including climate, soil properties, and nitrogen management practices. Under low-ambition nitrogen regulation policies, EF would increase from 1.18%–1.22% in 2010 to 1.27%–1.34% by 2050, representing a relative increase of 4.4%–11.4% and exceeding the IPCC tier-1 EF of 1%. This trend is particularly pronounced in tropical and subtropical regions with high nitrogen inputs, where EFs could increase by 0.14%–0.35% (relative increase of 11.9%–17%). In contrast, high-ambition policies have the potential to mitigate the increases in EF caused by climate change, possibly leading to slight decreases in EFs. Furthermore, our results demonstrate that global EFs are expected to continue rising due to warming and regional drying–wetting cycles, even in the absence of changes in nitrogen management practices. This asymmetrical influence of nitrogen fertilizers on EFs, driven by climate change, underscores the urgent need for immediate N<sub>2</sub>O emission reductions and further assessments of mitigation potentials. This hybrid modeling framework offers a computationally efficient approach to projecting future N<sub>2</sub>O emissions across various climate, soil, and nitrogen management scenarios, facilitating socio-economic assessments and policy-making efforts.</p>","author":"Linchao Li, \nChaoqun Lu, \nWilfried Winiwarter, \nHanqin Tian, \nJosep G. Canadell, \nAkihiko Ito, \nAtul K. Jain, \nSian Kou‐Giesbrecht, \nShufen Pan, \nNaiqing Pan, \nHao Shi, \nQing Sun, \nNicolas Vuichard, \nShuchao Ye, \nSönke Zaehle, \nQing Zhu","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"eb6d43ade16c8083105bdd782075cb8f7e81a22a3dcb30df74faca0b3a04131e","category":"Environment"}