{"title":"Darwin Online has virtually reassembled the naturalist’s personal library","link":"https://arstechnica.com/?p=2003187","date":1708448917000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/darwin1-800x534.jpg\" alt=\"Oil painting by Victor Eustaphieff of Darwin in his study at Down House with one of his bookcases that made up his extensive personal library reflected in the mirror.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/darwin1.jpg\">Enlarge</a> <span>/</span> Oil painting by Victor Eustaphieff of Charles Darwin in his study at Down House. One of the many bookcases that made up his extensive personal library is reflected in the mirror. (credit: State Darwin Museum, Moscow)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Famed naturalist <a href=\"https://en.wikipedia.org/wiki/Charles_Darwin\">Charles Darwin</a> amassed an impressive personal library over the course of his life, much of which was preserved and cataloged upon his death in 1882. But many other items were lost, including more ephemeral items like unbound volumes, pamphlets, journals, clippings, and so forth, often only vaguely referenced in Darwin's own records.</p>\n<p>For the last 18 years, the <a href=\"http://darwin-online.org.uk\">Darwin Online</a> project has painstakingly scoured all manner of archival records to <a href=\"http://darwin-online.org.uk/EditorialIntroductions/vanWyhe_The_Complete_Library_of_Charles_Darwin.html\">reassemble</a> a complete catalog of Darwin's personal library virtually. The project released its complete 300-page online catalog—consisting of 7,400 titles across 13,000 volumes, with links to electronic copies of the works—to mark Darwin's 215th birthday on February 12.</p>\n<p>“This unprecedentedly detailed view of Darwin’s complete library allows one to appreciate more than ever that he was not an isolated figure working alone but an expert of his time building on the sophisticated science and studies and other knowledge of thousands of people,\" project leader <a href=\"https://www.eurekalert.org/news-releases/1033893\">John van Wyhe of the National University of Singapore said</a>. \"Indeed, the size and range of works in the library makes manifest the extraordinary extent of Darwin’s research into the work of others.”</p></div><p><a href=\"https://arstechnica.com/?p=2003187#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2003187&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"eb6d1301658f6a87cd0bc8499264912a99d10dc3c3b7dd642809c860d1536055","category":"Tech"}