{"title":"How Apple’s Touch Bar can still have a purpose","link":"https://www.macworld.com/article/546624/touch-bar-macbook-air-ipad-magic-keyboard.html","date":1635422344000,"content":"<div>\n<section><div></div></section><p>I know what you’re thinking. For the past five years, we’ve <a href=\"https://www.macworld.com/article/351326/macbook-pro-ditch-touch-bar-rumors-function-keys.html\">questioned</a>, lambasted, and otherwise reviled the MacBook Pro’s Touch Bar. And now that it’s gone we already want it back.</p>\n\n\n\n<p>But the problem with the Touch Bar wasn’t actually the Touch Bar itself, it’s that it wasn’t a Pro feature. The concept of a small touch-screen for common tasks was a good one—and we’ve <a href=\"https://www.macworld.com/article/352235/macworld-podcast-macworld-is-so-wrong-about-safari-and-the-touch-bar.html\">heard</a> from many people who enjoyed using it. The MacBook Pro just wasn’t the right product for it, and Apple’s flagship laptop is better without it.</p>\n\n\n\n<p>But the Touch Bar isn’t without its merits and we’re hoping Apple still has plans for the Touch Bar. Here are three ways Apple could keep it alive.</p>\n\n\n\n<h2>MacBook Air</h2>\n\n\n\n<p>The most obvious way for Apple to keep the Touch Bar in its repertoire is by moving it over to the MacBook Air. We assume that the <a href=\"https://www.macworld.com/article/234838/13-inch-macbook-pro-m1-review-amazing-breakthroughs-in-processing-and-battery-performance.html\">13-inch MacBook Pro</a>, the only remaining laptop with a Touch Bar, will be unceremoniously retired at some point in 2022. So if Apple has any plans to keep the Touch Bar around, it’s going to have to end up in the MacBook Air.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/macbook-air-group.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The Touch Bar would look good on the MacBook Air.</figcaption></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://unsplash.com/photos/2FPjlAyMQTA&amp;xcust=1-1-546624-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">John Schnobrich/Unsplash</a></div>\n\n\n\n<p>The good news is the MacBook Air is already in store for a redesign. We’ve heard that the three-year-old MacBook Air will get a dramatic overhaul with new colors, a notched display, and an M2 processor. And a Touch Bar would be a perfect addition to an entirely new MacBook Air. I’ve long asserted that the Touch Bar is a consumer feature masquerading as a professional one, and it would be right at home on the MacBook Air. Here’s how Apple initially described the Touch Bar in the 2016 MacBook Pro press release:</p>\n\n\n\n<p>“The Touch Bar places controls right at the user’s fingertips and adapts when using the system or apps like Mail, Finder, Calendar, Numbers, GarageBand, Final Cut Pro X, and many more, including third-party apps. For example, the Touch Bar can show Tabs and Favorites in Safari, enable easy access to emoji in Messages, provide a simple way to edit images or scrub through videos in Photos and so much more.”</p>\n\n\n\n<p>Now read it as a feature of the MacBook Air:</p>\n\n\n\n<p>“The Touch Bar places controls for common tasks right at the user’s fingertips depending on the app you’re using, like Mail, Finder, Calendar, GarageBand, and many more, including third-party apps. For example, the Touch Bar can show Tabs and Favorites in Safari, enable easy access to emoji in Messages, offer easy access to controls like volume and brightness, and so much more.”</p>\n\n\n\n<p>See how easy it is?</p>\n\n\n\n<h2>Magic Keyboard</h2>\n\n\n\n<p>Apple’s standalone Magic Keyboard is a good keyboard but it’s hardly magical. It doesn’t have backlit keys, isn’t all that ergonomic, and you have to buy an iMac to get it in any color other than silver and space gray. But if Apple really wants to add some magic to its Magic Keyboard, a Touch Bar would absolutely do the trick.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/24-inch-imac-pink.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>A Touch Bar would truly make the Magic Keyboard magical.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>It could be an option for Apple silicon Macs like the Touch ID model and would probably cost $249 for the numeric keypad, but the Touch Bar would be a brilliant addition to Apple’s Bluetooth family. We’d probably have to sacrifice some battery life, but it would be an acceptable tradeoff for one of the coolest features ever to grace a Bluetooth keyboard. A Touch Bar on the Magic Keyboard would truly be a magical feature that finally gives the skinny screen a purpose and puts Apple’s standalone keyboards back on the map.</p>\n\n\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<h4>\n\t\t\t\t\t\t\t\t\t</h4>\n\t\t\t</div>\n\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>Apple Magic Keyboard with Numeric Keypad (Wireless, Rechargable) (US English) – Silver</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://m.media-amazon.com/images/I/21Eqwbg0YJL.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B071ZZTNBM?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$111.05 at Amazon</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</div>\n\t\t</div>\n\n\t\t\n\n\n<h2>iPad Pro</h2>\n\n\n\n<p>If there’s one place above all where the Touch Bar makes the most sense it’s the iPad. The coolest option would be to add it to the Magic Keyboard by rethinking the current layout. Like the iPhone, the iPad doesn’t need the same keys as the Mac, so the Magic Keybaord could tweak the layout to make room for a Touch Bar. Imagine snapping an iPad Pro into a Magic Keyboard and having a Touch Bar spring to life like a tiny second display. </p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-side.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The iPad Pro’s Magic Keyboard would make a nice home for the Touch Bar.</figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>The Touch Bar could also work as an element on the screen. When typing on the magic keyboard, a Touch Bar-style strip could pop up along the bottom of the screen that offers the same menu and contextual options that it provides on the MacBook keyboard. Until we get a touch-screen Mac, that’s probably the most logical place for it—still in a line of sight when typing, but without taking up important screen real estate. What doesn’t make a ton of sense on the MacBook Pro would be perfect for the iPad Pro, which is a different sort of professional machine. We’ve seen it on Android phones with varying results, but it could work very well on a large-screen iPad. </p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"eb7e5dbc7ff653c9c691f72d705894a9e0fadd5a08ac1a82754d99a3f921446a","category":"Apple"}