{"title":"[Counterpoint] Pixel มีส่วนแบ่งตลาดในญี่ปุ่นไตรมาสมิถุนายนเติบโตสูง ส่วน iPhone ลดลง","link":"https://www.blognone.com/node/135978","date":1695902283000,"content":"<div><div><div><p>Counterpoint Research รายงานส่วนแบ่งตลาดสมาร์ทโฟนในประเทศญี่ปุ่น ประจำไตรมาสเดือนมิถุนายน 2023 โดยมีประเด็นน่าสนใจคือ iPhone ของแอปเปิล มีส่วนแบ่งตลาดลดลงมาอยู่ที่ 46% ต่ำกว่า 50% เป็นครั้งแรกในรอบสองปี</p>\n<p>ส่วนสมาร์ทโฟนที่เติบโตเด่นในไตรมาสที่ผ่านมาคือ Pixel ของกูเกิล เพิ่มขึ้นมาเป็น 12% เทียบกับไตรมาสมิถุนายนปี 2022 Pixel มีส่วนแบ่งตลาดในญี่ปุ่นที่ 2% เท่านั้น จึงเป็นการเติบโตของส่วนแบ่งที่สูงมาก</p>\n<p>นักวิเคราะห์มองเหตุผลของ iPhone ที่ส่วนแบ่งลดลงเนื่องจากมีการปรับราคาขายในประเทศขึ้น ซึ่งเป็นผลจากเงินเยนที่อ่อนค่า แต่เงินเยนที่อ่อนค่านี้ก็มีผลทางอ้อมต่อยอดขาย Pixel เช่นกัน เพราะกูเกิลไม่ได้ทำตลาดสมาร์ทโฟนนี้ทั่วโลก ทำให้นักท่องเที่ยวจากประเทศที่ Pixel ไม่มีขายมาซื้อสมาร์ทโฟนนี้กลับไป และจูงใจมากขึ้นจากราคาที่ถูกลงเมื่อเทียบกับค่าเงินของตน ส่วนตลาดในประเทศญี่ปุ่น Pixel ที่ขายดีคือรุ่น Pixel 6a และ Pixel 7a ที่มีราคาไม่สูงเมื่อเทียบกับ iPhone</p>\n<p>อย่างไรก็ตามตัวเลขนี้เป็นของไตรมาสเดือนมิถุนายน ซึ่งน่าจะมีการปรับเปลี่ยนมากในไตรมาสเดือนกันยายนเพราะ iPhone 15 เริ่มขาย ส่วนแบ่งของแอปเปิลก็น่าจะกลับมาสูงเหมือนเดิม ขณะที่ Pixel มีกำหนดออกรุ่นใหม่ในเดือนตุลาคม ไม่ทันในไตรมาสปัจจุบัน</p>\n<p>ที่มา: <a href=\"https://www.bloomberg.com/news/articles/2023-09-28/iphones-sales-in-japan-take-pixel-hit-as-price-sensitivity-rises\">Bloomberg</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/2c4188cbc624e6e7cba4c57580ae9ce5.jpg\" /></p>\n<p>แถมด้วยโฆษณา Pixel 7 ของญี่ปุ่น ที่ถ่ายทำในประเทศไทย</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-pixel\">Google Pixel</a></div><div><a href=\"/topics/japan\">Japan</a></div><div><a href=\"/topics/counterpoint-research\">Counterpoint Research</a></div><div><a href=\"/topics/market-share\">Market Share</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ebad5ffd2843633939536a7ed9b71a1c2aa7372be5d9fb1e22dca041df44709c","category":"Thai"}