{"title":"Prevalence and Clinical Burden of Venous Thromboembolic Events (VTEs) in Contemporary Total Knee Arthroplasties (TKAs) in US Hospitals","link":"https://www.preprints.org/manuscript/202404.1913/v1","date":1714386624000,"content":"Abstract: Introduction: Total knee arthroplasty (TKA) is a common orthopedic procedure driven by factors such as an aging population, rising obesity rates, and surgical advancements. Despite improved venous thromboembolism (VTE) prophylaxis, eradication remains challenging, necessitating personalized prevention strategies. This study aims to identify predictors of VTE following TKA. Methods: A retrospective analysis of the American College of Surgeons National Surgical Quality Improvement Program (ACS NSQIP) database (2016-2021) included 367,365 patients who underwent TKA (CPT code 27447). Univariate and multivariate analyses assessed preoperative factors associated with deep vein thrombosis (DVT) and pulmonary embolism (PE). Results: Significant associations were found between demographic and clinical variables and VTE prevalence. Notable predictors of DVT included female sex (OR=1.2, p=0.001), younger age (OR=1.2, p=0.001), Hispanic ethnicity (OR=1.2, p=0.026), and chronic obstructive pulmonary disease (COPD) (OR=1.4, p=0.001). Independent functional status was a strong predictor of both DVT (OR=5.0, p=0.001) and PE (OR=0.53, p=0.033). Smoking (OR=0.7, p=0.001), COPD (OR=1.4, p=0.005), congestive heart failure (OR=2.1, p=0.001), and malignancy (OR=2.9, p=0.009) were significant predictors of PE. Conclusion: The study underscores the impact of demographic factors (gender, age, race) and comorbidities (COPD, CHF, malignancy) on VTE risk post-TKA. Preoperative mobilization status emerged as a critical indicator of thromboembolic risk. Unexpected findings regarding smoking and PE require further investigation. Overall, the study contributes to optimizing VTE prevention in TKA patients through tailored risk assessment and intervention strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ebad0e04eadfe74392ca10f00a1144f50215db1aa9aa6eb126b69a9d0cbfa7dd","category":"Interdisciplinary"}