{"title":"Examination of the Effect of Dimethyl Trisulfide in Acute Stress Mouse Model with the Potential Involvement of the TRPA1 Ion Channel","link":"https://www.preprints.org/manuscript/202406.0434/v1","date":1717721329000,"content":"Polysulfides are endogenously produced in mammals and generally associated with protective functions. Our aim was to investigate the effect of dimethyl trisulfide (DMTS) in a mouse model of acute stress. DMTS activates transient receptor potential ankyrin 1 (TRPA1) channels and leads to neuropeptide release, potentially that of substance P (SP). We hypothesize that DMTS might inhibit the degrading enzymes of endocannabinoids, so this system was also investigated as another possible pathway for mediating the effects of DMTS. Trpa1 gene wild type (WT) and knock out (KO) mice were used to confirm the role of the TRPA1 ion channel in mediating the effects of DMTS. C57BL/6J, NK1 gene KO, and Tac1 gene KO mice were used to evaluate the effect of DMTS on the release and expression of SP. Some C57BL/6J animals were treated with AM251, an inhibitor of the cannabinoid CB1 receptor, to elucidate the role of the endocannabinoid system in these processes. Open field test (OFT) and forced swim test (FST) were performed in each mouse strain. Tail suspension test (TST) was performed in TRPA1 WT and KO animals. C-FOS immunohistochemistry was carried out on TRPA1 WT animals. DMTS treatment increased the number of highly active periods and decreased immobility time in the FST in WT animals, but had no effect on Trpa1 KO mice. DMTS administration induced neuronal activation in stress-related brain areas such as the locus coeruleus, dorsal raphe nucleus, lateral septum, paraventricular nucleus of the thalamus, and paraventricular nucleus of the hypothalamus. DMTS may have a potential role in the regulation of stress-related processes, and the TRPA1 ion channel may also be involved in mediating the effects of DMTS. DMTS can be an ideal candidate for further study as a potential remedy in stress-related disorders.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ebb3e3635dc00b271adb52c66fe6685d630487b65df173e156a721ba552e27b2","category":"Interdisciplinary"}