{"title":"Population Dynamics of the Common Carp (Cyprinus carpio L. 1758) Stock in Lake Arekit, Ethiopia: Implications for Management and Conservation","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/9940938?af=R","date":1704700800000,"content":"<p><i>Cyprinus carpio</i> is a widely distributed and commercially important fish species in Ethiopia. Effective management is essential to sustain fisheries and provide benefits to local communities. This study aims to estimate the growth, mortality, and exploitation rate of <i>C</i>. <i>carpio</i> using length-frequency data. A total of 194 <i>C</i>. <i>carpio</i> specimens (117 females and 77 males) were collected between June 2022 and May 2023. The population parameters were determined using FISAT (ELEFAN I) software. The Von Bertalanffy growth function estimations were <i>L</i>\n<sub>\n   <i>∞</i>\n</sub> = 51.45 cm total length, <i>K</i> = 1.1 year<sup>−1</sup>; <i>t</i>\n<sub>0</sub> = −0.124 year, and growth performance index (Φ′) = 3.464. The total mortality rate (<i>Z</i>), natural mortality rate (<i>M</i>), and fishing mortality rate (<i>F</i>) were 2.55 year<sup>−1</sup>, 1.58 year<sup>−1</sup>, and 0.97 year<sup>−1</sup>, respectively. The estimated potential longevity (<i>t</i>\n<sub>max</sub>) and average age at which <i>C</i>. <i>carpio</i> attains length at the optimum cohort biomass or yield per recruit (<i>L</i>\n<sub>opt</sub> = 34.79) in Lake Arekit were calculated as 2.60 years and 1.29 years, respectively. The <i>Z</i>/<i>K</i> ratio (2.32), exploitation rate (<i>E</i> = <i>F</i>/<i>Z</i> = 0.38), and highest permissible yield per recruit for <i>C</i>. <i>carpio</i> (<i>E</i>\n<sub>max</sub> = 0.421) suggest enhancing fishery production by increasing the exploitation rate of the underexploited <i>C</i>. <i>carpio</i> in Lake Arekit. The results of this study provide information on the stock of <i>C</i>. <i>carpio</i>, which can be used to guide management efforts. The fish catch in Lake Arkeit is currently far lower than it could be. Therefore, the fish harvest should be boosted through the use of permitted nets, the establishment of groups of fishermen who can catch fish effectively, and the linking of the benefits of fish farming’s supply chain to the potential of fisheries.</p>","author":"Solomon Wagaw, \nYirga Enawgaw, \nInjigu Wendimu, \nMohamed Abdelsalam","siteTitle":"Wiley: Journal of Applied Ichthyology: Table of Contents","siteHash":"411fbab4e21e579add0b45892c8bae33151f2fc1dcfa886f71382f3516ee5117","entryHash":"ebb7970a05514d47168f42e25d8a91cd73827312c5e9004717dafeba19e7db02","category":"Environment"}