{"title":"Visuomotor predictors of interception","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308642","date":1726495200000,"content":"<p>by Inmaculada Márquez, Mario Treviño</p>\r\n\r\nIntercepting moving targets is a fundamental skill in human behavior, influencing various domains such as sports, gaming, and other activities. In these contexts, precise visual processing and motor control are crucial for adapting and navigating effectively. Nevertheless, there are still some gaps in our understanding of how these elements interact while intercepting a moving target. This study explored the dynamic interplay among eye movements, pupil size, and interceptive hand movements, with visual and motion uncertainty factors. We developed a simple visuomotor task in which participants used a joystick to interact with a computer-controlled dot that moved along two-dimensional trajectories. This virtual system provided the flexibility to manipulate the target’s speed and directional uncertainty during chase trials. We then conducted a geometric analysis based on optimal angles for each behavior, enabling us to distinguish between simple tracking and predictive trajectories that anticipate future positions of the moving target. Our results revealed the adoption of a strong interception strategy as participants approached the target. Notably, the onset and amount of optimal interception strategy depended on task parameters, such as the target’s speed and frequency of directional changes. Furthermore, eye-tracking data showed that participants continually adjusted their gaze speed and position, continuously adapting to the target’s movements. Finally, in successful trials, pupillary responses predicted the amount of optimal interception strategy while exhibiting an inverse relationship in trials without collisions. These findings reveal key interactions among visuomotor parameters that are crucial for solving complex interception tasks.","author":"Inmaculada Márquez","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ebba54a8a7366463329693fd598d70340c527d0d1e48665103b36d4962e33df8","category":"Interdisciplinary"}