{"title":"Trees and forests’ contribution to well-being during the COVID-19 pandemic in England: how did people adapt to change?","link":"https://academic.oup.com/forestry/article/97/2/243/7232253?rss=1","date":1690416000000,"content":"<span><div>Abstract</div>COVID-19 was declared a global pandemic on 11 March 2020 and has meant entire populations have experienced a significant change in lifestyle. Restrictions in England occurred through a series of phases from a lockdown through to the opening of shops and facilities. The initial restrictions led to a strong media focus on nature and getting outdoors for exercise and mental well-being. Alongside this but not related to COVID-19, there is a strong policy focus on forest creation and expansion in England with debate about where new forests might be created, what benefits they might provide, and to whom. In this research, we explored, for those with an existing interest in nature, whether this connection to nature and specifically to trees and forests could support people in coping with the restrictions they faced during the pandemic. We carried out an online survey in England in June/July 2020 and received 3333 qualitative comments. We then carried out 25 follow-up interviews in August/September 2020 with a sample of those who had completed the survey. We use the Kübler-Ross change curve as a lens to explore people’s reactions and responses to the significant changes brought about by the COVID-19 crisis, with a focus on their experiences relating to trees and forests. The results highlight that some people did move through the four stages of change outlined in the Kübler-Ross framework, although not always in a linear process, from shock and denial, to resistance, to exploration, and adaptation. The change curve model proved useful in this study but also had some limitations. Engagement with forests supported some adaptation as well as exploration through people undertaking new activities, visiting local spaces, and spending more time outdoors with their children. We also found that the benefits of engaging with trees and forests could help to support people’s well-being in times of high anxiety. The study highlights the importance of trees and forests as part of people’s lives, and the role they can play in supporting them when faced with major challenges.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"ebbcea4a6f7b9aab059e6c01853b719783873f057974dc674670fc0d8ec6fed2","category":"Environment"}