{"title":"Effectiveness of neck-specific exercises with and without internet-based support on dizziness/unsteadiness in chronic whiplash-associated disorders: Secondary analyses of a randomised controlled trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311145","date":1728309600000,"content":"<p>by Anneli Peolsson, Sara Wirqvist, Ann-Sofi Kammerlind, Gunnel Peterson</p>\r\nAim <p>To investigate the effectiveness in individuals with chronic whiplash-associated disorders (WADs) of neck-specific exercise (NSE) supervised by a physiotherapist twice a week for 12 weeks versus neck-specific exercise with internet support and four physiotherapy visits (NSEIT) regarding dizziness, unsteadiness and balance, and to investigate the differences between WAD grades.</p> Method <p>This is a secondary analysis of a prospective randomised multicentre study (RCT) with concealed allocation (ClinicalTrials.gov Protocol ID: NCT03022812). The outcomes were dizziness measured on the Dizziness Handicap Inventory (DHI); dizziness at rest and during activity and unsteadiness using visual analogue scales; and standing on one leg with eyes closed (SOLEC). Participants (n = 140) were randomised to NSE or NSEIT. Measurements were obtained at baseline, and at three- and 15-month follow-ups by assessor-blinded investigators.</p> Results <p>There were no significant differences between NSEIT and NSE in any of the outcomes (p&gt;0.38). Both NSEIT and NSE improved over time (p&lt;0.02; effect size (ES) = 0.74–1.01) in DHI score and dizziness during activity. There was a significant group-by-time interaction effect in dizziness (at rest: p = 0.035; ES: 0.66; and during activity: p = 0.016; ES: 1.24) between WAD grades. Individuals with WAD grade 3 had dizziness/unsteadiness to a greater extent and improved in all outcomes over time (p&lt;0.04) compared to those with WAD grade 2, except for SOLEC.</p> Conclusions <p>There were no significant group differences between NSEIT and NSE. Both groups decreased in terms of self-reported dizziness (DHI, dizziness during activity), with medium to large effect size. Those with WAD grade 3 have dizziness/unsteadiness to a greater extent than those with WAD grade 2. Despite improvements, many participants still reported dizziness at 15-month follow-up, and additional balance training and/or vestibular exercise may be investigated for potential additional effect.</p>","author":"Anneli Peolsson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ebce9c56faf5a0cbbf3a606a2c4252d0212a449096e40bac3da4507dcfa70426","category":"Interdisciplinary"}