{"title":"Video Review: Three Months With the M2 Max MacBook Pro","link":"https://www.macrumors.com/2023/04/19/video-review-m2-max-macbook-pro/","date":1681933905000,"content":"Apple in January 2023 introduced new 14 and 16-inch MacBook Pro models that are equipped with next-generation <a href=\"https://www.macrumors.com/guide/m2/\">M2</a> Pro and ‌M2‌ Max chips. <em>MacRumors</em> videographer Dan Barbera picked up a 14-inch ‌M2‌ Max MacBook Pro when the machines were released, and he's been using it daily for the past three months in preparation for a longer-term review on Apple's latest chip technology.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nThe 2023 14 and 16-inch MacBook Pro models haven't changed in design since Apple introduced the <a href=\"https://www.macrumors.com/guide/m1-max/\">M1 Max</a> and <a href=\"https://www.macrumors.com/guide/m1-pro/\">M1 Pro</a> models, so the main difference is the chipset. In terms of performance, there is a noticeable difference between the ‌M1 Max‌'s performance and the ‌M2‌ Max performance. The ‌M2‌ chip is able to handle intensive video editing tasks with ease, and it's not too far off from the <a href=\"https://www.macrumors.com/guide/m1-ultra/\">M1 Ultra</a>.\r<br />\n\r<br />\nDan's 14-inch machine has 32GB RAM and a 1TB SSD, and there are also noticeable improvements in SSD speeds. As for the size, the 14-inch form factor is better for travel, though it is nice to have the larger display real estate of the 16-inch machine, and you'll also notice thermal management deficiencies between the 14 and 16-inch models.\r<br />\n\r<br />\nDan has a lot of other thoughts on the ‌M2‌ MacBook Pro models compared to the prior-generation versions and other Mac options, so the full video is well worth watching.<br />This article, \"<a href=\"https://www.macrumors.com/2023/04/19/video-review-m2-max-macbook-pro/\">Video Review: Three Months With the M2 Max MacBook Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/video-review-three-months-with-the-m2-max-macbook-pro.2387270/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ebd1887c40fb3d58cf12f1efb8815cc9bb6d5d4dccbccc6a4b57423a1fe194e7","category":"Apple"}