{"title":"A king of the Classics: Clinical Van der Poel joins the greats with Paris-Roubaix triumph","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-king-of-the-classics-clinical-van-der-poel-joins-the-greats-with-paris-roubaix-triumph","date":1681062424000,"content":"\n      <p>It’s cycling’s great debate, it's Messi vs Ronaldo, or, more appropriately, Cancellara vs Boonen. Who’s best: Mathieu van der Poel or Wout van Aert? It’s a subjective argument, one that is rather pointless in that it achieves nothing short of bickering, but in an era of perpetually anointing someone as a GOAT (Greatest of All Time), in this epoch of a Big Six that look as talented a bunch as cycling has ever borne witness to, it keeps cropping back up.</p>\n<div></div>\n<p>The wider narrative will tell you that Van Aert - a winner of sprints, time trials and mountain stages - gets the nod over Van der Poel, but in the space of just nine weeks, it’s the latter who has emerged as the current leader of the argument, chalking up, arguably, the three most significant wins of his career in just nine weeks. First there was the Cyclocross World Championships, then came <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2023-everything-you-need-to-know\">Milan-Sanremo</a>, and on a sunny but chilly Sunday in Hell, it was the turn of <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a>. The one that really mattered. A win at E3 Saxo Bank Classic is Van Aert’s lot in the same timeframe; it just doesn’t compare. <br /><br />Jumbo-Visma might well have been operating in a way this spring that not even the Quick-Step teams of Tom Boonen did, but Van der Poel has been riding at a level that only Boonen, Cancellara, Museeuw, De Vlaeminck, Van Looy and Kelly can relate to. He’s among the champions.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/its-a-lot-harder-for-the-guys-with-more-weight-kilos-start-to-count-in-these-races-now-sep-vanmarcke-on-the-changing-landscape-of-the-classics\"><strong><em>Read more: 'It's a lot harder for the guys with more weight, kilos count in these races now’ - Sep Vanmarcke on the changing landscape of the Classics</em></strong></a><br /><br />When van Aert and Laporte attacked just before the Forest of Arenberg with more than 100km still remaining, Van der Poel was straight on their wheels. He would not let him go so easily. The Arenberg often crushes dreams (Van Aert broke his wheel on the fearsome cobbles 12 months ago), and by the time they had exited the forest, Van Aert was two teammates down: Laporte had punctured when exiting the Arenberg, and behind defending champion Dylan van Baarle had crashed to the ground.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/van_aert_van_der_poel_arenberg__paris-roubaix_2023.jpg?v=1681062317\" alt=\"Paris-Roubaix: Van der Poel and Van Aert\" /></p>\n<p>There were other losers too, chief among them Soudal - Quick-Step who were the only big team to miss out on the front group. It’s not that they can’t locate any four-leaf clovers, but rather that they don't have the class of their opponents. When Van der Poel and Van Aert have a moment of misfortune, they recover, they respond, and they animate once again. Quick-Step do none of that; their Classics decline is seemingly terminal.</p>\n<p>In their place as Belgium’s best is Alpecin-Deceuninck. Within the leading group that had absorbed the earlier break of four to make a group of 13, there were three wearing the team’s blue colours, Jasper Philipsen and Gianni Vermeersch joining their leader. They had the cards to play, and Van der Poel signed up to throw as many down as he could in his pursuit of greatness.</p>\n<p>In the space of 10 kilometres and across three different sectors of cobbles, the Dutchman launched a trio of stinging attacks. The first time it looked as if the elastic would snap, only for riders to bridge back across. Undeterred, he would go again, his energy restored as fast as a video game character. Turbo Boost: activated.</p>\n<p>He was prepared to risk everything, charging through the cobbles possessed on shedding riders from his wheel and denying Van Aert the opportunity to tie the Monument count at two-apiece. Corners approached, but his speed did not relent, the brakes barely feathered as he pushed incessantly towards Roubaix. Road furniture, spectators, muddy bergs - if he had to collect collateral damage to secure a cobblestone, he would.</p>\n<p>Three times he went, three times he was foiled. It was time to press option two - patience - on the gamepad. For the following 30km, there was a lull; proof, if ever it was needed, that Van der Poel was dictating the rhythm. As the attacks stalled, Philipsen was morphing from key domestique and pace-setter into the favourite to win; none of the other six in the leading group of seven except Mads Pedersen and John Degenkolb (winner in 2015) would fancy themselves in a sprint against Philipsen. If the time triallists Filippo Ganna and Stefan Küng were waiting for the final five-star sections of cobbles, the Carrefour de l’Arbre, to make their move, they were too late.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/van_der_poel_carrefour_de_l_arbre_paris-roubaix_2023.jpg?v=1681062375\" alt=\"Mathieu van der Poel Paris-Roubaix\" /></p>\n<p>Within 600 metres of motoring across the hellish pavé, the outcome had been settled by a minute of drama, clinicalness and luck. When Degenkolb collided with Van der Poel on the right of the cobbles, it easily could have brought down both. Van Aert, on his career-long rival’s wheel, sensed the moment. He was the one who had initiated the original move just before the Arenberg, and it was he again who was going to try and force the winning attack on these other vicious set of cobbles. Momentarily, Van der Poel, his bike swaying as he fought to stay upright, was held back as Van Aert catapulted forward. The sight was familiar - yellow marching towards victory.</p>\n<p>But then Van der Poel, steady once more, appeared, thundering yet again around a corner and across the cobbles, gritting his teeth and clenching his jaws in chase of his adversary. Fifteen metres. Five metres. Zero metres. Caught. He was hellbent on inflicting another wound into his career-long rival.</p>\n<p>Barely had Van der Poel had time to catch his breath and the race was his, Van Aert undone by the most awfully timed puncture. He looked behind him briefly to survey the scene, and then looked ahead, driving obdurately towards an historic third Monument, and stopping the clock on the fastest-ever edition of Paris-Roubaix.</p>\n<p>The discussion of who is the best of the two has been swung firmly towards the Dutch corner in the past two months. Van Aert can point to moments of bad luck, but three times in the past nine weeks he has been beaten by his nemesis when it really matters. We can argue all night about their different characteristics, but Van der Poel has emerged as the one who is most clinical at the most crucial of times. <br /><br />Monument score: Mathieu van der Poel 3 - 1 Wout van Aert. <br /><br /></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"ebddb1d640d9215b44b93aeeec81a04c3c46b7175776be7f1777a0f14b8dc7cd","category":"Cycling"}