{"title":"326 Relationship between activity and social interactions of beef bulls during the pre-breeding period and siring capacity in multi-sire breeding groups","link":"https://academic.oup.com/jas/article/102/Supplement_3/10/7757017?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>It is currently unknown whether the behavior of bulls during pre-breeding is related to their siring capacity. This information could help producers anticipate the reproductive potential of their bulls and include it in their decision-making. This study aimed to investigate the relationship between the activity and characteristics of social interaction of beef bulls expressed in drylot pens during the pre-breeding period and their siring capacity. Collars with 3-axis accelerometers and proximity sensors were placed on bulls for 12 d prior to breeding season in 2020 (n = 11 bulls) and in 2021 (n = 10 bulls). Bulls were satisfactory at the breeding soundness evaluation, and ages ranged from 1.5 to 5.4 yr. Afterward, bulls were exposed to cows in multi-sire groups at a 1:30 ratio for 2 mo, however, some bulls were removed early due to injuries (range = 15 to 62 d). DNA samples were collected from bulls and calves to calculate the number of calves sired per bull (SRC), adjusted to days exposed to cows. Daily proportion of time active (AC) was measured through a machine learning algorithm created in Python for beef bulls to differentiate activity vs. non-activity from accelerometer data every 20 sec (Precision = 95%). Daily non-directional social networks were created from proximity perceived by the sensors (Precision = 91%, &lt;3m) in Python, where nodes represented bulls and a connection represented one second in proximity. Eigencentrality (how well connected a bull is to others, EC) and strength (proportion of connections among overall connections, ST) were calculated for each bull daily, where greater EC and ST values indicated more interactions. The statistical analyses were performed in RStudio. Negative binomial mixed effect models were fitted to AC (mean ± S.E., 26.05 ± 0.31 %), EC (26.50 ± 0.89), and ST (8.90 ± 0.21 %) as repeated measures, age (3.3 ± 0.3 yr), days exposed to cows (54 ± 3.1 d), and year as covariates, identification of bull as a random effect, and SRC as the outcome variable (21 ± 2, 2 to 45 calves). Estimates were transformed into percentage change. Days exposed to cows, year, and interactions were not significant (<span>P</span> &gt; 0.05). Separate models with EC or ST (model-EC and model-ST) were built due to collinearity (r = 0.89, <span>P</span> &lt; 0.001). In model-EC (marginal-R<sup>2</sup> = 0.26, conditional-R<sup>2</sup> = 0.70) bulls with increased AC (estimate = 2.16±0.67, <span>P</span> = 0.001), increased EC (0.56±0.24, <span>P</span> = 0.019), and younger (-20.75 ± 5.51, <span>P</span> &lt; 0.001) had greater SRC. In model-ST (marginal-R<sup>2</sup> = 0.25, conditional-R<sup>2</sup> = 0.72) bulls with increased AC (2.29 ± 0.65, <span>P</span> &lt; 0.001), increased ST (3.57 ± 0.98, <span>P</span> &lt; 0.001), and younger (-19.90 ± 5.49, <span>P</span> &lt; 0.001) had greater SRC. These preliminary results suggest that activity and social interactions during pre-breeding of beef bulls are related to SRC when accounted for age. Therefore, the behavior of beef bulls during the pre-breeding period might have the potential to predict their SRC, and future studies could investigate using this information to select bulls and form breeding groups aiming at optimization of the use of the bulls.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ebe08c3afd63cbf36340e14b8121781e39e09030b64a5e8b8393013e70b1a7d6","category":"Environment"}