{"title":"Fake DMCA takedown notice targeted Ubuntu downloaders yesterday","link":"https://arstechnica.com/?p=1768091","date":1622138006000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/takedown-notice.png\" /></div>\n        <p>\n          u/NateNate60 received this (heavily redacted) DMCA infringement warning. We don't have email headers, so we can't 100% verify it actually came from Comcast.                      [credit:\n                        <a href=\"https://www.reddit.com/r/linux/comments/nkztyv/copyright_notice_from_isp_for_pirating_linux_is/\">u/NateNate60</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>This week, Redditor u/NateNate60 got a nasty surprise in his inbox—a DMCA infringement warning from his ISP, Comcast Xfinity. The notice warned him that Comcast had \"received a notification by a copyright owner, or its authorized agent, reporting an alleged infringement of one or more copyrighted works.\"</p>\n<p>The strange thing about this warning was the \"infringed work\" in question: Ubuntu 20.04, which is free to redistribute by any means desired. Adding insult to injury, the hash listed on the notice is the same one associated with Canonical's <a href=\"https://ubuntu.com/download/alternative-downloads#bittorrents\">own</a> torrent for Ubuntu 20.04.2—u/NateNate60 was getting dinged for torrenting an <em>unmodified</em> copy of an open source operating system.</p>\n<h2>DMCA, P2P, and you</h2>\n<p>Typically, DMCA infringement warnings are sent as a result of an ISP customer using BitTorrent to acquire media or software illicitly. While the customer is attached to the <a href=\"https://en.wikipedia.org/wiki/Glossary_of_BitTorrent_terms#Swarm\">swarm</a>, their public IP address is advertised—this allows other members of the swarm to request pieces of the files being torrented from that user.</p></div><p><a href=\"https://arstechnica.com/?p=1768091#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1768091&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ebe1608819540638f61840fbb847c2a1cacd4db6436fd90284f1d62d8f135005","category":"Tech"}