{"title":"MIT scientists reveal why water drops move faster on a hot, oil-coated surface","link":"https://arstechnica.com/?p=1787403","date":1629155106000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/leiden1-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/leiden1.jpg\">Enlarge</a> <span>/</span> Researchers have determined why droplets are propelled across a heated oily surface 100 times faster than on bare metal. The images above reveal the mechanisms that cause the rapid motion. (credit: <a href=\"https://news.mit.edu/\">Kripa Varanasi/MIT News</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>There's a classic <a href=\"https://en.wikipedia.org/wiki/MythBusters_(2009_season)#Lead_Plunge\">2009 <em>Mythbusters</em> episode</a> in which the hosts demonstrate how someone could wet their hand and dip it ever so briefly <a href=\"https://www.youtube.com/watch?v=yTOCAd2QhGg\">into molten lead</a> without injury. The protective mechanism is known as the \"Leidenfrost effect,\" and it could one day prove useful for microfluidic devices, particularly in microgravity environments, among other applications. We're one step closer to achieving those applications, thanks to new insights into the phenomenon uncovered by MIT scientists. They described their findings in <a href=\"https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.127.074502\">a recent paper</a> published in the journal Physical Review Letters.</p>\n<p>As <a href=\"https://arstechnica.com/science/2019/05/study-finds-ultimate-fate-of-leidenfrost-droplets-depends-on-their-size/\">we've reported previously</a>, the Leidenfrost effect dates back to 1756. That's when German scientist <a href=\"https://en.wikipedia.org/wiki/Johann_Gottlob_Leidenfrost\">Johann Gottlob Leidenfrost</a> observed that, while water splashed onto a very hot pan sizzles and evaporates very quickly, something changes when the pan's temperature is well above water's boiling point. When that happens, Leidenfrost discovered, \"gleaming drops resembling quicksilver\" will form and will skitter across the surface.</p>\n<p>In the ensuing 250 years, physicists came up with a viable explanation for why this occurs. If the surface is at least 400 degrees Fahrenheit (well above the boiling point of water), cushions of water vapor, or steam, form underneath the droplets, keeping them levitated. The droplet can skitter across the surface with very little friction. The Leidenfrost effect also works with other liquids, including oils and alcohol, but the temperature at which it manifests (the \"Leidenfrost point\") will be different.</p></div><p><a href=\"https://arstechnica.com/?p=1787403#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1787403&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ebe1a7c11c26d6dcedbea01079278be2e65a20821b1b3523969e8d6404c9d1fe","category":"Tech"}