{"title":"Growth and Survival of Scallops Austrochlamys natans (Philippi, 1845) and Zygochlamys patagonica (P. P. King, 1832) in Suspended Systems and Land‐Based Tanks in Chilean Patagonia","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/6685325?af=R","date":1706601600000,"content":"<p>The southern scallop (<i>Austrochlamys natans</i>) and the Patagonian scallop (<i>Zygochlamys patagonica</i>) are vital species in the fisheries of Chilean Patagonia. However, overfishing has led to stock depletion, necessitating research for stock restoration and commercial production. This study aimed to evaluate the growth and survival of these scallops in suspended systems and land-based tanks across various Patagonian regions. Eight experiments were conducted, three with southern scallops and five with Patagonian scallops. For southern scallops, two experiments involved suspended systems at different shell heights and three tested land-based tanks at various temperatures (9, 11, and 13°C). Patagonian scallop experiments included one suspended system in an endemic area, land-based tanks with different temperatures (9, 11, and 13°C), and three suspended systems outside the species’ endemic zone. In suspended systems, southern scallops grew from 15.1 to 42.7 mm (shell height) in 322 days, with a rate of 0.085 mm/day and a survival rate of 43.7%. Patagonian scallops reached 46.0 mm shell height in 466 days, with a growth rate of 0.079 mm/day and a survival rate of 57.2%. Experiments in controlled-temperature tanks revealed that 13°C was the lethal temperature for southern scallops. Notably, higher growth rates occurred at temperatures between 9 and 11°C. Both species show potential for future commercial cultivation, contributing to Chilean aquaculture diversification.</p>","author":"Pablo Gallardo, \nCristian Araneda, \nElisa M. de Godoy, \nGuilherme Wolff Bueno, \nSebastián Rosenfeld, \nCristian Aldea, \nÉrico T. Teramoto, \nMahmoud Dawood","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"ebebe26451826aa0412a6a611b948142f9d2d3ceb169b713e4247afb501117d2","category":"Environment"}