{"title":"Development of Energy Poverty and its Solutions from the Perspective of Renewables Use","link":"https://www.preprints.org/manuscript/202406.1192/v1","date":1718691084000,"content":"The problem of energy poverty, when energy becomes unaffordable for some population group, is not only a problem for developing countries, but this phenomenon is appearing more and more often in European countries as well. In Europe, it is estimated that 50 to 125 million people are at risk of energy poverty. We hear more and more about energy poverty in connection with the current energy crisis and rising energy prices, but also as a result of insufficient use of renewable energy sources. Due to rising energy prices, we are increasingly hearing about deepening energy poverty in Slovakia as well. The aim of the contribution is to examine the development of energy poverty in Slovakia compared to other EU countries. The situation is studied from the view of the number of days of heating and cooling, the percentage of the population that cannot maintain adequate heat at home, the percentage of the population that has a lack of heat and the percentage of residents without enough heat. During the research, we used distribution analysis, trend analysis, analysis of variance and one-way analysis. The main results show that HDD index recorded decrease, CDD index recorded increase, and Energy poverty is most obvious in low-income group of inhabitants, having shortage of heat, when RES use contribute to mitigation of energy poverty. Solving the unfavorable situation with energy poverty is possible by increasing the share of Renewable energy sources in the gross final energy consumption for heating and cooling, primarily in residential buildings. The results provide information for policy makers in area of economic, social and environmental decision-making.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ec0196ed01168c7e6d9d5d82ce2698b3dc2ae12848bdd3ea8476116480199a25","category":"Interdisciplinary"}