{"title":"Unveiling Fungi Armor: Fortifying Pisum sativum L. Seeds against Drought with Schizophyllum commune Fries 1815. Polysaccharides","link":"https://www.preprints.org/manuscript/202404.1291/v1","date":1713452263000,"content":"Amidst worsening climate change, drought stress imperils global agriculture, jeopardizing crop yields and food security, necessitating urgent exploration of sustainable methods like biopriming, harnessing beneficial microorganisms to bolster plant resilience. Recent research has revealed diverse biological compounds with versatile applications produced by Schizophyllum commune, rendering this fungus as a promising contender for biopriming applications. For the first time this study aimed to investigate,the potential of S. commune exo- (EPSH) and intra-PSH (IPSH), isolated from two strains: Italian (ITA) and Serbian (SRB) under submerged cultivation, in enhancing the resilience of Pisum sativum L. seeds through biopriming technique. Testing of seed quality of bioprimed, hydroprimed, and unprimed seeds was done using a germination test, under optimal and drought conditions. In optimal conditions, the IPSH SRB increased germination energy by 5.50% compared to the control, while the highest percentage of germination (94.70%) was shown after biopriming with PSH isolated from the ITA strain. Additionally, all assessed treatments resulted in a boost in seedling growth and biomass accumulation, where the ITA strain demonstrated greater effectiveness in optimal conditions, whereas the SRB strain showed superiority in drought conditions. The drought tolerance indices increased significantly in response to all examined treatments during the drought, with EPSH ITA (23.00%) and EPSH SRB (24.00%) demonstrating the greatest effects. Results demonstrate a significant positive influence of fungal PSH, indicating their potential as biopriming agents and offers insights into novel strategies for agricultural resilience in the face of changing environmental conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ec1b000eaedddc514477523b3b4ec41cc5403137e2c5e919ee70d14af3d972be","category":"Interdisciplinary"}