{"title":"Olaparib not cost-effective as maintenance therapy for platinum-sensitive, <i>BRCA1/2</i> germline-mutated metastatic pancreatic cancer","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301271","date":1712239200000,"content":"<p>by Tarun Mehra, Judith E. Lupatsch, Thibaud Kössler, Konstantin Dedes, Alexander Reinhard Siebenhüner, Roger von Moos, Andreas Wicki, Matthias E. Schwenkglenks</p>\r\nObjective <p>To assess the cost-effectiveness and budget impact of olaparib as a maintenance therapy in platinum-responsive, metastatic pancreatic cancer patients harboring a germline <i>BRCA1/2</i> mutation, using the Swiss context as a model.</p> Methods <p>Based on data from the POLO trial, published literature and local cost data, we developed a partitioned survival model of olaparib maintenance including full costs for <i>BRCA1/2</i> germline testing compared to FOLFIRI maintenance chemotherapy and watch-and-wait. We calculated the incremental cost-effectiveness ratio (ICER) for the base case and several scenario analyses and estimated 5-year budget impact.</p> Results <p>Comparing olaparib with watch-and wait and maintenance chemotherapy resulted in incremental cost-effectiveness ratios of CHF 2,711,716 and CHF 2,217,083 per QALY gained, respectively. The 5-year costs for the olaparib strategy in Switzerland would be CHF 22.4 million, of which CHF 11.4 million would be accounted for by germline <i>BRCA1/2</i> screening of the potentially eligible population. This would amount to a budget impact of CHF 15.4 million (USD 16.9 million) versus watch-and-wait.</p> Conclusions <p>Olaparib is not a cost-effective maintenance treatment option. Companion diagnostics are an equally important cost driver as the drug itself.</p>","author":"Tarun Mehra","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ec277afa828cc05c6809873dd3934d444815b40dc6c4880195634c21cb5dcbe4","category":"Interdisciplinary"}