{"title":"Nuke-launching AI would be illegal under proposed US law","link":"https://arstechnica.com/?p=1935261","date":1682698269000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/anuclear_mushroom_cloud_1200-800x450.jpg\" alt=\"An AI-generated image of a nuclear mushroom cloud.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/anuclear_mushroom_cloud_1200.jpg\">Enlarge</a> <span>/</span> An AI-generated image of a nuclear mushroom cloud. (credit: Midjourney)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Wednesday, US Senator Edward Markey (D-Mass.) and Representatives Ted Lieu (D-Calif.), Don Beyer (D-Va.), and Ken Buck (R-Colo.) <a href=\"https://www.markey.senate.gov/news/press-releases/markey-lieu-beyer-and-buck-introduce-bipartisan-legislation-to-prevent-ai-from-launching-a-nuclear-weapon\">announced</a> bipartisan legislation that seeks to prevent an artificial intelligence system from making nuclear launch decisions. The Block Nuclear Launch by Autonomous Artificial Intelligence Act would prohibit the use of federal funds for launching any nuclear weapon by an automated system without \"meaningful human control.\"</p>\n\n<p>“As we live in an increasingly digital age, we need to ensure that humans hold the power alone to command, control, and launch nuclear weapons—not robots,” Markey said in a news release. “That is why I am proud to introduce the Block Nuclear Launch by Autonomous Artificial Intelligence Act. We need to keep humans in the loop on making life or death decisions to use deadly force, especially for our most dangerous weapons.”</p>\n<p>The new bill builds on existing US Department of Defense policy, which <a href=\"https://media.defense.gov/2022/Oct/27/2003103845/-1/-1/1/2022-NATIONAL-DEFENSE-STRATEGY-NPR-MDR.PDF\">states</a> that in all cases, \"the United States will maintain a human 'in the loop' for all actions critical to informing and executing decisions by the President to initiate and terminate nuclear weapon employment.\"</p></div><p><a href=\"https://arstechnica.com/?p=1935261#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1935261&amp;comments=1\">Comments</a></p>","author":"Benj Edwards","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ec2a249fa943bff18a843b2346b521184398bf1b873ce28d87f2c26bb2d3e7d3","category":"Tech"}