{"title":"ถอดแนวคิดภาพยนตร์โฆษณา DirectAsia บนเส้นทางสู้ No.1 Digital Car insurance Broker ที่ “พร้อมอยู่กับคุณตั้งแต่ต้นจนจบ”","link":"https://www.blognone.com/node/125475","date":1635309900000,"content":"<div><div><div><p>ไดเร็ค เอเชีย (DirectAsia) ผู้นำด้านนวัตกรรมประกันภัยรถยนต์ออนไลน์ เผยเส้นทางการเป็น Digital Car Insurance Broker อันดับ 1 ในไทย ผ่านภาพยนตร์โฆษณาชุด ‘ความสัมพันธ์ออนไลน์’ ควบคู่กับ Tagline ใหม่ “DirectAsia เราพร้อมอยู่กับคุณตั้งแต่ต้นจนจบ”</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e687df56129e3d64d8e0ddd0e2b36b76.jpg\" /></p>\n<p>ตลอดระยะเวลาการให้บริการด้านประกันภัยรถยนต์ออนไลน์กว่า 7 ปี DirectAsia เล็งเห็นถึงการพัฒนาของเทคโนโลยีที่ก้าวกระโดดและเปลี่ยนแปลงอยู่แทบทุกวินาที จึงตระหนักถึงการพัฒนาตลอดเวลา ซึ่งไม่ใช่แค่การพัฒนาอย่างต่อเนื่อง แต่ต้องเน้นหลากหลายมิติไปพร้อมกันด้วย เช่น การพัฒนานวัตกรรมด้านผลิตภัณฑ์ (Product Innovation) อย่างประกันชั้น 1 เซฟ ที่นำจุดเด่นของ<a href=\"https://www.directasia.co.th/online-car-insurance/type1/\">ประกันรถยนต์ชั้น 1</a> มาต่อยอดจนได้ผลิตภัณฑ์ใหม่ ที่ครองใจผู้ขับขี่มาแล้วทั่วไทย</p>\n<p>ล่าสุด DirectAsia ได้ปล่อยภาพยนตร์โฆษณาชุดใหม่ ในความยาว 1 นาที ที่นำ Pain point ของลูกค้าในปัจจุบันที่อาจยังไม่มั่นใจในการรับบริการผ่านช่องทางออนไลน์ หรือบนเว็บไซต์ และเกิดความกังวลใจว่าจะเชื่อถือได้จริงหรือไม่ ซึ่ง DirectAsia ในฐานะโบรกเกอร์ประกันภัยรถยนต์ออนไลน์เจ้าแรกในไทย ต้องการนำเสนอผ่านมุมมองของ Smart Service ที่ DirectAsia ได้ให้บริการลูกค้าอยู่แล้วในปัจจุบัน มาเป็นโซลูชันในการสร้างความเชื่อมั่นให้แก่ผู้บริโภค</p>\n<p><u><strong>Smart Service จาก DirectAsia ที่พร้อมอยู่กับคุณตั้งแต่ต้นจนจบ - ตั้งแต่ลูกค้าเช็กเบี้ยประกันภัย ตลอดจนแจ้งเคลม</strong></u></p>\n<p><strong>- ระบบตอบรับอัตโนมัติ หรือ IVR (Interactive Voice Response)</strong></p>\n<p>หนึ่งในระบบปฏิบัติการที่ DirectAsia ให้ความสำคัญมากที่สุด เป็นความประทับใจแรกที่มอบให้ลูกค้า คือการรับสายโทรศัพท์ด้วยระบบตอบรับอัตโนมัติ (Interactive Voice Response) ที่รวดเร็วภายใน 5 วินาที โดยไม่มีวันหยุด ทำงานตลอด 24 ชั่วโมง อีกทั้งยังช่วยลดอัตราการรอสายของลูกค้าที่ต้องการสอบถามข้อมูลได้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/77bb0ea4137d2dfaea2261e5e5e32066.jpg\" /></p>\n<p><strong>ติดต่อกลับอย่างรวดเร็ว (Hot Lead)</strong></p>\n<p>เมื่อลูกค้าสนใจประกันรถยนต์ แต่ยังมีข้อสงสัยและต้องการพูดคุยกับเจ้าหน้าที่ สามารถฝากข้อมูลบนหน้าเว็บไซต์ https://www.directasia.co.th/ เพื่อให้เจ้าหน้าที่ติดต่อกลับอย่างรวดเร็ว ภายใน 30 วินาที โดยเจ้าหน้าที่จะได้รับข้อมูลที่จำเป็นก่อนจะโทรกลับหาลูกค้า เพื่อนำเสนอกรมธรรม์ที่เหมาะสมในเวลาอันสั้น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/bfd1884060d31d53278596d7771f0569.jpg\" /></p>\n<p><strong>-   ระบบตอบกลับอัตโนมัติ (Chat Bot)</strong></p>\n<p>ลูกค้าสามารถสนทนากับ DirectAsia ผ่าน Chat Bot ได้ทันทีตลอด 24 ชั่วโมง โดยไม่ต้องรอเจ้าหน้าที่ตอบกลับในเวลาทำการ ซึ่งการโต้ตอบที่รวดเร็วนี้ ส่งผลให้ลูกค้าตัดสินใจซื้อได้อย่างรวดเร็วด้วยเช่นกัน อีกทั้งลูกค้ายังสามารถใช้บริการคุยกับเจ้าหน้าที่ได้ทุกเมื่อที่ต้องการ เพียงกดที่ตัวเลือกคุยกับพนักงาน เจ้าหน้าที่ก็จะเข้ามาให้คำปรึกษาแทนระบบคอมพิวเตอร์</p>\n<p><strong>-   เคลมไว (Fast Claim)</strong></p>\n<p>กรณีรถยนต์ลูกค้าเกิดอุบัติเหตุ และแจ้งเคลมเข้ามา DirectAsia จะส่งเจ้าหน้าที่ไปถึงจุดเกิดเหตุไว ภายใน 30 นาที หรือไปเร็วกว่านั้น ด้วยวิสัยทัศน์ของบริษัทฯ คือการไม่ปล่อยให้ลูกค้ารอนาน และหากเกินเวลา 30 นาที ลูกค้าจะได้รับบัตรเติมน้ำมัน* มูลค่า 1,000 บาท เป็นการทดแทน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/db839937b0ca5d63c0c2aa50a971dde2.jpg\" /></p>\n<p><strong>-   บริการซ่อม และการันตีงานซ่อม (Repair Service and Car Warranty)</strong></p>\n<p>DirectAsia มีอู่ซ่อมและศูนย์บริการคุณภาพในเครือพร้อมให้บริการทั่วไทยกว่า 1,000 แห่ง และให้ลูกค้าซ่อมสีหรือตัวถังได้จนกว่าจะพอใจ ในกรณีที่งานซ่อมดังกล่าวไม่เรียบร้อย หรือไม่เป็นไปตามที่ได้ตกลงไว้ภายในระยะเวลา 6-12 เดือน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9cc9a2a96abd034d5cc0c26e5d7ec6cd.jpg\" /></p>\n<p><strong>-   บริการด้วยใจ (Service Mind)</strong></p>\n<p>DirectAsia มุ่งให้พนักงานพัฒนาคุณภาพด้านบริการอยู่เสมอ ทั้งการปฏิบัติงานเชิงรุกและเชิงรับ โดยไม่จำเป็นต้องรอให้ลูกค้าเข้ามาขอความช่วยเหลือเพียงอย่างเดียว แต่พนักงานจะต้องยื่นมือช่วยเหลือลูกค้าด้วยความเต็มใจ และสนองความต้องการของลูกค้าได้อย่างตรงจุด</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b0d5c16d333621bc6413f2df19dc6101.jpg\" /></p>\n<p>จากบริการข้างต้น สู่การนำเสนอในรูปแบบภาพยนตร์โฆษณาภายใต้คอนเซ็ปต์  ‘ความสัมพันธ์ออนไลน์’ ที่ DirectAsia ได้ออกแบบให้มีการผสมผสานรายการวิทยุกับการให้คำปรึกษาจากดีเจผู้จัดรายการ มาเป็นไอเดียสำหรับการเรียบเรียงเนื้อเรื่อง โดยเนื้อหาของโฆษณา เป็นการบอกเล่าเรื่องราวจากสาวสวยที่โทรไปปรึกษากับดีเจในรายการหนึ่ง กล่าวถึง ‘ความสัมพันธ์ออนไลน์’ ที่เธอได้รับการดูแลอย่างดีจากคนที่ไม่เคยเห็นหน้าคร่าตามาก่อน ดูเป็นความสัมพันธ์ที่จับต้องไม่ได้ และไม่แน่ใจว่ามีอยู่จริงหรือไม่ ก่อนจะเฉลยในภายหลังว่าความสัมพันธ์ที่ว่ามานั้น คือความสัมพันธ์ระหว่าง DirectAsia กับลูกค้า ทั้งนี้ยังมี Keyword ปิดท้ายด้วยว่า ‘บางความสัมพันธ์ ต้องดูกันไปยาว ๆ’ เป็นความตั้งใจที่ DirectAsia อยากชวนให้ผู้ชมคิดต่อว่า ประกันรถยนต์ออนไลน์ก็ควรศึกษา และให้เวลาในการพิสูจน์เช่นเดียวกันกับความรักเช่นกัน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6bbdbbd17d104597979e8886924a6b35.jpg\" /></p>\n<p>การตีความที่แบรนด์พยายามสื่อสารต่อผู้บริโภคด้วยข้อความที่เข้าใจง่าย การเปรียบเทียบกับความรัก ที่ดูเหมือนว่าผู้ชมจะอินกับโฆษณา และจดจำแบรนด์ได้อย่างตราตรึง ทำให้เห็นแล้วว่า DirectAsia ไม่ได้เป็น Digital Car Insurance Broker อันดับ 1 หรือ พร้อมดูแลลูกค้าตั้งแต่ต้นจนจบเพียงอย่างเดียว แต่ยังเป็น Genius Technology Solution หรือแบรนด์ที่ใช้เทคโนโลยีได้อย่างชาญฉลาดที่สุดด้วยเช่นกัน เพราะการไม่ละเลยต่อปัญหาของผู้บริโภค ทำให้ DirectAsia ยังคงรักษาตำแหน่งผู้นำด้านนวัตกรรมประกันภัยรถยนต์ออนไลน์อันดับ 1 ในไทยได้จนถึงทุกวันนี้</p>\n<p>รับชมภาพยนตร์โฆษณาชุด ‘ความสัมพันธ์ออนไลน์’ ได้ที่ <a href=\"https://directasia.biz/2Z1kjWz\">https://directasia.biz/2Z1kjWz</a> หรือโฆษณาเวอร์ชันอื่น ๆ ที่ YouTube: DirectAsia Thailand</p>\n<p>สนใจประกันรถยนต์ออนไลน์ที่จะช่วยให้คุณสะดวกสบายตั้งแต่เช็กเบี้ยประกัน ไปจนถึงชำระเงินบนเว็บไซต์ https://www.directasia.co.th/ หรือโทร 02-767-7777 เพื่อรับบริการจากเจ้าหน้าที่ผู้เชี่ยวชาญประกันรถยนต์</p>\n<p>*เงื่อนไขเป็นไปตามที่บริษัทฯ กำหนด</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/directasia\">DirectAsia</a></div><div><a href=\"/topics/insurance\">Insurance</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ec3f69cb14981218cd41d2ea202220e9e412d9ed3fa8318b9d306c41c6aa067f","category":"Thai"}