{"title":"Juul to pay N.C. $40M and stop targeting kids after igniting vaping “epidemic“","link":"https://arstechnica.com/?p=1777092","date":1624994249000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/02/Screen-Shot-2020-02-13-at-10.47.20-AM-800x502.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/02/Screen-Shot-2020-02-13-at-10.47.20-AM.jpeg\">Enlarge</a> <span>/</span> Juul went with a fashionable, \"cool\" marketing strategy. (credit: <a href=\"https://www.mass.gov/lists/attorney-generals-office-lawsuit-against-juul\">Mass.gov</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Electronic cigarette maker Juul and the state of North Carolina have reached <a href=\"https://ncdoj.gov/wp-content/uploads/2021/06/2021-06-28-JUUL-Consent-Judgment.pdf\">a settlement</a> over the state’s claims that Juul aggressively targeted its “highly addictive” products to youth, igniting a vaping epidemic.</p>\n<p>While still denying any wrongdoing, Juul has agreed to pay North Carolina a total of $40 million over six years. Additionally, the company will adhere to a list of restrictions aimed at blocking any promotion and sales of its products to youths. According to the list, Juul won’t use advertisements that may appeal to youth; it will avoid most social media advertising and the use of influencers; it won’t sponsor sports and entertainment events, like concerts; and it won’t use anyone under the age of 35 in its marketing.</p>\n<p>The company also agreed to help enforce age restrictions by running a “secret shopper” program. Juul will send undercover representatives, ages 21 to 27, into at least 50 stores throughout the Tar-Heel State per month to check whether retailers verify buyers’ ages.</p></div><p><a href=\"https://arstechnica.com/?p=1777092#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1777092&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ec43eb3dd170ad51952ac4202eaf5b45f5669c7c59e32311f17abb8dd468ec34","category":"Tech"}