{"title":"PSXIII-23 Phytogenic feed additive to improve performance by grazing Nellore growing cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/787/7757879?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Our objective was to evaluate the effects of a phytogenic additive (Digestarom Prime, dsm-firmenich, Switzerland) on performance and supplement intake of growing grazing Nellore young bulls from November 2021 to April 2022. Animals [n = 120; initial body weight (BW) = 280 kg and age = 14 mo] were equally distributed in six paddocks (7.7 ha each) of <span>B. brizantha</span> cv. Marandu (20 animal/paddocks) equipped with electronic feeders that provided individual access (Intergado system). The experiment was conducted in a complete randomized design, with 20 replicates (animals) per treatment. Treatments consisted of a protein supplement (Fosbovi Proteico 30, DSM, Brazil), provided ad libitum, with or without the addition of Digestarom Prime, in a dose adjusted to ensure a daily intake of 0.2, 0.4, 0.6 or 0.8 gּ animal<sup>-1</sup>ּ d<sup>-1</sup>. Treatments evaluated were: 1) control (CON) with no additive; 2) monensin 15 ppm (MON); 3) Digestarom 0.2 gּ animal<sup>-1</sup>ּ d<sup>-1</sup> (D 02); 3) Digestarom 0.4 gּ animal<sup>-1</sup>ּ d<sup>-1</sup> (D04); Digestarom 0.6 gּ animal<sup>-1</sup>ּ d<sup>-1</sup> (D06) and 6) Digestarom 0.8 gּ animal<sup>-1</sup>ּ d<sup>-1</sup> (D08). The experiment lasted 150 d. Supplement intake was measured by electronic feeders, and intake as % of BW was calculated using the average of initial and final BW. Average daily gain (ADG) was measured by Intergado system, through the electronic weighing system installed underneath the drinkers. Data were analyzed by SAS PROC MIXED in DIC considering the initial BW as a covariate. Student’s t test was utilized for means comparison. Significance of 5% was adopted. Supplementation with Digestarom at the level of 0.6 gּ animal<sup>-1</sup>ּ d<sup>-1</sup> increased ADG in approximately 0.116 kg/d (means: D06 = 1.174 kg/d vs. CON = 1.064, MON = 1.086, D02 = 1.069, D04 = 1.038 and D08 = 1.034 kg/d; <span>P</span> &lt; 0.01), and final BW, in approximately 19 kg (means D06 = 459 kg vs CON = 436, MON = 439, D02 = 449, D04 = 443 and D08 = 435 kg; <span>P</span> &lt; 0.05). Monensin presented the least supplement intake evaluated as either absolute or relative to BW (0.214 kg/d and 0.061% of BW, <span>P</span> &lt; 0.01), followed by Digestarom levels of 0.4 and 0.8 g gּ animal<sup>-1</sup>ּ d<sup>-1</sup> (D04 = 0.347 kg/d and 0.098% of BW and D08 = 0.367 and 0.103), that did not differ from each other (<span>P</span> &gt; 0.05). Control, 0.2 and 0.6 Digestarom gּ animal<sup>-1</sup>ּ d<sup>-1</sup> presented the greatest supplement intake (CON = 0.481 kg/d and 0.134% of BW, D02 = 0.456 and 0.123, D06 = 0.444 and 0.120, <span>P</span> &lt; 0.01), that also did not differ from each other (<span>P</span> &gt; 0.05). We conclude that Digestarom supplementation at 0.6 gּ animal<sup>-1</sup>ּ d<sup>-1</sup> improves animal performance, without affecting supplement intake of grazing Nellore young bulls.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ec459c6193867860fb8e806483fadcee1671f1595ef54e5fa7d0f4d16a922a32","category":"Environment"}