{"title":"Meet the latest AWS Heroes – November 2021","link":"https://aws.amazon.com/blogs/aws/meet-the-latest-aws-heroes-november-2021/","date":1636753521000,"content":"<p>It is an exciting time of year, with AWS re:Invent right around the corner. As we reflect back on 2021, we continue to be impressed by the way AWS communities support one-another across intersecting journeys to expand technical skills. At the center of these communities are impactful leaders who go above and beyond to create educational content and facilitate peer-to-peer knowledge sharing across multiple channels. These passionate builders are called <a href=\"https://aws.amazon.com/developer/community/heroes/\" target=\"_blank\">AWS Heroes</a>, and we are humbled by the amazing activities they support on behalf of their communities. Today we are excited to introduce the latest cohort of AWS Heroes:</p> \n<h2>Juan Pan – Beijing, China</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/juan-pan/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/08/juan-pan.jpg\" /></a>Data Hero <a href=\"https://aws.amazon.com/developer/community/heroes/juan-pan/\" target=\"_blank\">Juan Pan</a> (Trista) is the CTO and Co-Founder of SphereEx. She serves as an Apache ShardingSphere Project Management Committee member, as well as a mentor on various other Apache incubation projects. She was a recipient of the 2020 and 2021 “China OSCAR Open Source Pioneer” award, and frequently speaks at relevant conferences in the fields of databases &amp; database architecture, including at AWS Summit Shanghai and AWS Dev Days. Juan loves to encourage more women to pursue careers in technology, and she regularly shares her empowering journey from open source contributor to CTO at events such as the AWS She Builds Summit.</p> \n<h2>Masanori Yamaguchi – Chiba, Japan</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/masanori-yamaguchi/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/08/masanori-yamaguchi.jpg\" /></a>Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/masanori-yamaguchi/\" target=\"_blank\">Masanori Yamaguchi </a> is a Solution Architect at KDDI Corporation. Yamaguchi joined the Japanese AWS User Group (JAWS-UG) in 2014 and has since managed 35 events including the reboot of Fin-JAWS (Financial-JAWS), and the JAWS-UG Chiba Chapter in 2019. Yamaguchi organized the 2021 JAWS-UG online event (JAWS DAYS 2021). This event was a new challenge in online events: not only delivering sessions, but also providing a place for attendees to communicate with each other and participate in AWS quizzes, games, and more. 4,000 participants from all over Japan attended the event. In recognition of these activities, he received the AWS Samurai 2020 Award.</p> \n<h2>Pamela Gotti – Milan, Italy</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/pamela-gotti/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/08/pamela-gotti.jpg\" /></a>Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/pamela-gotti/\" target=\"_blank\">Pamela Gotti</a> is Chief Technology Officer at Credimi. She loves to design systems with clear boundaries through domain-driven design and event storming, and to bring them to life on Amazon EKS, with a mix of AWS Lambda, Amazon RDS, and Amazon S3. She has given talks about how Credimi uses AWS to implement new features, microservices communication approaches (from event-driven architecture to GraphQL), and about team organization. Since 2018 Pamela has led the tech team of SheTech, organizing events that help women build coding skills. The coding bootcamps focus on machine learning with Python, web development with JavaScript, and serverless.</p> \n<h2>Salah Elhossiny – Cairo, Egypt</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/salah-elhossiny/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/09/sala-elhossiny.jpg\" /></a>Machine Learning Hero <a href=\"https://aws.amazon.com/developer/community/heroes/salah-elhossiny/\" target=\"_blank\">Salah Elhossiny</a> works as an ML full stack developer, building backend and frontend solutions integrated with ML pipelines to provide intelligence for data labeling and analysis processes. Salah also builds serverless solutions on AWS integrated with ML models on Amazon SageMaker. A certified AWS ML specialist, Salah is an involved member of the AWS MENA Community, where he frequently writes summaries of AWS whitepapers to facilitate AWS certification exam preparation for fellow community members. He also enjoys writing about machine learning on Amazon SageMaker and serverless solutions.</p> \n<h2>Sheng Wu – Beijing, China</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/sheng-wu/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/08/sheng-wu.jpg\" /></a>Container Hero <a href=\"https://aws.amazon.com/developer/community/heroes/sheng-wu/\" target=\"_blank\">Sheng Wu</a> is a founding engineer at Tetrate. He serves on the world’s biggest open source foundation, The Apache Software Foundation, as a board director and mentor of the incubator. He is a regular speaker at conferences such as the AWS Summit, AWS Dev Day, QCon, KubeCon, and ApacheCon, typically sharing his expertise in observability for container-based and cloud-native environments. His articles and blogs on containers, cloud-native, and observability appear in media including The New Stack and the Apache SkyWalking Official Blog.</p> \n<h2>Takahiro Horike – Tokyo, Japan</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/takahiro-horike/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/09/takahiro-horike.jpg\" /></a>Serverless Hero <a href=\"https://aws.amazon.com/developer/community/heroes/takahiro-horike/\" target=\"_blank\">Takahiro Horike</a> is CEO of Serverless Operations, Inc. While working in cloud computing, he participates in and contributes to the open source community, letting people know how fun and meaningful it is by speaking at AWS official events like AWS Dev Day. He also speaks at Japan AWS User Group (JAWS-UG) events. Horike has contributed to several open source projects on GitHub, including Serverless Step Functions. His nearly 40 presentations can be found on SlideShare and Speaker Deck.</p> \n<h2>Vanessa Santos – São Paulo, Brazil</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/vanessa-santos/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/08/vanessa-santos.jpg\" /></a>Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/vanessa-santos/\" target=\"_blank\">Vanessa Santos</a> joined the AWS User Group São Paulo in 2017. Starting from a non-traditional technical background, she became recognized as an AWS Community Leader in 2019, achieving new learnings and practices through the AWS re:Invent We Power Tech Grant. Passionate about technology, Vanessa believes people can continuously learn and still be curious for more. She works with local and international AWS User Groups as an AWS UG São Paulo co-organizer, with female and black tech communities, as an MBA Lecturer, and as council volunteer for Brazilian health tech.</p> \n<h2>Vivek Raja P S – Madurai, India</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/vivek-raja/\" target=\"_blank\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/08/vivek-raja.jpg\" /></a>Machine Learning Hero <a href=\"https://aws.amazon.com/developer/community/heroes/vivek-raja/\" target=\"_blank\">Vivek Raja</a> works as Data Scientist at NexStem | CortexBCI Inc. He is an active speaker where he shares his learnings with AWS User Group India, at events such as AWS Community Day ANZ, and at various developer communities including the TensorFlow User Group, and Women in Data Science. He also supports AWS re:Skill with technical talks, podcasts, and open-source projects. Vivek regularly writes blogs where he shares about AWS Machine Learning and AWS DeepRacer. He is a DeepRacer enthusiast and uses it to help students learn Machine Learning by organizing regional AWS DeepRacer contests.</p> \n<p>If you’d like to learn more about the new Heroes, or connect with a Hero near you, please visit the <a href=\"https://aws.amazon.com/developer/community/heroes/\" target=\"_blank\"> AWS Heroes website</a> or browse the <a href=\"https://aws.amazon.com/developer/community/heroes/content-library/\" target=\"_blank\">AWS Heroes Content Library</a>.</p> \n<p>— <a href=\"https://twitter.com/rossbarich\" target=\"_blank\">Ross</a>;</p>","author":"Ross Barich","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"ec48b9135af1b87515d68fec491824a0b0e17682780b787a0161ecf2b37dc2b0","category":"Tech"}