{"title":"The effects of different diet, salinity and light condition on growth performance and moulting cycle of juvenile mud crab, Scylla paramamosain","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16106?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p><i>Scylla paramamosain</i> is an importantly economical mariculture crab. To figure out the optimized conditions in the culture of juvenile crabs, three experiments were conducted to examine the effects of diet, salinity and light condition on the growth performance (body weight gain, BWG; carapace width gain, CWG; carapace length gain, CLG) and moulting cycle (MC) of crablets from V to VII stages. The growth performances of the crablets from stages V–VII have no significant differences after feeding different diets. However, the MC of crablet V fed <i>Artemia</i> or mixed fish were significantly shorter than that fed artificial diet. The CLG of crablet VI in salinity 25‰ was significantly higher than that in salinity 15‰, while the CWG and CLG of crablet VII in salinity 15‰ were significantly higher than that in salinity 5‰. The MC of the crablets V–VI reared in salinity 25‰ and 15‰ were significantly shorter than that in salinity 5‰, while it was significantly shorter in salinity 25‰ than that in salinity 15‰ from crablets VI–VII. For light conditions, the BWG of crablet VI with full cover was significantly higher than that with half cover. Whereas, the MC of the crablets V and VI with full cover was significantly shorter than that without cover or half cover. These findings indicated that crablet V and VI may prefer to exposing to 25‰ salinity and dark environment and feeding on <i>Artemia</i> for faster growth. Thus, the current findings may serve as a guide for establishing appropriate conditions in the aquaculture of juvenile mud crabs.</p>","author":"Yin Zhang, \nZhi Huang, \nYao Zhou, \nHaiyi Ma, \nHafiz Sohaib Ahmed Saqib, \nQiong Su, \nWenxiao Cui, \nHongyu Ma","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"ec4ac0b8e6a7c58bd92e14c4d497e12b7aab2ed5cfc53345c2c825eefc16bffc","category":"Environment"}