{"title":"Long-Haul Truck Drivers&rsquo; Perceptions of Truck Stops and Rest Areas: A Focus on Health and Wellness","link":"https://www.preprints.org/manuscript/202407.2125/v1","date":1721963922000,"content":"The work and life routine of long-haul truck drivers involves the use of truck stops and rest areas to meet their basic human needs. These extensions of their workspaces while on the road, do not always offer adequate physical structures and services that drivers need for optimal health. Aim: To evaluate long-haul truck drivers’ perceptions about the services of food, safety, physical activity, rest and personal hygiene offered at truck stops and rest areas in Brazil. Method: Quantitative study conducted with long-haul truck drivers from the Southern region of Brazil. For data collection, a sociodemographic questionnaire and a Likert scale on food, rest, personal hygiene, safety and physical activity services were used, offered in general at the truck stops and rest areas along Brazilian roads, from March to August 2023. The data were analyzed with simple frequency descriptive statistics. Results: 175 long-haul truck drivers participated, 70.29% declared that the services of the truck stop and rest areas were charged; more than half (53.59%) of the professionals evaluated the rest service as “good” or “excellent”; the food services, was “good” or “excellent” for 42.24% of the drivers. The spaces for physical activities were the worst evaluated as “bad” or “terrible”, by 41.61%, followed by bathroom service (28.42%) and safety (34.24%), evaluated as “bad” or “terrible”. Conclusions: In the perception of long-haul truck drivers, the rest and feeding services had better evaluations, on the other hand, the services of bathroom, safety and physical activity presented worse evaluations. The perception of drivers demonstrates the lack of investments to improve basic services such as personal hygiene, safe environment and physical exercises, fundamental to the health of the worker, aiming to reduce vulnerability, sedentary lifestyle, and meeting the basic human needs of long-haul truck drivers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ec569a79df05fe8561f05b489d1f2072b48d4ff02f909c234950d5ae0301e9ed","category":"Interdisciplinary"}