{"title":"Cannondale CAAD13 105 Disc review","link":"https://www.cyclist.co.uk/reviews/9939/cannondale-caad13-105-disc-review","date":1627567016000,"content":"<span>\n      <span><a href=\"/authors/marc-abbott\">Marc Abbott</a></span>\n  </span><div>  \n  <div>      <div><span>Monday, August 2, 2021 - 15:53</span></div>    </div></div><p>\nThe CAAD13 is an aluminium road bike that packs a sizeable punch</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/07/cannondale_caad13_105_disc_3.jpg?itok=pywA4zuS\" />  </div>\n<div>  \n  <div>      <div><div>  \n  <div>\n    <div>\n      <div></div>\n    </div>\n  </div>\n      <span>\n      <strong>4.0</strong>\n      / <span>5</span>\n    </span>\n  \n</div>\n</div>    </div></div><div>  \n  <div>      <div>£2250</div>    </div></div><div>\n      <p> The aluminium Cannondale CAAD range is in serious danger of becoming a cycling cliché, right up there with the Shimano 105 groupset.</p>\n<p>While the latter is universally lauded for its combination of performance and value for money, the former has received accolades throughout its life for the way in which it disproves both the ‘carbon is king’ and ‘alloy is harsh’ maxims.</p>\n<p>The Cannondale CAAD13 105 Disc bolsters the reputation of this storied model, and presents writers like myself with the daunting prospect of supplying you with a review which avoids clichés like the plague (oops).</p>\n<p>What this bike does provide is a ride that’s a far cry from the aluminium bikes of a few decades ago, and in this updated form, also spices up its undeniable comfort with a smattering of features that imbue it with wind-cheating, performance-enhancing qualities.</p>\n<p>It might well be a cliché forged in alloy, but the Cannondale CAAD13 105 Disc is a bike you simply need to ride to believe. It does have its drawbacks, but the complete package is a very difficult prospect to ignore – if you can live with the price.</p>\n<h3>Not so heavy metal</h3>\n<p>We’ll deal with the frameset first, since that’s what really sets the Cannondale CAAD13 105 Disc apart from its rivals such as the Specialized Allez range (whose top end Sprint Comp is comparible in price).</p>\n<p>The SmartForm construction technique used for the aluminium alloy frame of the CAAD13 aims to (in the words of Cannondale) ‘deliver incredibly precise wall thickness distribution and tube shapes, concentrating material exactly where needed to maximize stiffness and strength, while shaving every last extraneous gram from the structure’.</p>\n<p>Precision is the key here, and extends to the internal butting of the tubes, which are smoothly tapered, eliminating ‘the abrupt changes in material thickness which cause stress-risers.</p>\n<p>'Furthermore, the double-pass smooth welds create the strongest possible joints, and the post-weld, heat-treat process creates a true uni-body finished structure.’ It’s reckoned by the American company to be the lightest and most sophisticated aluminium construction available.</p>\n<p><a href=\"https://www.cannondale.com/en/bikes/road/race/caad13/caad13-105\" target=\"_blank\"><strong><em>See more from Cannondale here</em></strong></a></p>\n<h3>Frame design</h3>\n<p>Beyond the material used, the new design of the Cannondale CAAD13 105 Disc frame sees truncated aerofoil tubing introduced, for an aerodynamic benefit. This design is claimed to offer ‘the same weight, and equal or better stiffness, as round tubes, but can reduce drag by up to 30%’.</p>\n<p>The redesigned rear triangle, with seatstays projecting towards the rear thru-axle from a starting point a good five inches below the top tube junction, offers a mix of stiffness and comfort which many bikes – yes, even carbon bikes – lack, not to mention clearance for tyres up to at least 30mm in diameter.</p>\n<p>Cleverly hidden away at the forward-facing section of the seat tube’s junction with the toptube is a bolt for an integrated seat binder – an internal wedge which allows adjustment of the D-profile alloy seatpost by a 4mm hex key.</p>\n<h3>Feel for the road</h3>\n<p>Point this 25c-tyred hunk of metal at a rolling road and the legendary smoothness of the Cannondale CAAD13 105 Disc reveals itself. As well as the optimised frame construction, the lengthy portion of exposed seatpost allied to low rear stays provide a restful experience at the back end.</p>\n<p>It’s a stark contrast to the truly performance-focussed aluminium Cervelo S1 I once raced – that felt like it was trying to impregnate me on pitted airfield circuits and was borderline-unrideable on the road.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/buying-guides/4798/the-best-books-about-cycling\">The best books about cycling</a></div>      <div><a href=\"/news/2104/vuelta-a-espana-route-race-reports-tv-guide-and-all-you-need-to-know\">Vuelta a Espana 2021: Route, start list, live TV guide and all we know so far</a></div>      <div><a href=\"/reviews/9281/the-road-book-2020-review\">The Road Book 2020 Review</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 117: on sale now!</a></div>    </div></div><p>\nThe compact, solid rear triangle of the CAAD13 also allows the efficient developement of power, especially rapid injections of it, adding some real vim to this bike. And the stoppers, cliché-packed Shimano 105 hydraulically-actuated disc brakes, haul up the Cannondale CAAD13 105 Disc with zero fuss when you do need to scrub off speed on descents.</p>\n<h3>Mix and match</h3>\n<p>Given its 8.64kg bulk, you might expect the Cannondale CAAD13 105 Disc to falter on climbs, but this weight is mitigated by the responsive nature of the bike. It’s also helped by the (wait for it…) Shimano 105 groupset.</p>\n<p>OK, the chainset is a mix of FSA and Cannondale chainrings and cranks, but the 105 11-30t cassette matched to that 52/36t chainset makes for a suitable climbing machine, with plenty in reserve for hammering down the other side. It’s here where the directness of the frame shines, too, with fast lines held or adjusted with just a nudge of the bars.</p>\n<p>The Vittoria Zaffiro Slick tyres, while not the most grippy or race-ready, boost confidence on hot summer tarmac. For a bike pitched to excel at ‘competition and the open road’, the CAAD13 makes a pretty good fist of it – I’ve ridden up to three hours at a time on it without any major discomfort.</p>\n<h3>Value for money</h3>\n<p>This is where things get a little tricky. For the £2,250 you’ll spend on the Cannondale CAAD13 105 Disc, you can pick up a carbon-framed, Shimano Ultegra-equipped road bike (the Ribble Endurance SL Disc is a good example, costing just £49 more than the CAAD13 – £449 if you opt for Di2!).</p>\n<p><a href=\"https://www.cannondale.com/en/bikes/road/race/caad13/caad13-105\" target=\"_blank\"><strong><em>See more from Cannondale here</em></strong></a></p>\n<p>In other words, for a similar outlay you can get a bike that’s going to be lighter, and with more sophisticated components. Buying an aluminium bike isn’t the lifestyle decision that steel bike ownership represents, but it’s still a lot to ask of people to part with this kind of money for a bike which is (bar the handlebar tape, tyres and tubes) made entirely from metal.</p>\n<p>But, if you’re going to go down that road, you won’t find a more commendable aluminium road bike than this.</p>\n<h3>Spec</h3>\n<table>\n<tbody>\n<tr>\n<td>Frame</td>\n<td>SmartForm C1 Premium alloy frame and BallisTec carbon fork</td>\n</tr>\n<tr>\n<td>Groupset</td>\n<td>Shimano 105</td>\n</tr>\n<tr>\n<td>Brakes</td>\n<td>Shimano 105, hydraulic discs, 160mm rotors</td>\n</tr>\n<tr>\n<td>Chainset</td>\n<td>Cannondale 1 cranks, FSA chainrings, 52-36</td>\n</tr>\n<tr>\n<td>Cassette</td>\n<td>Shimano 105, 11-30</td>\n</tr>\n<tr>\n<td>Bars</td>\n<td>Cannondale 3, 6061 alloy</td>\n</tr>\n<tr>\n<td>Stem</td>\n<td>Cannondale 3, 6061 alloy</td>\n</tr>\n<tr>\n<td>Seatpost</td>\n<td>HollowGram 27 KNØT, alloy, 330mm</td>\n</tr>\n<tr>\n<td>Saddle</td>\n<td>Prologo Nago RS STN</td>\n</tr>\n<tr>\n<td>Wheels</td>\n<td>Cannondale RD 2.0 Disc; Vittoria Zaffiro Pro Slick tyres, 700 x 25c</td>\n</tr>\n<tr>\n<td>Weight</td>\n<td>8.64kg (size 51)</td>\n</tr>\n<tr>\n<td>Contact</td>\n<td><a href=\"http://cannondale.com\">cannondale.com</a></td>\n</tr>\n</tbody>\n</table>\n  </div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"ec5aa6e0a333c83feaffedb15349cd4fb5f6bb274c97b6ace562b8c097d0d9d3","category":"Cycling"}