{"title":"iPhone 15 and iPhone 15 Pro: Complete Weights and Dimensions","link":"https://www.macrumors.com/2023/09/09/iphone-15-weights-and-dimensions/","date":1694276904000,"content":"The iPhone 15 Pro is expected to feature a new midframe made from <a href=\"https://twitter.com/URedditor/status/1683130501626773504\">Grade 5 Titanium</a>, resulting in a substantially lighter device overall. <a href=\"https://www.bloomberg.com/news/articles/2023-09-08/apple-event-2023-iphone-15-pro-max-airpods-watch-series-9-products-to-expect\">Mark Gurman recently said</a> that the iPhone 15 Pro could be up to 10 percent lighter than the iPhone 14 Pro.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/iPhone-15-Pro-Blue-Front-Perspective-Feature.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\n<i>MacRumors</i> has obtained the exact dimensions of the iPhone 15, iPhone 15 Pro, and iPhone 15 Pro Max, and the information appear to corroborate Gurman's claims.\r<br />\n\r<br />\n<b>iPhone 15 dimensions and weight</b>:\r<br />\n<ul>\r<br />\n \t<li><b>Thickness</b>: 7.8mm</li>\r<br />\n \t<li><b>Length</b>: 147.6mm</li>\r<br />\n \t<li><b>Width</b>: 71.6mm</li>\r<br />\n \t<li><b>Weight</b>: 171 grams</li>\r<br />\n</ul>\r<br />\n<b>iPhone 14 dimensions and weight:</b>\r<br />\n<ul>\r<br />\n \t<li><b>Thickness</b>: 7.8mm</li>\r<br />\n \t<li><b>Length: </b>146.7mm</li>\r<br />\n \t<li><b>Width: </b>71.5mm</li>\r<br />\n \t<li><b>Weight:</b> 172 grams</li>\r<br />\n</ul>\r<br />\nThe base model iPhone 15 could be considered the least different of the lineup, with its dimensions and total weight being similar to that of the iPhone 14. The iPhone 15 will maintain the exact same thickness as last year's model, with negligible changes to the length and width of the device. According to our sources, the iPhone 15 is said to continue to use the exact same chassis material as the iPhone 14 -- 6013 T6 Aluminum. With no significant differences in materials and no noteworthy structural changes, it's easy to see why the weight of the standard iPhone 15 is close to that of the iPhone 14.\r<br />\n\r<br />\nWhile the exact dimensions of the iPhone 15 Plus are not apparent at the time of writing, it is safe to assume the size difference between the iPhone 15 Plus and iPhone 14 Plus is minimal at best. As no major design changes, structural changes, or changes in materials are expected, the iPhone 15 Plus will also likely have a weight similar to that of its predecessor.\r<br />\n\r<br />\n<b>iPhone 15 Pro dimensions and weight:</b>\r<br />\n<ul>\r<br />\n \t<li><b>Thickness</b>: 8.25mm</li>\r<br />\n \t<li><b>Length</b>: 146.6mm</li>\r<br />\n \t<li><b>Width</b>: 70.6mm</li>\r<br />\n \t<li><b>Weight</b>: 188 grams</li>\r<br />\n</ul>\r<br />\n<b>iPhone 14 Pro dimensions and weight:</b>\r<br />\n<ul>\r<br />\n \t<li><b>Thickness</b>: 7.85mm</li>\r<br />\n \t<li><b>Length: </b>147.5mm</li>\r<br />\n \t<li><b>Width: </b>71.5mm</li>\r<br />\n \t<li><b>Weight:</b> 206 grams</li>\r<br />\n</ul>\r<br />\nThe iPhone 15 Pro is set to bring improvements in at least one key area -- weight. Compared to its predecessor, the iPhone 15 Pro will be 18 grams lighter due to the change in materials. Our sources were able to verify that Apple is using Grade 5 Titanium for the iPhone 15 Pro, which represents a notable departure from the stainless steel used on every Pro iPhone thus far. Grade 5 Titanium, also known as Ti-6Al-4V, is a titanium alloy used in a variety of industries and is widely known for its excellent corrosion resistance.\r<br />\n\r<br />\nAs far as the dimensions are concerned, the iPhone 15 Pro is expected to maintain a form factor similar to its predecessor, with slight differences in the length and width of the device. One noteworthy difference, though, is the thickness of the device. The iPhone 15 Pro features an increased thickness -- 8.25mm compared to 7.85 on the iPhone 14 Pro. The thickness change could be regarded as an interesting choice, considering the company has previously used reduced thickness as a selling point for certain devices. The reduced bezel size of the iPhone 15 Pro display will likely overshadow the increase in thickness, however.\r<br />\n\r<br />\nThe iPhone 15 Pro is expected to have thinner bezels due to the use of advanced display technology known as LIPO, an acronym for \"low-injection pressure over-molding\". <a href=\"https://www.bloomberg.com/news/newsletters/2023-07-30/apple-iphone-15-pro-features-usb-c-port-new-design-thinner-bezels-lkpemg29\">First mentioned by Bloomberg's Mark Gurman</a>, and since independently confirmed by <i>MacRumor</i>s, the use of LIPO technology for iPhone 15 Pro displays is expected to reduce the bezel size from the current 2.2mm to approximately 1.55mm.\r<br />\n\r<br />\n<b>iPhone 15 Pro Max dimensions and weight:</b>\r<br />\n<ul>\r<br />\n \t<li><b>Thickness</b>: 8.25mm</li>\r<br />\n \t<li><b>Length: </b>159.9mm</li>\r<br />\n \t<li><b>Width: </b>76.7mm</li>\r<br />\n \t<li><b>Weight:</b> 221 grams</li>\r<br />\n</ul>\r<br />\n<b>iPhone 14 Pro Max dimensions and weight</b>:\r<br />\n<ul>\r<br />\n \t<li><b>Thickness</b>: 7.85mm</li>\r<br />\n \t<li><b>Length: </b>160.7mm</li>\r<br />\n \t<li><b>Width: </b>77.6mm</li>\r<br />\n \t<li><b>Weight:</b> 240 grams</li>\r<br />\n</ul>\r<br />\nThe iPhone 15 Pro Max is expected to feature the same changes as the smaller iPhone 15 Pro, weighing 19 grams less than the iPhone 14 Pro Max. Because of this, it's safe to assume that the difference in weight is a result of the change in materials, rather than any sort of significant structural changes or design differences compared to the iPhone 14 Pro Max.\r<br />\n\r<br />\nIt's worth noting that the information presented here is <b>pre-production information</b>, and may not reflect the hardware of mass production units, but it represents our best insight into the dimensions of the iPhone 15 range. According to our sources, the dimensions of the iPhone 15 lineup have remained unchanged throughout development, although slight differences in weight may be possible due to the different hardware configurations Apple tested.\r<br />\n\r<br />\nFor additional information on what to expect with the iPhone 15 series, check out or dedicated rumor roundup pages for the <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> and <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a>.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a>, <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/09/iphone-15-weights-and-dimensions/\">iPhone 15 and iPhone 15 Pro: Complete Weights and Dimensions</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-and-iphone-15-pro-complete-weights-and-dimensions.2400901/\">Discuss this article</a> in our forums<br /><br />","author":"Marko Zivkovic","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ec66e69038df2dee52dc37040f67d054919acd81341065753e2bef61bc2bf78d","category":"Apple"}