{"title":"The Queen’s Gambit","link":"https://markpeak.net/the-queens-gambit/","date":1639297455000,"content":"<p>The Queen’s Gambit เป็นมินิซีรีส์ความยาว 7 ตอนที่ฉายบน Netflix ในปี 2020 โดยดัดแปลงมาจากนิยายชื่อเดียวกันของ Walter Tevis นักเขียนชาวอเมริกันที่ตีพิมพ์ในปี 1983</p>\n<p>เนื้อเรื่องของ The Queen’s Gambit เป็นเรื่องของนักหมากรุกหญิง Elizabeth Harmon ในอเมริกายุค 1960s</p>\n<p>ความสำเร็จของ The Queen’s Gambit ช่วยปลุกให้กระแสนิยมหมากรุกกลับมาใหม่ <a href=\"https://brandinside.asia/the-queens-gambit-make-lack-of-chess-in-market/\">กระดานหมากรุกกลับมาขายดีจนขาดตลาด</a> ส่วนชื่อเรื่องก็มาจาก<a href=\"https://markpeak.net/queens-gambit-vs-kings-gambit/\">ท่าเดินตอนเปิดกระดาน</a></p>\n<p>โดยแกนหลักของเรื่องแล้ว The Queen’s Gambit ตั้งแต่ฉบับนิยาย เป็นการเล่าเรื่อง coming-of-age (เพิ่งรู้ว่ามีศัพท์เรียกเฉพาะเป็นภาษาเยอรมันว่า <a href=\"https://en.wikipedia.org/wiki/Bildungsroman\">Bildungsroman</a>) พูดถึงชีวิตและการเติบโตของนางเอก Beth Harmon ที่เป็นอัจฉริยะแห่งการเล่นหมากรุก</p>\n<p>วิธีเล่าเรื่องเป็นแบบนิยายหรือหนังทั่วไป ที่ใช้<a href=\"https://en.wikipedia.org/wiki/Three-act_structure\">การเล่าเรื่องแบบ 3 องค์</a>คือ เปิดเรื่อง เจออุปสรรค และเอาชนะอุปสรรคได้สำเร็จ</p>\n<p>แต่สิ่งที่ทำให้ The Queen’s Gambit โดดเด่น คือ การใช้เซ็ตติ้งเป็นการแข่งหมากรุก ซึ่งถือว่าค่อนข้างแปลกอยู่แล้ว</p>\n<p>บวกด้วยการให้ตัวเอกเป็นผู้หญิง เลยยิ่งเกิดความคอนทราสต์ระหว่างความโดดเด่นของตัวเอกหญิง ในวงการที่มีแต่ผู้ชาย</p>\n<p>และบวกด้วยปมของนางเอกที่กำพร้าแต่เด็ก โหยหาความรักและการยอมรับจากคนรอบตัว ซึ่งส่งผลต่อความสัมพันธ์ของเธอในอนาคตด้วย ยิ่งทำให้เรื่องมีมิติขึ้นอีกมาก</p>\n<p>ลำพังแค่พล็อตหลักในนิยายก็โดดเด่นมากอยู่แล้ว พอถูกดัดแปลงเป็นซีรีส์ได้ดี องค์ประกอบรายล้อมพร้อมสรรพ ไม่ว่าเป็นการเขียนบทที่คมคาย, การแสดงที่โดดเด่นของ Anya Taylor-Joy, งานโปรดักชั่นระดับสุดยอด ฉากและเสื้อผ้าหน้าผม, การถ่ายทำและตัดต่อ ไปจนถึงดนตรีประกอบ</p>\n<p>ย่อมทำให้ The Queen’s Gambit เป็นซีรีส์ที่สมบูรณ์มากๆ ที่สุดเรื่องหนึ่งเท่าที่เคยดูทีเดียว</p>\n<p>ดูจบแล้วผมถึงขั้นต้องไปหาเบื้องหลังมาอ่าน-มาดูเลยว่า ฉากของเรื่องนี้อลังการมาก เนรมิตโลกยุคปี 60s ขึ้นมาได้อย่างไร</p>\n<p></p>\n<p>คำตอบแบบสั้นๆ คือ ฉากอลังการส่วนใหญ่ในเรื่อง ไม่ว่าจะเป็นลาสเวกัส ปารีส มอสโก เม็กซิโกซิตี้ ยุค 60s ล้วนถ่ายทำในเบอร์ลิน และบางส่วนถ่ายในแคนาดา (<a href=\"https://www.atlasofwonders.com/2020/10/where-was-the-queens-gambit-filmed.html\">บทความพร้อมภาพเปรียบเทียบของจริง-ในหนัง</a>) ส่วนหัวหน้าทีมโปรดักชันดีไซน์คือ Uli Banisch ชาวเยอรมัน ก็มี<a href=\"https://ulihanisch.net/projects.html\">ผลงานในหนังดังหลายเรื่อง</a> (<a href=\"https://www.imdb.com/name/nm0359914/\">IMDb</a>)</p>\n<p>ในเรื่องของรายละเอียดการเดินหมากรุก ถึงแม้ในหนังไม่ได้โฟกัสให้เราเห็นแทคติกบนกระดานมากนัก แต่ในฉบับนิยาย ผู้เขียน Walter Tevis ก็ปรึกษากับเซียนหมากรุก <a href=\"https://en.wikipedia.org/wiki/Bruce_Pandolfini\">Bruce Pandolfini</a> (ซึ่งเป็นคนตั้งชื่อเรื่อง The Queen’s Gambit ด้วย) และอีก 37 ปีต่อมา Pandolfini ก็มาเป็นที่ปรึกษาเรื่องหมากรุกให้ฉบับซีรีส์ด้วย</p>\n<p>นอกจาก Pandolfini แล้ว อดีตแชมป์โลกชาวรัสเซีย Garry Kasparov (คนที่แพ้ให้กับคอมพิวเตอร์ Deep Blue ของ IBM) ก็มาเป็นที่ปรึกษาให้ด้วยเช่นกัน และ <a href=\"https://www.insider.com/interesting-things-about-the-queens-gambit-fun-facts\">Kasparov ช่วยอัพเกรดระดับของการเดินหมากในเรื่องให้ด้วย</a> (พลังของการมีเงินบวกมีกึ๋นพร้อมกันนี่มันช่างยิ่งใหญ่เสียจริง)</p>\n<p>ที่ไม่ชมไม่ได้คือ การแสดงของนางเอกคือ Anya Taylor-Joy ที่เล่นได้ทุกบท แถมเป็นบทยากๆ ทั้งความโดดเดี่ยวเปลี่ยวเหงา พ่ายแพ้สูญเสีย จมดิ่งติดเหล้าและยา ไปจนถึงสวยเริ่ดเชิดหยิ่ง ประมือกับผู้ชายทั้งโลก (หมากรุก) ได้แบบไม่เป็นรอง</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/12/queens-gambit.jpg\" /></p>\n<p>เกร็ดอื่นๆ</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Allan_Scott_(Scottish_screenwriter)\">Allan Scott</a> นักเขียนบทชาวสกอตแลนด์ อยากทำเรื่องนี้เป็นหนังมานาน ซื้อไลเซนส์มาตั้งแต่ปี 1992 และเคยเกือบทำสำเร็จในปี 2007 โดยจะให้นักแสดง Heath Ledger มากำกับ แต่ Ledger ตายก่อน เลยมาทำเสร็จในปี 2020 (ปัจจุบัน Scott อายุ 82 แล้ว)</li>\n<li>ในนิยายมีจุดต่างจากฉบับซีรีส์อยู่บ้าง หลักๆ คือแม่ของ Beth ไม่ได้ฆ่าตัวตาย, Beth ไม่ได้เมาตอนไปแข่งกับ Borgov ที่ปารีส (สู้สุดฝีมือแล้วก็ยังแพ้), Townes มีบทน้อยกว่าในซีรีส์มาก</li>\n<li>ตอนแรกรู้สึกว่าคนแสดงเป็น Benny Watts แชมป์หมากรุกของอเมริกา หน้าตาคุ้นมาก จนกระทั่งไปเปิดประวัติดูว่า Thomas Brodie-Sangster คือคนที่แสดงเป็นเด็กผู้ชายใน Love Actually ที่ขโมยซีน</li>\n<li>ส่วน Harry Melling ผู้แสดงเป็น Harry Beltik แชมป์หมากรุกของรัฐเคนตักกี คือ Dudley Dursley ใน Harry Potter</li>\n<li>คนที่แสดงเป็น Vasily Borgov แชมป์โลกหมากรุกชาวรัสเซีย คือ <a href=\"https://en.wikipedia.org/wiki/Marcin_Doroci%C5%84ski\">Marcin Dorociński</a> นักแสดงชาวโปแลนด์ ซึ่งส่วนใหญ่ก็แสดงแต่หนังของโปแลนด์</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Lexington_Herald-Leader\">Lexington Herald-Leader</a> หนังสือพิมพ์ที่ Townes ทำงานให้ มีตัวตนอยู่จริงๆ และเป็นหนังสือพิมพ์ของเมือง Lexington ใน Kentucky จริงๆ (Tevis ผู้เขียนนิยาย เป็นชาวเมือง Lexington)</li>\n<li>ชื่อตอนทั้ง 7 ตอน ล้วนแต่เป็นศัพท์ของวงการหมากรุกทั้งนั้น\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Chess_opening\">Openings</a> – ท่าเดินเปิดเกม</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Exchange_(chess)\">Exchanges</a> – การแลกหมากกัน ต่างฝ่ายต่างกินหมากฝ่ายตรงข้าม</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Doubled_pawns\">Doubled Pawns</a> – เบี้ยสีเดียวกัน มาอยู่ในแถวเดียวกัน (หมายถึงความติดขัด)</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Chess_middlegame\">Middle Game</a> – วิธีการเดินช่วงกลางเกม</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Fork_(chess)\">Fork</a> – การเดินหมาก 1 ตัว แล้วจู่โจมฝ่ายตรงข้ามพร้อมกัน 2 ตา</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Adjournment_(games)\">Adjournment</a> – การพักแข่งชั่วคราวแล้วไปแข่งต่อวันถัดไป</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Chess_endgame\">End Game</a> – ท่าเดินไล่กันตอนท้ายเกม</li>\n</ul>\n</li>\n</ul>The post <a href=\"https://markpeak.net/the-queens-gambit/\">The Queen’s Gambit</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"ec6a6bbf523c1d5eb7211f2d4b763788a7177db069379c6232e3c8c8f70dbfb9","category":"Thai"}