{"title":"โต้ทุกประเด็น Mark Zuckerberg ชี้ Facebook ไม่ได้หน้าเงิน สนใจกำไรมากกว่าความปลอดภัย","link":"https://www.blognone.com/node/125130","date":1633492953000,"content":"<div><div><div><p>Mark Zuckerberg โพสต์ข้อความตอบโต้ <a href=\"https://www.blognone.com/node/125084\">Frances Haugen อดีตผู้จัดการผลิตภัณฑ์ของ Facebook ที่ออกมาแฉบริษัทว่าสนใจกำไรมากกว่าแก้ปัญหาความเกลียดชัง-ความปลอดภัย</a></p>\n<p>Zuckerberg บอกว่าบริษัทสนใจประเด็นเรื่องความปลอดภัย สุขภาพจิต ความเป็นอยู่ของผู้ใช้อย่างมาก (เขาใช้คำว่า care deeply) และผิดหวังที่เห็นสื่อมองข้ามความพยายามของ Facebook ในการแก้ปัญหาเหล่านี้</p>\n<p>เขาตอบโต้คำกล่าวหาต่างๆ ว่าไม่เป็นความจริง บริษัทไม่ได้มีเจตนาปิดบังผลการวิจัยต่อสาธารณะ เพราะถ้าบริษัทอยากปิดบังเรื่องนี้จริงๆ คงไม่จ้างทำวิจัยตั้งแต่แรก และถ้าบริษัทไม่สนใจเรื่องเนื้อหาที่เป็นภัย ก็คงไม่จ้างคนจำนวนมากกว่าบริษัทโซเชียลอื่นๆ มาคอยตรวจสอบเนื้อหาเหล่านี้</p>\n<p>ส่วนประเด็นหลักว่า Facebook สนใจกำไรมากกว่าความปลอดภัยก็ไม่จริงอย่างสิ้นเชิง เขาระบุว่า<a href=\"https://www.blognone.com/node/99008\">การเปลี่ยนอัลกอริทึมในปี 2018</a> (มีชื่อเรียกว่า Meaningful Social Interactions) ช่วยลดการมองเห็นวิดีโอไวรัลลง เห็นเนื้อหาจากเพื่อนและครอบครัวเพิ่มขึ้น บริษัททราบดีว่าการปรับอัลกอริทึมจะทำให้คนใช้เวลาบน Facebook น้อยลง ส่งผลกระทบต่อรายได้ แต่ก็ยังตัดสินใจเดินหน้าเพราะเชื่อว่าเป็นสิ่งที่ถูกต้อง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/50e531f15da0fd9823db87aab0e5c521.jpg\" /></p>\n<p>เขายังบอกด้วยว่าโมเดลธุรกิจของ Facebook คือโฆษณา และผู้ลงโฆษณาย่อมไม่ต้องการให้โฆษณาของตัวเองแสดงอยู่ใกล้ๆ กับเนื้อหาที่เป็นภัยอยู่แล้ว จึงไม่มีเหตุผลเลยที่ Facebook จะอยากให้มีเนื้อหาที่เป็นภัยอยู่บนแพลตฟอร์มต่อไป เขาบอกว่าเขาเองก็มีลูก เขาย่อมไม่ต้องการให้ลูกของตัวเองอยู่ในโลกออนไลน์ที่ไม่ปลอดภัยอยู่แล้ว</p>\n<p>Zuckerberg บอกว่าการตีความงานวิจัยภายใน (ที่ Haugen ปล่อยหลุดออกมา) ว่า Instagram มีผลเสียต่อเด็กและวัยรุ่นเป็นเรื่องที่รับไม่ได้ เพราะจริงๆ แล้วงานวิจัยชิ้นนี้ชี้ให้เห็นว่า วัยรุ่นใช้ Instagram เป็นที่พักใจเมื่อเผชิญกับปัญหาในชีวิตจริงๆ ต่างหาก เขาโต้แย้งว่าปัญหาเรื่องผลกระทบต่อเด็กและวัยรุ่นไม่ใช่หน้าที่ของบริษัทโซเชียลรายใด แต่เป็นหน้าที่ของสังคมต้องมาตัดสินใจร่วมกันว่า เด็กอายุแค่ไหนถึงสมควรใช้อินเทอร์เน็ตมากกว่า</p>\n<p>ที่มา - <a href=\"https://www.facebook.com/zuck/posts/10113961365418581\">Mark Zuckerberg</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/mark-zuckerberg\">Mark Zuckerberg</a></div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/hate-speech\">Hate Speech</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ec74539f44eacc2399449379ebaaa45c90c175e54197b2af2f595837bdee6834","category":"Thai"}