{"title":"54 Development of an equine metabolism model to describe post-absorptive nutrient dynamics","link":"https://academic.oup.com/jas/article/102/Supplement_3/213/7757080?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Nutrition modelling is instrumental to modern feed formulation and diet optimization across livestock sectors. Mechanistic models of nutrient digestion, absorption, and metabolism are implemented in industry as ‘decision support systems’, and in academia to summarize and examine our cumulative biological knowledge, identify knowledge gaps and test/evaluate hypotheses. However, comparatively less progress in this field has been made in the equine sector. This limits the ability of the equine sector to address complex challenges such as interactions between equine nutrition, management, health, and welfare. To address this gap, a first iteration of a dynamic, deterministic, mechanistic model describing postabsorptive nutrient dynamics for equines has been developed. Model coding and development was performed using Python with specific libraries for mathematical equations and integration. This model was developed primarily based on extant published mechanistic models of protein and energy metabolism in other species. The present model simulates the partitioning of ingested nutrients into digested nutrients, through intermediary metabolism and ultimately to growth and deposition of protein, fat, water, and ash into the body compartments. As shown in Figure 1, the model takes digested nutrients (protein, fat, starch, glucose, volatile fatty acids) as inputs and contains 12 state variables divided into metabolite pools (amino acids, fatty acids, glucose, glycogen, acetyl-CoA, ATP), and body constituent pools (muscle protein, bone protein, hide protein, viscera protein, body fat, body ash). Ingested feed is partitioned into digested nutrients using digestibility coefficients from extant equine literature, and indigestible nutrients are excreted. Meta-analysis was used to develop empirical equations to predict VFA concentrations in the hindgut. VFA absorption is estimated using Michaelis-Menten kinetics including the pH and hindgut volume, assumed as a constant value for a mature horse Acetyl-CoA, a key intermediary metabolism pool, is produced from amino acid, glucose, and fatty acid catabolism and is consumed for maintenance requirements, which is accounted for in an ATP pool. The ATP pool is a ‘zero pool’, which balances the ATP producing and -consuming reactions in the model, with any remaining ATP balance required being pulled from the acetyl-CoA pool. Turnover of protein and fat is represented by differences in accretion and catabolism. Work is ongoing to evaluate the developed model for model performance using data extracted from the literature. The model will be trained and subsequently evaluated using equine studies in three main areas: growth and body composition, protein turnover and nitrogen balance, and energy metabolism. Developing this model for the equine sector will stimulate and assist in defining future research priorities, inform revisions to the nutrient requirements of horses, increase understanding of metabolic processes as well as related disorders, reduce waste via increased focus on precision feeding and support the development of new products and services to improve equine health.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ec783791d38bf37a7fd9dfea13965422785263afd499cc132f66ef7016ccc3c2","category":"Environment"}