{"title":"The Apple Watch Ultra’s next-gen microLED screen might not launch until 2026","link":"https://www.macworld.com/article/1982361/microled-apple-watch-ultra-manufacturing-problems.html","date":1688649174000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s plan to launch a new Apple Watch Ultra model with a microLED display has taken another knock. It’s been reported this week that the device has hit manufacturing problems and is now unlikely to launch until 2026.</p>\n\n\n\n<p>This isn’t the first setback to afflict the microLED Ultra. When it was first rumored (as recently as <a href=\"https://www.macworld.com/article/1469935/apple-watch-switch-superior-microled-display.html\">January</a>), pundits predicted that the device would appear at the end of 2024. But by April (based on a subscribers-only tweet from reliable displays expert <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/DSCCRoss/status/1651626420593106944&amp;xcust=1-1-1982361-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Ross Young</a>) this had been pushed back to 2025.</p>\n\n\n\n<p>Now research company TrendForce (via Korean-language site <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.thelec.kr/news/articleView.html?idxno=21875&amp;xcust=1-1-1982361-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">The Elec</a>) says it won’t be here until the first quarter of 2026 at the earliest. In other words, within the space of six months, the expected launch has moved back by around 15.</p>\n\n\n\n<p>TrendForce cites manufacturing problems for the more cautious estimate. Apple has yet to find a way to bring down manufacturing costs for mass production, despite having already invested more than $1 billion in this field. The Apple Watch Ultra would be the first Apple device to use a microLED display. The 14-inch and 16-inch MacBook Pros and 12.9-inch iPad use mini-LED tech and the upcoming Vision Pro has higher-end micro-OLED displays.</p>\n\n\n\n<p>This doesn’t mean we will be waiting until 2026 for the second-generation Apple Watch Ultra. At one stage it was believed that microLED would be part of the package when Apple launched the second-gen version of the Ultra, back when that device was expected to follow the same biennial upgrade cadence as the Apple Watch SE. But just as microLED has been pushed back, the second Ultra has <a href=\"https://www.macworld.com/article/1967628/new-apple-watch-ultra-fall-2023.html\">somehow come closer</a>. It now seems certain that the second Ultra will arrive long before microLED does–perhaps as soon as this fall–and that this major screen upgrade will appear in the third- or even fourth-gen model.</p>\n\n\n\n<p>All current Apple Watch models are based on OLED screens. Switching to <a href=\"https://www.macworld.com/article/1471788/microled-oled-touchscreen-rumors.html\">microLED</a> brings numerous advantages: the panels are thinner, brighter, and more power-efficient, and have faster response times. But they present technical difficulties, as we are seeing.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ec79df5a0bb842e9b7de6cd502ccf7d78fd5947230851f0963175edd914d48e7","category":"Apple"}