{"title":"Use of tobacco during COVID-19: A qualitative study among medically underserved individuals","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308966","date":1724076000000,"content":"<p>by Tamar Klaiman, Nsenga Farrell, Dorothy Sheu, Aerielle Belk, Jasmine Silvestri, Jannie Kim, Ryan Coffman, Joanna Hart</p>\r\n\r\nThe COVID-19 pandemic produced stress for people around the world. The perception that tobacco can be a coping tool for stress relief suggests that the conditions during the COVID-19 pandemic can provide insight into the relationship between stress and tobacco use patterns, particularly among those most at risk for severe COVID-19 disease. The goal was to identify the impacts of the COVID-19 pandemic on tobacco use and preparedness for smoking cessation among individuals who smoke and are older and medically underserved. We conducted in-depth interviews with 39 patients to learn about individuals’ smoking behavior during the COVID-19 pandemic. We used a modified grounded theory approach to code and analyze all qualitative data. We conducted thematic analysis to identify key factors associated with smoking behaviors during COVID-19. Our results indicated that increases in perceived stress and social isolation may have been associated with increased tobacco use during the COVID-19 pandemic. Pandemic-related social isolation contributed to increases in smoking, despite respondents being concerned about the severity of COVID-19. While many respondents felt that smoking relieved their stress from the pandemic, they appeared unaware of the stress-inducing properties of tobacco use. Our findings indicate that pandemic-related stress impacted smoking behavior among older, medically underserved smokers. Results may assist clinicians in addressing the role of tobacco use in response to highly stressful events. Smoking cessation strategies should consider the implications of stress on smoking behavior, including smoking relapse in response to highly stressful events–particularly for medically underserved populations.","author":"Tamar Klaiman","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ec81db3d304f4fc31da56bcc142653146038c4ff026e78db655e2aa8067a703e","category":"Interdisciplinary"}