{"title":"155 Standardized ileal digestibility of amino acids in soybean meal, fermented soybean meal, and soy protein concentrate fed to nursery pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/96/7664857?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Accurate information of amino acid (AA) digestibility in protein supplements is critical in formulating diets for nursery pigs. Soybean products are widely used in nursery pig diets due to the high crude protein (CP) concentrations. The objective of the present study was to determine the standardized ileal digestibility (SID) of AA in soybean meal, 3 sources of fermented SBM (FSBM), and soy protein concentrate (SPC) fed to nursery pigs. Ten barrows with an initial body weight of 10.5 kg (standard deviation = 0.9) were surgically fitted with T-cannulas at the distal ileum. The animals were assigned to a replicated 5 × 5 Latin square design with 10 animals, 5 experimental diets, and 5 periods to obtain 10 observations per diet. Five diets were prepared to contain SBM (48.5% CP), 3 sources of FSBM (A, B, and C; 52.6% CP, 55.1% CP, and 49.8% CP, respectively), or SPC (58.4% CP) as the sole source of AA. Each period consisted of 4 d of adaptation period and 3 d of ileal digesta collection period. The values of basal endogenous losses of AA reported in the literature were used to calculate the SID of AA by correcting the apparent ileal digestibility (AID) values. Additionally, a 2-step in vitro procedure modified for nursery pigs was conducted to determine the in vitro ileal disappearance of CP in the 5 ingredients. The AID of all indispensable AA except His and Lys in FSBM-A and FSBM-B was greater (<span>P</span> &lt; 0.05) than that in SBM, whereas AID values for all AA except Trp in SPC did not differ from the values in SBM. The SID of Leu and Trp in FSBM-A and FSBM-B was greater (<span>P</span> &lt; 0.05) than that in SBM or SPC. The SID of all AA in SPC was not different from that in SBM. In vitro ileal disappearance of CP in 3 sources of FSBM was greater (<span>P</span> &lt; 0.001) than that in SBM or SPC. In conclusion, in vitro ileal disappearance of protein was greater in fermented soybean meal compared with soybean meal or soy protein concentrate whereas the standardized ileal digestibility of most amino acids was comparable among the soybean-derived ingredients.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ec888c4f717315d39a96df329c66c70f53f025903056e24b911a85c68489ebd2","category":"Environment"}