{"title":"Announcing CDK for Terraform 0.7","link":"https://www.hashicorp.com/blog/announcing-cdk-for-terraform-0-7","date":1635350400000,"content":"<p>We are excited to announce the release of Cloud Development Kit for Terraform (CDKTF) 0.7. With <a href=\"https://github.com/hashicorp/terraform-cdk\">CDK for Terraform</a>, you can write Terraform configurations in your choice of C#, Python, TypeScript, or Java (with experimental support for Go), and still benefit from the full ecosystem of Terraform providers and modules.</p>\n<p>Key improvements in CDK for Terraform 0.7 include:</p>\n<ul>\n<li><strong>AWS CDK compatibility</strong>: A new experimental adapter lets you use resources from the <a href=\"https://aws.amazon.com/cdk/\">AWS Cloud Development Kit</a> construct library in your CDKTF application.</li>\n<li><strong>Simplified provider API</strong>: The interface with the provider API has been updated to make the returned resources easier to access and work with.</li>\n<li><strong>Improved documentation</strong>: Product documentation has been updated and moved from GitHub to <a href=\"https://www.terraform.io/docs/cdktf/index.html\">Terraform.io</a>.</li>\n</ul>\n<h2><a href=\"#aws-cdk-construct-compatibility-tech-preview\">»</a><a></a>AWS CDK Construct Compatibility (Tech Preview)</h2>\n<p>You can now leverage resources from both the Terraform and AWS CDK ecosystems in your CDK for Terraform applications. The new experimental <code>AwsTerraformAdapter</code> allows you to deploy <a href=\"https://docs.aws.amazon.com/cdk/api/v2/docs/aws-construct-library.html\">AWS CDK (v2) constructs</a> in your CDKTF application to provision resources using Terraform. <a href=\"https://docs.aws.amazon.com/cdk/latest/guide/constructs.html\">Constructs</a> are the building blocks of CDK applications; by adding in compatibility with the AWS CDK construct ecosystem, engineers deploying resources on AWS should enjoy a faster and more efficient development process.</p>\n<p>Check out the three-minute video below for a demo of how to use the new AWS Terraform adapter in a CDKTF TypeScript application.</p><p>The <code>AwsTerraformAdapter</code> is in technical preview and is not ready for production usage. Please share your experiences trying out this new feature by posting to the <a href=\"http://discuss.hashicorp.com/c/terraform-core/cdk-for-terraform\">CDK for Terraform Discuss forum</a>. For more information, please refer to the <a href=\"https://www.terraform.io/docs/cdktf/create-and-deploy/aws-adapter.html\">documentation</a>.</p>\n<h2><a href=\"#improvements-to-the-provider-api\">»</a><a></a>Improvements to the Provider API</h2>\n<p>When you run <code>cdktf get</code>, the provider API downloads the providers and modules that were defined in your application and generates CDK constructs for them. In 0.7, the interface with this API has been updated to make the constructs that are returned easier to access and work with. Previously, the API translated any block to an array of a certain type, both in configuration and as properties on the resource/data source instances. For blocks that appear only once, this made the API harder to use, and resulted in a lot of extra nesting.</p>\n<p>Starting with 0.7, these blocks will return just the type, instead of an array of a certain type. This change makes the returned resources easier to work with. For example, in the TypeScript code snippet below, the object properties that are returned from the new API can be accessed directly, rather than within an array:</p><pre><code>// Before\nconst development = new Namespace(this, \"development\", {\n  metadata: [\n    {\n      name: \"development\",\n    },\n  ],\n});\nconst deploy = new Deployment(this, \"nginx\", {\n  metadata: [\n    {\n      namespace: \"setViaOverride\",\n      name: \"nginx\",\n    },\n  ],\n  //   ...\n});\ndeploy.addOverride(\n  \"metadata.0.namespace\",\n  `\\${${development.fqn}.metadata.0.name}`\n);\n\n// After\nconst development = new Namespace(this, \"development\", {\n  metadata: {\n    name: \"development\",\n  },\n});\nnew Deployment(this, \"nginx\", {\n  metadata: {\n    namespace: development.metadata.namespace,\n    name: \"nginx\",\n  },\n  //   ...\n});</code></pre><p>For information on how to migrate to the new version of this API, please see <a href=\"https://github.com/hashicorp/terraform-cdk/blob/main/docs/upgrade-guide/upgrading-to-0.7.md\">the upgrade guide</a>.</p>\n<h2><a href=\"#other-improvements\">»</a><a></a>Other Improvements</h2>\n<p>Product documentation for CDK for Terraform has been updated and moved from the GitHub repo to <a href=\"https://www.terraform.io/\">Terraform.io</a>. On the new docs site, you can filter for specific reference topics and read more about the architecture and conceptual framework of CDKTF. You can start reading the CDKTF documentation on the introductory <a href=\"https://www.terraform.io/docs/cdktf/index.html\">What is CDK for Terraform?</a> page.</p>\n<p>The <a href=\"https://github.com/hashicorp/terraform-cdk/blob/main/CHANGELOG.md\">CDK for Terraform changelog</a> contains a comprehensive list of additional enhancements and bug fixes. Please note that CDK for Terraform 0.7 contains breaking changes that will require code updates for namespacing AWS provider resources, as well as the provider API updates described above. Please see the <a href=\"https://github.com/hashicorp/terraform-cdk/blob/main/CHANGELOG.md\">CHANGELOG</a> and<a href=\"https://github.com/hashicorp/terraform-cdk/blob/main/docs/upgrade-guide/upgrading-to-0.7.md\"> 0.7 Upgrade Guide</a> for details.</p>\n<h2><a href=\"#try-cdk-for-terraform\">»</a><a></a>Try CDK for Terraform</h2>\n<p>If you’re new to the project, the tutorials for <a href=\"https://learn.hashicorp.com/tutorials/terraform/cdktf\">CDK for Terraform on HashiCorp Learn</a> are the best way to get started, or you can dive deeper into our <a href=\"https://www.terraform.io/docs/cdktf/index.html\">documentation</a>.</p>\n<p>Whether you’re experimenting or actively using CDK for Terraform, we’d love to hear from you. Please <a href=\"https://github.com/hashicorp/terraform-cdk/issues/new?assignees=&amp;labels=bug%2C+new&amp;template=bug-report.md&amp;title=\">file any bugs you encounter</a>, let us know about your <a href=\"https://github.com/hashicorp/terraform-cdk/issues/new?assignees=&amp;labels=enhancement%2C+new&amp;template=feature-request.md&amp;title=\">feature requests</a>, and share other questions, thoughts, and experiences in the <a href=\"https://discuss.hashicorp.com/c/terraform-core/cdk-for-terraform/47\">CDK for Terraform discussion forum</a>.</p>","author":"Sarah MacDonald","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"ec8b570a4cb6d5771e8d9465a9c3d842180d32e516609f10f2a160cd0a59c6d4","category":"Tech"}