{"title":"Garlic oil improves small intestinal motility in experimentally induced type II diabetes mellitus in female Wistar rats","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301621","date":1713362400000,"content":"<p>by Nermine K. M. Saleh, Abd El-Hamid A. Mohamed, Manal H. Moussa, Yasmin Assal, Noha N. Lasheen</p>\r\n\r\nDiabetes mellitus adversely affects the contractile ability of the small intestine. However, there is a paucity of studies investigating the impact of garlic oil on small intestinal motility. This study aimed to evaluate the potential beneficial effects of garlic oil on type 2 diabetes mellitus in rats. Thirty-six adult female Wistar rats (n = 36) were divided into four groups: control, non-diabetic rats supplemented with garlic oil, diabetic rats, and diabetic rats treated with garlic oil. The rats were anesthetized using pentobarbitone (40 mg/kg BW); various motility parameters and oxidative markers were determined in small intestinal segments. Measurements were taken for naso-anal length, waist circumference, fasting blood glucose level (FBG), and plasma insulin level. Compared to the control group, the diabetic rats exhibited a reduction in the average force of contraction and motility index in all small intestinal segments. Furthermore, the rats exhibited a reduction in the average duration of muscle contraction only in the jejunum. The rats also exhibited hyperglycemia, insulin resistance, significant oxidative stress, and obesity. This was proven by changes in motility parameters, fasting blood glucose levels, HOMA-IR values, intestinal MDA levels, and waist circumference. The non-diabetic rats supplemented with garlic oil also exhibited a decrease in the average force of contraction and motility index in all small intestinal segments, despite having consistently higher Lee index and waist circumference values. However, the diabetic rats treated with garlic oil demonstrated improved small intestinal motility in nearly all small intestinal segments and a reduction in oxidative stress. In conclusion, rats with diabetes mellitus experienced a decrease in small intestinal motility, which is primarily driven by oxidative stress. Normal rats administered with garlic oil supplements exhibited similar effects. In contrast, garlic oil treatment in diabetic rats led to enhanced small intestinal motility and a notable anti-hyperglycemic effect, which can be attributed to the potent antioxidant properties of garlic oil.","author":"Nermine K. M. Saleh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ec959070bb7b0af49518e7c0ff6082755f4e92b52542a03464b8d61443208f57","category":"Interdisciplinary"}