{"title":"Socioeconomic inequalities in adverse pregnancy outcomes in India: 2004–2019","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003701","date":1726668000000,"content":"<p>by Caroline M. Joyce, Deepti Sharma, Arnab Mukherji, Arijit Nandi</p>\r\n\r\nAlthough India has made substantial improvements in public health, it accounted for one-fifth of global maternal and neonatal deaths in 2015. Stillbirth, abortion, and miscarriage contribute to maternal and infant morbidity and mortality. There are known socioeconomic inequalities in adverse pregnancy outcomes. This study estimated changes in socioeconomic inequalities in rates of stillbirth, abortion, and miscarriage in India across 15 years. We combined data from three nationally representative health surveys. Absolute inequalities were estimated using the slope index of inequality and risk differences, and relative inequalities were estimated using the relative index of inequalities and risk ratios. We used household wealth, maternal education, and Scheduled Caste and Scheduled Tribe membership as socioeconomic indicators. We observed persistent socioeconomic inequalities in abortion and stillbirth from rates of 2004–2019. Women at the top of the wealth distribution reported between 2 and 5 fewer stillbirths per 1,000 pregnancies over the study time period compared to women at the bottom of the wealth distribution. Women who completed primary school, and those at the top of the household wealth distribution, had, over the study period, 5 and 20 additional abortions per 1,000 pregnancies respectively compared to women who did not complete primary school and those at the bottom of the wealth distribution. Women belonging to a Scheduled Caste or Scheduled Tribe had 5 fewer abortions per 1,000 pregnancies compared to other women, although these inequalities diminished by the end of the study period. There was less consistent evidence for socioeconomic inequalities in miscarriage, which increased for all groups over the study period. Despite targeted investments by the Government of India to improve access to health services for socioeconomically disadvantaged groups, disparities in pregnancy outcomes persist.","author":"Caroline M. Joyce","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"ec977b9f18fc11a2d49468058098af49b89e054199519eb726a19dc3e3b2ca5b","category":"Environment"}