{"title":"Restoring landscape burning is compatible with conservation and livestock production in a southeast Australian grassland fragment","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12355?af=R","date":1718591010000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/6d4de572-1a80-4eea-9b31-0707d70a3f6c/eso312355-toc-0001-m.png\" alt=\"Restoring landscape burning is compatible with conservation and livestock production in a southeast Australian grassland fragment\" />\n<p>Conserving and restoring southeast Australia's degraded remnant lowland grasslands is a priority, but many are used for sheep grazing and rarely burnt, despite being shaped by Indigenous fire-use. We returned fire to a degraded grassland fragment in the Tasmanian midlands that is used for sheep grazing, and assessed how this influenced; (i) sheep and wild herbivore activity; (ii) vegetation biomass and (iii) broad vegetation composition. The results suggest grazing is an important control on exotic grasses in degraded grassland fragments, and that restoring fire can be compatible with livestock production and conservation goals.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nLowland grassland fragments in southeast Australia are valued for both sheep grazing and conservation. Many fragments are now rarely burnt, despite being shaped by millennia of Aboriginal fire-use. Restoring fire could potentially reduce fuels, control exotic plant species, promote native species and renew Aboriginal cultural burning. However, this requires understanding of how fire and large herbivores, both native and exotic, are coupled and influence vegetation.\n\nWe implemented a single round of low-intensity experimental burns in an area of remnant grassland and patchy eucalypt woodlands in Tasmania that is managed for conservation, albeit intermittently grazed by sheep, as well as by native and exotic wild herbivores. We compared herbivore activity between burnt and unburnt areas over 2 years using cameras and scat transects, and assessed how fire and herbivory influenced herbaceous biomass and the cover of broad vegetation classes with and without herbivore exclusion.\n\nContrary to expectations, burnt areas did not disproportionately attract the main herbivores: domestic sheep, introduced deer and native wallabies. In the predominant grassy sward, grazing and fire both reduced herbaceous biomass but we found no support for our hypothesis that grazing reduces biomass more strongly after burning. This contrasts with isolated patches of <i>Poa</i> tussock grassland, where fire reduced biomass much more strongly than grazing, and grazing effects on biomass were more pronounced following burning. The cover of broad vegetation classes was little affected by burning, but excluding herbivores increased exotic grass cover in both burnt and unburnt plots.\n\n<i>Practical implication</i>. In degraded fragments of lowland native grassland, burning and grazing do not necessarily act as strongly synergistic disturbances. Grazing by sheep and wild herbivores can help to control exotic grasses and reduce herbaceous biomass, although burning is much more effective than grazing for reducing biomass of unpalatable <i>Poa</i> tussock grassland. Our results suggest that returning occasional low-intensity fires to our study system, and other degraded grassland-woodland fragments, can be compatible with livestock production and conservation goals, but this requires caution and adaptive management.\n</p>","author":"Ben J. French, \nLynda D. Prior, \nChristopher N. Johnson, \nSteven W. J. Leonard, \nDavid M. J. S. Bowman","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"ec9703f1fb8fe7d729cf0984e329217d8de47d0ff36da7258dccad2644db3987","category":"Environment"}