{"title":"Surgical modeling of Chiari-like malformation in rats: Insights from canine morphology","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310505","date":1726754400000,"content":"<p>by Jae-Hwan Jung, Chang-Hyeon Cho, Sang-Yoon Shin, Eun-Ji Chung, Da-Eun Seo, Woo-Suk Kim, Hun-Young Yoon</p>\r\nBackground <p>Chiari-like malformation in dogs and Chiari malformation type 1 in humans are conditions characterized by a relatively small caudal cranial fossa, leading to cerebellar herniation. This study aimed to develop a rat model of Chiari-like malformation using surgical techniques based on morphological characteristics observed in dogs.</p> Methods <p>Endocranial magnetic resonance images of both normal dogs and dogs diagnosed with Chiari-like malformation were retrospectively analyzed. Measurements of the caudal cranial fossa volume, rostral and medial fossa volume, and volume index were taken. The differences in caudal cranial fossa volume and volume index between normal dogs and those diagnosed with Chiari-like malformation were then utilized to create a rat model of Chiari-like malformation through surgical intervention. The measurements were conducted on both the rat Chiari-like malformation models and normal rats, with each measurement taken twice and the mean values calculated.</p> Results <p>Significant differences were found between normal dogs and dogs diagnosed with Chiari-like malformation in terms of the volume of the caudal cranial fossa (27.62% reduction) and the volume index (23.36% reduction) (p&lt;0.05). These differences were used to develop a rat model, which also showed significant reductions in both caudal cranial fossa volume (29.52%) and volume index (28.30%) compared to normal rats (p&lt;0.05). The condition in the rat model was confirmed through magnetic resonance imaging, which revealed cerebellar herniation into the foramen magnum.</p> Conclusions <p>The study successfully established a rat model of Chiari-like malformation that accurately reproduces the morphological features observed in dogs. This model potentially serves as a valuable tool for investigating the pathological mechanisms and potential therapeutic approaches for Chiari-like malformation in veterinary medicine.</p>","author":"Jae-Hwan Jung","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ec9c60de4294b0e72e739aa7796f622b928d465654faa85c85818c71a343de9c","category":"Interdisciplinary"}