{"title":"Microsoft Wants to Launch Xbox Games Store on iPhone","link":"https://www.macrumors.com/2023/03/20/microsoft-wants-xbox-games-store-on-iphone/","date":1679325235000,"content":"Microsoft is preparing to launch an Xbox games store on the iPhone as early as next year, but the plans depend on multiple regulatory measures.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/09/App-Store-and-XCloud.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nIn an <a href=\"https://www.ft.com/content/7707705e-b288-4531-b30d-7fa993325018\">interview with the <em>Financial Times</em></a>, Microsoft's gaming chief Phil Spencer said the app's launch hinges on regulators approving the company's acquisition of video game maker Activision Blizzard, as this would give Microsoft a wider portfolio of mobile games. Second, the app would only be able to launch if the EU's Digital Markets Act and other regulations allowing for alternative app stores on iOS are enforced.\r<br />\n\r<br />\n\"We want to be in a position to offer Xbox and content from both us and our third-party partners across any screen where somebody would want to play,\" Spencer told the <em>Financial Times</em>. \"Today, we can't do that on mobile devices, but we want to build towards a world that we think will be coming where those devices are opened up.\"\r<br />\n\r<br />\nIn December, <em>Bloomberg</em>'s Mark Gurman reported that Apple was <a href=\"https://www.macrumors.com/2022/12/13/apple-europe-alternate-app-store-support/\">preparing to allow alternative app stores</a> on the iPhone in order to comply with the Digital Markets Act, which is expected to come into effect in March 2024. Gurman said Apple was aiming to roll out the changes with an iOS 17 update next year for iPhone users in Europe only. This means the Xbox games store would not be available in the U.S., at least initially.\r<br />\n\r<br />\nXbox already <a href=\"https://www.macrumors.com/2021/06/30/hands-on-xbox-cloud-gaming/\">offers a cloud gaming service</a> on the iPhone, but games are only playable via the web instead of the App Store. Apple has faced increasing regulatory scrutiny over its tight control of the App Store, leading the company to make changes in some countries, such as <a href=\"https://www.macrumors.com/2022/06/30/app-store-alternative-payments-south-korea/\">allowing alternative payments in South Korea</a>.<div>Tags: <a href=\"https://www.macrumors.com/guide/microsoft/\">Microsoft</a>, <a href=\"https://www.macrumors.com/guide/xbox/\">Xbox</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/20/microsoft-wants-xbox-games-store-on-iphone/\">Microsoft Wants to Launch Xbox Games Store on iPhone</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/microsoft-wants-to-launch-xbox-games-store-on-iphone.2384210/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ecaec13c9444b60dd38ce4f73f42c705f6d1284d1b06b007d6f460597b9cd38d","category":"Apple"}