{"title":"Those annoying iPhone Live Photos actually make pretty cool videos","link":"https://www.macworld.com/article/1791928/how-to-live-photos-convert-to-video.html","date":1682594100000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When Apple’s Live Photos feature arrived with iOS 9 on the iPhone 6s, they were fun for a minute. As a hybrid photo-video, Live Photos capture a still image plus one and a half seconds of video before and after the shutter tap, complete with sound.</p>\n\n\n\n<p>They never really caught on—mostly because the “live” part usually just records a useless few seconds of nothing. But occasionally you capture something pretty great that you didn’t know was even happening and you want to share it with your friends. However, unless you have a Mac, iPhone, or iPad you can’t view the moving part of the picture. Viewers on other platforms miss out on the special before-and-after video feature and instead, see only the static image. But there’s actually an easy way to share it.</p>\n\n\n\n<p>First, make sure you are actually shooting a Live Photo by enabling the feature in the Camera app. On your iPhone (or iPad) launch the Camera app and tap the bullseye icon at the top right of the screen. The Off position is a white circular bullseye design with a line through it, while the On position removes the line. Tapping the bullseye sends a quick alert that reads <em>Live</em> in yellow or <em>Live Off</em> in white.</p>\n\n\n\n<p>On iPhone 11 or later models, you can switch Live Photos on and off via the Camera control panel, in which case the bullseye up top will be yellow instead of white. Live Photos are enabled by default, but you can choose when to use the feature by toggling on <em>Preserve Settings</em> in <em>Settings &gt; Camera</em>, which honors whichever setting you last chose.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-Video-3.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Live Photos Save as video\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-Video-3.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-Video-3.jpg?resize=300%2C159&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-Video-3.jpg?resize=768%2C407&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-Video-3.jpg?resize=1200%2C635&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-Video-3.jpg?resize=1536%2C813&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-Video-3.jpg?resize=2048%2C1084&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"635\" /></figure><p>Foundry</p></div>\n\n\n\n<p>After you’ve shot your picture, you can make it universally sharable by converting it into a video. Go into the Photos app and under Albums choose <em>Media Types</em> and then tap <em>Live Photos</em>. Choose the photo you want to share. At the top right, tap the three-dot <em>More</em> button, and from the resulting menu, choose <em>Save as Video</em>. That’s all there is to it.</p>\n\n\n\n<p>To find the new video, go back to <em>Albums</em> and choose <em>Recents</em>. Your video will appear as the last entry in the Camera Roll. From there you can trim or edit it as you would any other video or immediately share it as is.</p>\n\n\n\n<p>You can also use a Live Photo with special effects such as Loop and Bounce which, functioning more like a GIF, either replays the Live Photo forever in a loop or plays the video in perpetual forward and reverse motion. To do that, tap the <em>Live</em> arrow at the left above the photo. A drop-down menu lets you choose the effect you want. Once created, you can share the video via the normal channels: email, text, social media, website, you name it.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-video-4.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Live Photo Shortcuts\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-video-4.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-video-4.jpg?resize=300%2C159&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-video-4.jpg?resize=768%2C407&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-video-4.jpg?resize=1200%2C635&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-video-4.jpg?resize=1536%2C813&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Live-Photo-to-video-4.jpg?resize=2048%2C1084&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"635\" /><figcaption><p>The two screenshots on the left show how to use Live Photo effects. The two on the right show the LIve Photo shortcut for the Shortcuts app.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>If you’re fond of the Shortcuts app (which was integrated into iOS 13), you can achieve the same result via the Convert LivePhotos to Video shortcut, located in the Shortcuts Gallery. If you don’t already have it you can <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/guide/shortcuts/discover-shortcuts-in-the-gallery-apdd018638ca/6.0/ios/16.0&amp;xcust=1-1-1791928-1-0-0&amp;sref=https://www.macworld.com/feed\">search for it</a> to add it to your collection. Once you locate the shortcut, tap it and navigate to the Live Photo you want to convert, and then tap that. The shortcut goes through its routine and then sends a notification that your new video is located in the Camera Roll.</p>\n\n\n\n<p><em>Today I Learned is a Macworld column that spotlights lesser-known but useful tips and tricks for Apple users. If you have any ideas for future columns, send an email to michael_simon@idg.com.</em></p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ecb00c93560aa0bf10cce626396d4b8e98465ed17c645d00f469d616b69293bb","category":"Apple"}