{"title":"The Interplay among Wnt/&beta;-Catenin Family Members in Colorectal Adenomas and Surrounding Tissues","link":"https://www.preprints.org/manuscript/202406.1700/v1","date":1719247125000,"content":"Background: Colorectal adenoma undergoes neoplastic progression via the normal epithelium-adenoma-adenocarcinoma sequence as reported in the Vogelgram. The risk of developing cancer is strongly associated with the number and size of adenoma and with the subtype. Currently, adenomatous polyps can be distinguished on the basis of histology: the prevalence are tubular, 5-15% are villous and tubular/villous. Considering the increased risk for malignant transformation described for tubular/villous adenomas, patients diagnosed with adenomatous polyposis are at increased risk of developing CRC. The Wnt/β-catenin pathway plays a key role in the onset of colorectal adenoma, in particular intestinal cells first acquire loss-of-function mutations in APC gene that induce the formation of adenomas.\nMethods: Wnt/β-catenin pathway APC, Wnt3a, Wnt5a, LEF1, BCL9 genes and protein expression analyses were conducted by qRT-PCR and western blot in 68 colonic samples (polyps and adjacent mucosa) from 41 patients, of which 17 affected by FAP. Ten normal colonic mucosal samples were collected from 10 healthy donors.\nResults: In this study both APC gene and protein resulted less expressed in colon tumor compared to the adjacent colonic mucosa. Conversely, activated β-catenin was more expressed in polyps than in the adjacent mucosa. All results confirmed literature data on carcinomas. A statistically significant correlation between Wnt3a and BCL9 both in polyps and in the adjacent mucosa underlies that the canonical Wnt pathway is activated in early colon carcinogenesis and that the adjacent mucosa is already altered.\nConclusion: This is the first study analyzing the difference in expression of Wnt/β-catenin pathway in human colorectal adenomas. Understanding the progression from adenomas to colorectal carcinomas is essential for the development of new therapeutic strategies and improving clinical outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ecb329d668f8bf673b61448fc08248650c6b3d13985f3f86e49db566bbc4b6cb","category":"Interdisciplinary"}