{"title":"Backdoored firmware lets China state hackers control routers with “magic packets”","link":"https://arstechnica.com/?p=1971587","date":1695841476000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/enterprise-router-800x534.jpg\" alt=\"Backdoored firmware lets China state hackers control routers with “magic packets”\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/enterprise-router.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Hackers backed by the Chinese government are planting malware into routers that provides long-lasting and undetectable backdoor access to the networks of multinational companies in the US and Japan, governments in both countries said Wednesday.</p>\n<p>The hacking group, tracked under names including BlackTech, Palmerworm, Temp.Overboard, Circuit Panda, and Radio Panda, has been operating since at least 2010, a <a href=\"https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-270a\">joint advisory</a> published by government entities in the US and Japan reported. The group has a history of targeting public organizations and private companies in the US and East Asia. The threat actor is somehow gaining administrator credentials to network devices used by subsidiaries and using that control to install malicious firmware that can be triggered with “magic packets” to perform specific tasks.</p>\n<p>The hackers then use control of those devices to infiltrate networks of companies that have trusted relationships with the breached subsidiaries.</p></div><p><a href=\"https://arstechnica.com/?p=1971587#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1971587&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ecc9e0defc0ebf3335dfed6810b27b1c0d11bc9635c56ae777ccade195b15b9d","category":"Tech"}