{"title":"Rover sampling finds organic molecules in water-altered rocks on Mars","link":"https://arstechnica.com/?p=1953490","date":1689200323000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/image-1-800x435.jpeg\" alt=\"Greyscale image of a large fan of material spread out across a crater floor.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/image-1-scaled.jpeg\">Enlarge</a> <span>/</span> Jezero crater shows clear signs of water-formed deposits, so it's not a surprise to find water-altered material there. (credit: <a href=\"https://www.usgs.gov/media/images/jezero-crater-mars-1\">NASA/MSSS/USGS</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Organic chemicals, primarily composed of carbon and hydrogen, underly all of life. They're also widespread in the Universe, so they can't be taken as a clear signature of the presence of life. That creates an annoying situation regarding the search for evidence of life on Mars, which clearly has some organic chemicals despite the harsh environment.</p>\n<p>But we don't know whether these are the right kinds of molecules to be indications of life. For the moment, we also lack the ability to tear apart Martian rocks, isolate the molecules, and figure out exactly what they are. In the meantime, our best option is to get some rough information on them and figure out the context of where they're found on Mars. And a big step has been made in that direction with the publication of results from imaging done by the Perseverance rover.</p>\n<h2>Ask SHERLOC</h2>\n<p>The instrument that's key to the new work has a name that pretty much tells you it was designed to handle this specific question: <a href=\"https://mars.nasa.gov/mars2020/spacecraft/instruments/sherloc/\">Scanning Habitable Environments with Raman &amp; Luminescence for Organics &amp; Chemicals</a> (SHERLOC). SHERLOC comes with a deep-UV laser to excite molecules into fluorescing, and the wavelengths they fluoresce at can tell us something about the molecules present. It also has the hardware to do <a href=\"https://en.wikipedia.org/wiki/Raman_spectroscopy\">Raman spectroscopy</a> simultaneously.</p></div><p><a href=\"https://arstechnica.com/?p=1953490#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1953490&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ecd546dae1d88e328f4e4bed25300a4d1ca75c4bf095fe0f49e1d085204c8bb9","category":"Tech"}