{"title":"A Prebiotic Diet Containing Galactooligosaccharides and Polydextrose Produces Dynamic and Reproducible Changes in the Gut Microbial Ecosystem in Male Rats","link":"https://www.preprints.org/manuscript/202405.0682/v1","date":1715364256000,"content":"Despite substantial evidence supporting the efficacy of prebiotics for promoting host health and stress resilience, few experiments present evidence documenting the dynamic changes in microbial ecology and fecal microbial-modified metabolites across time. Furthermore, the literature reports a lack of reproducible effects of prebiotics on specific bacteria and bacterial-modified metabolites. The current experiments examined whether consumption of diets enriched in prebiotics (galactooligosaccharides, GOS and polydextrose, PDX) compared to control diet, would consistently impact the gut microbiome and microbial-modified bile acids across time and between two research sites. Male Sprague Dawley rats were fed control or prebiotic diets for several weeks, and their gut microbiome and metabolome were examined using 16S rRNA gene sequencing and untargeted LC-MS/MS analysis. Dietary prebiotics altered beta diversity, relative abundances of bacterial genera, and microbially modified bile acids across time. PICRUSt2 analyses identified four inferred functional metabolic pathways modified by prebiotic diet. Correlational network analyses between inferred metabolic pathways and microbial-modified bile acids revealed deoxycholic acid as a potential network hub. All these reported effects were consistent between the two research sites supporting the conclusion that dietary prebiotics robustly changed the gut microbial ecosystem. Consistent with our previous work demonstrating that GOS/PDX reduces the negative impacts of stressor exposure, we propose that ingesting a diet enriched in prebiotics facilitates the development of a health-promoting gut microbial ecosystem.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ecd851b31904e5ab64f3782208483bc8b8e54090b2d63e5939ac4986731ebbc4","category":"Interdisciplinary"}