{"title":"Is your USB-C device getting the proper charge? It’s all sorted out for you","link":"https://www.macworld.com/article/1978821/is-your-usb-c-device-getting-the-proper-charge-its-all-sorted-out-for-you.html","date":1691658000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Many people found–and some still find–USB-C confusing because of the variety of data standards supported by different hosts (computers, mobile phones, etc.) and devices (headphones, other computers, gaming systems, drives, and so forth). But mixed in there was the issue that a USB-C cable has no preferred end <em>and</em> can carry power over any cable, often at high wattages necessary for charging laptops or recharging USB battery packs.</p>\n\n\n\n<p>When you plug in multiple devices that can provide power over USB-C, will you fry a computer or other equipment? Will their voltages combine for faster charging? If they’re competing to charge, which one “wins” when you have two sources with different outputs, like 15 watts and 100 watts?</p>\n\n\n\n<p>The answer is that USB-C sorts it all out. The controller on each device that handles negotiation over the cable with other connected devices also negotiates power flow, as power has to pass over certain pathways within the cable. This should typically lead to a host device choosing the highest available power, though there’s no way to be sure.</p>\n\n\n\n<p>One reader described a scenario in which they had plugged into their MacBook Pro a dock that provided 65W over USB-C even though the computer could charge at up to 95W. (All USB-C cables have to carry a minimum of 60W, but ones that are also rated for Thunderbolt 4 must pass 100W. However, charging <em>devices</em> aren’t required to offer a minimum power.)</p>\n\n\n\n<p>As expected, when they plugged both in, the laptop received 95W from the directly attached adapted, declining the power feed from the dock. If the MacBook Pro’s charger were unplugged, it would immediately switch to receiving power from the dock through a sub-second negotiation.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Vicente.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nMac, Power</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"eced1ce432685a36438abb06a9e9a8d7b4652d01bb2eb7051a600ea3eb082fda","category":"Apple"}