{"title":"Fluctuating and Stable High Temperatures Differentially Affect Reproductive Endocrinology of Female Pupfish","link":"https://academic.oup.com/iob/article/doi/10.1093/iob/obae003/7596545?rss=1","date":1706745600000,"content":"<span><div>Synopsis</div>For many fishes, reproductive function is thermally constrained such that exposure to temperatures above some upper threshold has detrimental effects on gametic development and maturation, spawning frequency, and mating behavior. Such impairment of reproductive performance at elevated temperatures involves changes to hypothalamic–pituitary–gonadal (HPG) axis signaling and diminished gonadal steroidogenesis. However, how HPG pathways respond to consistently high versus temporally elevated temperatures is not clear. Here, sexually mature Amargosa River Pupfish (<span>Cyprinodon nevadensis amargosae</span>) were maintained under thermal regimes of either stable ∼25°C (low temperature), diurnal cycling temperatures between ∼27 and 35°C (fluctuating temperature), or stable ∼35°C (high temperature) conditions for 50 days to examine effects of these conditions on HPG endocrine signaling components in the pituitary gland and gonad, ovarian and testicular gametogenesis status, and liver gene expression relating to oogenesis. Female pupfish maintained under stable high and fluctuating temperature treatments showed reduced gonadosomatic index values as well as a lower proportion of oocytes in the lipid droplet and vitellogenic stages. Females in both fluctuating and stable 35°C conditions exhibited reduced ovarian mRNAs for steroid acute regulatory protein (<span>star</span>), cholesterol side chain-cleavage enzyme, P450scc (<span>cyp11a1</span>), and 3β-hydroxysteroid dehydrogenase (<span>3bhsd</span>), while ovarian transcripts encoding 11β-hydroxysteroid dehydrogenase (<span>11bhsd</span>) and sex hormone-binding globulin (<span>shbg</span>) were elevated in females at constant 35°C only. Ovarian aromatase (<span>cyp19a1a</span>) mRNA levels were unaffected, but circulating 17β-estradiol (E<sub>2</sub>) was lower in females at 35°C compared to the fluctuating temperature condition. In the liver, mRNA levels for choriogenins and vitellogenin were downregulated in both the fluctuating and 35°C conditions, while hepatic estrogen receptor 2a (<span>esr2a</span>) and <span>shbg</span> mRNAs were elevated in 35°C females. Taken together, these results demonstrate the potential for elevated temperatures to impair ovarian steroidogenesis and reduce egg envelope and vitellogenin protein production in female <span>C. n. amargosae</span> pupfish, while also shedding light on how thermal regimes that only intermittently reach the upper thermal range for reproduction have differential impacts on reproductive endocrine pathways than constantly warm conditions.</span>","author":"","siteTitle":"Integrative Organismal Biology Current Issue","siteHash":"ad96bcf7a80ab7e3a1a88c34298d761f9695964c0badbbef4e1166baa6580fcc","entryHash":"ecee9f647c3e2f8804e538f8a02d5755a568f8c494f6d5f7313c43d9d0f77c7c","category":"Environment"}