{"title":"ENVE’s Grodeo ride and Builder Round-Up Weekend is Set for June 25 and 26","link":"https://theradavist.com/2021/04/enves-grodeo-ride-and-builder-round-up-weekend-is-set-for-june-25-and-26/?utm_source=rss&utm_medium=rss&utm_campaign=enves-grodeo-ride-and-builder-round-up-weekend-is-set-for-june-25-and-26","date":1619622819000,"content":"<p>Remember our coverage from the <a href=\"https://theradavist.com/2020/07/the-bikes-of-the-enve-builder-round-up-part-01-alchemy-alliance-bingham-breadwinner-calfee-desalvo-english-fiftyone-firefly-holland-horse/\" target=\"_blank\">ENVE Builder Round-Up in 2019</a>? Well, after a year-long hiatus, it’s back!</p>\n<p>ENVE’s Grodeo ride and Builder Round-Up weekend is set for June 25 &amp; 26. It kicks off on Friday at ENVE HQ with the Builder Round-Up and Open House (a mini-NAHBS of sorts) with more than 30 of the most renowned custom builders displaying their latest works of art. Meet the builders with live music, food, drink, and the chance to test your skills on ENVE’s Ogden Trackline Gravel TT.<b></b></p>\n<p>The Grodeo ride on Saturday takes inspiration from some of the ENVE crew’s favorite gravel events, and travels the dirt roads and trails that the G Series gravel products were developed on. The Wasatch Mountains that cast their shadow on the town of Ogden are not for the faint of heart; the route will cover 92 miles and 8,500 feet of climbing with Strava-times sections along the way. Less race, more adventure ride, share the day with friends new and old.<b></b></p>\n<p>Although the Builder Round-Up is open to everyone, the Grodeo ride is limited to 200 riders. The full course will be announced in June. Registration opens May 1st at 8 AM MST and is expected to sell out. Details and sign-up info here: <a href=\"https://www.enve.com/grodeo/\" target=\"_blank\">https://www.enve.com/grodeo/</a></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"ecf4896b794d5038f7387b033571476de3c190541fc866929ee2d4ac3dacb271","category":"Cycling"}