{"title":"The Sphagnum cuspidatum complex: phylogeny, species delimitation, and morphology","link":"https://academic.oup.com/biolinnean/article/141/4/466/7273651?rss=1","date":1694649600000,"content":"<span><div>Abstract</div>The use of species as a concept is an important metric for assessing biological diversity and ecosystem function. However, delimiting species based on morphological characters can be difficult, especially in aquatic plants that exhibit high levels of variation and overlap. The <span>Sphagnum cuspidatum</span> complex, which includes plants that dominate peatland hollows, provides an example of challenges in species delimitation. Microscopic characters that have been used to define taxa and the possibility that these characters may simply be phenoplastic responses to variation in water availability make species delimitation in this group especially difficult. In particular, the use of leaf shape and serration, which have been used to separate species in the complex, have resulted in divergent taxonomic treatments. Using a combination of high-resolution population genomic data (RADseq) and a robust morphological assessment of plants representing the focal species, we provide evidence to evaluate putative species in this complex. Our data support the recognition of <span>S. cuspidatum</span>, <span>S. fitzgeraldii</span>, <span>S. mississippiense</span>, and <span>S. trinitense</span> as genetically distinct species that can be separated morphologically. These results indicate that <span>S. viride</span> does not differ genetically from <span>S. cuspidatum</span>. Our results are broadly relevant to other aquatic groups where leaf shape and marginal teeth are used to distinguish species.</span>","author":"","siteTitle":"Biological Journal of the Linnean Society Current Issue","siteHash":"49e2627ca4236f035605387a5e9b308f0f71198bce05f1a2f79007f5fd444361","entryHash":"ed0cf5558bca4f7e1c9680c5e2e915d30a18b46b8690373946f2a0348ff77660","category":"Environment"}