{"title":"Acute and long-term outcomes of SARS-CoV-2 infection in school-aged children in England: Study protocol for the joint analysis of the COVID-19 schools infection survey (SIS) and the COVID-19 mapping and mitigation in schools (CoMMinS) study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303892","date":1716386400000,"content":"<p>by Katharine J. Looker, Elliot McClenaghan, Alison Judd, Livia Pierotti, Harriet Downing, Jody Phelan, Charlotte Warren-Gash, Kalu Ngozi, Fiona Dawe, Caroline Relton, Hannah Christensen, Alastair D. Hay, Punam Mangtani, Patrick Nguipdop-Djomo, Rachel Denholm</p>\r\nBackground <p>The symptom profiles of acute SARS-CoV-2 infection and long-COVID in children and young people (CYP), risk factors, and associated healthcare needs, are poorly defined. The Schools Infection Survey 1 (SIS-1) was a nationwide study of SARS-CoV-2 infection in primary and secondary schools in England during the 2020/21 school year. The Covid-19 Mapping and Mitigation in Schools (CoMMinS) study was conducted in schools in the Bristol area over a similar period. Both studies conducted testing to identify current and previous SARS-CoV-2 infection, and recorded symptoms and school attendance. These research data have been linked to routine electronic health record (EHR) data.</p> Aims <p>To better understand the short- and long-term consequences of SARS-CoV-2 infection, and their risk factors, in CYP.</p> Methods <p>Retrospective cohort and nested case-control analyses will be conducted for SIS-1 and CoMMinS data linked to EHR data for the association between (1) acute symptomatic SARS-CoV-2 infection and risk factors; (2) SARS-CoV-2 infection and long-term effects on health: (a) persistent symptoms; (b) any new diagnosis; (c) a new prescription in primary care; (d) health service attendance; (e) a high rate of school absence.</p> Results <p>Our study will improve understanding of long-COVID in CYP by characterising the trajectory of long-COVID in CYP in terms of things like symptoms and diagnoses of conditions. The research will inform which groups of CYP are more likely to get acute- and long-term outcomes of SARS-CoV-2 infection, and patterns of related healthcare-seeking behaviour, relevant for healthcare service planning. Digested information will be produced for affected families, doctors, schools, and the public, as appropriate.</p> Conclusion <p>Linked SIS-1 and CoMMinS data represent a unique and rich resource for understanding the impact of SARS-CoV-2 infection on children’s health, benefiting from enhanced SARS-CoV-2 testing and ability to assess a wide range of outcomes.</p>","author":"Katharine J. Looker","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ed0f171b56be47de97a8ec58cce5c6b33f8aad42b3756a1912c984deeb6c2a55","category":"Interdisciplinary"}