{"title":"How to opt out of the Find My network","link":"https://www.macworld.com/article/347243/how-to-opt-out-of-the-find-my-network.html","date":1622192400000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s new AirTags make use of the crowdsourced Find My network that Apple built from your devices: iPhones, iPads, and Macs with internet connections pick up specially formulated anonymized Bluetooth network broadcasts, package them with the current location, and send an encrypted form to Apple.</p>\n\n\n\n<p>An iPhone, iPad, Mac, or Apple Watch with Find My network enabled can be tracked this way from a native Find My app (in iOS, iPadOS, or macOS), while AirTags and upcoming Find My network accessories from third parties are always available for tracking.</p>\n\n\n\n<p>Only an iPhone, iPad, or Mac can relay these beacons with their location, and that feature is opt-out: Apple enables it for new devices and it’s turned on when you updated to iOS/iPadOS 13 or 14 or macOS 10.15 Catalina or 11 Big Sur. The switch to disable the Find My network on your device is a little hidden, and its name has changed in some places: it was called “offline finding” in macOS.</p>\n\n\n\n<p>When your device has Find My network enabled, it relays any signals it picks up from other devices if it has an active Internet connection. But it also broadcasts that anonymized Bluetooth message whenever it’s not connected to the Internet. When you disable Find My network, both tracking and relaying is turned off.</p>\n\n\n\n<p>Here’s where you go to disable Find My network,</p>\n\n\n\n<p><strong>iOS/iPadOS 13 or later:</strong> Go to <em>Settings &gt; account name &gt; Find My &gt; Find My iPhone/iPad</em> and disable Find My network.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/mac911-find-my-ios-option.jpg?quality=50&amp;strip=all&amp;w=1107\" /><figcaption><p>iOS and iPadOS let you flip a nested switch to opt out of the Find My network.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p><strong>macOS 10.15 or later:</strong> Open the Apple ID preference pane, select <em>iCloud</em>, and click the <em>Options</em> button to the right of the Find My service entry. Click <em>Turn Off</em> next to Find My network.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/mac911-find-my-disable-macos.jpg?quality=50&amp;strip=all\" /><figcaption><p>In Find My preferences, you can turn off the Find My network in macOS.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a> including screen captures as appropriate, and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ed1103c981c1cb1a73ccf066ee98f27c5aa3d7dc3ef820eb4639af2608b956aa","category":"Apple"}