{"title":"Sex‐specific oviposition site selection in an arboreal treefrog with a resource‐defense mating system","link":"https://onlinelibrary.wiley.com/doi/10.1111/eth.13444?af=R","date":1712209239000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/23aa3c55-57c3-438e-a0f2-47f59c1680b6/eth13444-toc-0001-m.png\" alt=\"Sex-specific oviposition site selection in an arboreal treefrog with a resource-defense mating system\" />\n<p>Oviposition site selection by parents affects offspring survival and parental fitness, but the relative importance of sexes in oviposition site selection is unconfirmed. Using a phytotelm-breeding frog <i>Kurixalus eiffingeri</i>, we examined bamboo stumps (oviposition sites) in the field to determine whether males and females chose oviposition sites based on site physical characteristics. We found that males prefer a site of a higher stump with deeper water inside the stump, while females showed no preference for site physical characteristics.</p>\n<br />\n<h2>Abstract</h2>\n<p>Oviposition site selection by parents is an important factor that affects offspring survival and parental fitness. The relative importance of sexes in oviposition site selection in anurans is rarely evaluated, especially in species with resource-defense mating systems, where males defend territory containing eventual oviposition sites before advertising for females. Using a phytotelm-breeding frog (<i>Kurixalus eiffingeri</i>) with male territoriality, we examined 310 bamboo stumps (potential for oviposition sites) to determine whether male and female choice of oviposition site based on physical characteristics (stump height, inner diameter, stump depth, water depth, and water volume). We found that males preferred a site with higher stumps that were deeper and contained more water, while females showed no preference for sites based on the characteristics observed. Although we do not exclude the possibility that <i>K. eiffingeri</i> female oviposition site selection can be relied on and/or correlates to male advertisement calls, this study is one of few studies to examine the role of both sexes in oviposition site selection simultaneously, and provides empirical evidence that oviposition site selection is primarily determined by males in an amphibian with a resource-defense mating system.</p>","author":"Sinlan Poo, \nYuan‐Cheng Cheng, \nNien‐Tse Fuh, \nMing‐Feng Chuang, \nYeong‐Choy Kam","siteTitle":"Wiley: Ethology: Table of Contents","siteHash":"7a94182f50d5fe321f60efa1a57eebe5c3e6a74d1fa25ba04a906a999025c0b6","entryHash":"ed150740d307c9b4748024c846b29e8497376cecff809934e4b7420cda043203","category":"Environment"}