{"title":"Video: Tech and bikes from the first women’s Paris-Roubaix","link":"https://cyclingtips.com/2021/10/video-tech-and-bikes-from-the-first-womens-paris-roubaix/","date":1633371388000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/paris-roubaix-femmes-gruber-21-of-25-650x473.jpg\" /></div><h2>Video: Tech and bikes from the first women's Paris-Roubaix</h2><p>\n</p><p>Disparity is a word often used when it comes to women’s cycling, and it sprang to mind when we were wandering the pits on the morning of the inaugural women’s Paris-Roubaix.</p>\n\n\n\n<p>In this instance, it was the disparity in the amount and sort of equipment that teams had at their disposal. Sure, we’re used to seeing a difference in what the wild card invite teams have at their disposal when compared to the World Tour squads in the men’s race. But the difference in equipment available to the women’s teams was, to put it lightly, an eye-opener in the world of women’s cycling.</p>\n\n\n\n<p>We had the eventual winners team, Trek-Segafredo, equipped with the same quantity and quality of equipment as the men’s team, three bikes each, 20+ spare sets of wheels and people on every cobble sector with even more wheels. SD Worx had new Specialized Roubaix bikes for the day in a custom colour; these, believe it or not, had been gathering dust in some Specialized warehouse for over two years, waiting for the first edition to roll out.</p>\n\n\n\n<p>At the other end, you had teams such as Team Doltcini-VanEyck running nothing different from the norm and with just a handful of spare wheels and staff. Even Elisa Balsamo, the new World Champion, and her team, Valcar-Travel &amp; Service, had no new kit for the race. Their standard setups weren’t altered: Cannondale Super Six bikes with Shimano Ultegra Di2.</p>\n\n\n\n<p>Then there were the tech stories that put a smile on your face, such as that of NXTG, a small Danish squad set up by former Roubaix winner Servais Knaven. He had drafted in the team he usually works for to lend a hand: Team Ineos were on hand at each sector with a fleet of spare wheels for the women of NXTG. See, those old rim brake wheels hanging about doing nothing do come in handy sometimes!</p>\n\n\n\n<p>As always, please delve into this weeks video to check out just a touch of the tech from the first women’s Paris-Roubaix. Roll on next year.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/video-tech-and-bikes-from-the-first-womens-paris-roubaix/\">Read More</a>","author":"Dave Everett","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ed1784c7fcfb6bd32c100a5e2744f30c2f6b70d5b383b0b0e0da5f4fc0a082c0","category":"Cycling"}