{"title":"Understanding the impact of network structure on air travel pattern at different scales","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299897","date":1709906400000,"content":"<p>by Hoai Nguyen Huynh, Kuan Luen Ng, Roy Toh, Ling Feng</p>\r\n\r\nThis study examines the global air travel demand pattern using complex network analysis. Using the data for the top 50 airports based on passenger volume rankings, we investigate the relationship between network measures of nodes (airports) in the global flight network and their passenger volume. The analysis explores the network measures at various spatial scales, from individual airports to metropolitan areas and countries. Different attributes, such as flight route length and the number of airlines, are considered in the analysis. Certain attributes are found to be more relevant than others, and specific network measure models are found to better capture the dynamics of global air travel demand than others. Among the models, PageRank is found to be the most correlated with total passenger volume. Moreover, distance-based measures perform worse than the ones emphasising the number of airlines, particularly those counting the number of airlines operating a route, including codeshare. Using the PageRank score weighted by the number of airlines, we find that airports in Asian cities tend to have more traffic than expected, while European and North American airports have the potential to attract more passenger volume given their connectivity pattern. Additionally, we combine the network measures with socio-economic variables such as population and GDP to show that the network measures could greatly augment the traditional approaches to modelling and predicting air travel demand. We’ll also briefly discuss the implications of the findings in this study for airport planning and airline industry strategy.","author":"Hoai Nguyen Huynh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ed174f4da624603c09ff125b171a0f1284c74f0663e99d6053cff8423fdfef17","category":"Interdisciplinary"}