{"title":"Research on strength and microscopic characteristics of lime-activated fly ash-slag solidified sludge under high temperature effect","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305761","date":1718719200000,"content":"<p>by Shunmei Gong, Songbao Feng, Shiquan Wang, Lemei Yu, Yuanyuan Chen, Qiang Xu, Zhiyong Niu</p>\r\n\r\nTo explore the reaction mechanism of sludge, slag, lime, and fly ash in high temperature environments, the unconfined compressive strength (UCS) test was hereby implemented to study the effect on curing age, curing temperature, slag content and fly ash content about the strength of sludge. Scanning electron microscopy (SEM) was used to observe the microscopic composition of the substance, and X-ray diffraction (XRD) was used to analyze the mineral composition at the micro level to further disclose its reinforcement mechanism. The experimental results demonstrate the difference in the strength measured by different dosage of curing agent, and results indicate that the strength of high temperature curing sample was obviously higher than that of low temperature curing sample. When the curing temperature rises, the pozzolanic reaction and hydration reaction between materials are accelerated, and a certain amount of gel products are produced, playing a precipitation and bonding role between particles. The 28 days and 90 days strengths of the sludge samples with 20% fly ash and 80% slag dosing at 40°C were 1139 KPa and 1194 KPa, which were 1.4 and 1.1 times of that of pure cement solidified sludge. At 60°C, the strength of 14 days, 28 days and 90 days were 802 KPa, 1298 KPa and 1363 KPa, which were 1.1, 1.5 and 1.3 times of that of pure cement solidified sludge. Under the influence of an alkaline environment, the silicon-aluminum grid structure was interconnected into a denser network structure, and the compressive strength of lime-activated fly ash-slag was thus continuously enhanced. Affected by the high temperature, lime-activated fly ash-slag solidified sludge could significantly improve the middle and late strength of the sample. The research showed that the new solidification material can replace partly the concrete curing agent, thereby alleviating the carbon emission and environmental pollution problems arising from cement solidified sludge.","author":"Shunmei Gong","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ed19f846e26cfe9ecf35025514ecad29332dd88fcc158fb9b4630045f3bc7666","category":"Interdisciplinary"}