{"title":"Giant worms go wandering in man’s innards, cause dangerous traffic jam","link":"https://arstechnica.com/?p=1964741","date":1693502268000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/10176-800x536.jpg\" alt=\"In this 1960 photograph are two, &lt;em&gt;Ascaris lumbricoides&lt;/em&gt; nematodes, i.e., roundworms. The larger of the two is the female of the species, while the normally smaller male is on the right. Adult female worms can grow to over 12 inches in length.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/10176.jpg\">Enlarge</a> <span>/</span> In this 1960 photograph are two, <em>Ascaris lumbricoides</em> nematodes, i.e., roundworms. The larger of the two is the female of the species, while the normally smaller male is on the right. Adult female worms can grow to over 12 inches in length. (credit: <a href=\"https://phil.cdc.gov/Details.aspx?pid=10176\">CDC</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Parasitic worms are having a slimy moment. In the wake of news that a<a href=\"https://arstechnica.com/health/2023/08/australian-woman-has-3-inch-snake-parasite-pulled-from-her-brain/\"> 3-inch snake parasite burrowed into a woman's brain</a> comes the horrifying report of giant intestinal worms that went wandering in a man's innards, only to cause a rare, dangerous traffic jam in his bile duct.</p>\n<p>According to <a href=\"https://www.nejm.org/doi/full/10.1056/NEJMicm2301930\">a report in the New England Journal of Medicine</a>, doctors in Colombia extracted not one, not two, but three large intestinal worms that had crammed themselves into the normally narrow duct, causing an uncommon, dangerous condition called biliary ascariasis.</p>\n<p>The worms in this case, <em>Ascaris lumbricoides</em>, are typically found in humans. In fact, <em>A. lumbricoides</em> is among the most common parasitic worms found in humans, estimated to infect some 807 million to 1.2 billion people worldwide, according to the Centers for Disease Control and Prevention.</p></div><p><a href=\"https://arstechnica.com/?p=1964741#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1964741&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ed26e197e57b60e7fd142388482f95b363d13293fa5632e4f059ad74b52da052","category":"Tech"}