{"title":"Ars is hosting an IT event in Houston on November 1, and you should come","link":"https://arstechnica.com/?p=1977352","date":1697803252000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/sch-sca-ind-800x533.jpg\" alt=\"Photograph of a shuttle mock-up on top of a real 747\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/sch-sca-ind-scaled.jpg\">Enlarge</a> <span>/</span> Space Center Houston's Shuttle <em>Independence</em> sits atop one of the two Shuttle Carrier Aircraft 747s. (credit: Lee Hutchinson)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Are you an Ars Technica reader? (I hope so, because otherwise, how are you reading these words?) Are you somewhere in or around the greater Houston area, or maybe even somewhere reasonably Houston-adjacent, like Austin or San Antonio? Are you free on the afternoon of November 1, from about 2 pm to about 6 pm? And, if so, <em>would you like to hang out?</em></p>\n<p>If the answers to these questions are mostly \"yes,\" then you could do much worse with your time than attending the event we're hosting on November 1! Ars Technica has partnered up with IBM to bring you a set of panel discussions lasting a half-day, titled \"Harnessing Big Data: Resiliency, AI, and the future of IT.\" On the menu for the day is a talk about modern strategies for fighting ransomware and other disasters; a discussion on managing machine-learning data flows; and a talk about what the future of big distributed hybrid app development might look like.</p>\n<p>Because this is Houston, we opted for just about the most location-specific event venue that we could find: <a href=\"https://spacecenter.org/\">Space Center Houston</a>, right next door to NASA's Johnson Space Center and the headquarters of Mission Control. Holding the event at SCH gives us access to some really cool stuff!</p></div><p><a href=\"https://arstechnica.com/?p=1977352#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1977352&amp;comments=1\">Comments</a></p>","author":"Lee Hutchinson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ed273c26f4d036ad134e52326152d67da091ef389763370db84b75be03027371","category":"Tech"}