{"title":"Therapies go digital. What drives physicians’ acceptance?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303302","date":1715349600000,"content":"<p>by Alessandro Carrera, Emanuele Lettieri, Gaia Lietti, Sara Martignoni, Chiara Sgarbossa, Joseph Cafazzo</p>\r\n\r\nNational healthcare systems face multiple challenges, including the increasing demand for care and decreasing availability of healthcare professionals. Digital health technologies represent opportunities that offer improved efficiency, accessibility, and patient care. In this scenario, Digital Therapeutics are technological advancements to treat or alleviate a disease and deliver a medical intervention with evidence-based therapeutic impacts and regulatory approval. Digital Therapeutics are a paradigm shift for physicians, who exercise caution in terms of trust and wide usage. Digital Therapeutics represents an opportunity and a challenge in healthcare system integration. The research investigates the factors explaining physicians’ acceptance of Digital Therapeutics. A research model that combines organizational mechanisms derived from Institutional Theory and rational factors derived from the Technology Acceptance model was developed. The model was tested through 107 responses from a survey distributed to the members of the leading Italian scientific society in Diabetology. Literature-based hypotheses were empirically tested through Structural Equation Modelling. The analysis confirmed the influence of Perceived Ease of Use on Perceived Usefulness and Perceived Usefulness on the Intention To Use Digital Therapeutics. Rules and norms impact Perceived Usefulness when considering the influence of the scientific society. Culture and mindset towards innovation within the hospital positively affect Perceived Ease of Use. The readiness of hospital facilities enhances the extent to which physicians perceive the ease of employing Digital Therapeutics in their daily practice. Instead, esteemed colleagues’ opinions and guidelines from the scientific society reveal to physicians the value of Digital Therapeutics in patients’ care pathways. Institutions should prioritize cultural, normative, and regulative aspects to accelerate physicians’ endorsement of Digital Therapeutics. Findings advance the theoretical knowledge around clinicians’ adoption of innovative digital health technologies, unveiling the interaction between rational and institutional factors. The results highlight practical implications for healthcare institutions and Digital Therapeutics manufacturers willing to promote their adoption.","author":"Alessandro Carrera","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ed2cdc87d5ca79771c80483e68b9ba0066b21681eb15368a130b7dbdce32f5e3","category":"Interdisciplinary"}