{"title":"How to control the hidden volume in Photos and other apps in iOS","link":"https://www.macworld.com/article/350205/how-to-control-the-hidden-volume-in-photos-and-other-apps-in-ios.html","date":1625824800000,"content":"\n<div>\n<section><div></div></section><p>You certainly know the experience an app or your iPhone or iPad is or is <em>not</em> producing a sound or audio, and you can’t figure out how to get it to start or stop—even though Apple has system-wide volume and mute controls as well as a hardware mute switch (technically, the “Ring/Silent switch”). However, apps have their own relationship with producing audio. They often, but not always, err on the side of not making a peep depending on other settings until you take action.</p>\n\n\n\n<h2>System-wide audio controls</h2>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/07/iphone-se-iphone7-iphone-11pro-buttons-switches-tech-spec-1.png?w=1200\" /><figcaption>Apple explains where all the buttons are, including the Ring/Silent switch.</figcaption></figure></div>\n\n\n\n<p>In <em>Settings &gt; Sounds &amp; Haptics</em> you can control the Ringer and Alerts volume and keep this level unaffected by the volume up/down buttons on your iPhone or iPad by disabling Change with Buttons. The physical Ring/Silent switch controls overall system muting. But apps can seemingly override this: in some cases, an app will play audio even when the switch is enabled; in others, disabling the switch or using the volume up button enables audio at that moment.</p>\n\n\n\n<h2>Photos app</h2>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/07/mac911-photos-audio.png?w=1200\" /><figcaption>The speaker icon is easy to miss in Photos.</figcaption></figure></div>\n\n\n\n<p>When viewing a movie, its audio is typically disabled by default. Tap the speaker icon at the bottom of the view to enable audio.</p>\n\n\n\n<h2>Instagram</h2>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/07/mac911-instagram-audio.png?w=1200\" /><figcaption>Instagram relies heavily on the speaker icon found only on videos with sound embedded.</figcaption></figure></div>\n\n\n\n<p>Instagram’s audio controls are mystifying because it relies on a complicated interaction of choices:</p>\n\n\n\n<ul><li>With the Ring/Silent switch enabled, audio is muted in the app by default. When you view video with audio in the timeline or stories, no audio plays. However, you will see a muted speaker icon on videos with sound in the timeline: tap that, and it enables audio both in the timeline <em>and</em> in stories (and reels and so forth). You can’t disable audio except again by finding a video with sound in the timeline and tapping it again.</li><li>With the Ring/Silent switch disabled, audio plays by default everywhere. However, find a video with sound, and you can tap it to mute sound everywhere in the app.</li></ul><h2>Zoom mobile app</h2>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/07/mac911-zoom-audio.png?w=1200\" /><figcaption>Zoom challenges even the sophisticated by overriding your device’s mute settings.</figcaption></figure></div>\n\n\n\n<p>Zoom’s mobile app overrides system-wide audio settings, which resulted in a maddening hour-long troubleshooting session when I was helping a school I was associated with set up for a Zoom-based workshop. <em>Even</em> when you have muted sound on your iPhone or iPad, the Zoom mobile app will <em>always</em> play through audio if you have enabled what the app calls “Computer Audio”—audio passed from the device you’re using. (We were using multiple devices in one location and getting terrible feedback loops through an iPhone.)</p>\n\n\n\n<p>The trick is that there’s a tiny speaker icon in the upper-left corner of the screen. If you have <em>Settings &gt; Meetings &gt; Always Show Meetings Controls</em> disabled in Zoom, you won’t even <em>see</em> this icon unless you tap the screen briefly to make meeting controls appear.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ed46de93c95b34b7bfff14a1f7a79b704c6d148ff7961487af0679c4ef080034","category":"Apple"}