{"title":"Philips Hue App Gets Design Overhaul","link":"https://www.macrumors.com/2021/06/03/philips-hue-app-gets-design-overhaul/","date":1622705455000,"content":"Signify today announced the launch of a redesigned version of the Philips Hue app for controlling Hue lighting setups. The fourth iteration of the Hue app was rebuilt from scratch to improve functionality and to enhance communication with Hue bulbs, lamps, and accessories.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/hue-app-main-screen.jpg\" />\r\n<br />\r\nA reimagined Home tab offers access to each room in the home so you can get to your Hue lights by room with a tap. Drilling down into a room shows available your lights and scenes all in one easy access tiled view. Prior to now, setting scenes required switching tabs, so this is a more streamlined way of controlling lights in a room together or individually.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/hue-app-room-settings-3.jpg\" />\r\n<br />\r\nThe Home tab also houses the Hue Scene Gallery, a feature that existed before but should now be easier to get to. For those that have multiple bridges, there's now a toggle to swap between them to access different lights in the home.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/hue-app-color-picker-4.jpg\" />\r\n<br />\r\nRoutines have been eliminated in favor of Automations, accessible through the Automations tab. Automations support more advanced actions than before, including multi-user geofencing. With this feature, if a Coming Home or Leaving Home automation is used, the Hue app will check to see if anyone else is home before running the automation, so the lights don't get turned off when someone is still in the house.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/hue-app-automations.jpg\" />\r\n<br />\r\nAutomations that run at sunrise or sunset have been improved with options to end a scene after a set time or to activate a scene at a time before or after sunrise/sunset rather than right at sunrise/sunset.\r\n<br />\r\n\r\n<br />\r\nSignify says that more than a hundred other small and large improvements have been added to streamline the design of the Hue app. The design of the Home tab, for example, makes it easier to configure your setup from multiple places, and if you have an Entertainment Area set up it's easier to customize with a revamped isometric 2.5D view. There continue to be <a href=\"https://www.macrumors.com/guide/home-screen/\">widgets</a> and shortcuts available, as well as Hue Labs features to play with.\r\n<br />\r\n\r\n<br />\r\nLater this year, Signify will further enhance the Hue app with dynamic scenes, which will let the lights in a set Room or Zone transition through different colors of a scene, allowing for all new lighting effects.\r\n<br />\r\n\r\n<br />\r\nThe Hue app is available from the iOS <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> for free, and Hue lights can be <a href=\"https://www.philips-hue.com/en-us\">purchased from the Hue website</a>. Updating to the new app will require migrating settings and scenes, a process that should be hassle-free.<div>Tag: <a href=\"https://www.macrumors.com/guide/philips-hue/\">Philips Hue</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/03/philips-hue-app-gets-design-overhaul/\">Philips Hue App Gets Design Overhaul</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/philips-hue-app-gets-design-overhaul.2299020/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=FcQQfyCq-v4:I5MMkvJXqj4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=FcQQfyCq-v4:I5MMkvJXqj4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/FcQQfyCq-v4\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ed4a20c06b8dd834ea4c5676ab0f2ba7ce3c520141a525a4bcbb114f4a0b5355","category":"Apple"}