{"title":"Study on design optimization of GFRP tubular column composite structure based on machine learning method","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301865","date":1714140000000,"content":"<p>by Peiyao Shu, Chengqi Xue, Gengpei Zhang, Tianyi Deng</p>\r\n\r\nCircular reinforced concrete wound glass fiber reinforced polymer (GFRP) columns and reinforced concrete filled GFRP columns are extensively utilized in civil engineering practice. Various factors influence the performance of these two types of GFRP columns, thereby impacting the whole project. Therefore, it is highly significant to establish the prediction models for ultimate displacement and ultimate bearing capacity to optimize the design of the two types of GFRP columns. In this study, based on the experiments conducted under different conditions on the two kinds of GFRP columns, automatic machine learning along with four other commonly used machine learning methods were employed for modeling to analyze how the column parameters (cross section shape, concrete strength, height of GFRP column, wound GFRP wall thickness, inner diameter of wound GFRP column) affect their performance. The differences in performance among these five machine learning methods were analyzed after modeling. Subsequently, we obtained the variation patterns in ultimate displacement and ultimate bearing capacity of the columns influenced by each parameter by testing the data using the optimal model. Based on these findings, the optimal design schemes for the two types of GFRP columns are proposed. The contribution of this paper is three-fold. First, AutoML sheds light on the automatic prediction of ultimate displacement and ultimate bearing capacity of GFRP column. Second, in this paper, two optimal design schemes of GFRP columns are proposed. Third, for AEC industrial practitioners, the whole process is automatic, accurate and less reliant on data expertise and the optimization design scheme proposed in the article is relatively scientific.","author":"Peiyao Shu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ed4d08d5b093fbcc841689bb9f0d1b133fe3c68f25b224a1c19d26bcd031ad27","category":"Interdisciplinary"}