{"title":"Sonos เปิดตัวลำโพงรุ่นใหม่ Era 100 และ Era 300 เสียงดีกว่าเดิม ยืดหยุ่นกว่าเดิม","link":"https://www.blognone.com/node/132928","date":1678269991000,"content":"<div><div><div><p>Sonos ผู้ผลิตเครื่องเสียงพรีเมียมจากสหรัฐอเมริกาเปิดตัวลำโพงรุ่นใหม่พร้อมกัน 2 รุ่นคือ Era 100 ซึ่งมาแทน Sonos One ที่ขายมานาน และ Era 300 จะเป็นรุ่นใหม่เลย</p>\n<p><strong>Era 100</strong> อัพเกรดจาก Sonos One หลายอย่าง สิ่งสำคัญคือมันรองรับเสียงแบบสเตอริโอแท้ๆ แล้ว โดยให้ทวีตเตอร์มา 2 ตัว (เดิมมี 1 ตัว) ยิงเสียงออกตรงมุมซ้ายขวาของลำโพง (แม้ลำโพงตัวแค่นี้อาจแยกเสียงซ้ายขวายากหน่อย) ส่วนวูฟเฟอร์ก็ใหญ่ขึ้นอีก 25% จาก Sonos One ทำให้เสียงเบสอิ่มและลึกมากขึ้น</p>\n<p><img src=\"https://sv1.picz.in.th/images/2023/03/08/eQYtee.png\" alt=\"eQYtee.png\" /></p>\n<p>นอกจากนี้ Era 100 ยังรองรับบลูทูธแล้ว ซึ่งเป็นสัญญาณว่า Sonos เริ่มยืดหยุ่นมากขึ้น เพราะรุ่นก่อนๆ จะบังคับให้ใช้งานผ่าน Wi-Fi อย่างเดียว (เริ่มใส่บลูทูธมาครั้งแรกใน Sonos Move และ Roam ซึ่งเป็นลำโพงที่ทำมาให้เคลื่อนย้ายได้ แต่ Era ต้องเสียบสายไฟตลอดเวลา) รวมถึงรองรับการต่อ line-in ผ่านพอร์ต USB-C อีกด้วย ทำให้การเล่นเพลงจากเครื่องเล่นต่างๆ สะดวกขึ้นมาก</p>\n<p><img alt=\"alt=&quot;eQYg4E.png&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/f415581e2d82f7d1fe259978529fa52c.png\" /></p>\n<p><strong>Era 300</strong> เป็นรุ่นใหญ่ขึ้นมาพอสมควร มาพร้อมทวีตเตอร์ถึง 4 ตัว (ยิงเสียงออกด้านหน้า, ซ้าย, ขวา, บน) และวูฟเฟอร์ 2 ตัว การจัดวางแบบนี้ทำให้ Era 300 รองรับ Dolby Atmos และ spatial audio รวมถึง Sonos จะเป็นผู้ผลิตลำโพงเจ้าแรกที่รองรับการเล่นเพลง spatial audio จาก Apple Music ด้วย หรือหากนำ Era 300 สองตัวมาใช้งานร่วมกับซาวน์บาร์ Sonos Arc และซับวูฟเฟอร์ Sonos Sub จะได้ระบบเสียง Dolby Atmos 7.1.4 ทันที (ซื้อยกเซ็ทนี้ราคา 2,471 ดอลลาร์สหรัฐ หรือราว 86,000 บาท)</p>\n<p><img alt=\"alt=&quot;eQYqPn.png&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/c402492928c1394def282e20e56d3225.png\" /></p>\n<p>ทั้งสองรุ่นรองรับการสั่งงานด้วยเสียงผ่าน Amazon Alexa และ Sonos Voice Control ที่ Sonos พัฒนาขึ้นเอง โดยเน้นรองรับคำสั่งที่เกี่ยวกับการเล่นเพลง ส่วน Google Assistant นั้นไม่มีให้ใช้แล้ว ซึ่ง Patrick Spence ซีอีโอของ Sonos ระบุว่าไม่เกี่ยวกับ<a href=\"https://www.blognone.com/node/126601\">คดีความ</a>ที่ทั้งสองบริษัทฟ้องร้องกันอย่างหนัก แต่เป็นเพราะกูเกิลปรับข้อกำหนดที่บริษัทต่างๆ จะนำ Google Assistant ไปใส่ในผลิตภัณฑ์ของตน และ Sonos ไม่สามารถทำได้ พร้อมบอกว่าเขาหวังว่ากูเกิลจะเลือกเส้นทางอื่นเพื่อให้ Sonos กลับมาใช้ได้หมือนเดิม</p>\n<p><img alt=\"alt=&quot;eQzxB8.png&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/273150b8b3cc9a8684932354611de1fb.png\" /></p>\n<p>อีกประเด็นที่น่าสนใจคือฟีเจอร์ Trueplay จะมีให้ใช้ใน Android แล้ว โดยก่อนหน้านี้มีให้ใช้เฉพาะบน iOS หลักการคือลำโพงจะจูนเสียงให้เข้ากับห้องที่ตั้งลำโพงไว้โดยผู้ใช้เปิดแอพ Sonos แล้วเดินไปรอบๆ ห้องเพื่อให้แอพฟังเสียงที่ปล่อยออกมาจากลำโพง แต่วิธีการนี้ใช้กับ Android ไม่ได้ เพราะฮาร์ดแวร์ไมโครโฟนหลากหลายเกินไป แต่วิธีที่ Sonos จะใช้สำหรับ Android คือให้ลำโพงเล่นเสียงแล้วฟังเสียงด้วยไมโครโฟนของตัวลำโพงเองเลย ทั้งนี้ Sonos บอกว่าการให้ผู้ใช้ถือเครื่องเดินไปรอบๆ ห้องยังดีกว่าอยู่ และจะใช้กับ iOS ต่อไป</p>\n<p>ขณะนี้ Sonos เปิดพรีออเดอร์ลำโพงรุ่นใหม่ทั้งสองรุ่นแล้ว โดย Era 100 ราคา 249 ดอลลาร์สหรัฐ (ราว 8,600 บาท) ส่วน Era 300 ราคา 449 ดอลลาร์สหรัฐ (ราว 15,600 บาท)</p>\n<p>ที่มา - <a href=\"https://www.theverge.com/23627044/sonos-era-300-100-announced-price-features-hands-on\">The Verge</a>, <a href=\"https://arstechnica.com/gadgets/2023/03/sonos-replaces-the-sonos-one-with-new-era-300-and-100-speakers/\">Ars Technica</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/sonos\">Sonos</a></div><div><a href=\"/topics/speaker\">Speaker</a></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ed4e2c7f0327880d25ae769168d725bdd05ac589b1ef08159bb4da","category":"Thai"}