{"title":"Secondary Amazon rainforest partially recovers tree cavities suitable for nesting birds in 18–34 years","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duae008/7754273?rss=1","date":1708128000000,"content":"<span><div>Abstract</div>Passive restoration of secondary forests can partially offset loss of biodiversity following tropical deforestation. Tree cavities, an essential resource for cavity-nesting birds, are usually associated with old forest. We investigated the restoration time for tree cavities suitable for cavity-nesting birds in secondary forest at the Biological Dynamics of Forest Fragments Project (BDFFP) in central Amazonian Brazil. We hypothesized that cavity abundance would increase with forest age, but more rapidly in areas exposed to cutting only, compared to areas where forest was cut and burned. We also hypothesized that cavities would be lower, smaller, and less variable in secondary forest than in old-growth forest, which at the BDFFP is part of a vast lowland forest with no recent history of human disturbance. We used pole-mounted cameras and tree-climbing to survey cavities in 39 plots (each 200 × 40 m) across old-growth forests and 11–34-year-old secondary forests. We used generalized linear models to examine how cavity supply was related to forest age and land-use history (cut only vs cut-and-burn), and principal components analysis to compare cavity characteristics between old-growth and secondary forest. Cavity availability increased with secondary forest age, regardless of land-use history, but the oldest secondary forest (31–34 years) still had fewer cavities (mean ± SE = 9.8 ± 2.2 cavities ha<sup>–1</sup>) than old-growth forest (20.5 ± 4.2 cavities ha<sup>–1</sup>). Moreover, secondary forests lacked cavities that were high and deep, with large entrances—characteristics likely to be important for many species of cavity-nesting birds. Several decades may be necessary to restore cavity supply in secondary Amazonian forests, especially for the largest birds (e.g., forest-falcons and parrots &gt; 190 g). Retention of legacy trees as forest is cleared might help maintain a supply of cavities that could allow earlier recolonization by some species of cavity-nesting birds when cleared areas are abandoned. A Portuguese version of this article is available in Supplementary Material 1Supplementary Material 1.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"ed5114764e93aa8e0ff3e323cfd65927eb4508c42788c8da792c4c04d734e0ca","category":"Environment"}