{"title":"Google จับมือ Samsung นำ Wear OS รวมกับ Tizen เปลี่ยนชื่อใหม่เป็น Wear","link":"https://www.blognone.com/node/122748","date":1621396461000,"content":"<div><div><div><p>Wear OS ระบบปฏิบัติการสำหรับสมาร์ทวอทช์ของ Google ที่ไม่แพร่หลายนัก เนื่องจากไม่มีฮาร์ดแวร์ที่ Google ทำเองและผู้ผลิตสมาร์ทวอทช์เจ้าใหญ่ๆ เช่น Samsung ใช้ระบบปฏิบัติการ Tizen บนสมาร์ทวอทช์ของตัวเอง มาวันนี้ Google จับมือกับ Samsung เตรียมประสานแพลตฟอร์ม Wear OS กับ Tizen เข้าด้วยกัน พร้อมเปลี่ยนชื่อ ตัดคำว่า OS ออก เหลือแค่ Wear เฉยๆ และจะอยู่บนสมาร์ทวอทช์ภายในปีนี้</p>\n<p>ระบบฟิตเนสของ Fitbit ก็จะกลายเป็นส่วนหนึ่งของ Wear ด้วย โดย <a href=\"https://www.blognone.com/node/120606\">Google ซื้อ Fitbit เสร็จสิ้นในปีนี้</a> และในหน้าแนะนำ Wear ก็มีโลโก้ Fitbit คู่กับกลุ่มโลโก้บริการของ Google</p>\n<p>Google ระบุว่า Wear จะมาพร้อมกับ UX, UI แบบใหม่ ทั้งหน้าตาของนาฬิกา และการใช้งาน แต่ยังไม่มีข้อมูลว่าหน้าปัดแบบหมุนที่ Samsung เคยใช้ จะถูกนำมาใช้ด้วยหรือไม่ ส่วนในด้านแอป จะมาพร้อมกับ Tiles API และ watch face editor ของ Tizen</p>\n<p>ในแง่ประสิทธิภาพ Wear ปรับปรุงเลเยอร์ระดับล่างของระบบปฏิบัติการให้แบตเตอรี่ยาวนานขึ้น ใช้ประโยชน์จากคอร์พลังงานต่ำมากขึ้น ส่วนการทำงานของแอพจะเรียกได้เร็วขึ้นกว่าเดิม 30% และแอนิเมชันต่างๆ จะลื่นไหลมากขึ้น</p>\n<p>ซัมซุงยังไม่ได้เปิดตัวนาฬิกาใหม่ที่ใช้ Wear ในตอนนี้ แต่ความร่วมมือครั้งนี้แปลว่า Galaxy Watch จะใช้บริการต่างๆ ของ Google เช่น Assistant, Maps, Google Pay, YouTube Music ได้เต็มที่ และจะมีแอปใหม่ๆ สำหรับสมาร์ทวอทช์ที่ปรับปรุงดีขึ้น เยอะขึ้น เรียกได้ว่ายุคทองของ Galaxy Watch อาจใกล้เข้ามาแล้ว และอาจทำให้ Wear (OS) แพร่หลายได้สักที</p>\n<p>ที่มา - <a href=\"https://blog.google/products/wear-os/wear-io21/\">Google</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/5a0c8ac5b92e8ae15625e853f8ee9164.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/wear-os\">Wear OS</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/samsung\">Samsung</a></div><div><a href=\"/topics/galaxy-watch\">Galaxy Watch</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ed603edf86fc48cf84f8617874b1fc5ad15a00355a87616598418f8a7a385a64","category":"Thai"}