{"title":"IBM, Meta ตั้งกลุ่ม AI Alliance สนับสนุนแนวทาง AI โอเพนซอร์ส สู้บริษัทยักษ์ใหญ่","link":"https://www.blognone.com/node/137101","date":1701830068000,"content":"<div><div><div><p>บริษัทเอกชนและหน่วยงานวิจัยจำนวน 50 แห่ง นำโดย IBM และ Meta ประกาศตั้งกลุ่ม <strong>AI Alliance</strong> เพื่อกำหนดมาตรฐานของวงการ AI ร่วมกัน โดยเน้นการเปิดกว้างและความโปร่งใส (open and transparent)</p>\n<p>เป้าหมายของ <a href=\"https://thealliance.ai/\">AI Alliance</a> มีตั้งแต่พัฒนาเบนช์มาร์ควัดผล AI โดยเฉพาะในด้านความปลอดภัย, พัฒนาโมเดลพื้นฐาน (foundation model) แบบเปิดกว้าง, พัฒนาชิปเร่งการประมวลผล AI, ร่วมกับภาคการศึกษาเพื่อพัฒนาทักษะ อบรม เผยแพร่เอกสารความรู้ต่างๆ</p>\n<p>ตัวอย่างบริษัทที่เป็นสมาชิกได้แก่ AMD, Cerebras, Dell Technologies, Hugging Face, Intel, Oracle, Red Hat, ServiceNow, Sony, Stability AI</p>\n<p>ตัวอย่างสมาชิกกลุ่มสถาบันวิจัยและสถาบันการศึกษา ได้แก่ A*STAR ของสิงคโปร์, Cornell, Dartmouth, ETH Zurich, Imperial College London, Indian Institute of Technology Bombay, Keio University, New York University,  UC Berkeley, University of Illinois Urbana-Champaign, The University of Texas at Austin, The University of Tokyo, Yale</p>\n<p>นอกจากนี้ยังมีหน่วยงานภาครัฐและมูลนิธิอื่นๆ เช่น NASA, National Science Foundation, Linux Foundation เป็นต้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/87291b0cf2d4e51318c895f72cbf04ec.png\" /></p>\n<p>เป็นที่น่าสังเกตว่ากลุ่ม AI Alliance ไม่มีบริษัทคลาวด์รายใหญ่ทั้ง 3 เจ้าคือ Amazon, Microsoft, Google บริษัทชิปอย่าง NVIDIA รวมถึงไม่มีบริษัท AI ชื่อดังอย่าง OpenAI หรือ Anthropic เข้าร่วมด้วย ซึ่งบริษัทยักษ์ใหญ่เหล่านี้มีแนวโน้มไม่เปิดโมเดลของตัวเองสู่สาธารณะ</p>\n<p>ในทางกลับกัน สมาชิกของ AI Alliance กลับเป็นบริษัทที่สนับสนุนแนวทางโอเพนซอร์ส เช่น Meta ที่เปิด Llama 2 ออกมาตั้งแต่ต้น, Stability AI ที่เปิด Stable Diffusion รวมถึง Hugging Face, LangChain, LlamaIndex เป็นต้น</p>\n<p>ที่มา - <a href=\"https://newsroom.ibm.com/AI-Alliance-Launches-as-an-International-Community-of-Leading-Technology-Developers,-Researchers,-and-Adopters-Collaborating-Together-to-Advance-Open,-Safe,-Responsible-AI\">IBM</a>, <a href=\"https://ai.meta.com/blog/ai-alliance/\">Meta</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/ibm\">IBM</a></div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/open-source\">Open Source</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ed611d26daa522a6a7b68f45cc8155d2b51e1d6a69216d1cc2f546620d39f5dc","category":"Thai"}