{"title":"Early Prediction of Kimchi Cabbage Height using Drone Imagery and Long Short-Term Memory (LSTM) Model","link":"https://www.preprints.org/manuscript/202407.1718/v1","date":1721641934000,"content":"This study introduces a novel method for early prediction of Kimchi cabbage (Brassica rapa subsp. pekinensis (Lour.) Hanelt) height, utilizing drone imagery and a long short-term memory (LSTM) model. The research was conducted on a testbed at the National Institute of Agricultural Sciences (NAS) in South Korea, encompassing two distinct soil types (loam and sandy loam) to investigate their impact on growth. High-resolution drone images were captured throughout the growing season to generate a canopy height model (CHM) for estimating plant height at various stages. Missing height data were interpolated using a logistic growth curve, and an LSTM model was trained on this data to predict the final height of Kimchi cabbage at harvest. Three LSTM models were developed using time-series data collected at 29, 36, and 44 days after planting (DAP). The model trained on data from DAP 44 demonstrated the highest accuracy with a coefficient of determination (R²) of 0.83, a mean absolute error (MAE) of 2.48 cm, and a root mean square error (RMSE) of 3.26 cm, outperforming models trained on earlier data. Color-coded maps were generated to visualize the spatial distribution of predicted Kimchi cabbage heights, revealing variations in growth patterns across the testbed and confirming the model's potential for site-specific management. Considering the trade-off between accuracy and prediction timing, the model trained on DAP 36 data (MAE = 2.77 cm) was deemed optimal for informing cultivation management decisions. This research demonstrates the feasibility and effectiveness of integrating drone imagery, logistic growth curves, and LSTM models for early and accurate prediction of Kimchi cabbage height. The proposed technology enables data-driven decision-making for farmers, facilitating timely interventions based on predicted growth patterns. This could lead to improved crop yields, resource optimization, and a more sustainable agricultural future. Future research will focus on refining the model's accuracy and exploring its applicability to other crops, further expanding the potential of precision agriculture technologies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ed70465066b287df9a9bfb868030684a06fca42efca333e45f082f1f49d7fd93","category":"Interdisciplinary"}