{"title":"Review: The Philips Hue Line Now Has Security Cameras, But There's No HomeKit Support","link":"https://www.macrumors.com/review/philips-hue-secure-camera/","date":1702583591000,"content":"The Philips Hue line has long been focused on lighting products, but this year, Hue parent company Signify expanded the lineup with a set of Philips Hue Secure cameras and sensors designed for home security.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/hue-secure-camera-1.jpg\" width=\"2000\" height=\"1124\" />\r<br />\nI was able to test out the $200 Hue Secure Wired Camera to see how it measures up to some of the other smart camera options on the market. Hue's cameras can be used indoors or out, and the Hue Secure has 1080p video recording with night vision and motion trigger alerts, which at this point I'd expect from any security camera.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-design.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThe camera itself has a base that mounts to the wall with a screw, but if you want to sit it on a table or another flat surface, you need to pay an extra $30 for the \"Desktop\" version. You can also buy the desktop stand after buying the camera, but it is $50, which I feel is unreasonable for a plastic stand that should have come with the camera at no extra cost to begin with. I didn't want to use or test the camera mounted, so I did purchase the stand. You could probably rig something up, but the placement of the cord on the bottom of the camera prevents it from laying flat without the stand, and it's angled too high to use that way.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-front.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nTo allow for interchangeable wall mounting and desktop use, magnets are used for base attachment. The magnets are super strong, so while the camera is meant to be mounted to the wall, I'm not worried that it's going to become detached. You can take it off the mount, and attach the mount to either the top or the bottom to optimize the view regardless of where you're mounting it. The field of view is wide enough that you're able to see an entire room if the camera is indoors, or a good section of your yard if it is outdoors.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-magnetic-components.jpg\" width=\"4047\" height=\"2276\" />\r<br />\nThe Hue Secure has a white plastic casing and a standard camera lens inside, and there is no mistaking it for a security camera. I was surprised at how long it is (a little over 3.5 inches), which means if you wall mount it, it's going to protrude a decent amount. The battery version of this camera is even longer in length at five inches, so it will protrude even further when mounted. I like the clean design and the magnetic attachment system, especially since the magnets allow it to be positioned in a range of ways that might not be possible with just a swivel mount.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-standard-base.jpg\" width=\"2000\" height=\"1125\" /><em><div>This is the standard base the camera comes with. The other base is one I purchased for $50 to allow it to be placed on a desk.</div></em>\r<br />\nThe video quality was totally fine for a 1080p indoor/outdoor camera, and on par with the HomeKit-enabled cameras that I've tested. So, speaking of <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a>, these don't have it. Those with a lot of Philips Hue lights know they all work with ‌HomeKit‌, but that is not the case with the cameras. No ‌HomeKit‌ support is likely going to be a dealbreaker for those in Apple's ecosystem who want everything to be controllable through a central app.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-live-view.jpg\" width=\"2000\" height=\"988\" />\r<br />\nTo use Hue Cameras, a Hue Bridge is required. The cameras don't ship with the Bridge, which costs $60 if you don't have one already for Hue lights. I prefer smart home products that have a hub or a bridge like the Hue Bridge because it improves reliability. I never have setup issues or connectivity problems with my Hue lights, and the same is true for the Hue Secure Camera. It works and it works well.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-cord.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nIt was easy to add the camera to the app, and it can be viewed through the new Hue Secure section of the app. In my testing, it never once went offline, and it was a more reliable than the Eve <a href=\"https://www.macrumors.com/guide/homekit-secure-video/\">HomeKit Secure Video</a> camera I have outside, which is off more than it is on and has been a total headache these last few months.\r<br />\n\r<br />\nI've had similar problems with other ‌HomeKit‌ cameras, and I just don't find them to be the most reliable option. Compared to Ring, though, I don't think Hue has much of an edge. My Ring cameras rarely go offline or have connectivity issues, so Hue is about on par.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-side-view.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThe cameras can be paired to Hue lights with automations to activate the lights when motion is detected, and they can sound alarms should there be an intruder. According to Signify, there is end-to-end encryption (E2EE) to keep video clips and snapshots private, along with software that helps prevent hacking. Video data is stored in the Hue Cloud if you opt for that, and content is deleted after 30 or 60 days. With E2EE, video and audio recordings cannot be viewed if the Hue Cloud were hacked because a multi-word auto-generated passcode you have is required. On that note, you need to keep the passcode somewhere safe, and you also need to hold on to the Hue Secure \"Ownership Card\" that's required for setup.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-timeline.jpg\" width=\"2000\" height=\"1984\" />\r<br />\nLike other smart cameras, the Hue Secure can recognize people, pets, and packages to send tailored alerts, and there are options to set up Activity and Package zones. There is a mimic presence function that can turn on Hue lights to make it seem like you're home when you're not, and the cameras support two-way talk so you can interface with someone if you need, but these are all functions that are available on other smart security cameras.\r<br />\n\r<br />\nUp to 10 cameras can be linked to a Hue Bridge, and a Hue account is required to use them. While the cameras can be used without a subscription, some of the functionality does require a monthly payment. Live streaming, video snapshots, light and sound alarms, and notifications are accessible for free.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-paid-plans.jpg\" width=\"2000\" height=\"1314\" />\r<br />\nRecording requires a Basic or Plus plan, priced starting at $39.99 per year after a 90-day trial period that comes with the purchase. Other paywalled features include Activity zone setup, and package/people alerts. The Basic plan supports two cameras, but if you have more cameras, you need the Plus plan that costs $100/year. That basically puts the full cost of a Hue Camera at $200 for the camera itself (not counting any accessories), $60 for a Bridge (though these are sometimes on sale for less), and at least $3.30 a month if you want to have a 30-day log.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-video-feed.jpg\" width=\"2000\" height=\"988\" />\r<br />\nIf you wanted to use Hue Secure for a whole-home security system, you're looking at $570 for a three-camera bundle (wired, not battery), and $275 for a set of four contact sensors, two motion sensors, and a Bridge. Depending on how many doors and windows you have and what you want to protect, that may only cover a small home.\r<br />\n\r<br />\nI found the Hue Secure portion of the Hue app to be a bit confusing at first. I expected to have the option to see my camera feed right when opening the app, but I don't. I have to tap on the \"Disarmed\" or \"Armed\" feature under Security, then I have to tap on the feed under \"Cameras.\" It then takes several seconds for the camera to connect to my <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> so that I can see my feed.\r<br />\n\r<br />\nThe Hue Secure camera is not activated and set to recording unless the \"Armed\" option is enabled, so no alerts are received unless the camera is set to this state. The \"Armed\" feature can activate a siren or flash the lights when motion is detected, but by disabling everything, you can set it to Armed without having alarms and flashing lights going off if you simply want motion notifications.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-night-vision.jpg\" width=\"2000\" height=\"988\" />\r<br />\nThere are separate Armed activation options for when at home and when away, with the Hue app using geofencing for the away option to turn on the Armed mode automatically. If you \"armed\" the system and then it detected motion while you were away, you could set it to send a notification, flash the lights, and sound an alarm, hopefully scaring off any would-be intruders. When motion is detected, a 60 to 90 second video is captured, depending on subscription plan.\r<br />\n\r<br />\nHue also has \"Take Action\" buttons for turning on the lights or sounding an alarm, and there are buttons for calling 911 or an emergency contact. The Armed and Not Armed features are nice for those who want a one-touch button that enables or disables all recording.\r<br />\n\r<br />\nAt home, if you have the camera armed, you need to ensure that it and any linked motion sensors are not in areas where they could be accidentally triggered, because there is no specific person recognition or way for the camera to tell an intruder from someone who lives in the home. If you have lights set to activate or a siren on, a middle of the night bathroom break might accidentally set everything off. I have an open floor plan, so none of the main entries in my home are sectioned off enough that I could arm an indoor Hue Secure camera and not have to worry about triggering it myself.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-take-action.jpg\" width=\"2000\" height=\"1984\" />\r<br />\nWith a paid plan, the Hue Secure camera can tell a person from another event that triggers motion like an animal or a vehicle, but without it, it's all or nothing motion sensing. Setting boundaries for recording is also a paid feature, but there are blackout zones that can stop the camera from recording everything that's marked.\r<br />\n\r<br />\nWhen not armed, the camera is not recording, but the live view can be accessed. If you want to record, you need to make sure you put it into armed mode before you leave the house, and there is an automation for this so you don't need to remember to do it manually. There are options to delete all timeline events under the privacy section, and individual recordings can also be removed.\r<br />\n\r<br />\nFrom the layout of the app and the function of the camera, it's clear that Hue intends its system to be used for detecting and deterring intruders rather than something like keeping an eye on a pet or general home monitoring. The two-way talk works well, and the microphone quality is fine as long as there isn't a lot of ambient noise. I didn't have an issue being heard or understanding what was said on the camera.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-interface.jpg\" width=\"2000\" height=\"1984\" />\r<br />\nI have a lot of Hue lights and also several security cameras, so I'm probably the kind of person that's the ideal target market for Hue's new camera options, but I'm struggling to find something new here to entice me to upgrade to the Hue Secure system at this price point.\r<br />\n\r<br />\nAt a minimum, I'd like to be able to integrate these cameras into ‌HomeKit‌ so I can see the cameras in the Home app on the TV, Mac, and other devices. There isn't a Hue app on the Mac or on the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> so while the Hue app itself does have a live feed of the camera, I can't view it on anything but an ‌iPhone‌ or an <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>. I also don't have options to use the cameras with my other non-Hue ‌HomeKit‌ lights and sensors.\r<br />\n\r<br />\n<h2>Bottom Line</h2>\r<br />\nGiven the number of ‌HomeKit‌ cameras on the market, I think the lack of ‌HomeKit‌ integration and the lack of ‌HomeKit Secure Video‌ support makes these a difficult sell to ‌HomeKit‌ users. And for people who don't care about ‌HomeKit‌ integration, the cost of these cameras makes it hard for them to compete with cheaper cameras with similar specs, such as those from Ring. The Ring Stick Up Cam with 1080p video recording and a battery is $100, Hue's equivalent is $250.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/hue-camera-front-2.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThere's already a lot of competition in the smart camera market, and it's tough to see where the Hue cameras quite fit in at this point given the limited integration and the price. The Hue cameras with included floodlights make the most sense because they serve a dual purpose as a light and as a camera, so those I could see investing in, but only if I was able to integrate them into ‌HomeKit‌.\r<br />\n\r<br />\nThe Hue Secure System would most appeal to someone who has Hue lights but few other smart home products and wants to stay entirely in a single platform.\r<br />\n<h2>How to Buy</h2>\r<br />\nThe Hue Secure Wired Camera <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2FPhilips-Hue-Secure-Security-Camera%2Fdp%2FB0CLBLFBNY\">can be purchased from Amazon.com</a> or <a href=\"https://www.philips-hue.com/en-us/products/smart-security/\">from the Hue website</a> for $200. The <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2FPhilips-Hue-Secure-Battery-Powered-Security%2Fdp%2FB0CLBFNMW9\">Battery Powered version is $250</a> and the <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2FPhilips-Hue-Secure-Desktop-Security%2Fdp%2FB0CLBFD5JN\">Desktop model is $230</a>.\r<br />\n\r<br />\n<em><small>Note: Signify provided MacRumors with a Hue Secure Wired Camera for the purpose of this review. No other compensation was received.</small></em><div>Tag: <a href=\"https://www.macrumors.com/guide/philips-hue/\">Philips Hue</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/philips-hue-secure-camera/\">Review: The Philips Hue Line Now Has Security Cameras, But There's No HomeKit Support</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/review-the-philips-hue-line-now-has-security-cameras-but-theres-no-homekit-support.2413754/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ed77b9c8113f16bb55f19030330fb62de51dbeeff871729874aac1485cdc3827","category":"Apple"}