{"title":"Investigation of the Effect of Thymoquinone on Egfr/FOXP3 Signaling Pathway in OVCAR3 Human Ovarian Adenocarcinoma Cells","link":"https://www.preprints.org/manuscript/202407.2359/v1","date":1722307104000,"content":"Aim: In our study, the chemotherapeutic drug doxorubicin (Dox) and the natural anticancer property thymoquinone (TQ) were applied to OVCAR3 human ovarian adenocarcinoma cells and human skin keratinocyte cell line HaCat cells, and their cytotoxic effects were investigated through the EGFR/FOXP3 signaling pathway.\nMaterials and Methods: In our study, different doses of thymoquinone and doxorubicin were applied to the cells for 24, 48 and 72 hours and the cytotoxicity level was determined by the MTT method. With Western blot and qRT-PCR analysis, metastasis markers Epidermal growth factor receptor (EGFR) and forkhead box p3 (FOXP3) and apoptosis marker apoptosis inbibitory 5 (API5) genes and their expression levels were examined. Colony counting was performed after DAPI staining and its effect on cell proliferation was determined. An in vitro wound model for metastasis was created and cell migration was evaluated morphologically. All results were analyzed statistically. \nResults: By the cell viavility test, it was found that cytotoxicity was at the highest level in the TQ and Dox applied group, metastasis was prevented especially in the TQ and Dox combined treatment group, and by qRT-PCR analysis, the activity in the EGFR and FOXP3 pathway decreased the most with TQ and the amount of protein decreased with TQ and Dox.\nConclusion: As a result of the study, it was seen that the highest cytotoxic effect and the highest apoptosis induction occurred with TQ treatment. Additionally, it was determined that a significant decrease in EGFR and FOXP3 levels occurred in TQ and Dox applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ed9c8a51548fb25db39a150df66c1db85317a561cfc3fc2d6f79169ed10ac5e4","category":"Interdisciplinary"}