{"title":"The high-end Apple Watch Series 9 will be 3D printed in major design shift","link":"https://www.macworld.com/article/2049817/apple-watch-series-9-stainless-steel-chassis-3d-printing.html","date":1693488921000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The iPhone 15 isn’t the only <a href=\"https://www.macworld.com/article/2044404/apple-september-2023-iphone-15-apple-watch-series-9-ios-17.html\">new product launching</a> at the <a href=\"https://www.macworld.com/article/831417/apple-september-iphone-event-date-time.html\">event on September 12</a>—Apple will also unveil the Apple Watch Series 9. We’re not expecting nearly as many new features as the iPhone 15, but a new rumor claims there will be one significant change you might not even notice.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2023-08-30/apple-watch-series-9-apple-tests-3d-printing-in-device-production&amp;xcust=1-1-2049817-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Mark Gurman at Bloomberg</a>, Apple will use 3D printers to produce the steel chassis in the high-end Apple Watch Series 9. He says the new manufacturing method will cut down on waste and costs and <strong>“</strong>obviate the need to cut large slabs of metal into the product’s shape.<strong>”</strong> The report corroborates a <a href=\"https://www.macworld.com/article/1997157/apple-watch-ultra-2-launch-2024-3d-printed-parts.html\">rumor by Ming-Chi Kuo</a> earlier this year.</p>\n\n\n\n<p>The stainless steel models represent an extremely small portion of Apple’s overall watch sales, which is why Apple is limiting the trial to those models. However, they’re also significantly more expensive than the aluminum models, which start at $399. The stainless steel Series 8 starts at $699.</p>\n\n\n\n<p>According to Gurman, the technique, known as “binder jetting” involves making a print with a powered substance that then goes through a process called sintering, which “uses heat and pressure to squeeze the material into what feels like traditional steel. The exact design and cutouts are then milled like in the previous process.”</p>\n\n\n\n<p>According to Gurman’s description, the new watches won’t technically be stainless steel, so it’s unclear whether Apple will market them the same way. Apple could bring back the “Edition” moniker that was dropped when the Apple Watch Ultra arrived in 2022.</p>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/1472709/apple-watch-series-9-rumors-specs-features-price-release.html\">Apple Watch Series 9</a> will be unveiled at Apple’s Wonderlust event on Tuesday, September 12 at 10am PT. </p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"eda2ccc7f4c66c6ad13b5f94207a3c9b71a6c84fae40426d73a9beca9a61451e","category":"Apple"}