{"title":"Parametrization of Fluid Models for Electrical Breakdown of Nitrogen at Atmospheric Pressure","link":"https://www.preprints.org/manuscript/202407.0838/v1","date":1720608448000,"content":"In transient phase of an atmospheric-pressure discharge, the avalanche turns into a streamer discharge with time. Hydrodynamic fluid models are frequently used to describe the formation and propagation of streamers, where charge particle transport is dominated by the creation of space charge.  The required electron transport data and rate coefficients for the fluid model are parameterized using the local mean-energy approximation (LMEA) and the local field approximation (LFA).  In atmospheric pressure applications, the excited species produced in the electrical discharge determine the subsequent conversion chemistry. We performed the fluid model simulation of streamers in nitrogen gas at atmospheric pressure using three different parametrizations for transport and electron excitation rate data. We present the spatial and temporal development of several macroscopic properties such as electron density and energy, and the electric field during the transient phase.  The species production efficiency which is important to understand the efficacy of any application of non-thermal plasmas is also obtained for the three different parametrizations.  Our results suggest that at atmospheric pressure all three schemes predicted essentially the same macroscopic properties.  Therefore, a lower order method such as LFA which does not require the solution of the energy conservation equation should be adequate to determine the streamer macroscopic properties to inform most plasma-assisted applications of nitrogen containing gases at atmospheric pressure.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"edaf7899ad89b3c9b57c685910300aaf2520daab9b9e1e2dff43c532e94ba2f3","category":"Interdisciplinary"}