{"title":"Sean Kelly Q&A: ‘Time is ticking’ for Wout van Aert","link":"https://www.cyclist.co.uk/in-depth/sean-kelly-interview-2023","date":1685716848000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/sean-kelly-interview-2023\">Sean Kelly Q&amp;A: ‘Time is ticking’ for Wout van Aert</a></p>\n\n<p>Sean Kelly is a true legend of the sport; as a racer he won Monuments, one-week races and both points jerseys and overall wins at Grand Tours; as a commentator he’s soundtracked some of the biggest moments in the sport’s history. </p>\n\n\n\n<p>Now, GCN+ has just released a documentary on his career as part of its ‘Legends’ series, which you can watch now on the GCN app or at <a href=\"https://plus.globalcyclingnetwork.com/watch/5126986\" target=\"_blank\">plus.globalcyclingnetwork.com</a>. We were lucky enough to catch up with Kelly and discuss the film, his career and the current crop of pros.</p>\n\n\n\n<div></div>\n\n\n\n<p><strong>Your ‘Legends’ documentary has just been released on GCN+, are there any riders in the current peloton you think are already worthy of a ‘Legends’ documentary themselves?</strong></p>\n\n\n\n<p>I don’t want to name any names because I think you have to wait until the end of their career to really look at what they’ve achieved, but I definitely think there are a few on course to be classed as some of the best riders of all time.</p>\n\n\n\n<p><strong>[Spoiler alert] In the film you beat Dan Lloyd in a shooting contest in the final round, did you deliberately let him get ahead so you could break his heart?</strong></p>\n\n\n\n<p>Of course. I had to give him a bit of confidence. He said to me he hadn’t done it before but then later I heard, ‘Oh yeah I did this thing…’ So he did have some experience clay pigeon shooting even though he led me to believe he had never had a gun in his hand. Mind games, that’s what it’s about in the modern world of cycling; it’s physical but also very much about the head too. So I let him get a little bit cocky and then in the end I knocked him back a peg.</p>\n\n\n\n<p><strong>You made him scones at the start of the documentary, do you bake?</strong></p>\n\n\n\n<p>No, but I did put them in the oven in the morning! They were made, I had the timing and I just had to put them in the oven. So I’d say that means I can claim some credit, and they were very nice.</p>\n\n\n\n<figure><img width=\"970\" height=\"544\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/GCNPR188_LEG_SEANKELLY_230123_Day2_S1H_Card1_P1055007-1-970x544.jpg\" alt=\"two men chatting while cycling down wet road\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/GCNPR188_LEG_SEANKELLY_230123_Day2_S1H_Card1_P1055007-1-970x544.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/GCNPR188_LEG_SEANKELLY_230123_Day2_S1H_Card1_P1055007-1-300x168.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/GCNPR188_LEG_SEANKELLY_230123_Day2_S1H_Card1_P1055007-1-768x431.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/GCNPR188_LEG_SEANKELLY_230123_Day2_S1H_Card1_P1055007-1-1536x862.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/GCNPR188_LEG_SEANKELLY_230123_Day2_S1H_Card1_P1055007-1-2048x1150.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/GCNPR188_LEG_SEANKELLY_230123_Day2_S1H_Card1_P1055007-1-750x421.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/GCNPR188_LEG_SEANKELLY_230123_Day2_S1H_Card1_P1055007-1-1140x640.jpg 1140w\" /><figcaption>Lewis Rhodes and Tom Grundy/GCN+</figcaption></figure>\n\n\n\n<p><strong>Looking back at your cycling career, you won <em>a</em> <em>lot </em>but their were two races that got away. Do you have more regrets about the Tour of Flanders or the Tour de France?</strong></p>\n\n\n\n<p>Flanders. The regrets about the <a href=\"https://www.cyclist.co.uk/tags/tour-de-france\" target=\"_blank\">Tour de France</a> are not big ones, I regretted not being on the podium as I think that was achievable, but to win the Tour, only if everything went perfectly right for me in every way I might’ve been able to win it. It would have been a long shot. The podium could have been there, had I not raced like crazy at the beginning of the year. I’d do the Classics, go after the Tour of the Basque Country, then come back for Flanders, then do the Vuelta – which was at the beginning of the year back then – it was too much, too soon to be at my strongest for the Tour. </p>\n\n\n\n<p>Flanders and World Championships though, they were two races that suited me, my characteristics, and Flanders was the one I wanted. On two of the three occasions when I finished second I was in really excellent shape and rode it stupidly because I was so good: I thought nobody could beat me. But that’s when you make a mistake, that’s when you can lose big races, which was what happened. With the Worlds I was up there a few times but I was never really in super shape like I was at Flanders because of the promo races after the Tour de France. I always had to do all these appearance races in August, so there wasn’t really enough time to prepare for the Worlds for the date it was scheduled on back then.</p>\n\n\n\n<p><strong>What was your favourite race?</strong></p>\n\n\n\n<p>It would be a toss up between Liège-Bastogne-Liège and Il Lombardia. I say that because they’re very straightforward races, if you’re in really good shape you just follow and allow the race to go by, and then in the end you find yourself with the favourites and a few more guys thrown in; maybe 15 or 20 guys. So tactically they’re not difficult races, and they’re nice to ride as well. Unlike the Tour of Flanders and Paris-Roubaix. Roubaix in particular, you fight so much and there’s so much danger and a high risk of mechanicals. They can be unfair sometimes. So yeah, I preferred others. They weren’t perhaps the races that suited me the best but I could manage them when I was in good shape.</p>\n\n\n\n<p><strong>How do you think you’d get on if you were riding today?</strong></p>\n\n\n\n<p>It’s a bit more difficult, if you look at Liège or Lombardia, riders such as <a href=\"https://www.cyclist.co.uk/tags/tadej-pogacar\" target=\"_blank\">Tadej Pogačar</a> are so explosive now it’s more difficult to control them. In my time in Liège riders like Hinault and Fignon maybe weren’t at their 100% at that point of the season and I was coming off Paris-Nice, where I always came out in really good shape and winning, so I had a little advantage there. Now you see the guys in the early part of the season are 100% or very close to it and that makes it difficult.</p>\n\n\n\n<p><strong>Do you think that Wout van Aert is the new Sean Kelly?</strong></p>\n\n\n\n<p>I thought that two years ago, but he seems to be struggling a little bit to win the big Classics. I thought two years ago he’d already have a number of Monuments ticked off but the last two years he’s been unlucky. This year Roubaix could’ve been a win for him if it came down to a sprint. Time is ticking by, and there are always new guys that seem to spring up very very quickly to that level now, so time runs out much quicker than it did in my day. In terms of the week-long races, I thought he’d be winning the likes of Paris-Nice by now, but the problem is he’s having to work for others in his team so opportunities aren’t coming his way. I would’ve said he’d win some Monuments and smaller stage races, and then when you start winning the smaller stage races that gives an indication if you can win a big three-weeker in three or four years time. That was talking a few years ago, so it’s proving a bit more difficult than I was expecting for him.</p>\n\n\n\n<figure><img width=\"970\" height=\"708\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/04/06221559/graham_watson_spring_classics_03_liege-bastogne-liege_1985_fignon_kelly-970x708.jpg\" alt=\"two cyclists in 80s riding hard in race\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/04/06221559/graham_watson_spring_classics_03_liege-bastogne-liege_1985_fignon_kelly-970x708.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/04/06221559/graham_watson_spring_classics_03_liege-bastogne-liege_1985_fignon_kelly-300x219.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/04/06221559/graham_watson_spring_classics_03_liege-bastogne-liege_1985_fignon_kelly-768x561.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/04/06221559/graham_watson_spring_classics_03_liege-bastogne-liege_1985_fignon_kelly-1536x1121.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/04/06221559/graham_watson_spring_classics_03_liege-bastogne-liege_1985_fignon_kelly-750x548.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/04/06221559/graham_watson_spring_classics_03_liege-bastogne-liege_1985_fignon_kelly-1140x832.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/04/06221559/graham_watson_spring_classics_03_liege-bastogne-liege_1985_fignon_kelly.jpg 2000w\" /><figcaption>Graham Watson</figcaption></figure>\n\n\n\n<p><strong>Is he getting a case of feeling <em>too</em> good on the day?</strong></p>\n\n\n\n<p>Yeah definitely, I think he’s really in top shape but it can come apart. This time around at Flanders he was just a little bit off on the day and got caught out, but then again Pogačar is another problem for the big Monument riders. When you have a Pogačar come in and win the <a href=\"https://www.cyclist.co.uk/tags/tour-of-flanders\" target=\"_blank\">Tour of Flanders</a> my god, that makes it even more difficult. Roubaix was horrible luck but that’s what those races are like. It’s heartbreaking when you get it at that point in the race like Van Aert did this year though.</p>\n\n\n\n<p><strong>Are there any riders capable of winning a sprinter’s jersey and a GC of a Grand Tour?</strong></p>\n\n\n\n<p>Well Van Aert was the one. When he started coming on the scene two or three years ago he definitely looked like the one that could do that. Sagan was the same when he appeared on the scene too, we thought he was going to win Tirreno-Adriaticos and Paris-Nices and you’d think he’d chalk up quite a big palmares in the Classics but that also didn’t happen. In this era of cycling now it’s more difficult to win because everybody is training much better so more riders are capable of winning these Classics and week-long races.</p>\n\n\n\n<p><strong>You were part of a Golden Age of cycling in Ireland, is that something that you still see the effects of now?</strong></p>\n\n\n\n<p>Yeah it’s there still, because it’s such a small cycling nation when I came up with Stephen Roche, Martin Earley and the rest we had an amazing following. We didn’t realise it until the Nissan Classic started and we went back to Ireland and the country closed down. Every area we went through was closed down for that day and some were closed down for the week. It was crazy, the full population almost turned out at the roadside in five days. We never realised the following we had when we were out in Europe going from race to race, you don’t get a feel for that until you go back to compete in Ireland like we did. We’re very much remembered for that back in Ireland still today, I get recognised all the time.</p>\n\n\n\n<p><strong>It was a good Giro d’Italia for the Irish with Eddie Dunbar and Ben Healy…</strong></p>\n\n\n\n<p>Yeah it was. Over the past 15-20 years we’ve always had a few riders in there, some sprinters some GC men: Sam Bennett, Nicky Roche, Dan Martin etc. It’s great to see the guys now doing well, we need them out there flying the flag and for the younger generation looking up. It’s been around 30 years that we’ve had a lot of very good riders coming through the juniors but only a small number filtering through to the pro peloton, it’s surprising. I look at Australia; when I was competing you’d have Phil Anderson and maybe one or two others, now you look at all the Aussies coming through and competing and winning at the top level. They’re probably not being looked after in the right way in the earlier stages of their careers and not getting their breakthroughs; it’s disappointing we’ve not had more coming through.</p>\n\n\n\n<p><strong>Do you think Eddie Dunbar</strong> <strong>will keep progressing after this?</strong></p>\n\n\n\n<p>Yeah, he had a fabulous Giro and we know his early season was disrupted because of the crash in Valencia. Hopefully he can keep going. When you look at what preparation he had for this Giro I think he’ll be looking for higher places on the podium in three-week races from here.</p>\n\n\n\n<figure><img width=\"970\" height=\"633\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/09/02223806/sean_kelly_vitus-970x633.jpg\" alt=\"cyclist in green with no helmet\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/09/02223806/sean_kelly_vitus-970x633.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/09/02223806/sean_kelly_vitus-300x196.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/09/02223806/sean_kelly_vitus-768x502.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/09/02223806/sean_kelly_vitus-1536x1003.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/09/02223806/sean_kelly_vitus-750x490.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/09/02223806/sean_kelly_vitus-1140x744.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2021/09/02223806/sean_kelly_vitus.jpg 2000w\" /><figcaption>Vitus</figcaption></figure>\n\n\n\n<p><strong>With the weather we saw at the Giro, do you think we should switch its place with the Vuelta?</strong></p>\n\n\n\n<p>No, I don’t think so, and I don’t think the Vuelta will want to budge from where they are now. When they were pushed back to the end of the season they weren’t happy at all but it has worked out really well for them if you look at the riders they’ve been getting in the past few years, they’ve been getting excellent start list because of the injuries and crashes at the Tour. I think the organisers are really happy with the slot they have in the calendar at the moment.</p>\n\n\n\n<p><strong>Do you think you’d have had a better chance at the Tour if you were racing this way round?</strong></p>\n\n\n\n<p>Yes definitely, having to do the early part of the season with the smaller races like Paris-Nice and Basque Country and then wanting to do the Classics as well, the Vuelta was too much for me before the Tour. I think I paid for it on the big days in the heat in the mountains, you have that one moment of fatigue and you get caught out.</p>\n\n\n\n<p><strong>You’ve now had two really long careers, how has commentary changed since you started?</strong></p>\n\n\n\n<p>There’s a big difference, when I started out it was just two or three hours at the end of the race, you just come online for the final 80km or so; now a lot of the races you’re starting from kilometre zero.</p>\n\n\n\n<p><strong>Who’s your favourite of the new breed of commentators?</strong></p>\n\n\n\n<p>They all have their good points, some guys commentate on the race but also talk a lot more outside of the race like the countryside and surroundings, whereas other guys are just focussed on the race and riders only. I think there’s a place for everybody because when you’re on air all day you need that variety, but if you go back when you did just two and a half hours, the commentator was all about the race, riders and the route.</p>\n\n\n\n<p><strong>Do any of the other commentators have any bad habits that get on your nerves?</strong></p>\n\n\n\n<p>No, some commentators do get a lot of stick, well we <em>all</em> get a lot of stick, because some people prefer that style of commentary to another. With such a broad audience you have to try to satisfy everybody but you’re never going to get 100%.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h3><span>Related Posts</span></h3>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/criterium-du-dauphine-preview\">Critérium du Dauphiné 2023: Route, TV guide and everything you need to know</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/giro-ditalia-2023-gallery\">The 21 best photos from the Giro d’Italia 2023</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/cyclist-magazine-podcast-episode-21-the-king-sean-kelly\">Cyclist Magazine Podcast Episode 21 – The King, Sean Kelly</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p><strong>Where was your favourite place to ride?</strong></p>\n\n\n\n<p>The Tour of Switzerland was always my favourite. In my day in Spain the roads weren’t as good as we have now but Switzerland was unbelievable, really beautiful roads even in the big mountains.</p>\n\n\n\n<p><strong>What about your favourite place to ride in Ireland?</strong></p>\n\n\n\n<p>Outside of the big cities. When you get outside the big cities you only have to ride half an hour out of Dublin, Galway, Cork and then you can find great roads. We don’t have a big population so the roads are very quiet in so many places. In the south of Ireland Kerry is a beautiful place, in the west Connemara is another great place to ride your bike, but I would say weather is a problem in Ireland, we get a lot of rain and wind. If you get nice weather there’s no place greater than Ireland to ride though.</p>\n\n\n\n<p><strong>Who do you think is going to win the Tour de France?</strong></p>\n\n\n\n<p>Well with Pogačar having the accident it will be interesting to see how well he recovers. At the moment it’s a bit more open, last year’s winner will have confidence from that and I’m interested to see what shape both of them are in at the start, Pogačar moreso because of the accident. We know Vingegaard is going to prepare the same way he did last year, but will the crash have affected Pogačar? That’s the big question.</p>\n\n\n\n<p><strong>Do you think Remco Evenepoel should ride the Tour after dropping out of the Giro early?</strong></p>\n\n\n\n<p>No I don’t think this year is the year for him to ride it, he needs another big tour under his belt – he needed this Giro. I was expecting him to do the Vuelta after he dropped out but now we’re being told he’s not doing it, which is more surprising, I thought as soon as he went out of the Giro they’d be rearranging his programme to do the Vuelta. He’s a young guy, I think he needs a bit more experience in the three-weekers under his belt before he goes to the Tour de France.</p>\n\n\n\n<p><strong>You mentioned in the documentary about having Jeannie Longo’s</strong> <strong>jersey, do you keep up with women’s racing now? How good is it to see its growth?</strong></p>\n\n\n\n<p>It’s great to see how it’s grown rapidly. We’ve been talking about it a lot but it still needs more TV coverage and now in a pretty short space of time we’re getting an awful lot of races. It’s always exciting racing whereas sometimes in men’s races the big tours like this Giro can be slow burners.</p>\n\n\n\n<p><strong>Do you think this Giro was a bit boring or is that how it goes sometimes?</strong></p>\n\n\n\n<p>Well that’s how it goes, you look back at the Giro, there have been others that have been the exact same. The problem is the Tour last year was an exceptional race, they raced hard every day, mountain stages were full-on racing, but you get used to that and then you forget pretty quickly the races that were boring over the years. Unfortunately weather conditions and the parcours didn’t help the Giro, but this year won’t be the end of that.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/sean-kelly-interview-2023\">Sean Kelly Q&amp;A: ‘Time is ticking’ for Wout van Aert</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Will Strickson &#124; Deputy Website Editor","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"edb0ea36b2bbec0a00162fc6e4d1d698dd2de95462333359771ecb0955162191","category":"Cycling"}