{"title":"Sony รายงานผลประกอบการ รายได้รวมโต 22% ปรับลดคาดการณ์ยอดขาย PS5 ลงเล็กน้อย","link":"https://www.blognone.com/node/138199","date":1707901511000,"content":"<div><div><div><p>โซนี่รายงานผลประกอบการประจำไตรมาสเดือนธันวาคม 2023 ภาพรวมมีรายได้เพิ่มขึ้น 22% เมื่อเทียบกับช่วงเดียวกันในปีก่อนเป็น 3.75 ล้านล้านเยน และมีกำไรสุทธิ 3.64 แสนล้านเยน เพิ่มขึ้น 13% ส่วนใหญ่เป็นผลจากการเติบโตของธุรกิจการเงิน เกม และเทคโนโลยีเซ็นเซอร์ภาพ</p>\n<p>ธุรกิจเกมของโซนี่มีรายได้เฉพาะส่วนธุรกิจ 1.44 ล้านล้านเยน เพิ่มขึ้น 16% ปัจจัยหลักจากยอดขายเกม non-first-party ส่วนกำไรจากการดำเนินงานเฉพาะส่วนธุรกิจลดลง 26% เป็น 8.61 หมื่นล้านเยน เนื่องจากการทำโปรโมชัน PS5 และยอดขายเกม first-party ที่ลดลง ในไตรมาสที่ผ่านมา PS5 ขายได้เพิ่มอีก 8.2 ล้านเครื่อง</p>\n<p>ผลจากการดำเนินงานส่วนธุรกิจเกม ทำให้โซนี่ปรับลดคาดการณ์ตัวเลขของปีการเงิน 2023 (สิ้นสุดมีนาคม 2024) โดยรายได้ลดลง 2.1 แสนล้านเยน เป็น 4.15 ล้านล้านเยน ส่วนยอดขาย PS5 จากเดิม 25 ล้านเครื่อง ลดลงเป็น 21 ล้านเครื่อง</p>\n<p>ส่วนธุรกิจอื่นที่น่าสนใจของโซนี่เป็นดังนี้ ธุรกิจเทคโนโลยีเซ็นเซอร์ภาพ รายได้เพิ่มขึ้น 21% จากคำสั่งซื้อที่เพิ่มขึ้น และธุรกิจการเงิน รายได้เพิ่มขึ้น 1,100% เป็น 3.12 แสนล้านเยน จากรายได้ของธุรกิจประกันภัย ซึ่งโซนี่มีแผนนำส่วนธุรกิจนี้เข้าตลาดหุ้นแยกออกมาในชื่อ Sony Financial Group ภายในปี 2025 ด้วย</p>\n<p>ที่มา: <a href=\"https://www.sony.com/en/SonyInfo/IR/library/presen/er/pdf/23q3_sonypre.pdf\">โซนี่</a> (pdf) และ <a href=\"https://www.cnbc.com/2024/02/14/sony-posts-record-quarterly-revenue-on-playstation-sales-boost.html\">CNBC</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/01d077e2c990c45fa660137557b66048.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/sony\">Sony</a></div><div><a href=\"/topics/ps5\">PS5</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"edb46933cf04e11c1f0c8d38df49b4217481b45ea061262fb65f8c0607d89212","category":"Thai"}