{"title":"Interpretation of COVID-19 Epidemiological Trends in Mexico Through Wastewater Surveillance Using Simple Machine Learning Algorithms for Rapid Decision-Making","link":"https://www.preprints.org/manuscript/202410.1297/v1","date":1729126028000,"content":"Detection and quantification of disease-related biomarkers in wastewater samples, denominated Wastewater Based Surveillance (WBS), has proven a valuable strategy for studying the prevalence of infectious diseases within populations in a time and resource-efficient manner, as wastewater samples are representative of all cases within the catchment area, whether they are clinically reported or not. However, analysis and interpretation of WBS datasets for decision-making during public health emergencies, such as the COVID-19 pandemic, remains an area of opportunity. In this article, a database obtained from wastewater sampling at wastewater treatment plants (WWTPs) and university campuses in Monterrey and Mexico City between 2021 and 2022 was used to train simple clustering and regression-based risk assessment models to allow for informed prevention and control measures in high-affluence facilities, even if working with low-dimensionality datasets and a limited number of observations. When dividing weekly data points based on whether the seven-day average daily new COVID-19 cases were above a certain threshold, the resulting clustering model could differentiate between weeks with surges in clinical reports and periods between them with an 83.3% accuracy rate. Moreover, the clustering model provided satisfactory forecasts one week (79.2% accuracy) and two weeks (72.9%) into the future. However, the prediction of the weekly average of new daily cases was limited (R2 = 0.452, MAPE = 180.2%), likely because of insufficient dimensionality in the database. Overall, while simple, WBS-supported models can provide relevant insights for decision-makers during epidemiological outbreaks, regression algorithms for prediction using low-dimensionality datasets can still be improved.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"edb570c6d7178773bb3f0ea34f834c156d74ca842529ccd5514dd9bcd4d0d785","category":"Interdisciplinary"}