{"title":"Amazon RDS now supports io2 Block Express volumes for mission-critical database workloads","link":"https://aws.amazon.com/blogs/aws/amazon-rds-now-supports-io2-block-express-volumes-for-mission-critical-database-workloads/","date":1709751392000,"content":"<p><em><strong>March 7, 2024:</strong> Post updated to change GB to GiB.</em></p> \n<p><em><strong>March 8, 2024:</strong> Post updated to reflect correct region availability.</em></p> \n<p>Today, I am pleased to announce the availability of Provisioned IOPS (PIOPS) io2 Block Express storage volumes for all database engines in <a href=\"https://aws.amazon.com/rds/\">Amazon Relational Database Service (Amazon RDS)</a>. Amazon RDS provides you the flexibility to choose between different storage types depending on the performance requirements of your database workload. io2 Block Express volumes are designed for critical database workloads that require high performance and high throughput at low latency.</p> \n<p><span><strong>Lower latency and higher availability for I/O intensive workloads<br /> </strong></span>With io2 Block Express volumes, your database workloads will benefit from consistent sub-millisecond latency, enhanced durability to 99.999 percent over io1 volumes, and drive 20x more IOPS/GiB from provisioned storage (up to 1,000 IOPS per GiB) at the same price as io1. You can upgrade from io1 volumes to io2 Block Express volumes without any downtime, significantly improving the performance and reliability of your applications without increasing storage cost.</p> \n<p><em>“We migrated all of our primary Amazon RDS instances to io2 Block Express within 2 weeks,”</em> said Samir Goel, Director of Engineering at <a href=\"https://www.figma.com/enterprise/\">Figma</a>, a leading platform for teams that design and build digital products.<em> “Io2 Block Express has had a profound impact on the availability of the database layer at Figma. We have deeply appreciated the consistency of performance with io2 Block Express — in our observations, the latency variability has been under 0.1ms.”</em></p> \n<p>io2 Block Express volumes support up to 64 TiB of storage, up to 256,000 Provisioned IOPS, and a maximum throughput of 4,000 MiB/s. The throughput of io2 Block Express volumes varies based on the amount of provisioned IOPS and volume storage size. Here is the range for each database engine and storage size:</p> \n<table> \n <tbody> \n  <tr> \n   <td><strong>Database engine</strong></td> \n   <td><strong>Storage size</strong></td> \n   <td><strong>Provisioned IOPS</strong></td> \n   <td><strong>Maximum throughput<br /> </strong></td> \n  </tr> \n  <tr> \n   <td>Db2, MariaDB, MySQL, and PostgreSQL</td> \n   <td>Between 100 and 65,536 GiB</td> \n   <td>1,000–256,000 IOPS</td> \n   <td>4,000 MiB/s</td> \n  </tr> \n  <tr> \n   <td>Oracle</td> \n   <td>Between 100 and 199 GiB</td> \n   <td>1,000–199,000 IOPS</td> \n   <td>4,000 MiB/s</td> \n  </tr> \n  <tr> \n   <td>Oracle</td> \n   <td>Between 200 and 65,536 GiB</td> \n   <td>1,000–256,000 IOPS</td> \n   <td>4,000 MiB/s</td> \n  </tr> \n  <tr> \n   <td>SQL Server</td> \n   <td>Between 20 and 16,384 GiB</td> \n   <td>1,000–64,000 IOPS</td> \n   <td>4,000 MiB/s</td> \n  </tr> \n </tbody> \n</table> \n<p><span><strong>Getting started with io2 Block Express in Amazon RDS<br /> </strong></span>You can use the <a href=\"https://console.aws.amazon.com/rds\">Amazon RDS console</a> to create a new RDS instance configured with an io2 Block Express volume or modify an existing instance with io1, gp2, or gp3 volumes.</p> \n<p>Here’s how you would create an Amazon RDS for PostgreSQL instance with io2 Block Express volume.</p> \n<p>Start with the basic information such as engine and version. Then, choose <strong>Provisioned IOPS SDD (io2)</strong> from the <strong>Storage type</strong> options:</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/02/29/rds-pg-io2-create-2-1.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/02/29/rds-pg-io2-create-2-1.png\" width=\"781\" height=\"1438\" /></a></p> \n<p>Use the following <a href=\"https://aws.amazon.com/cli/\">AWS CLI</a> command to create a new RDS instance with io2 Block Express volume:</p> \n<pre><code>aws rds create-db-instance --storage-type io2 --db-instance-identifier new-db-instance --db-instance-class db.t4g.large --engine mysql --master-username masteruser --master-user-password &lt;enter password&gt; --allocated-storage 400 --iops 3000</code></pre> \n<p>Similarly, to modify an existing RDS instance to use io2 Block Express volume:</p> \n<pre><code>aws rds modify-db-instance --db-instance-identifier existing-db-instance --storage-type io2 --allocated-storage 500 --iops 3000 --apply-immediately</code></pre> \n<p><span><strong>Things to know</strong></span></p> \n<ul> \n <li>io2 Block Express volumes are available on all RDS databases using <a href=\"https://aws.amazon.com/ec2/nitro/\">AWS Nitro System</a> instances.</li> \n <li>io2 Block Express volumes support an IOPS to allocated storage ratio of 1000:1. As an example, With an RDS for PostgreSQL instance, the maximum IOPS can be provisioned with volumes 256 GiB and larger (1,000 IOPS × 256 GiB = 256,000 IOPS).</li> \n <li>For DB instances not based on the AWS Nitro System, the ratio of IOPS to allocated storage is 500:1. In this case, maximum IOPS can be achieved with 512 GiB volume (500 IOPS x 512 GiB = 256,000 IOPS).</li> \n</ul> \n<p><span><strong>Available now<br /> </strong></span>Amazon RDS io2 Block Express storage volumes are supported for all RDS database engines and are available in US East (Ohio, N. Virginia), US West (N. California, Oregon), Asia Pacific (Hong Kong, Mumbai, Seoul, Singapore, Sydney, Tokyo), Canada (Central), Europe (Frankfurt, Ireland, London, Stockholm), and Middle East (Bahrain) Regions.</p> \n<p>In terms of pricing and billing, io1 volumes and io2 Block Express storage volumes are billed at the same rate. For more information, see the <a href=\"http://aws.amazon.com/rds/pricing/\">Amazon RDS pricing</a> page.</p> \n<p>Learn more by reading about Provisioned IOPS SSD storage in the <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/CHAP_Storage.html#USER_PIOPS\">Amazon RDS User Guide</a>.</p> \n<p>— <a href=\"https://linkedin.com/in/abhirockzz\">Abhishek</a></p>","author":"Abhishek Gupta","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"edb7993957f679dfb92214115fb1039a31340fa67d821327c44bebb73ad7426a","category":"Tech"}