{"title":"iOS 14.7: RC is available with MagSafe Battery Pack support and more","link":"https://www.macworld.com/article/346989/ios-14-7-developers-public-beta-how-to-install-features-release-date.html","date":1626200962000,"content":"\n<div>\n<section><div></div></section><p>Just days after the release of the final beta of <a href=\"https://www.macworld.com/article/344220/ios-14-6-features-release-date-public-beta-how-to-install.html\">iOS 14.6</a>, and before it is released to the general public, Apple has begun beta testing iOS 14.7. A point-seven release ties iOS 14 with iOS 13 for the most point releases of any iOS version ever. Even that is a bit of a technicality, as iOS 13.7 was released in September of 2020, many months after iOS 13.6, just to get the new COVID-19 contact tracing technology out to as many people as possible.</p>\n\n\n\n<p>Betas of the associated operating systems—iPadOS 14.7, tvOS 14.7, and watchOS 7.6—have also been released.</p>\n\n\n\n<p><em><strong>Updated 07/13/21:</strong> Apple has released the “release candidate” beta of iOS 14.7 to both developers and public beta testers, along with associated operating systems iPadOS, watchOS, and tvOS. The final public release typically follows within a week.</em></p>\n\n\n\n<h2>What’s new in iOS 14.7</h2>\n\n\n\n<p>This is a fairly minor update, but there are a handful of new features. This release adds support for the official <a href=\"https://www.macworld.com/article/350929/apple-magsafe-battery-pack-iphone-12.html\">Apple MagSafe Battery Pack</a>, lets you set credit limits with a Apple Card Family shared account, lets you adjust HomePod timers in the Home app, and more. Here are the full release notes:</p>\n\n\n\n<ul><li>MagSafe Battery Pack support for iPhone 12, iPhone 12 mini, iPhone 12 Pro and iPhone 12 Pro Max</li><li>Apple Card Family adds the option to combine credit limits and share one co-owned account with an existing Apple Card user</li><li>Home app adds the ability to manage timers on HomePod</li><li>Air quality information is now available in Weather and Maps for Canada, France, Italy, Netherlands, South Korea, and Spain</li><li>Podcasts library allows you to choose to see all shows or only followed shows</li><li>Share playlist menu option missing in Apple Music</li><li>Dolby Atmos and Apple Music lossless audio playback may unexpectedly stop</li><li>Battery service message that may have disappeared after reboot on some iPhone 11 models is restored</li><li>Braille displays could show invalid information while composing Mail messages</li></ul><h2>How to get the iOS 14.7 beta</h2>\n\n\n\n<p>If you’re feeling brave, you can try out iOS 14.7 before its general release. Apple suggests you do not run the beta on any critical device, and that’s good advice—you never know what can go wrong.</p>\n\n\n\n<p>Developers can go head to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/download/&amp;xcust=1-1-344220-0-0-0%7Cxid:fr1621460822673ggd&amp;sref=https://www.macworld.com/article/344220/ios-14-6-features-release-date-public-beta-how-to-install.html\">developer.apple.com/download</a> on the device upon which they which to run the beta, and download a developer beta profile. Those who aren’t developers can join the public beta by heading to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/&amp;xcust=1-1-344220-0-0-0%7Cxid:fr1621460822673ffd&amp;sref=https://www.macworld.com/article/344220/ios-14-6-features-release-date-public-beta-how-to-install.html\">beta.apple.com</a> using the device upon which you wish to run the beta, signing in, and downloading the beta profile.</p>\n\n\n\n<p>Once you have the profile you must enable it by going to <em>Settings</em> &gt; <em>General</em> &gt; <em>Profile</em>. Your device will reset to enable the profile. After it has reset with the profile enabled, you can head to <em>Settings</em> &gt; <em>General</em> &gt; <em>Software Updates</em> to download the latest beta release.</p>\n\n\n\n<p>If you’re already on the release candidate version of iOS 14.6, you’ll see the 14.7 update listed under a new “Also Available” section in Software Updates. This allows you to either stay on the iOS 14.6 release or jump on the new beta.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"edbb64ebdd21f090d0deb0b290a99e17128d1a660c75caa73d785eb2b514ba5a","category":"Apple"}