{"title":"Tracking Interprovincial Flows of Atmospheric PAH Emissions Through Downscaling Estimates With Province‐Specific Emission Factors","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004383?af=R","date":1712409582000,"content":"<h2>Abstract</h2>\n<p>Atmospheric polycyclic aromatic hydrocarbons (PAHs), which are emitted significantly by economic sectors, are closely related to the global incidence of human cancer. When assessing temporal changes in PAH emissions in a country that is vast in area, such as China, it is crucial to consider socioeconomic differences across geological regions. In this study, we developed PAH emission factors at the provincial level and used them to compile a Chinese PAH emission inventory. Subsequently, we estimated trade-driven PAH emissions at the provincial level in 2007, 2010, 2012, 2015, and 2017, and examined the critical supply chain paths. The updated inventory reveals a distinct temporal trend in trade-driven PAH emissions, although they remain at an order of magnitude similar to previous estimates. National total production-, consumption-, and income-based PAH emissions, despite a rebound in 2012, exhibit a general decline from 59.3, 43.3, and 48.8 kt in 2007 to 52.1, 43.9, and 47.0 kt in 2017, respectively. These declines align with economic adjustments and emissions mitigation legislation. Spatial hotspots were concentrated in the most affluent Yangtze River Delta, Pearl River Delta, and Jing-Jin-Ji provinces on the demand side and in the northern coal resource-rich provinces on the supply side. They primarily drive PAH emissions from the heavy industrial sectors of northern coal resource-rich provinces. Fewer affluent provinces have experienced a rapid increase in trade-driven PAH emissions after 2012, emphasizing the need for synergistic reduction measures to combat PAH pollution.</p>","author":"Linlin Xia, \nJianbing Wang, \nRuwei Wang, \nSai Liang, \nZhifeng Yang","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"edbb9954a702d543ae792fbdb77773bb35e12120292b209d74585f4ccd774e0a","category":"Environment"}