{"title":"Characterizing the association between child malnutrition and protected areas in sub-Saharan Africa using unsupervised clustering","link":"http://link.springer.com/10.1007/s13412-023-00880-3","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Food security, a crucial concern, intersects with land conservation, particularly in the context of growing global populations. On the one hand, ensuring food security necessitates maximizing agricultural productivity and land use, often resulting in deforestation and habitat loss. On the other hand, conservation efforts require preserving habitats and ecosystems, directly impacting land available for agricultural production. Balancing these opposing needs is intricate, presenting a complex and antagonistic relationship that necessitates innovative strategies for sustainable coexistence. Cluster analysis helps in gaining further insights on this relationship by identifying distinct groups empirically in support of the formulation and implementation of group-level policy responses. This study applied an unsupervised clustering machine learning algorithm to 399 ZDHS clusters across Zimbabwe to identify the groups of Height for Age in children under 5, their proximity to protected areas, and a bundle of socioeconomic and environmental variables obtained from the Demographic and Health Survey. The results of the cluster analysis identified four distinct groups across the country. All identified groups were explained, and their geographic positions were shown on the map. The findings revealed that households in the capital city of Harare had better nutritional status. Moreover, we identified two groups of households, both close to the protected areas, with opposite socioeconomic and environmental characteristics. Identifying these groups with distinguished characteristics has policy and managerial implications and has demonstrated the importance of considering a holistic approach in conservation and child nutrition intervention policies and programs.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"edcd7e953beca142f9213f022e97931aff514d5c734be5fa2da4af19d6436625","category":"Environment"}