{"title":"Factors influencing olfactory function in an adult general population sample: the CHRIS study","link":"https://academic.oup.com/chemse/article/doi/10.1093/chemse/bjae011/7624027?rss=1","date":1709769600000,"content":"<span><div>Abstract</div>The sense of smell allows for the assessment of the chemical composition of volatiles in our environment. Different factors are associated with reduced olfactory function, including age, sex, as well as health and lifestyle conditions. However, most studies that aimed at identifying the variables that drive olfactory function in the population suffered from methodological weaknesses in study designs and participant selection, such as the inclusion of convenience sample or only of certain age groups, or recruitment biases. We aimed to overcome these issues by investigating the Cooperative Health Research in South Tyrol (CHRIS) cohort, a population-based cohort, by using a validated odor identification test. Specifically, we hypothesized that a series of medical, demographic and lifestyle variables is associated with odor identification abilities. In addition, our goal was to provide clinicians and researchers with normative values for the Sniffin’ Sticks identification set, after exclusion of individuals with impaired nasal patency. We included 6,944 participants without acute nasal obstruction and assessed several biological, social, and medical parameters. A basic model determined that age, sex, years of education, and smoking status together explained roughly 13% of the total variance in the data. We further observed that variables related to medical (positive screening for cognitive impairment and for Parkinson’s disease, history of skull fracture, stage 2 hypertension) and lifestyle (alcohol abstinence) conditions had a negative effect on odor identification scores. Finally, we provide clinicians with normative values for both versions of the Sniffin’ Sticks odor identification test, i.e. with 16 items and with 12 items.</span>","author":"","siteTitle":"Chemical Senses Current Issue","siteHash":"eaf999c97f18ab6d9732972032217d08ae5a0287f7a7d719a702f9f5727afa53","entryHash":"edd36abb34988f3c3b2e80b289e4029fa7bc03ab1e6e65c3f294bc9e6f641b6b","category":"Environment"}