{"title":"PSXIII-12 Effects of phytoestrogens on progesterone biosynthesis in dairy cows","link":"https://academic.oup.com/jas/article/102/Supplement_3/719/7757720?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Phytoestrogens are polyphenolic compounds that are present in legumes such as soybeans and red clover. When consumed by cows, the phytoestrogens in legumes mimic estrogen action by binding endogenous estrogen receptors, possibly influencing ovarian function. During the cow estrous cycle, progesterone is the primary steroid hormone produced by the corpus luteum (CL) and is regulated by luteinizing hormone (LH). Findings from previous studies on the impact of phytoestrogen action on reproductive health in ruminants are mixed. To further our understanding of the role of phytoestrogens on the ovary, the objective of the present study was to determine the effects of phytoestrogens on progesterone production by the CL, ex vivo and in vitro. Non-pregnant, non-lactating dairy cows were randomly assigned to graze on traditional grass pastures (n = 5), or pastures enriched with red clover (n = 3) for 5 wk. Afterwards, CL were harvested via colpotomy, and luteal tissue minces were incubated, ex vivo, at 37°C, in the absence or presence of LH (10ng/mL) for 2 h or 24 h. Conditioned medium was collected to determine progesterone concentration by radioimmunoassay (RIA). The response of luteal tissue to LH from cows that grazed on pastures enriched with red clover was less (<span>P</span> = 0.03) than those that grazed on traditional grass pastures. One of the major phytoestrogens in red clover, equol, was chosen to explore possible mechanisms of action on steroidogenic luteal cells obtained from early- and mid-cycle CL in vitro. After luteal tissue was dissociated by collagenase, one million cells were seeded into 6-well plates containing Ham’s F12 medium supplemented with insulin/transferrin/selenium. After 24 h, spent medium was discarded and replaced with fresh medium. In experiment one, the cells were pretreated with equol (0.01, 0.1, 1, or 10 µM) for 24 h followed by LH (10ng/mL) for 4 h. Afterwards, medium was collected to determine P4 concentration. Pretreatment with equol (0.01uM) decreased LH responsiveness in early-cycle cells (<span>P</span> = 0.04, n = 3). In experiment two, cells were treated for 24 h with equol (same concentrations as experiment one), after which total ribonucleic acid was extracted followed by complementary deoxyribonucleic acid generation before quantitative polymerase chain reaction. Expression of enzymes responsible for progesterone production, cholesterol side chain cleavage enzyme (p450scc), and 3β-hydroxysteroid dehydrogenase (3βHSD) were examined. Interestingly, equol (0.01µM, n = 4; 1µM, n = 6) increased p450scc expression (<span>P</span> = 0.02; <span>P</span> = 0.006, respectively) in early-cycle luteal cells, while there were no effects (<span>P</span> ≥ 0.05) on the expression of 3βHSD in either early- or mid-cycle luteal cells. All data were analyzed by analysis of variance (ANOVA) followed by multiple comparison tests. In conclusion, long-term and short-term exposure to phytoestrogens (e.g., equol), disrupted progesterone biosynthesis through decreased responsiveness to LH, despite increases in p450scc and no changes in 3βHSD expression.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"edd61266b0515f70c989614f4bf0a4a163fe634dbc56302cdbd3153fd6deca41","category":"Environment"}