{"title":"Happy 15th Birthday Amazon EC2","link":"https://aws.amazon.com/blogs/aws/happy-15th-birthday-amazon-ec2/","date":1629731394000,"content":"<p><img src=\"https://media.amazonwebservices.com/blog/2021/ec2_15_1.png\" />Fifteen years ago today I wrote the blog post that launched the <a href=\"https://aws.amazon.com/blogs/aws/amazon_ec2_beta/\">Amazon EC2 Beta</a>. As I recall, the launch was imminent for quite some time as we worked to finalize the feature set, the pricing model, and innumerable other details. The launch date was finally chosen and it happened to fall in the middle of a long-planned family vacation to Cabo San Lucas, Mexico. Undaunted, I brought my laptop along on vacation, and had to cover it with a towel so that I could see the screen as I wrote. I am not 100% sure, but I believe that I actually clicked <strong>Publish</strong> while sitting on a lounge chair near the pool! I spent the remainder of the week offline, totally unaware of just how much excitement had been created by this launch.</p> \n<p><span><strong>Preparing for the Launch</strong></span><br /> When Andy Jassy formed the AWS group and began writing his narrative, he showed me a document that proposed the construction of something called the Amazon Execution Service and asked me if developers would find it useful, and if they would pay to use it. I read the document with great interest and responded with an enthusiastic “yes” to both of his questions. Earlier in my career I had built and run several projects hosted at various colo sites, and was all too familiar with the inflexible long-term commitments and the difficulties of scaling on demand; the proposed service would address both of these fundamental issues and make it easier for developers like me to address widely fluctuating changes in demand.</p> \n<p>The EC2 team had to make a lot of decisions in order to build a service to meet the needs of developers, entrepreneurs, and larger organizations. While I was not part of the decision-making process, it seems to me that they had to make decisions in at least three principal areas: features, pricing, and level of detail.</p> \n<p><strong>Features</strong> – Let’s start by reviewing the features that EC2 launched with. There was one instance type, one region (<span>US East (N. Virginia)</span>), and we had not yet exposed the concept of Availability Zones. There was a small selection of prebuilt Linux kernels to choose from, and IP addresses were allocated as instances were launched. All storage was transient and had the same lifetime as the instance. There was no block storage and the root disk image (AMI) was stored in an S3 bundle. It would be easy to make the case that any or all of these features were must-haves for the launch, but none of them were, and our customers started to put EC2 to use right away. Over the years I have seen that this strategy of creating services that are minimal-yet-useful allows us to launch quickly and to iterate (and add new features) rapidly in response to customer feedback.</p> \n<p><strong>Pricing</strong> – While it was always obvious that we would charge for the use of EC2, we had to decide on the units that we would charge for, and ultimately settled on instance hours. This was a huge step forward when compared to the old model of buying a server outright and depreciating it over a 3 or 5 year term, or paying monthly as part of an annual commitment. Even so, our customers had use cases that could benefit from more fine-grained billing, and we launched <a href=\"https://aws.amazon.com/blogs/aws/new-per-second-billing-for-ec2-instances-and-ebs-volumes/\">per-second billing for EC2 and EBS</a> back in 2017. Behind the scenes, the AWS team also had to build the infrastructure to measure, track, tabulate, and bill our customers for their usage.</p> \n<p><strong>Level of Detail</strong> – This might not be as obvious as the first two, but it is something that I regularly think about when I write my posts. At launch time I shared the fact that the EC2 instance (which we later called the <strong>m1.small</strong>) provided compute power equivalent to a 1.7 GHz Intel Xeon processor, but I did not share the actual model number or other details. I did share the fact that we built EC2 on <a href=\"https://www.cl.cam.ac.uk/research/srg/netos/projects/archive/xen/\">Xen</a>. Over the years, customers told us that they wanted to take advantage of specialized processor features and we began to share that information.</p> \n<p><span><strong>Some Memorable EC2 Launches</strong></span><br /> Looking back on the last 15 years, I think we got a lot of things right, and we also left a lot of room for the service to grow. While I don’t have one favorite launch, here are some of the more memorable ones:</p> \n<p><strong><a href=\"https://aws.amazon.com/blogs/aws/amazon_ec2_beta/\">EC2 Launch</a> (2006)</strong> – This was the launch that started it all. One of our more notable early scaling successes took place in early 2008, when <a href=\"https://animoto.com/\">Animoto</a> scaled their usage from less than 100 instances all the way up to 3400 in the course of a week (read <a href=\"https://aws.amazon.com/blogs/aws/animoto-scali/\">Animoto – Scaling Through Viral Growth for the full story</a>).</p> \n<p><strong><a href=\"https://aws.amazon.com/blogs/aws/amazon-elastic/\">Amazon Elastic Block Store</a> (2008)</strong> – This launch allowed our customers to make use of persistent block storage with EC2. If you take a look at the post, you can see some historic screen shots of the once-popular ElasticFox extension for Firefox.</p> \n<p><strong><a href=\"https://aws.amazon.com/blogs/aws/new-aws-load-balancing-automatic-scaling-and-cloud-monitoring-services/\">Elastic Load Balancing / Auto Scaling / CloudWatch</a> (2009)</strong> – This launch made it easier for our customers to build applications that were scalable and highly available. To quote myself, “Amazon CloudWatch monitors your Amazon EC2 capacity, Auto Scaling dynamically scales it based on demand, and Elastic Load Balancing distributes load across multiple instances in one or more Availability Zones.”</p> \n<p><strong><a href=\"https://aws.amazon.com/blogs/aws/introducing-amazon-virtual-private-cloud-vpc/\">Virtual Private Cloud / VPC</a> (2009)</strong> – This launch gave our customers the ability to create logically isolated sets of EC2 instances and to connect them to existing networks via an IPsec VPN connection. It gave our customers additional control over network addressing and routing, and opened the door to many additional networking features over the coming years.</p> \n<p><strong><a href=\"https://aws.amazon.com/blogs/aws/amazon-ec2-update-additional-instance-types-nitro-system-and-cpu-options/\">Nitro System</a> (2017)</strong> – This launch represented the culmination of many years of work to reimagine and rebuild our virtualization infrastructure in pursuit of higher performance and enhanced security (<a href=\"https://aws.amazon.com/ec2/nitro/\">read more</a>).</p> \n<p><strong><a href=\"https://aws.amazon.com/blogs/aws/new-ec2-instances-a1-powered-by-arm-based-aws-graviton-processors/\">Graviton</a> (2018)</strong> -This launch marked the launch of Amazon-built custom CPUs that were designed for cost-sensitive scale-out workloads. Since that launch we have continued this evolutionary line, launching general purpose, compute-optimized, memory-optimized, and burstable instances powered by Graviton2 processors.</p> \n<p><strong><a href=\"https://aws.amazon.com/ec2/instance-types/\">Instance Types</a> (2006 – Present)</strong> -We launched with one instance type and now have over four hundred, each one designed to empower our customers to address a particular use case.</p> \n<p><span><strong>Celebrate with Us</strong></span><br /> To celebrate the incredible innovation we’ve seen from our customers over the last 15 years, we’re hosting a <a href=\"https://aws.amazon.com/ec2/15th-birthday-event/\">2-day live event</a> on August 23rd and 24th covering a range of topics. We kick off the event with today at 9am PDT with Vice President of Amazon EC2 Dave Brown’s keynote “Lessons from 15 Years of Innovation.”</p> \n<p><span><strong>Event Agenda</strong></span></p> \n<table> \n <tbody> \n  <tr> \n   <td><strong>August 23</strong></td> \n   <td><strong>August 24</strong></td> \n  </tr> \n  <tr> \n   <td>Lessons from 15 Years of Innovation</td> \n   <td>AWS Everywhere: A Fireside Chat on Hybrid Cloud</td> \n  </tr> \n  <tr> \n   <td>15 Years of AWS Silicon Innovation</td> \n   <td>Deep Dive on Real-World AWS Hybrid Examples</td> \n  </tr> \n  <tr> \n   <td>Choose the Right Instance for the Right Workload</td> \n   <td>AWS Outposts: Extending AWS On-Premises for a Truly Consistent Hybrid Experience</td> \n  </tr> \n  <tr> \n   <td>Optimize Compute for Cost and Capacity</td> \n   <td>Connect Your Network to AWS with Hybrid Connectivity Solutions</td> \n  </tr> \n  <tr> \n   <td>The Evolution of Amazon Virtual Private Cloud</td> \n   <td>Accelerating ADAS and Autonomous Vehicle Development on AWS</td> \n  </tr> \n  <tr> \n   <td>Accelerating AI/ML Innovation with AWS ML Infrastructure Services</td> \n   <td>Accelerate AI/ML Adoption with AWS ML Silicon</td> \n  </tr> \n  <tr> \n   <td>Using Machine Learning and HPC to Accelerate Product Design</td> \n   <td>Digital Twins: Connecting the Physical to the Digital World</td> \n  </tr> \n </tbody> \n</table> \n<p><a href=\"https://aws.amazon.com/ec2/15th-birthday-event/\">Register here</a> and join us starting at 9 AM PT to learn more about EC2 and to celebrate along with us!</p> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"eddcd393b8067794295e5e18cb8ae3757e9ca21605fcf63d5caa6825a6e37704","category":"Tech"}