{"title":"Training: the right tools for the job","link":"https://www.cyclist.co.uk/sponsored/10275/training-the-right-tools-for-the-job","date":1637753041000,"content":"<span>\n      <span><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div>  \n  <div>      <div><span>30 Nov 2021</span></div>    </div></div><p>\nIf you want to get the most from your training sessions, you’ll need to have all the right tools at your disposal</p>\n<div>\n      <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/article_main_image/public/2021/11/wf_kickr_jene_0228-01.jpg?itok=nL7AONEU\" />  </div>\n<div>\n      <p><em><strong><span>If you want to get the most from your training sessions, you’ll need to have all the right tools at your disposal</span></strong></em></p>\n<p><span>Technology has transformed cycling training. Where once you had to rely on a rudimentary cyclometer that would count the number of times your front wheel rotated to work out the distance you had travelled, there are now myriad devices on the market that can give you a lab-standard setup in your own home.</span></p>\n<p><span>This explosion in choice does have a downside, though – where do you start? After all, it's very easy to fall into the trap of having all the gear and no idea, which could see your training and performance going backwards. Here, we'll look at the best tools for the job that will take your training to the next level.</span></p>\n<h2><span>Training app</span></h2>\n<p><span>Gone are the days where you needed to rely on a generic training plan found online, or fork out for a coach to provide you with a personalised breakdown to help you achieve your goals. Now, you can get access to completely tailored plans at the click of a button, and sessions that are modified to fit your life and your targets.</span></p>\n<p><span>The new Wahoo SYSTM training app pioneers this approach to training and staying motivated on the bike. Based on research and analysis from the Wahoo sports science team, you can create a completely customised training plan that is based on your fitness and objectives. Each workout is unique to the individual and power targets are based on four different measurements (4DP®) – rather than the standard one (FTP) like other training apps.</span></p>\n<p>\n</p><div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/2021/11/wf_kickr_jene_0052-01.jpg\" />  </div>\n</div>\n<p></p>\n<p><span>Wahoo SYSTM features an extensive library of immersive video-based workouts to help you take your fitness to the next level. There is something for everyone: lose yourself in a virtual ride on some of the world’s most iconic routes with On Location workouts; raise your heart rate with a workout from The Sufferfest; or put yourself right in the middle of the action with a ProRide session, with official footage from the biggest pro races on the calendar. What's more, with the ability to add yoga, strength training and mental training to each plan, you'll be left fully prepared for whatever your next event throws at you.</span></p>\n<p><span>Available on Mac, PC, iOS and Android, Wahoo SYSTM is the most accessible training app on the market.</span></p>\n<h2><span>Turbo trainer</span></h2>\n<p><span>Even with the best training plan in the world, your fitness is only going to improve if you're able to stick to it. Enter the turbo trainer. Previously the preserve of a hardcore minority who didn't think anything of spending their winter months tucked away in a spare bedroom facing a wall for hours at a time, indoor trainers have come on leaps and bounds in recent years with the advent of 'smart' turbos.</span></p>\n<p><span>Wahoo has led the way with its KICKR platform. The most advanced smart turbo trainer on the market, the latest iteration can simulate outdoor riding with side-to-side movement, gradients of up to 20% and a flywheel that emulates the power and inertia of riding on the road.</span></p>\n<p><span>Building out the KICKR ecosystem is the KICKR CLIMB that physically simulates ascents of up to 20% and descents of -10%, and the KICKR HEADWIND smart fan, which pairs directly to your smart trainer, heart rate monitor or speed sensor to gauge your workout intensity and automatically adjusts to make your indoor rides as immersive and engaging as possible.</span></p>\n<p><span>When combined with Wahoo SYSTM, the KICKR is the ultimate training tool, providing the resistance required along every step of a training plan, and all within +/- 1% accuracy.</span></p>\n<h2><span>Bike computer</span></h2>\n<p><span>Putting in the sessions on the turbo trainer is all well and good when they're focussed and specific high-intensity drills, but nothing can replace the feeling of actually heading out on the open road for longer, low-intensity rides.</span></p>\n<p><span><br />\n<div>\n<div>\n<div>\n<div>\n<div>\n          </div>\n</div>\n</div>\n</div>\n</div>\n<p></p></span></p>\n<p><span>To keep your training consistent, it's worth investing in a bike computer. They provide an accurate log of distance travelled and speed via a built-in GPS sensor, and when paired with sensors such as a heart rate monitor and a power meter, they can show you real-time data mid-effort. The Wahoo ELEMNT BOLT is a great addition to any road bike's handlebars, while the 2.7in screen of the Wahoo ELEMNT ROAM is ideal for those who like exploring new routes on the fly.</span></p>\n<p><span>Both will be able to sync with Wahoo SYSTM when the latter launches its outside ride training plans, allowing you to take your training sessions to the streets.</span></p>\n<h2>Heart rate monitor</h2>\n<p><span>The Wahoo SYSTM training app bases its workouts on your power profile, but there's another data set that's important to record and pay attention to – your heart rate. Although power is the preferred measure because it is instant and it's possible to train above your thresholds (unlike your heart rate), your heart's response to training can show how your cardiovascular system is reacting to a training plan. A high heart rate can also show if you're overtraining or even getting ill.</span></p>\n<p><span>Wahoo has a number of heart rate monitors to choose from that can pair with the whole Wahoo suite of products and apps. The TICKR is its standard chest strap monitor, the TICKR X has additional running features such as cadence and ground contact time, and its TICKR FIT is an optical armband monitor.</span></p>\n<p><span>The Wahoo ELEMNT RIVAL GPS Sportwatch also connects to Wahoo SYSTM and can monitor your heart rate as well as control the KICKR HEADWIND.</span></p>\n<h2><span>Transform your training</span></h2>\n<p><span>Taking your cycling to the next level has been made even easier thanks to the increased availability and affordability of training-specific technology, but achieving your goals requires it all to work in tandem. The Wahoo SYSTM training app can provide you with the most tailored and specific plan, but it's nothing without the tools to complement it. Fortunately, it's built to be used in tandem with turbo trainers, bike computers and heart rate monitors, and slots seamlessly into the Wahoo ecosystem.</span></p>\n<p><strong><span>• Find out more about how Wahoo SYSTM can boost your training and <a href=\"https://pubads.g.doubleclick.net/gampad/clk?id=5842629321&amp;iu=/359/impcount.co.uk\" target=\"_blank\">try it free for 14 days</a></span></strong> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/training\">Training</a></div>    </div></div>","author":"HughA","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"eddd2983baf60a14dc1ad150c4afdcf29e3a0320f960b44d5c2fdcaaaf0fe540","category":"Cycling"}