{"title":"Imagine Cup 2023 รอบ World Finals ประกาศผล  นักเรียนไทยชนะใน Asia","link":"https://www.blognone.com/node/133927","date":1684684101000,"content":"<div><div><div><p>ไมโครซอฟท์ประกาศผลการแข่งขัน <a href=\"https://imaginecup.microsoft.com\">Imagine Cup 2023</a> รอบ World Finals โดยทีม CS-M Tool จากโรงเรียนปรินส์รอยแยลส์วิทยาลัย ได้ผ่านเข้ารอบเป็น 3 ทีมสุดท้ายและคว้ารางวัลเป็นผู้ชนะใน Asia ในประเภท Health</p>\n<p>Imagine Cup เป็นการแข่งขันพัฒนาซอฟต์แวร์และเทคโนโลยีสำหรับนักเรียนนักศึกษาจากไมโครซอฟท์ ในปีนี้เป็นการแข่งขันปีที่ 21 โดยในปีที่ผ่านมา มีเยาวชนเข้าร่วมประชันความสามารถแล้วกว่า 2 ล้านคน รวมถึงผลงาน JustSigns ของทีม Threeotech (อ่าน<a href=\"https://www.blognone.com/node/122013\">ข่าวเก่า</a>) และเกม <a href=\"https://www.timeliegame.com\">Timelie</a> ของทีม PH21 (อ่าน<a href=\"https://www.blognone.com/node/83963\">ข่าวเก่า</a>) โดยเป็นครั้งแรกของการแข่งขันกับผู้ชนะจากระดับมัธยมศึกษาจากประเทศไทย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b5eeadb92380a8f0e3ba0c5b16aec968.png\" /></p>\n<p><strong>นวัตกรรม AI for All เพื่อผู้มีความเสี่ยงโรคหัวใจด้วย CS-M Tool</strong></p>\n<p>CS-M Tool (Cardiac Self-Monitoring Tool) เป็นเครื่องมือการตรวจสอบการเต้นของหัวใจด้วยตนเอง ซึ่งนำเอาเทคโนโลยี AI มาทำงานร่วมกับอุปกรณ์ทางการแพทย์อย่างหูฟังทางการแพทย์ (Stethoscope) ติดเข้ากับอุปกรณ์ที่ทุกคนใช้อย่างสมาร์ทโฟนที่มีการติดตั้งแอปพลิเคชันที่จัดทำโดยทีม เพื่อให้บุคคลทั่วไปสามารถตรวจหาความผิดปกติของหัวใจได้ด้วยตนเองอย่างสม่ำเสมอ</p>\n<p>โดย AI จะประเมินจากจังหวะและรูปแบบการเต้นของหัวใจและแสดงผลออกมาเป็นแดชบอร์ดพร้อมแสดงความเป็นไปได้ของทิศทางโรคจากค่าความผิดปกติ ช่วยเพิ่มโอกาสการรอดชีวิตให้กับผู้ป่วยหรือผู้ที่มีความเสี่ยงจากโรคหัวใจได้มากขึ้น จากการประเมินตัวเองอย่างสม่ำเสมอ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/92ed3e824bf4c91a4c8f919fefadf570.jpeg\" /></p>\n<p>เทคโนโลยีของ Microsoft Azure ที่ใช้ใน CS-M Tool ได้แก่ API Management / App Service / Azure Active Directory / Azure Blob Storage / Key Vault / Table Storage และบริการอื่น ๆ</p>\n<p><strong>สมาชิกในทีม CS-M Tool</strong></p>\n<ol>\n<li>นายธนภัทร จรัญวรพรรณ</li>\n<li>นายนพวิชญ์ ฉุนรัมย์</li>\n<li>นายแมท แทนไทน คอช</li>\n<li>นายเลนนี โทมัส</li>\n</ol>\n<p>นักเรียนมัธยมศึกษาปีที่ 5 และ 6 โรงเรียนปรินส์รอยแยลส์วิทยาลัย</p>\n<p><strong>ผลการแข่งขัน Imagine Cup 2023 รอบ World Finals</strong></p>\n<ul>\n<li>ผู้ชนะใน <strong>Americas</strong> ได้แก่ ทีม <a href=\"https://imaginecup.microsoft.com/en-us/Team/eab631f9-c30d-4660-8145-fc6a4b547430\">Eupnea</a> จากสหรัฐอเมริกา กับผลงานโซลูชันวิเคราะห์อาการไอด้วย AI เพื่อผู้ป่วยวัณโรค</li>\n<li>ผู้ชนะใน <strong>Asia</strong> ได้แก่ ทีม <a href=\"https://imaginecup.microsoft.com/en-us/Team/1fe3d065-3b95-4239-b2eb-675cd26aaa89\">CS-M Tool</a> จากประเทศไทย</li>\n<li>ผู้ชนะใน <strong>EMEA</strong> ได้แก่ ทีม <a href=\"https://imaginecup.microsoft.com/en-us/Team/af33c180-9772-4790-a2fe-56544e2b91b1\">TAWI</a> จากประเทศเคนยา กับผลงานโซลูชันที่จะมาช่วยแก้ปัญหาด้านการสื่อสารด้วยเทคโนโลยี Speech Recognition แบบเรียลไทม์เพื่อเด็กที่มีความผิดปกติของการประมวลผลการได้ยินหรือ Auditory Processing Disorder (APD)</li>\n</ul>\n<p>ผู้ที่สนใจสามารถติดตามการแข่งขันและเชียร์ทีมต่าง ๆ ในรอบ World Championship ที่งาน <a href=\"https://aka.ms/MSBuildTH\">Microsoft Build</a> ในวันที่ 23 พฤษภาคมนี้</p>\n<p>ผู้ชนะในรอบ World Championship จะได้รับเงินรางวัล 100,000 เหรียญและสิทธิ์เข้าร่วม Mentoring Session แบบตัวต่อตัวกับคุณ Satya Nadella ประธานกรรมการและซีอีโอของไมโครซอฟท์</p>\n<p>ที่มา - <a href=\"https://www.facebook.com/ImagineCupTH\">Imagine Cup Thailand</a> และ <a href=\"https://techcommunity.microsoft.com/t5/student-developer-blog/celebrating-the-innovators-of-tomorrow-announcing-the-top-3/ba-p/3784110\">Student Developer Blog</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/imagine-cup\">Imagine Cup</a></div><div><a href=\"/topics/thailand\">Thailand</a></div><div><a href=\"/topics/competition\">Competition</a></div></div></div>","author":"Phantip","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ede3de0a5b665313fd2200601a46d7f8dbc49d89acfeb723f257ddcc3a9e6c65","category":"Thai"}