{"title":"PSXI-9 Impact of copper dose and soybean oil on in vitro ruminal fermentation products","link":"https://academic.oup.com/jas/article/102/Supplement_3/767/7757867?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The objective of this experiment was to determine the impact of copper (Cu) dose on microbial fermentation products and biohydrogenation of soybean oil (SBO) using an in vitro rumen fermentation technique. Two heifers [body weight (BW) = 408 and 422 kg] fitted with ruminal canulae were fed a high concentrate diet for 14 d. On d 15, rumen fluid samples were obtained 2 h post-feeding from both animals and combined into one pre-warmed (39°C) container. Anaerobic conditions were maintained by bubbling carbon dioxide (CO2) into McDougall’s buffer, while two volumes of rumen fluid were added to each volume of McDougall’s buffer. The suspension was mixed under CO2 as 30-mL portions were added to pre-weighed vaccine bottles containing 0.5 g of substrate (ground basal finishing diet with no supplemental Cu or SBO). The basal diet contained 4.2 mg Cu/kg dry matter (DM). Treatments were assigned to vaccine bottles in a 2 x 3 factorial arrangement with factors being SBO (0 or 3.5%) and Cu (0, 10, or 20 mg/kg DM) relative to substrate DM. Each treatment was replicated 6 times. Following treatment administration, all vaccine bottles were caped and sealed to maintain anaerobic condition and incubated at 39°C. Vaccine bottles were swirled by hand at the time of gas sample collection at 0, 2, 4, 6, 8, 10, 12, 18, 24, 36, and 48 h post-inoculation. Samples were immediately analyzed for methane (CH4) and CO2. Following every gas sampling timepoint, the vaccine bottles were degassed. At the end of the 48-h incubation, all vaccine bottles were centrifuged, and 2 mL of supernatant were removed and acidified with 25% metaphosphoric acid for volatile fatty acid (VFA) determination, and another 5 mL of supernatant were removed and analyzed for long chain fatty acids. The remaining supernatant was decanted, and the vaccine bottles were dried at 60°C for 72 h to determine DM disappearance (DMD). Data were analyzed as a randomized block design for a 2 x 3 factorial arrangement of treatment using PROC MIXED of SAS. Forty-eight hour DMD, CO2 production, molar percent of acetate, propionate, and butyrate, total mM of VFA, and pH were unaffected by treatment. Methane production per unit of DMD decreased (<span>P</span> &lt; 0.05) in fermentation bottles containing SBO but increased (<span>P</span> &lt; 0.04) in fermentation bottles containing Cu. Soybean oil addition increased C16:0, C18:0, C18:1, C18:2, and C18:3 fatty acids at 48 h. Copper addition tended to decrease C18:0 (<span>P</span> &lt; 0.07) and tended to increased C18:1 (<span>P</span> &lt; 0.06) and C18:3 (<span>P</span> &lt; 0.09) fatty acids. These data suggest that Cu may decrease biohydrogenation in vaccine bottles not containing SBO but increases ruminal biohydrogenation in vaccine bottles containing SBO.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ede9e7d8465869a4f6cd7f06cf6b54ad87344af17bc811774338ac677d2c1ce7","category":"Environment"}