{"title":"Remember when Matej Mohoric dropped everyone at Milan-San Remo?","link":"https://www.cyclingtips.com/2023/03/remember-when-matej-mohoric-dropped-everyone-at-milan-san-remo/","date":1679090429000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2022/03/mohoric-milan-san-remo-dropper-post-1-of-1.jpg?width=1200\" alt=\"Remember when Matej Mohoric dropped everyone at Milan-San Remo?\" /></figure>\r\n<p>With the countdown to the 114th Milano-San Remo ticking away, we wonder if we will see more dropper posts. After last year’s harrowing attack on the Poggio descent and lower center of gravity, thanks to the use of a short travel dropper post, there was lots of debate on the subject. The UCI said they are legal, and looking further back to 2017, some neutral support bikes have even been equipped with them, allowing for a quick adjustment until a proper team-issue bike can be supplied.</p>\r\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-812551556-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" />\r\n<figcaption><span>PERIGUEUX, FRANCE – JULY 11: A detail view of the Mavic neutral support bikes with custom dropper seat posts are seen prior to stage 10 of the 2017 Le Tour de France, a 178km stage from Périgueux to Bergerac on July 11, 2017 in Perigueux, France. (Photo by Chris Graythen/Getty Images)</span></figcaption>\r\n</figure>\r\n<p><strong>Also Read:</strong> <a href=\"https://www.cyclingtips.com/2022/03/the-uci-wont-drop-droppers-in-road-races/\" target=\"_blank\">The UCI won’t drop droppers in road races</a></p>\r\n\r\n\r\n\r\n<p>Speaking in the post-race press conference last year immediately following his first monument win, Matej Mohoric explained how he had prepared all winter with San Remo in mind, including working with the team to add the dropper post to his Merida Scultura.</p>\r\n\r\n\r\n\r\n<blockquote>\r\n<p>“I was thinking about this race for the whole winter,” Mohorič said after the race. “The team came up with the idea of using a dropper post because this race suits me pretty well and it has a descent at the end.”</p>\r\n</blockquote>\r\n<p></p>\r\n\r\n\r\n\r\n<figure>While it has been clear that the pro peloton is not adopting the dropper post in any significant way, it has been seen leading into this year’s classics. Will we see it again this weekend? Only time will tell, but we are looking forward to another exciting race. </figure>\r\n<p><strong>Also Read:</strong> <a href=\"https://www.cyclingtips.com/2023/03/the-poggio-milan-san-remos-most-famous-climb-is-not-really-a-climb-at-all/\" target=\"_blank\">The Poggio: Milan-San Remo’s most famous climb is not really a climb at all</a></p>\r\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-1470993493-1340x899.jpg?width=730\" alt width=\"1340\" height=\"899\" />\r\n<figcaption><span>Matej Mohoric of Slovenia and Team Bahrain Victorious attends Strade Bianche 2023 race route on March 03, 2023 in Siena, Italy. (Photo by Sara Cavallini/Getty Images)</span></figcaption>\r\n</figure>","author":"Troy Templin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ee0390c5b2bf61d79e3011bd0b55485c0559a68f843da8a3397f827b397645d9","category":"Cycling"}