{"title":"Balancing bioenergy expansion and restoration: Global shifts in biodiversity intactness","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2664.14695?af=R","date":1719806470000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/78d14404-9a06-4c01-87d3-ba05d6eb6a5a/jpe14695-toc-0001-m.png\" alt=\"Balancing bioenergy expansion and restoration: Global shifts in biodiversity intactness\" />\n<p>While restoration is the best strategy for biodiversity, planting energy crops on agricultural land rather than replacing natural vegetation could minimise losses in biodiversity intactness index. However, achieving targets for bioenergy, climate change and restoration will require strategic land-use planning to minimise ecological compromises.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nTo combat climate change, bioenergy is expected to play a more substantial role in the global energy mix, necessitating the expansion of energy crop plantations during the 21st century. Low-quality or abandoned agricultural land is commonly proposed for growing energy crops. However, restoring such agricultural land back to natural vegetation is also key for global biodiversity conservation and carbon sequestration. Thus, understanding the ecological implications of land-use changes involving both energy crop plantations and restoration is required.\n\nHere, we use biodiversity data to calculate the Biodiversity Intactness Index (BII) in different land uses, including energy crop plantations. We combine our BII models with maps of land use, crop yields and priority areas for restoration to estimate the effects on BII of changes in land use, from the current day, due to bioenergy expansion. We then compare the effects on BII of replacing either any land with energy crops, or only existing agricultural land that is a priority for restoration. Finally, we contrast the effects on BII of planting energy crops versus restoring natural vegetation in priority areas for restoration.\n\nPlanting energy crops in places with relatively high amounts of natural vegetation and high BII would substantially reduce BII.\n\nPlanting energy crops only on existing agricultural land that is a priority for restoration would result in less negative effects on BII than planting such crops in high BII areas, and small increases in BII in places with less remaining natural vegetation. However, restoring natural vegetation in priority areas, rather than expanding energy crops, would result in better outcomes for BII.\n\nContrasting the spatial effects on BII of planting energy crops compared with restoring natural vegetation highlights places where energy crops could be the least detrimental to BII, such as Central Europe and the east coasts of the USA and China.\n\n<i>Synthesis and applications</i>. While restoration is the best strategy for biodiversity, planting energy crops on agricultural land rather than replacing natural vegetation could minimise losses in biodiversity intactness. However, achieving targets for bioenergy, climate change and restoration will require strategic land-use planning to minimise ecological compromises.\n</p>","author":"Sophie Jane Tudge, \nRichard Murphy, \nZoe M. Harris, \nAdriana De Palma","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"ee10d5f70dc17a40faff5a49f9f63583005cc0ff6cd8b532e1367e791e7bb0a7","category":"Environment"}