{"title":"The synergistic immunomodulatory activity of Lycium barbarum glycopeptide and isochlorogenic acid A on RAW264.7 cells","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13972?af=R","date":1729586454000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Regulation of the immune system to maintain homeostasis in the organism has become a focus of research, and the synergistic effect of multi-component complexes will effectively improve the immunomodulatory activity. The present study aimed to investigate the interaction and synergistic immunomodulatory activity of isochlorogenic acid A (IAA) and <i>Lycium barbarum</i> glycopeptide (LbGp).</p>\n<h2>RESULTS</h2>\n<p>The results obtained indicated that non-covalent intermolecular interactions were employed to form the LbGp–IAA complex, with a binding ratio of 135.15 mg g<sup>−1</sup>. The formation of LbGp–IAA complex altered the conformation of LbGp, and IAA was mainly bound to LbGp by van der Waals forces and hydrogen bonds. In addition, LbGp–IAA promoted the proliferation of RAW264.7 cells. The IAA and LbGp interaction had a synergistic effect on the promotion of phagocytosis and the expression of nitric oxide, tumor necrosis faction-<i>α</i> and interleukin-1<i>β</i>, which improved the immunomodulatory effect of LbGp. Furthermore, the combination of LbGp and IAA synergistically inhibited lipopolysaccharide-induced inflammatory response.</p>\n<h2>CONCLUSION</h2>\n<p>In summary, the binding of IAA enhanced the immunomodulatory activity of LbGp and coordinated the immune response, and did not trigger an inflammatory response, which was potentially attributed to the alteration of spatial structure of LbGp through the binding of IAA. The results provide new perspectives for the study of glycopeptide–polyphenol interactions. © 2024 Society of Chemical Industry.</p>","author":"Ge Xu, \nZhipeng Yu, \nWenzhu Zhao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"ee1e1549089a85a8228a616a1ffd23e74a44525e75dbe2c125f3d6e346560688","category":"Environment"}