{"title":"Musical saddles: making sense of pro team rider changes for 2021","link":"https://www.cyclist.co.uk/in-depth/9373/musical-saddles-making-sense-of-pro-team-rider-changes-for-2021","date":1615914878000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/felix-lowe\">Felix Lowe</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-03-17T09:49:00+00:00\">17 Mar 2021</span></div>    </div></div><p class=\"short-teaser\">\nRiders have been swapping teams and teams have been changing names and kit. Felix Lowe tries to makes sense of it all</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/03/team_musical_chairs_1_froome.jpg?itok=umk2Ppi3\" />  </div>\n<div class=\"field field-name-body\">\n      <p> <strong>Riders have been swapping teams and teams have been changing names and kit. Felix Lowe tries to makes sense of it all</strong></p>\n<p><strong>Words</strong>: Felix Lowe <strong>Photography</strong>: Veloimages; KBMB</p>\n<p><a href=\"/tags/uae-team-emirates\">UAE Team Emirates</a> missed a trick when they failed to announce their latest recruit with the accompaniment of Bonnie Tyler’s song ‘Here She Comes’. Geddit – Hirschi comes? Never mind.</p>\n<p>Marc Hirschi’s controversial arrival from Sunweb raised eyebrows, coming as it did after a mysterious contract severance that required a non-disclosure agreement. We can only speculate, but a hefty pay hike may have played a part.</p>\n<p>And so the man who made ripples on his <a href=\"/tags/tour-de-france\">Tour de France</a> debut last year will join the man who won it on his own debut, with the stylish Swiss putting his personal ambitions on hold in support of <a href=\"/tags/tadej-pogacar\">Tadej Pogačar</a>.</p>\n<p>The Slovenian sensation will have extra support in the form of Rafał Majka (from <a href=\"/tags/bora-hansgrohe\">Bora-Hansgrohe</a>) and Matteo Trentin (from CCC) as UAE beef up their roster. As for Hirschi, perhaps he felt cramped by the arrival of <a href=\"/tags/romain-bardet\">Romain Bardet</a> at Sunweb, which has now morphed into the new-look <a href=\"/tags/team-dsm\">Team DSM</a>, and whose black kit with a double blue stripe down the middle is a nod to the Sky togs of old.</p>\n<p>DSM are certainly struggling to keep their best assets. A year after losing <a href=\"/tags/tom-dumoulin\">Tom Dumoulin</a> they have lost Wilco Kelderman to Bora-Hansgrohe and Michael Matthews to <a href=\"/tags/team-bikeexchange\">the latest GreenEdge generation</a>. The Australian team are now BikeExchange, which is appropriate having just exchanged their Scott bikes for Bianchis.</p>\n<div id=\"file-44054\" class=\"file file-image file-image-jpeg file-content-original\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/03/team_musical_chairs_2_ag2r.jpg\" alt=\"\" />  </div>\n</div>\n<p>The Aussie team was also home to the previously inseparable Yates twins, but now only Simon is staying Down Under while brother Adam jumps ship to <a href=\"/tags/team-ineos\">Ineos Grenadiers</a>, where he’s joined by fellow Brit <a href=\"/tags/tom-pidcock\">Tom Pidcock</a> on his first senior pro contract, and the Aussie veteran <a href=\"/tags/richie-porte\">Richie Porte</a>, who returns following a career-first Tour podium with <a href=\"/tags/trek-segafredo\">Trek-Segafredo</a>.</p>\n<p>Ineos have looked to weaken rivals <a href=\"/tags/jumbo-visma\">Jumbo-Visma</a> by poaching the promising Belgian Laurens De Plus, who will be replaced by another DSM defector in Dutchman Sam Oomen. The Killer Bees are otherwise largely unchanged – although they have, unlike Ineos, moved with the times <a href=\"/news/8823/jumbo-visma-announce-womens-team-for-2021\">by launching a women’s team</a>.</p>\n<p>Three-time world champion Marianne Vos comes in as figurehead (quite a coup given they are not yet in the WorldTour) while CCC-Liv, the team she still co-owns, have also lost the <a href=\"/sponsored/9302/cyclist-s-31-inspirational-women-no12-ashleigh-moolman-pasio\">inaugural Esports World Champion Ashleigh Moolman-Pasio</a> to SD Worx.</p>\n<p>The CCC men’s team, meanwhile, have been bought out by Intermarché-Wanty-Gobert Matériaux, who join the top table with little Louis Meintjes as their GC capture from Education First.</p>\n<p>That team is now <a href=\"/tags/ef-education-nippo\">EF Education-Nippo</a>, and as well as losing Meintjes they are witnessing the exodus of Dauphiné champion Dani Martínez to <a href=\"/tags/team-ineos\">Ineos Grenadiers</a>, and Michael Woods and Sep Vanmarcke to the burgeoning retirement powerhouse that is <a href=\"/tags/israel-start-up-nation\">Israel Start-Up Nation</a>.</p>\n<p><a href=\"http://www.dennismags.co.uk/cyclist\"><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/01/clickable_subs_promo.jpg\" alt=\"click to subscribe\" border=\"0\" /></a></p>\n<p>Already at the team is <a href=\"/tags/chris-froome\">Chris Froome</a>, who may struggle to rediscover the form that won him four Tours but will sport one of the best new kits in the peloton – a slick dark blue and white number that will also cover the torsos of Daryl Impey and Alessandro De Marchi.</p>\n<p>Most interestingly, ISUN have made a huge statement <a href=\"/sponsored/9297/cyclist-s-31-inspirational-women-no7-cherie-pridham\">by bringing in Cherie Pridham</a>, the first female directeur sportif in the men’s WorldTour.</p>\n<div class=\"field field-name-field-see-related field-type-node-reference field-label-above\">      <div class=\"field-label\">See related&nbsp;</div>\n  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/news/9380/womens-tour-set-for-its-first-time-trial-as-more-2021-start-and-finish-towns-announced\">Women&#039;s Tour set for its first time-trial as more 2021 start and finish towns announced</a></div>      <div class=\"field-item odd\"><a href=\"/news/9374/tour-of-britain-2021-start-and-finish-destinations-announced\">Tour of Britain 2021 start and finish destinations announced</a></div>      <div class=\"field-item even\"><a href=\"/in-depth/2305/womens-tour-route-riders-and-all-you-need-to-know\">Women&#039;s Tour 2021: Route, riders and all you need to know</a></div>      <div class=\"field-item odd\"><a href=\"/news/913/tour-of-britain-route-riders-live-tv-guide-all-you-need-to-know\">Tour of Britain 2021: Route, teams and all you need to know</a></div>    </div></div><p>\nTalking of kits it would be remiss not to mention <a href=\"/tags/ag2r-citroen\">AG2R-Citroën</a>, who now sport a sponsor-heavy sash jersey that is even more Marmite than their continued dedication to brown shorts.</p>\n<p>Maybe that’s what scared Bardet off, but the team is no weaker for his absence thanks to the recent arrivals of <a href=\"/tags/greg-van-avermaet\">Greg Van Avermaet</a> from CCC, Bob Jungels from QuickStep, Ben O’Connor from NTT and Lilian Calmejane from Direct Énergie.</p>\n<p>One team that certainly looks weaker going into 2021 is <a href=\"/tags/astana\">Astana</a>. The Kazakh-backed team have lost their main GC threat, Miguel Ángel López, who joins veteran Alejandro Valverde at Movistar <a href=\"/news/8964/miguel-angel-lopez-leaves-astana-for-movistar\">despite their previous war of words</a>.</p>\n<p>Thankfully <a href=\"/news/9142/netflix-and-movistar-to-return-for-a-second-series-this-spring\">Netflix is on board to film the fireworks for a second series</a>. Movistar are further strengthened on the women’s side by the arrival of <a href=\"/sponsored/9293/cyclists-31-inspirational-women-no3-annemiek-van-vleuten\">Dutch superstar Annemiek van Vleuten</a>.</p>\n<p>Having <a href=\"/news/9001/rod-ellingworth-leaves-bahrain-mclaren\">never really settled at Bahrain-McLaren</a>, manager Rod Ellingworth has rejoined Ineos as director of racing while his former protégé <a href=\"/tags/mark-cavendish\">Mark Cavendish</a> swaps the red kit of the newly minted Bahrain Victorious <a href=\"/in-depth/9117/what-will-mark-cavendish-bring-to-deceuninck-quickstep\">for the dark blue of Deceuninck-QuickStep</a>.</p>\n<p>Cav may struggle to win the four Tour stages he needs to draw level with Merckx’s record, but he’ll be relieved to have one last throw of the dice with his former team. And on his own road to recovery, Fabio Jakobsen couldn’t have a better mentor. </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/cyclists\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Cyclists</a></div>    </div></div>","author":"mjames","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"ee29222cdabf6fda2efe5b65bcf65b2c9c502160375660be95193cbd04974b26","category":"Cycling"}