{"title":"Lina Khan, Big Tech skeptic, named FTC chair mere hours after confirmation","link":"https://arstechnica.com/?p=1774022","date":1623859317000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/GettyImages-1232438401-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/GettyImages-1232438401.jpg\">Enlarge</a> <span>/</span> Lina M. Khan testifies during a Senate Commerce, Science, and Transportation Committee nomination hearing on Capitol Hill on April 21, 2021, in Washington, DC. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/commissioner-nominee-lina-m-khan-testifies-during-a-senate-news-photo/1232438401?adppopup=true\">Graeme Jennings-Pool/Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>President Joe Biden named Lina Khan chair of the Federal Trade Commission just hours after her confirmation in the Senate as one of the agency's five commissioners. It’s an unusual move—newly nominated commissioners are seldom elevated to chair immediately—and it likely signals that the Biden administration will be taking a hawkish approach to antitrust enforcement, particularly when it comes to Big Tech platform companies like Google, Amazon, Facebook, and Apple.</p>\n<p>Though Khan is certain to take a harsher view on platforms, the FTC is unlikely to begin dismantling Big Tech tomorrow. “Lina Khan has pushed the academic conversation on tech, and now she has to push the agenda at the FTC,” <a href=\"https://www.hbs.edu/faculty/Pages/profile.aspx?facId=718917\">Shane Greenstein</a>, a professor at Harvard Business School, told Ars. “A lot of the day to day at the FTC has little to do with tech, and a lot of the agenda is just not up to the chairman. It comes inbound from consumer complaints, merger proposals, etc. It will be interesting to see how she manages that—and with a divided Congress. That just has to be challenging.”</p>\n<p>While she may have a rocky trail ahead of her, Khan’s confirmation vote of 69-28 was relatively straightforward by modern standards. Her nomination was expected as far back <a href=\"https://arstechnica.com/tech-policy/2021/03/white-house-reportedly-plans-to-name-amazon-foe-lina-khan-to-ftc/\">as early March</a>, but her elevation to chair came as a surprise. “If you walk back through the modern or earlier history of the FTC, I can’t remember an instance where the White House has named an individual to be a commissioner, then once that person was confirmed by the Senate, designated that person to be the chair,” William Kovacic, former FTC chair, said to <a href=\"https://www.axios.com/lina-khan-ftc-chair-tech-24fa3aa0-d3ba-47b0-bbda-db87f401ac25.html\">Axios</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1774022#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1774022&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ee33c34a25d5c080a28b251d26c4e7757e0bdd1b60c102a121f2010bc9fd66ac","category":"Tech"}