{"title":"Correlation Among Maternal and Infant Factors, Social Support and Breastfeeding Self-efficacy: A Cross-sectional Study in Indonesia","link":"https://www.preprints.org/manuscript/202410.1962/v1","date":1729786403000,"content":"Background: Breastfeeding self-efficacy is a critical factor influencing the initiation and continuation of breastfeeding among mothers. Low self-efficacy affects mothers’ ability to sustain breastfeeding. Several studies have investigated the factors influencing breastfeeding self-efficacy, but none have interconnected maternal, infant, and social support factors. Aims: This study aimed to measure the correlation between maternal and infant factors, social support, and breastfeeding self-efficacy. Methods: A cross-sectional approach was employed in Jember, Indonesia, among 200 breastfeeding mothers. The study population consisted of mothers 17-42 years old who were breastfeeding and who met the following inclusion criteria: mothers who have babies aged 1-6 months, term pregnancy history, wanted pregnancy, and baby weight born ≥ 2500 grams. Maternal and infant factors and social support were determined through interviews and questionnaires. Breastfeeding self-efficacy was examined using The Breastfeeding Self-efficacy Scale Short. The multiple logistic analysis was used for multivariate analysis. Results: Of a total of 200 breastfeeding mothers, 63% had low breastfeeding self-efficacy, and 59.5% of mothers did not exclusively breastfeed. The multiple logistic regression indicated that 74.2% of the factors included in the model influenced breastfeeding self-efficacy. Positive correlations were observed between breastfeeding self-efficacy and feeding type (OR=6.603), breastfeeding frequency (OR=6.220), breastfeeding intention (OR=4.993), and family type (OR=4.001). Conclusion: feeding type, breastfeeding frequency, and family support were the important factors that support breastfeeding self-efficacy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ee3fd04206a79a7e5c3faad69e5402ab7e1fc48db980500b6acd130f18163bff","category":"Interdisciplinary"}