{"title":"Performance evaluation of a bifacial floating standalone photovoltaic system with different water bodies: An experimental investigation of 10E analysis","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14487?af=R","date":1729137339000,"content":"<h2>Abstract</h2>\n<p>This study delves into harnessing solar energy potential through innovative floating bifacial solar power generation systems. Employing a comprehensive 10E analysis—encompassing Energy, Exergy, Economic, Environmental, Energo-economic, Exergo-economic, Enviro-economic, Energo-environmental, Exergo-environmental, Energy Payback Time, and Embodied Energy factors—the research evaluates energy performance, economic viability, and environmental impact. Among coolants, fresh water exhibited optimal performance, with peak output power (399 W), final yield (371.9351 W), and performance ratio (59.08173655). Capacity utilization factors were comparable (~0.516), with fresh water (0.5165764992) and black water (0.5154933033) excelling. Fresh water also minimized energy loss (−365.639816266105). Exergy efficiency peaked with fresh water (32.10%). Energo-economic Analysis indicated lower LCOE (3.39 $/MWh) and higher enviro-economic parameter (243.4965981) for Fresh Water. Exergo-environmental Analysis showed consistent efficiency across conditions (exergy performance time [EPT]: 37.28410450–37.35602872). The Embodied Energy for panels was 2840.67 kWh/kg. Freshwater emerges as the frontrunner, offering high energy efficiency, minimized energy loss, and environmental sustainability. Embracing freshwater coolant opens avenues for inventive and environmentally conscious solar energy solutions in buoyant applications.</p>","author":"Ganesan Rathinavel Pandian, \nGurukarthik Babu Balachandran, \nPrince Winston David, \nHariharasudhan Thangaraj","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"ee4655f3bb66a04dbd1b77e5524a8e7a5b5e63425bb7565e3af9f53afc764533","category":"Environment"}