{"title":"Optical Detection of Underwater Propeller Wake Based on a Position-Sensitive Detector","link":"https://www.preprints.org/manuscript/202407.0992/v1","date":1720766438000,"content":"The study of underwater vehicle wake detection is of significant importance within the field of target detection, localisation and tracking of underwater vehicles. Given that propellers are the propellers of modern ships and underwater vehicles, the propeller wake field represents the principal target source for wake detection in underwater vehicles. The objective of this paper is to propose a method for measuring the wake of an underwater propeller based on a position-sensitive detector. A theoretical model of the relationship between the laser spot displacement and the change of refractive index of the wake field is established on the basis of the principle of laser beam deflection. A prototype experimental setup for underwater propeller wake measurement was constructed based on the aforementioned optical measurement method. Furthermore, the simulation of the propeller wake flow field with strong density stratification and linear density stratification was conducted based on the experimental setup. In the experiment, a three-bladed propeller with a diameter of 39mm was selected, the water tank size was 980mm×380mm×380mm, and the laser acted at a distance of 550 mm from the propeller. The experimental results indicate that the wake dissipation time of the propeller in a strong density-stratified water environment is approximately 800s. Following the stabilization of the wake field density, the laser spot position is observed to be stable at 0.341 mm, with a corresponding refractive index change of 2.99×10-6 RIU. The wake dissipation time of the propeller in a linear density-stratified water environment is approximately 750 s. Once the wake field density has reached a stable state, the laser spot position is found to be 0.441mm, corresponding to a refractive index change of 3.87×10-6 RIU. These experimental results are found to be in general agreement with the simulation results of the propeller wake field. A comparison of the experimental device-based wake measurements with the CTD-based wake measurements reveals a consistent trend.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ee60485cedf98330fdb53cf65b9fdc0b3486c99dc38f60287e0418dc6c72fb69","category":"Interdisciplinary"}