{"title":"Acoustic Characterization of Potential Quiet Areas in Dortmund, Germany","link":"https://www.preprints.org/manuscript/202402.1382/v2","date":1710159431000,"content":"German noise action plans aim to reduce negative health outcomes from noise exposure and identify quiet areas free of noise pollution. Quiet area identification in German noise action plans is based primarily on noise mapping and spatial analysis and not empirical or qualitative data about acoustic environments, thus leaving a gap in the understanding of the quality of formally recognized quiet areas in noise action plans. This work presents a comparative empirical case study in Dortmund, Germany, with the aim to describe the diurnal dB(A) and biophonic properties of quiet areas versus noise 'hot spots'. Sound observations were collected (n=282,764) in five different natural or recreational land use patch types larger than four acres within 33 proposed quiet areas in Dortmund (n=70) and 23 noise hot spots between April 27th, 2022 and March 2nd, 2023. We find that quiet areas are on average more than 20 dB(A) quieter than noise hot spots almost every hour of the day. Forests, managed tree stands, cemeteries, and agriculture diel patterns are dominated by dawn dusk chorus in spring and summer, whereas sport and recreation as well as noise hot spots are dominated by traffic and human noise. A novel composite biophony mapping procedure is presented that finds distinct temporal distribution of biophony in forested and agriculture peri-urban locations positively associated with patch size, distance away from LDEN &gt; 55, proximity to water, and the number of vegetation layers in the plant community. Anthrophony distribution dominates urban land uses in all hours of the day, but expands during day and evening and contracts at night and in dusk hours. The procedures presented here illustrate how qualitative information regarding quiet areas can be integrated into German noise action planning.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ee70b28539d81c77d82ca04412f1deb659529efa688cb830b2f69a331f5e89cc","category":"Interdisciplinary"}