{"title":"Environmental Suitability Predictions for the Distribution and Potential Cultivation of Artemisia afra","link":"https://www.preprints.org/manuscript/202410.1384/v1","date":1729168859000,"content":"Cultivation is advocated as a solution for sustainable exploitation of medicinal plants. Understanding environmental factors influencing plant species distribution will eliminate the introduction of medicinal plants indiscriminately to inappropriate cultivation regions. The study investigated environmental conditions for the distribution of Artemisia afra and mapped out potential areas for its cultivation in South Africa. Soil samples were collected in the Free State Province in South Africa for analysis. To identify suitable environmental conditions for the natural distribution of A. afra, the South African National Botanical Institute database and physically collected Global Positioning System points were used in maximum entropy model. Monthly long-term average interpolated weather surfaces were used to estimate the effect of climate change on future climate suitability for A. afra distribution. Sixty-one percent of soil samples from different A. afra populations were clay loam soils with slightly acidic to neutral pH. The carbon source utilization, Shannon Weaver Index, and species richness were positively correlated to one group of fourteen soil samples, and species evenness was positively correlated to the second group, consisting of four samples. Climate change will only affect the distribution of A. afra in the very long term. The current study provides critical information for identifying suitable cultivation areas for A. afra, while supporting conservation efforts from an ecological point.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ee7ae08842b6acd59c6a406aa8e5d3acb0aed9e134413c9df2278d0190d00ead","category":"Interdisciplinary"}