{"title":"A Completely Different and Innovative Bio-Inspired Metaheuristic Approach for Effectively Solving Complex Optimization Problems Across Various Domains","link":"https://www.preprints.org/manuscript/202409.1803/v1","date":1727147518000,"content":"In this paper, a completely different metaheuristic algorithm called the Orangutan Optimization Algorithm (OOA) is introduced, which replicates the complex and adaptive behaviors of Orangutans in their natural habitat. The main inspiration for OOA lies in the strategic foraging techniques of Orangutans, alongside their highly developed nesting abilities. More words are used to provide a detailed theoretical explanation of OOA, followed by a comprehensive modeling of the algorithm’s implementation in two key phases: exploration and exploitation. These phases are mathematically structured to ensure the balance required for optimal search processes. The performance of OOA is rigorously evaluated using twenty-nine benchmark functions from the CEC 2017 test suite, with problem dimensions of 10, 30, 50, and 100. More sentences are included to elaborate on the optimization outcomes, which reveal that OOA effectively balances the exploration and exploitation stages, yielding suitable and competitive solutions across the benchmark functions. Additionally, to further validate its quality, the results from OOA are compared against twelve other well-established metaheuristic algorithms. The analysis of these simulation results demonstrates that OOA consistently outperforms competing algorithms by achieving superior results across most benchmark functions. Furthermore, to assess its real-world applicability, OOA is implemented on a set of twenty-two constrained optimization problems drawn from the CEC 2011 test suite. The extended simulation results clearly indicate that OOA is highly efficient in solving real-world optimization challenges, consistently delivering a superior performance when compared to other competitor algorithms.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ee848e8cc00be715aa736ebe7aa7248d2aadfadce1e9c0421f1d65aae120130e","category":"Interdisciplinary"}