{"title":"British Cycling announces impressive World Championships roster","link":"https://www.cyclist.co.uk/news/10084/british-cycling-announces-impressive-world-championships-roster","date":1631528411000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>13 Sep 2021</span></div>    </div></div><p>\nTom Pidcock, Lizzie Deignan and Ethan Hayter lead GB's hope for rainbow in Belgium next week</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2020/09/tom-pidcock.jpg?itok=wCzuQifL\" />  </div>\n<div>\n      <p> British Cycling has announced a star-studded roster for the <a href=\"https://www.cyclist.co.uk/news/10017/flanders-uci-road-cycling-world-championships-2021-key-information\">UCI Road World Championships</a> in Flanders, which begins in just five days, with the likes of <a href=\"https://www.cyclist.co.uk/tags/tom-pidcock\">Tom Pidcock</a>, Lizzie Deignan and Ethan Hayter earning selection.</p>\n<p>The Men’s Elite Road Race team comprises <a href=\"https://www.cyclist.co.uk/tags/mark-cavendish\">Mark Cavendish</a>, who recently tied Eddy Merckx’s record for stage victories at the Tour de France, and Tour of Norway winner Hayter.</p>\n<p>Tokyo 2020 mountain-bike gold medalist Pidcock and Jake Stewart are also included after their phenomenal 2021 seasons, as well as Ben Swift, Connor Swift, Luke Rowe and Fred Wright. Hayter will also participate in the Men’s Elite Time-Trial with Dan Bigham.</p>\n<p>Former road race World Champion Deignan is scheduled to ride the Women’s Elite Road Race with Anna Shackley after the pair united for the road race at the Tokyo Olympics Games.</p>\n<p>They will line up with Alice Barnes and Anna Henderson, as well as Pfeiffer Georgi and Joss Lowden. Georgi and Lowden are also set to represent in the Women’s Elite Time-Trial.</p>\n<p>Lowden is coming into the World Championships on fine form, beginning her season by unofficially breaking the Hour Record and stating her intentions to officially attempt the Hour Record this month.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/buying-guides/10066/what-s-the-difference-between-shimanos-road-groupsets\">What’s the difference between Shimano's road groupsets?</a></div>      <div><a href=\"/8745/campagnolo-ekar-13-speed-1x-gravel-groupset\">Campagnolo goes 13-speed with its Ekar 1x gravel groupset</a></div>      <div><a href=\"/news/6146/campagnolo-launches-12-speed-super-record-eps\">Campagnolo launches 12-speed Super Record EPS</a></div>      <div><a href=\"/news/6342/campagnolo-chorus-12-speed-groupset\">Campagnolo Chorus 12-speed groupset review</a></div>    </div></div><p>\nThe Drops Le Col rider is pencilled in for the newer event of the Mixed Team Time Trial too, with Dan Bigham as their team leader. An exciting discipline that pairs some of Britain’s best women and men together, Alex Dowsett, John Archibald, Alice Barnes and Anna Henderson are set to post a blistering time.</p>\n<p>Participants for the U23 Men are Lewis Askey, Robert Donaldson, Oliver Stockwell, Ethan Vernon (Road and TT) and Sam Watson. The Junior Men includes Finlay Pickering (Road and TT) and Junior CiCLE Classic winner Joshua Tarling (Road and TT), in addition to Jack Brough and Junior Tour of Yorkshire winner Max Poole.</p>\n<p>Lining up for the Junior Women will be Zoe Bäckstedt (Road and TT) and Maddie Leech (Road and TT) with Millie Couzens – who recently won three gold medals at the European Track Cycling Championships – and Flora Perkins.</p>\n<p>Bäckstedt won the Junior Tour of Yorkshire in June, with Couzens second and Perkins third. Couzens, Leech and Bäckstedt also recently won gold in the European Track Cycling Championships in the Women’s Junior Team Pursuit, setting a world record in the process.</p>\n<h3>Dates:</h3>\n<p>Sunday 19th September, Men’s Elite Individual Time Trial<br />\nMonday 20th September, Men’s U23 Individual Time Trial<br />\nMonday 20th September, Women’s Elite Individual Time Trial<br />\nTuesday 21st September, Women’s Junior Individual Time Trial<br />\nTuesday 21st September, Men’s Junior Individual Time Trial<br />\nWednesday 22nd September, Team Time Trial Mixed Relay<br />\nFriday 24th September, Men’s Junior Road Race<br />\nFriday 24th September, Men’s U23 Road Race<br />\nSaturday 25th September, Women’s Junior Road Race<br />\nSaturday 25th September, Women’s Elite Road Race<br />\nSunday 26th September, Men’s Elite Road Race </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"ee88ab109ff4f83891731db9dd5b467cc8873c6852d9d4755ee0fb87947fa077","category":"Cycling"}