{"title":"Preview: Your guide to the 2021 Milan-San Remo","link":"https://cyclingtips.com/2021/03/preview-your-guide-to-the-2021-milan-san-remo/","date":1616029579000,"content":"<p><em>The first Monument of the season is upon us. After last year&#8217;s edition was moved to August (thanks COVID!) Milan-San Remo is back in its traditional March timeslot. Here&#8217;s what you should know ahead of Saturday&#8217;s 112th edition of &#8216;La Classicissima&#8217;.</em></p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<h2>The course</h2>\n\n\n\n<p>Spanning a lengthy 299 km from Milan to (you guessed it) San Remo, Saturday&#8217;s race is the longest day of racing on the pro calendar. The route is different from last year (which was re-routed out of certain areas due to COVID concerns) and different from the &#8216;classic&#8217; Milan-San Remo route which takes the riders to the Mediterranean coast via the Passo del Turchino. That particular climb is off-limits this year due to landslides.</p>\n\n\n\n<p>The basics of the route are the same though: head south-ish from Milan to the coast, this time via the Colle del Giovo, before the south-western run towards San Remo.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"852\" height=\"852\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/MSR-2021-map.jpeg\" alt=\"\" class=\"wp-image-501580\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/MSR-2021-map.jpeg 852w, https://cyclingtips.com/wp-content/uploads/2021/03/MSR-2021-map-650x650.jpeg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/MSR-2021-map-190x190.jpeg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/MSR-2021-map-16x16.jpeg 16w\" sizes=\"(max-width: 852px) 100vw, 852px\" /></figure>\n\n\n\n<p>The most important part of the race remains the same. The final 60 km features the short ascents of the Capo Mele, Capo Cervo and Capo Berta, on approach to the race&#8217;s two main climbs.</p>\n\n\n\n<p>The Cipressa starts 27 km from the finish and is 5.6 km at 4.1%. That&#8217;s followed by the final and most important ascent: the Poggio. Starting at 9 km from the finish line, the Poggio is 3.7 km at 4%. After a winding descent back to the coast, the riders have 2 km of fast and flat roads before the finish.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1280\" height=\"852\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/MSR-2021-profile.jpeg\" alt=\"\" class=\"wp-image-501583\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/MSR-2021-profile.jpeg 1280w, https://cyclingtips.com/wp-content/uploads/2021/03/MSR-2021-profile-650x433.jpeg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/MSR-2021-profile-190x126.jpeg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/MSR-2021-profile-1080x719.jpeg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/MSR-2021-profile-16x11.jpeg 16w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" /></figure>\n\n\n\n<h2>How it might unfold</h2>\n\n\n\n<p>Milan-San Remo is regarded as the sprinters&#8217; Monument and the race does often finish in a reduced bunch sprint. While the Cipressa and Poggio do tend to shred the peloton (more a function of the high racing tempo rather than the difficulty of the climbs), many sprinters are able to make it over the top still in contention.</p>\n\n\n\n<p>That said, a decent-sized group is far from a certainty at the finish. In the past 10 editions of Milan-San Remo, one was won solo (Vincenzo Nibali in 2018), one was decided from a group of two (last year), two finished with a group of three (2017 and 2012), and a total of seven finished with 10 riders or fewer in the front group. The other three editions had groups of 25, 26 and 31.</p>\n\n\n\n<p>What does that tell us? Well, it could go one of a couple different ways. The Poggio is again likely to be the most decisive part of the race. Most of the time when it&#8217;s a small group that breaks clear, it does so on the Poggio. Sprinters looking for victory will either need to stay in contact over that final climb, or hope there&#8217;s enough firepower left in the bunch to help chase down anyone that gets away.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/CORVOS_00027733-025-1340x894.jpg\" alt=\"\"/><figcaption>Peter Sagan (left), Michal Kwiatkowski (centre) and Julian Alaphilippe battling it out for the 2017 edition after getting away on the Poggio.</figcaption></figure>\n\n\n\n<h2>The favourites</h2>\n\n\n\n<p>As at Strade Bianche, there are three clear favourites for Milan-San Remo. The same three favourites we&#8217;ll likely be talking about at most of the big one-day races for the next few years: <strong>Wout van Aert</strong> <strong>(Jumbo-Visma)</strong>, <strong>Mathieu van der Poel</strong> <strong>(Alpecin-Fenix)</strong> and <strong>Julian Alaphilippe</strong> <strong>(Deceuninck-QuickStep)</strong>.</p>\n\n\n\n<p>Van Aert starts Saturday&#8217;s race as the defending champion (he beat Alaphilippe in a two-up sprint last year after the pair got clear on the Poggio). The in-form Belgian is coming off a brilliant Tirreno-Adriatico where he finished second overall(!) after winning a bunch sprint, the final-stage time trial, and after climbing better than most of the stage-race specialists.</p>\n\n\n\n<p>Van Aert can do it all and has the tools to win on Saturday either with a late move, or in a reduced bunch sprint. There&#8217;s every chance that, by Saturday evening, he&#8217;ll be the first back-to-back Milan-San Remo winner since Erik Zabel in 2000-2001.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/milan-san-remo-2020-kramon-27.jpg\" alt=\"\"/><figcaption>More of this on Saturday?</figcaption></figure>\n\n\n\n<p>Van der Poel might have other ideas though. The Dutchman has been equally brilliant in 2021, if not more so, with a stage win at the UAE Tour, an utterly imperious victory at Strade Bianche, and two stage wins at Tirreno-Adriatico, one of them via a trademark 50 km solo effort.</p>\n\n\n\n<p>Like Van Aert, Van der Poel can win Milan-San Remo regardless of how those final kilometres play out. He&#8217;s got the strength to get away on the Poggio and he can certainly win a bunch sprint. A long-range solo move isn&#8217;t out of the question either &#8230;</p>\n\n\n\n<p>And then there&#8217;s the world champion, Alaphilippe. The Frenchman won this race in 2019 from a group of 10, he was third in the winning trio in 2017, and he was second last year behind Van Aert. Recent editions suggest his best chance of victory will be another full-gas attack on the Poggio in an attempt to distance the top sprinters. If he&#8217;s on a good day – and his form suggests he will be – few will be able to follow when he inevitably makes his move.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/alaphilippe-poggio-2019-milan-sanremo-1340x894.jpg\" alt=\"\"/><figcaption>Alaphilippe attacking on the Poggio has become a common sight in recent editions.</figcaption></figure>\n\n\n\n<p>Note that Alaphilippe has the luxury of a truly stacked Deceuninck-QuickStep team behind him. While the world champ will almost certainly do his thing on the Poggio, if it all comes back together for a bunch sprint, Sam Bennett – currently the world&#8217;s best sprinter – should be there. </p>\n\n\n\n<p>The Belgian squad also has Davide Ballerini who&#8217;s been one of the standout performers so far this season. The Italian took two stage wins at the Tour de la Provence, he won Omloop Het Nieuwsblad, he can climb well, and he can certainly sprint. He&#8217;s another very dangerous option for the strongest team on the startlist.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/02/ballerini_ohn-1340x893.jpg\" alt=\"\"/><figcaption>Here&#8217;s Ballerini winning Omloop Het Nieuwsblad.</figcaption></figure>\n\n\n\n<h2>The challengers</h2>\n\n\n\n<p>Odds are that one of Van Aert, Van der Poel or Alaphilippe will win on Saturday. But there are plenty of riders who&#8217;ll be doing their best to ensure they don&#8217;t. Here are some of the most promising challengers.</p>\n\n\n\n<p><strong>Michael Matthews (BikeExchange)</strong> has been on the podium twice at Milan-San Remo (he won the bunch sprint for third last year) and comes in as a real threat for Saturday. Now back at BikeExchange, he&#8217;s shown some promising form this season, with two third-place finishes at Paris-Nice last week. He&#8217;ll want it to come to a reduced bunch and for the other fast finishers to be distanced.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"894\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032346-229-1340x894.jpeg\" alt=\"\" class=\"wp-image-501585\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032346-229-1340x894.jpeg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032346-229-650x434.jpeg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032346-229-190x127.jpeg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032346-229-1080x721.jpeg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032346-229-16x11.jpeg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032346-229.jpeg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Matthews (right) was third last year.</figcaption></figure>\n\n\n\n<p><strong>Caleb Ewan (Lotto Soudal) </strong>is another Australian who&#8217;s won the bunch sprint for the minor placings at Milan-San Remo (in 2018 when Nibali won solo). He was also 10th back in 2017. Like Matthews, Ewan has shown some good signs this year, winning a stage at the UAE Tour and taking a few other podiums. He too will want a reduced bunch sprint, ideally without Sam Bennett and other top sprinters there.</p>\n\n\n\n<p>Note that Ewan abandoned Tirreno-Adriatico early with gastro. His team said he wasn&#8217;t too badly affected – they wanted to make sure he was well recovered before Milan-San Remo. Hopefully he&#8217;s fighting fit by Saturday.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032914-039-1340x893.jpeg\" alt=\"\" class=\"wp-image-501588\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032914-039-1340x893.jpeg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032914-039-650x433.jpeg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032914-039-190x127.jpeg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032914-039-1080x720.jpeg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032914-039-16x11.jpeg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032914-039.jpeg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Ewan won a stage of the recent UAE Tour.</figcaption></figure>\n\n\n\n<p>On the subject of Lotto-Soudal, we need to mention <strong>Philippe Gilbert</strong>. It&#8217;s no secret that Gilbert desperately wants to win this race, to become only the fourth rider in history to win all five Monuments.</p>\n\n\n\n<p>That might seem to clash with Ewan&#8217;s ambitions, but Gilbert&#8217;s best chance probably comes from following (or initiating) moves on the Poggio in the hope of getting into a select lead group, while Ewan&#8217;s best chance will come from a bigger bunch.</p>\n\n\n\n<p><s><strong>Mads Pedersen (Trek-Segafredo) </strong>is on debut at Milan-San Remo but a top finish wouldn&#8217;t be a huge surprise. The former world champion shouldn&#8217;t be fazed by the climbs, and he&#8217;s quickly establishing himself as one of the top sprinters in hard and hilly races. He recently won Kuurne-Brussels-Kuurne and has three other sprint podiums to his name this year. Keep an eye out for the Dane.</s> <strong>Sadly, Pedersen doesn&#8217;t appear to be racing after all. </strong></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/02/mads-pedersen-kuurne-brussels-kuurne-1-of-1-1080x720.jpg\" alt=\"\"/><figcaption>Pedersen winning the recent Kuurne-Brussels-Kuurne.</figcaption></figure>\n\n\n\n<p>Keep <strong>Nacer Bouhanni (Arkea-Samsic)</strong> in mind as well. The French sprinter has finished inside the top 10 on three occasions in the past, and with four podium finishes so far this year, he could be heading for a big result.</p>\n\n\n\n<p>It&#8217;s also worth considering Team UAE-Emirates. The team has three great riders who, depending on how things unfold, could be in the mix. The Stavanger Stallion, <strong>Alexander Kristoff</strong>, has been a consistently impressive performer at Milan-San Remo, winning in 2014, finishing second in 2015, and going top-10 every year from 2013 to 2018. He might be past his best, but don&#8217;t write him off.</p>\n\n\n\n<p><strong>Fernando Gaviria </strong>hasn&#8217;t been at his scintillating best in recent times (two bouts of COVID won&#8217;t have helped) but if the Colombian is in a reduced bunch at the finish, he&#8217;ll be one to watch. And then there&#8217;s <strong>Matteo Trentin</strong>. The Italian has two top-10s at this race and he&#8217;s both good uphill, and a strong sprinter. Look to him to be active on the Poggio.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/CORVOS_00022955-019-1340x893.jpg\" alt=\"\"/><figcaption>It&#8217;s been seven years since Kristoff won Milan-San Remo. Could he wind back the clock and rediscover <a href=\"https://twitter.com/iaintreloar/status/1299859097441902592?lang=en\">where the magic happens</a>?</figcaption></figure>\n\n\n\n<h2>The outsiders</h2>\n\n\n\n<p>For other riders capable of a great result if things go their way, consider some of the following.</p>\n\n\n\n<p><strong>Giacomo Nizzolo (Qhubeka-Assos) </strong>was fifth last year and has had a couple of impressive seasons. He could well be a shot from a reduced group. <strong>Arnaud Demare (Groupama-FDJ) </strong>hasn&#8217;t shown the form he did prior to winning this race in 2016, but the Frenchman shouldn&#8217;t be discounted if he&#8217;s there for a reduced bunch sprint.</p>\n\n\n\n<p>For other riders capable of a strong move in the closing kilometres, consider the likes of <strong>Soren Kragh Andersen (DSM)</strong>, <strong>Max Schachmann (Bora-Hansgrohe), Filippo Ganna (Ineos Grenadiers)</strong> and <strong>Tim Wellens (Lotto-Soudal)</strong>.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/2020-tour-de-france-stage-19-corvos-5-1340x894.jpg\" alt=\"\"/><figcaption>Kragh Andersen won two stages of last year&#8217;s Tour de France with late moves.</figcaption></figure>\n\n\n\n<h2>How to watch it</h2>\n\n\n\n<p>For the vast majority of viewers, your best chance of catching the 2021 Milan-San Remo will be the combination of Eurosport and GCN+. Between the two you should be able to get live coverage on TV and/or streaming online. </p>\n\n\n\n<p><strong>Who&#8217;s your pick to win the 2021 Milan-San Remo?</strong></p>\n\n\n\n<p><em>Follow the link for a <a href=\"https://www.milanosanremo.it/wp-content/uploads/2021/03/Milano_Sanremo_Iscritti-2021.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">provisional startlist for the 2021 Milan-San Remo</a>.</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/preview-your-guide-to-the-2021-milan-san-remo/\">Preview: Your guide to the 2021 Milan-San Remo</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ee9cc54bebca7707ab8936cf08e472f873d12bc31559e635b7cb3d92ebdac27a","category":"Cycling"}