{"title":"Mathematical Modeling and Sensitivity Analysis of Glioblastoma Growth and Dissemination: Insights from a Comprehensive Computational Framework","link":"https://www.preprints.org/manuscript/202406.0806/v1","date":1718267809000,"content":"Glioblastoma is a highly aggressive brain tumor characterized by rapid growth, extensive infiltration, and poor prognosis. Understanding the complex interplay of biological processes driving glioblastoma progression is crucial for developing effective therapeutic strategies. In this study, we present a comprehensive mathematical model that incorporates key aspects of glioblastoma growth and dissemination, including tumor cell diffusion, angiogenesis, nutrient availability, molecular signaling pathways, and blood-brain barrier (BBB) interactions. The model is based on a system of coupled partial differential equations (PDEs) and ordinary differential equations (ODEs) that capture the spatiotemporal dynamics of tumor cell density, nutrient concentration, signaling molecule concentrations, and BBB integrity. We employ numerical simulation techniques, such as the finite difference method and the Runge-Kutta method, to solve the model equations and visualize the evolution of tumor growth and its associated biological processes. The model parameters are estimated using experimental data from the literature, and the model is validated against clinical observations. Furthermore, we perform a comprehensive sensitivity analysis to identify the key parameters that significantly influence tumor growth, diffusion, and dissemination. The sensitivity analysis reveals the relative importance of each parameter in driving glioblastoma progression and highlights potential targets for therapeutic interventions. Our computational framework provides a powerful tool for understanding the complex dynamics of glioblastoma growth and offers valuable insights into the underlying biological mechanisms. The model can be used to test hypotheses, predict tumor response to various treatment strategies, and guide the design of targeted therapies. The findings from this study contribute to the ongoing efforts in developing personalized treatment approaches for glioblastoma patients and improving their clinical outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ee9cdb3d1d47d61b53b56d32c10ee551872284c9d3912d10bd3a8d690714790f","category":"Interdisciplinary"}