{"title":"“Mystery” pneumonia in China is mix of common respiratory germs, WHO says","link":"https://arstechnica.com/?p=1986656","date":1701126208000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/GettyImages-1800064703-800x533.jpeg\" alt=\"Parents with children who are suffering from respiratory diseases are lining up at a children's hospital in Chongqing, China, on November 23, 2023.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/GettyImages-1800064703-scaled.jpeg\">Enlarge</a> <span>/</span> Parents with children who are suffering from respiratory diseases are lining up at a children's hospital in Chongqing, China, on November 23, 2023. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/parents-with-children-who-are-suffering-from-respiratory-news-photo/1800064703?adppopup=true\">Getty | Costfoto/NurPhoto</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Last week, news stories and a posting on an infectious disease surveillance system raised fears that another novel respiratory pathogen with pandemic potential was mushrooming in northern areas of China—namely Beijing and Liaoning province. The reports referenced \"<a href=\"https://promedmail.org/promed-post/?place=8713261,353#promedmailmap\">undiagnosed pneumonia</a>\" in \"<a href=\"https://www.npr.org/2023/11/23/1215024992/china-pneumonia-clusters-children-who\">clusters</a>\" of children, hospitals that were \"overwhelmed,\" and parents who were questioning whether \"authorities were covering up the epidemic.\"</p>\n<p>But, rather than a sequel to the COVID-19 pandemic, the situation appears to be merely a side effect of it. According to independent experts and the World Health Organization, it's most likely that China is now experiencing a roaring comeback of a mix of common respiratory infections that were muted during the global health crisis. Many other countries experienced the same surges in the past year or two, including the US. As with the other countries, the wave of infection in China is mostly affecting children, who were less exposed to all sorts of pathogens amid the health restrictions, leaving them more vulnerable to infections now.</p>\n<p>The global explosion of COVID-19 transmission and subsequent pandemic health measures severely disrupted common cycles of many infectious diseases worldwide, knocking seasonal respiratory infections like adenoviruses and RSV (respiratory syncytial virus) off their annual cycles. In the US, the 2020-2021 flu season was virtually nonexistent, for instance. But, as the novel coronavirus abated and restrictions lifted, those pathogens vigorously returned. (The US also experienced early and intense peaks of RSV and flu last year.)</p></div><p><a href=\"https://arstechnica.com/?p=1986656#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1986656&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ee9d65953f4cc5d026b04cff4e0c60f255d33584ca13bfcfd39e647db23cc496","category":"Tech"}