{"title":"รู้จักกับ MusicBrainz เมื่อนำ Shazam มารวมกับ Free Online Music Database","link":"https://www.blognone.com/node/122304","date":1619069667000,"content":"<div><div><div><p>เนื่องจากเพิ่งมีเวลาสะสางไฟล์เพลงที่มีเก็บไว้แล้วพบว่ามีเพลงจำนวนมากที่ไม่มี metadata ทำให้ไม่รู้ว่าเพลงอะไร ในยุคนี้เราไม่ต้องเปิดเพลงฟัง แล้วจับเนื้อร้อง เพื่อเอาไปค้นหาด้วย Google อีกแล้ว เราสามารถใช้ <strong>Shazam</strong> เพื่อหาว่าเพลงที่เปิดอยู่คือเพลงอะไรได้โดยง่ายแล้วไปแก้ไขข้อมูลด้วยมือ หนึ่งถึงสองเพลงแรกยังสนุกอยู่ แต่ปรากฏว่ามีนับร้อยเพลงที่ไม่มี metadata ก็ไม่ไหวแล้ว ถึงได้พยายามหาวิธีที่ดีกว่านี้ แล้วคำตอบคือ <strong>MusicBrainz</strong> ครับ</p>\n<p><a href=\"https://musicbrainz.org/\">MusicBrainz</a> เป็นโปรเจค ที่สร้างฐานข้อมูลเพลงออนไลน์โดยอาศัยชุมชนเป็นผู้เพิ่มข้อมูลและใครๆ ก็ใช้ได้ ซึ่งเป็นแนวทางแบบเดียวกับ <a href=\"https://en.wikipedia.org/wiki/Freedb\">Freedb</a> ที่เป็นฐานข้อมูลออนไลน์ของแผ่นซีดี นอกจากจะเป็นฐานข้อมูลออนไลน์แล้ว MusicBrainz ยังมีฐานข้อมูลของ <a href=\"https://en.wikipedia.org/wiki/Acoustic_fingerprint\">acoustic fingerprint</a> ซึ่งช่วยในการค้นหาเพลงโดยไม่ต้องอาศัย metadata ได้อีกทาง</p>\n<p>ณ ปัจจุบัน MusicBrainz มีข้อมูลเพลงอยู่ <a href=\"https://musicbrainz.org/statistics\">28 ล้านเพลง</a> เป็นฐานข้อมูลเพลงออนไลน์ที่มีขนาดใหญ่เป็นอันดับ 4 รองจาก Discogs <a href=\"http://www.discogs.com/data\">(151 ล้าน)</a>, Gracenote <a href=\"https://web.archive.org/web/20140309030630/http://www.gracenote.com/press/01/23/2011\">(100 ล้าน)</a>, ACRCloud <a href=\"https://www.music-asia.com/2016/10/lyricfind-becomes-more-easily-available-to-developers/\">(40 ล้าน)</a> แต่นับเป็น <em>ฐานข้อมูลฟรีของ acoustic fingerprint ที่มีขนาดใหญ่ที่สุด</em>ในปัจจุบัน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/8c02be9cc17ef6f41ffcfd041c3c9c86.jpg\" /></p>\n<p>แอปยอดนิยมที่ใช้แก้ไข metadata สามารถดึงข้อมูลจาก MusicBrainz ได้โดยตรง เช่น mp3tag / Foobar2000 แต่การค้นหาจาก acoustic fingerprint ต้องใช้ผ่านแอปเฉพาะที่ชื่อ MusicBrainz <a href=\"https://picard.musicbrainz.org/downloads/\">Picard</a> เท่านั้น ซึ่งตอนนี้มีครอบคลุม platform ใหญ่ทั้งหมด ทั้ง <a href=\"https://www.microsoft.com/th-th/p/musicbrainz-picard/9nj9q3jr29l2\">Windows</a> / <a href=\"https://picard.musicbrainz.org/downloads/\">macOS / Linux</a> / <a href=\"https://play.google.com/store/apps/details?id=org.metabrainz.android\">Android</a> ส่วนวิธีการใช้งานสามารถหาได้ตาม YouTube ครับ</p>\n<p>ส่วนใครเจอปัญหาว่าหาเพลงด้วย acoustic fingerprint ไม่เจอ ก็สามารถที่เพิ่มเข้าไปได้ผ่าน Picard เช่นกัน จากประสบการณ์ใช้งานจริง พบว่าเพลงที่ค่อนข้างใหม่จะหาได้จาก acoustic fingerprint เกือบทั้งหมด ส่วนเพลงที่เก่าหน่อย เช่นก่อนปี 2000 มักไม่ไม่มีใครให้ข้อมูล acoustic fingerprint ไว้ครับ แต่มีข้อมูล metadata ไว้ครบถ้วนทีเดียว ผมจึงได้เพิ่มเติมเข้าไปแล้ว</p>\n<p>นอกจากนั้นยังมีสิ่งที่น่าสนใจ และเปิดให้เข้าถึงได้ เช่น</p>\n<ul>\n<li>MusicBrainz ยังมีฐานข้อมูลภาพหน้าปก CD / Media Cover Art แยกออกมาในชื่อ <a href=\"https://coverartarchive.org/\">Cover Art Archive</a> ซึ่งเปิด API ให้ใครๆ ก็ใช้งานได้ Amazon ก็ใช้งานระบบนี้เช่นกัน</li>\n<li>เทคโนโลยีในการทำ acoustic fingerprint ของ MusicBrainz มีชื่อเรียกว่า Chromaprint รายละเอียดสามารถอ่านได้ใน<a href=\"https://oxygene.sk/2011/01/how-does-chromaprint-work/\">บล็อกของ Lukáš Lalinský</a> ซึ่งเป็นหนึ่งใน Contributor ของชุมชน MusicBrainz</li>\n<li>ฝั่ง Server เขียนด้วย Perl ร่วมกับฐานข้อมูล PostgreSQL ส่วนข้อมูลในฐานข้อมูลจะมี snapshot ออกมาให้ทุก 2 สัปดาห์ ทุกอย่างเป็น Open source พร้อม document อย่างละเอียด</li>\n<li>ฝั่ง Picard เองก็เป็น Open source เขียน Python</li>\n</ul>\n<p>แม้ว่าปัจจุบัน ตอนนี้ Online music streaming จะมาแรง แต่การเก็บเพลงที่ตัวเองชอบฟังไว้ก็ยังเป็นหนึ่งในแนวทางที่ยังมีคนนิยมทำกันอยู่ ก็หวังว่า MusicBrainz จะตอบโจทย์ผู้ใช้กลุ่มนี้นะครับ</p>\n<p>อ่านข้อมูลเพิ่มเติมได้ที่ <a href=\"https://musicbrainz.org/doc/About\">MusicBrainz</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/musicbrainz\">MusicBrainz</a></div><div><a href=\"/topics/open-source\">Open Source</a></div><div><a href=\"/topics/open-data\">Open Data</a></div></div></div>","author":"Nozomi","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"eea2405edd634d0c4483858676e1803d2159ef9c6a3b8198fbc3d84fa2184e67","category":"Thai"}