{"title":"'I can ride everywhere' - Filippo Ganna the sprinter","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/i-can-ride-everywhere-filippo-ganna-the-sprinter","date":1693419554000,"content":"\n      \n<p><span>Filippo Ganna is not content with just being cycling’s time trial supremo, track dominator and all-round powerhouse. The 27-year-old beast, all 6’ 3” of him, has added a new talent to his skillset this summer: that of a sprinter.</span></p>\n<div></div>\n<p><span>It was at July’s Tour de Wallonie that Ganna, just weeks before he would become individual pursuit world champion for the sixth time, shocked bonafide sprinters including Davide Ballerini, Arnaud De Lie and Elia Viviani to win stage one of the race. </span></p>\n<p><span>A month later, on stage five of the Vuelta a España, Ineos Grenadiers’ do-it-all extraordinaire narrowly missed out winning a bunch sprint against the race’s fastest man, Alpecin-Deceuninck’s Kaden Groves. It was so tight that the Italian reckoned he only needed 20 more metres of road and he would have pulled off a major upset.</span></p>\n<p><span>“I’m riding the buses!” Ganna laughed after the finish in Burriana. “I try to do the leadout, [be the] last man [in the mountains], sprint, and there’s also a TT after the rest day. I can ride everywhere.” Indeed he can, and almost win everywhere. He says he only needed 20 metres more; TV footage would suggest he needed even less. <img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1642398003_1024x1024.jpg?v=1693419410\" /><em>Image: Tim de Waele/Getty Images</em></span></p>\n<p><span>It has to be countered that the sprint field at the Vuelta isn’t exactly replete with the fastest men on the planet; in fact Groves, who made it two in two on the Valencian coast, is the only top-20 ranked sprinter in the race.</span></p>\n<p><span>But such a paucity of high-level sprinters opens up opportunities to other riders, and Ganna, with his enviable force, his irrepressible power and lightning speed, can sense an opportunity to add sprint successes to his </span><em><span>palmarès</span></em><span>. Or perhaps not. “I don’t like to do the sprint,” he surprised </span><em><span>Rouleur</span></em><span> when asked what his sprinting ambitions are. “It’s too dangerous and I don’t like the sensations, the pressure on the body. But if it’s necessary I do it.”</span></p>\n<p><span>Was it necessary on stage five? “I prefer to take care of my GC rider but G [Geraint Thomas] said I can do a sprint, so why not? I tried to do my best to finish today, it was not easy and I did my maximum. We will see in the next few days.” It's a mark of Ganna’s array of faculties that he can almost win a stage of a Grand Tour despite not actually wanting to. </span></p>\n<p><span>Should he fancy it, should he want to wrestle at 70km/h in the finishing kilometres, there will be more chances for Ganna the sprinter in the coming two-and-a-half weeks, one as soon as Friday just down the coast in Oliva. But it sounds as if his flirtation with sprinting is just that: a brief crush, one he occasionally comes back to, but not one he seriously engages with or wants to pursue much further. </span></p>\n<p><span>On stage six, he’ll be back on domestique duties, shepherding Thomas and Thymen Arensman up into the mountains of Teruel. He’ll then start switching his focus and conserving his energy for stage 10’s 25.8km time trial where he’ll be on a revenge mission against Remco Evenepoel who denied him a third time trial world title in Glasgow just a few weeks ago.</span></p>\n<p><span>Will we see Filippo Ganna the sprinter again during this Vuelta? Only he knows, but it appears that this is going to be cycling’s occasional wild ride, its dirty little secret that feels as right as it does wrong, appearing once every now and again without expectation - but to disruptive effect.</span></p>\n<p><em>Cover image: ASO/Unipublic/Sprint Cycling Agency</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"eea7a484cac283658a90bc7f535139e2643166fc623f11b541e0772344d4b473","category":"Cycling"}