{"title":"Progressive heterogeneity of enlarged and irregularly shaped apicoplasts in Plasmodium falciparum persister blood stages after drug treatment","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae424/7769712?rss=1","date":1727136000000,"content":"<span><div>Abstract</div>Morphological modifications and shifts in organelle relationships are hallmarks of dormancy in eukaryotic cells. Communications between altered mitochondria and nuclei are associated with metabolic quiescence of cancer cells that can survive chemotherapy. In plants, changes in the pathways between nuclei, mitochondria, and chloroplasts are associated with cold stress and bud dormancy. <span>Plasmodium falciparum</span> parasites, the deadliest agent of malaria in humans, contain a chloroplast-like organelle (apicoplast) derived from an ancient photosynthetic symbiont. Antimalarial treatments can fail because a fraction of the blood-stage parasites enter dormancy and recrudesce after drug exposure. Altered mitochondrial–nuclear interactions in these persisters have been described for <span>P. falciparum</span>, but interactions of the apicoplast remained to be characterized. In the present study, we examined the apicoplasts of persisters obtained after exposure to dihydroartemisinin (a first-line antimalarial drug) followed by sorbitol treatment, or after exposure to sorbitol treatment alone. As previously observed, the mitochondrion of persisters was consistently enlarged and in close association with the nucleus. In contrast, the apicoplast varied from compact and oblate, like those of active ring-stage parasites, to enlarged and irregularly shaped. Enlarged apicoplasts became more prevalent later in dormancy, but regular size apicoplasts subsequently predominated in actively replicating recrudescent parasites. All three organelles, nucleus, mitochondrion, and apicoplast, became closer during dormancy. Understanding their relationships in erythrocytic-stage persisters may lead to new strategies to prevent recrudescences and protect the future of malaria chemotherapy.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"eeb1c47023bb8f0a8a7d4519c7bfcce56f2dfab4a8bfbf76d067bdf32454ba0d","category":"Interdisciplinary"}