{"title":"Inflammatory response in dairy cows caused by heat stress and biological mechanisms for maintaining homeostasis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300719","date":1711375200000,"content":"<p>by Hana Kim, Jang-Hoon Jo, Hong-Gu Lee, Woncheoul Park, Hak-Kyo Lee, Jong-Eun Park, Donghyun Shin</p>\r\n\r\nClimate change increases global temperatures, which is lethal to both livestock and humans. Heat stress is known as one of the various livestock stresses, and dairy cows react sensitively to high-temperature stress. We aimed to better understand the effects of heat stress on the health of dairy cows and observing biological changes. Individual cows were divided into normal (21–22 °C, 50–60% humidity) and high temperature (31–32 °C, 80–95% humidity), respectively, for 7-days. We performed metabolomic and transcriptome analyses of the blood and gut microbiomes of feces. In the high-temperature group, nine metabolites including linoleic acid and fructose were downregulated, and 154 upregulated and 72 downregulated DEGs (Differentially Expressed Genes) were identified, and eighteen microbes including <i>Intestinimonas</i> and <i>Pseudoflavonifractor</i> in genus level were significantly different from normal group. Linoleic acid and fructose have confirmed that associated with various stresses, and functional analysis of DEG and microorganisms showing significant differences confirmed that high-temperature stress is related to the inflammatory response, immune system, cellular energy mechanism, and microbial butyrate production. These biological changes were likely to withstand high-temperature stress. Immune and inflammatory responses are known to be induced by heat stress, which has been identified to maintain homeostasis through modulation at metabolome, transcriptome and microbiome levels. In these findings, heat stress condition can trigger alteration of immune system and cellular energy metabolism, which is shown as reduced metabolites, pathway enrichment and differential microbes. As results of this study did not include direct phenotypic data, we believe that additional validation is required in the future. In conclusion, high-temperature stress contributed to the reduction of metabolites, changes in gene expression patterns and composition of gut microbiota, which are thought to support dairy cows in withstanding high-temperature stress via modulating immune-related genes, and cellular energy metabolism to maintain homeostasis.","author":"Hana Kim","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"eeb3717e88f3b3aab454ad816b327d56cd2e888c50205463911b65f11db97983","category":"Interdisciplinary"}