{"title":"Identification of countercurrent tubule-vessel arrangements in the early development of mouse kidney based on immunohistochemistry and computer-assisted 3D visualization","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307223","date":1723557600000,"content":"<p>by Yun-Sheng Ma, Si-Qi Deng, Ping Zhang, Jesper Skovhus Thomsen, Arne Andreasen, Shi-Jie Chang, Jie Zhang, Ling Gu, Xiao-Yue Zhai</p>\r\n\r\nNephron loop-vessel countercurrent arrangement in the medulla provides the structural basis for the formation of concentrated urine. To date, the morphogenesis of it and relevant water and solutes transportation has not been fully elucidated. In this study, with immunohistochemistry for aquaporins (AQP) and Na-K-2Cl co-transporter (NKCC2), as well as 3D visualization, we noticed in embryonic day 14.5 kidneys that the countercurrent arrangement of two pairs of loop-vessel was established as soon as the loop and vessel both extended into the medulla. One pair happened between descending limb and ascending vasa recta, the other occurred between thick ascending limb and descending vasa recta. Meanwhile, the immunohistochemical results showed that the limb and vessel expressing AQP-1 such as descending thick and thin limb and descending vasa recta was always accompanied with AQP-1 negative ascending vasa recta or capillaries and thick ascending limb, respectively. Moreover, the thick ascending limb expressing NKCC2 closely contacted with descending vasa recta without expressing NKCC2. As kidney developed, an increasing number of loop-vessels in countercurrent arrangement extended into the interstitium of the medulla. In addition, we observed that the AQP-2 positive ureteric bud and their branches were separated from those pairs of tubule-vessels by a relatively large and thin-walled veins or capillaries. Thus, the present study reveals that the loop-vessel countercurrent arrangement is formed at the early stage of nephrogenesis, which facilitates the efficient transportation of water and electrolytes to maintain the medullary osmolality and to form a concentrated urine.","author":"Yun-Sheng Ma","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"eeb4a8d0917e0258896497f8f6325e3c21a770b637f86d885695095eb7ca843f","category":"Interdisciplinary"}