{"title":"PSI-4 Evaluation of chemical mitigants when soybean meal was inoculated with porcine epidemic diarrhea virus, porcine reproductive and respiratory virus, and Seneca Valley virus 1","link":"https://academic.oup.com/jas/article/102/Supplement_2/349/7664882?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Chemical mitigants have been found to decrease virus concentrations in feed and ingredient matrices. Continued research is needed to identify the appropriate inclusion levels and application time for different viruses in these matrices. Therefore, the objective was to evaluate different inclusion levels of two different chemical mitigants when applied either before or after inoculation of porcine epidemic diarrhea virus (PEDV), porcine reproductive and respiratory syndrome virus (PRRSV) and Seneca Valley virus 1 (SVV1) to soybean meal. The experiment was designed in a 2×2×2 factorial with two chemical mitigants, a formaldehyde-based product (Termin-8, Anitox Corp. Lawrenceville, GA) and a product containing Synergistic blend of phytochemicals and carboxylic acids (Finio, Anitox Corp. Lawrenceville, GA), two applications times, before virus inoculation (prevention) and after virus inoculation (mitigation), and either a low or high inclusion level (Termin-8: 2 or 3 kg/MT; Finio: 1.75 or 2.75 kg/MT). On d 1, samples of the respective matrices were weighed in 50 g aliquots and added to 500 mL bottles. Chemical mitigants were applied to the prevention samples at their respective inclusion levels and 50 µL each of 1×10<sup>7</sup> TCID<sub>50</sub>/mL PEDV, 1×10<sup>8</sup> TCID<sub>50</sub>/mL PRRSV, and 1×10<sup>8</sup> TCID<sub>50</sub>/mL SVV1 were added to the mitigation samples. All bottles were shaken and allowed to sit at room temperature for 24 h. On d 2, virus was added to the prevention samples and chemical mitigants were added to the mitigation bottles, samples incubated at room temperature for 1 h before 200 mL of phosphate buffer solution was added, and bottles incubated at 4°C for 18 h. After incubation, liquid from the samples was centrifuged and the supernatant analyzed via triplex PCR at Kansas State University Veterinary Diagnostic Laboratory. Cycle threshold and proportion PCR positive were analyzed using SAS GLIMMIX v 9.4 (SAS, Inc., Cary, NC) with each virus and matrix combination analyzed individually. A chemical mitigant×application time×inclusion level interaction was not observed (<span>P</span> &gt; 0.05) for any virus. A chemical mitigant×application time interaction was observed (<span>P</span> &lt; 0.05) in all three viruses, where less viral RNA was detected (<span>P</span> &lt; 0.05) when either Termin-8 or Finio were applied after inoculation (mitigation) than when applied prior to inoculation or to the positive controls. An application time×inclusion level interaction was noticed (<span>P</span> &lt; 0.05) for SVV1 and PEDV in soybean meal. Chemical mitigants applied at either the low or high inclusion level after inoculation (mitigation) had less detectable RNA (<span>P</span> &lt; 0.05) than their prevention counterparts. Overall, Termin-8 and Finio can reduce detectable RNA immediately in contaminated soybean meal, with ongoing research evaluating the effect of extended contact times between the mitigants and soybean meal.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"eec2c23a42e01354ff85a2ecccac72d148ec4e7d62341e0cf8c665ed314e65ec","category":"Environment"}