{"title":"The function of red and banded patterns in snakes: a review of hypotheses and evidence","link":"https://academic.oup.com/biolinnean/article/142/4/351/7465226?rss=1","date":1702080000000,"content":"<span><div>Abstract</div>The functions of bright bands in coral and other snakes have long been a puzzle. The most common opinion is that coral snakes display aposematic marks and that other red and black banded snakes in the Americas are mimics of coral snakes. Although supported by some evidence, the notion comes with unresolved difficulties. Here, I review the proposed functions of the colour of coral snakes and similar-coloured snakes, taking a more comprehensive view than usual, from the plausibility of aposematism in coral snakes to the apparent existence of a selective force for red and black banded patterns across the world. Theoretical models of the maintenance of aposematic signals do not seem applicable, hence aposematism has a low a priori plausibility in coral snakes. Evidence of avoidance is weak, field studies rely on unsettled methods and do not reproduce well, and two laboratory studies reporting strong innate fear are questioned. Coral snakes predict the geography and richness of ‘mimics’ in the Americas, but not in line with expectations. Conversely, polymorphism and evidence of local selection and of a worldwide selective force for patterns similar to coral snakes, including complex banded patterns, contradicts aposematism and mimicry and points to an undefined alternative. In summary, aposematism and mimicry fail on too many fronts to be sustained, existing alternatives also fail to be supported sufficiently, and hypotheses need to be formulated to account for the widespread selection for red and black bands and for complex banded patterns in snakes.</span>","author":"","siteTitle":"Biological Journal of the Linnean Society Current Issue","siteHash":"49e2627ca4236f035605387a5e9b308f0f71198bce05f1a2f79007f5fd444361","entryHash":"eec355b439116e8b4292796b98641a063254e0c64cd732fe0cf72a03975ea70c","category":"Environment"}