{"title":"Ethical guidance for conducting health research with online communities: A scoping review of existing guidance","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302924","date":1715954400000,"content":"<p>by Jane Harris, Jennifer Germain, Ellie McCoy, Rosemary Schofield</p>\r\n\r\nOnline research methods have grown in popularity due in part to the globalised and far-reaching nature of the internet but also linked to the Covid-19 pandemic whereby restrictions to travel and face to face contact necessitated a shift in methods of research recruitment and data collection. Ethical guidance exists to support researchers in conducting online research, however this is lacking within health fields. This scoping review aims to synthesise formal ethical guidance for applying online methods within health research as well as provide examples of where guidance has been used. A systematic search of literature was conducted, restricted to English language records between 2013 and 2022. Eligibility focused on whether the records were providing ethical guidance or recommendations, were situated or relevant to health disciplines, and involved the use or discussion of online research methods. Following exclusion of ineligible records and duplicate removal, three organisational ethical guidance and 24 research papers were charted and thematically analysed. Four key themes were identified within the guidance documents, 1) consent, 2) confidentiality and privacy, 3) protecting participants from harm and 4) protecting researchers from harm with the research papers describing additional context and understanding around these issues. The review identified that there are currently no specific guidelines aimed at health researchers, with the most cited guidance coming from broader methodological perspectives and disciplines or auxiliary fields. All guidance discussed each of the four key themes within the wider context of sensitive topics and vulnerable populations, areas and issues which are often prominent within health research thus highlighting the need for unifying guidance specific for health researchers. Further research should aim to understand better how online health studies apply ethical principles, to support in informing gaps across both research and guidance.","author":"Jane Harris","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"eec5f43291e001e9e035105079ad60b052a8073707d344bae72e647135dd9416","category":"Interdisciplinary"}