{"title":"Vuelta a Burgos Feminas general classification wide open after two stages","link":"https://cyclingtips.com/2021/05/vuelta-a-burgos-feminas-general-classification-wide-open-after-two-stages/","date":1621622303000,"content":"<p>With two stages down and two stages to go at the Vuelta a Burgos Feminas, the general classification is still wide open. A combination of the lack of bonus seconds at the finish and two tight races means the leader’s jersey has changed hands twice, and will likely change hands again in the coming days. </p>\n\n\n\n<p>The first stage was won by Grace Brown (Team BikeExchange) out of a three-rider breakaway. Her break mates Elise Chabbey (Canyon-SRAM) and Niamh Fisher-Black (SD Worx) finished at the same time as Brown with a reduced peloton crossing the line five seconds later. </p>\n\n\n\n<p>In most stage races, when a race finishes on a flat road there are bonus seconds on the line. It adds another level to the general classification and will sometimes leave riders fighting for the overall win in the mid-race sprints. </p>\n\n\n\n<p>Think Amgen Breakaway from Heart Disease Women’s Race Empowered with SRAM (aka Tour of California) in 2017, when Anna van der Breggen snatched the yellow jersey from Katie Hall on the final stage by winning the bonus sprint seconds. Only one second separated Van der Breggen and Hall when the race wrapped up. </p>\n\n\n\n<h2>Where does the GC stand now? </h2>\n\n\n\n<p>Although Brown and Chabbey finished stage 2 at the same time, Chabbey crossed the line 14th while Brown finished 33nd and Chabbey took the leader’s jersey to wear on stage 3. Fisher-Black crossed the line in 20th so she also jumped above Brown and will start stage 3 second overall. </p>\n\n\n\n<p>Stage three on Saturday, which features a rolling parcours and a 2km climb at the finish, will be the first of the four stages with real movement in the general classification. </p>\n\n\n\n<p>After the first two stages, 29 riders are within five seconds of the top step. SD Worx has four riders able to move into a winning position, with Fisher-Black the closest. Van der Breggen, Ashleigh Moolman-Pasio, and Demi Vollering are all capable of taking over the lead on stage three, with a short climb to the finish in Ojo Guareña. The climbing talent of Fisher-Black, Moolman Pasio and Van der Breggen also means the numbers are well in SD Worx favour come the final stage, depending on how stage 3 is raced.</p>\n\n\n\n<p>Another team with numbers still in contention is Canyon-SRAM. As of stage 2, they are leading the general classification with Kasia Niewiadoma perfectly placed in seventh. Mikayla Harvey, who joined Canyon-SRAM in 2021, will start stage 3 in 11th overall. Harvey is an incredible climber and could be a factor on the final stage 4 climb that will likely decide the overall. Omer Shapira, another talented climber, is also only five seconds off leading the general classification in 26th, despite having put in a lot of work for her team. </p>\n\n\n\n<p>A number of teams have two or three riders still in contention. Team BikeExchange has Brown in third overall with Ane Santesteban 16th. Movistar’s Annemiek van Vleuten is one of the out and out favourites for the overall win on Sunday and sits 23rd on GC after stage 3. </p>\n\n\n\n<p>Long story short, the final climb to the finish on stage 3 could see Chabbey handing the leaders jersey over to one of her teammates, keeping it for herself, or losing it to any of the riders sitting in the top 29. The climb isn’t quite long enough to gain a massive amount of time, but that won’t matter come stage 4. </p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/vuelta-a-burgos-feminas-general-classification-wide-open-after-two-stages/\">Vuelta a Burgos Feminas general classification wide open after two stages</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"eecb0656f38f7a462a720a00ca203126c59948c5ad0964f143a1bf03b890fa41","category":"Cycling"}