{"title":"Enhancing Diversity in Undergraduate Degree Programs in Forestry and Related Natural Resources: a Brief Review of Critical Issues and Promising Actions","link":"https://academic.oup.com/jof/article/122/2/107/7428713?rss=1","date":1700265600000,"content":"<span><div>Abstract</div>Although forestry and related natural resources (FRNR) undergraduate degree programs in the United States have become increasingly diverse in recent years, women and minorities remain underrepresented in multiple disciplines; this is particularly true in forestry undergraduate programs. We reviewed over one hundred reports and publications to help understand the critical issues that must be addressed to enhance diversity in FRNR undergraduate programs. Based on that review, here we summarize eight critical issues in recruiting and retaining a more diverse FRNR undergraduate student body, and we also present promising actions to address the issues. Our goal is to more widely communicate validated ideas and practices, thereby prompting further discussion and effective actions to make more tangible gains in enhancing the diversity of FRNR undergraduate degree programs in the United States in the future.Study Implications: To be effective managers and stewards of forestry and related natural resources (FRNR), professionals must be effective in developing, communicating, and implementing plans and actions. From recommendations for a single stand or forest, to community-level natural resource issues, to state, regional, and national policy decisions, FRNR professionals must be trusted by increasingly diverse stakeholders in our society. FRNR professions can become more diverse in terms of gender as well as race and ethnicity by developing and implementing actions that address specific critical issues in undergraduate enrollment. A more diverse and society-ready cadre of leaders in FRNR will help to ensure healthy biotic communities are restored, sustained, and valued while meeting long-run societal needs.</span>","author":"","siteTitle":"Journal of Forestry Current Issue","siteHash":"f325018648ab04fba35e6e1191e9c9d953f9458bd233a7a41545c2e465328e3b","entryHash":"eedb40d29024afc4c9b5c73ee8f2295d55d5fcd6a53024c216722258e665500d","category":"Environment"}