{"title":"Comparative Analysis of the Effect of Beta Blockers of Different Generations on the Parameters of Myocardial Energy Metabolism in Experimental Doxorubicin-Induced Chronic Heart Failure","link":"https://www.preprints.org/manuscript/202407.2562/v1","date":1722422217000,"content":"Background: beta blockers of three generations are first-line drugs in the treatment of chronic heart failure (CHF). However, to date there is no clear understanding of the effect of beta blockers on myocardial energy metabolism disorders in CHF. The aim of the study: to conduct a study of beta-blockers of different generations on myocardial energy metabolism in the experimental CHF. Methods: CHF was modeled in white outbred rats by administering doxorubicin. The study drugs were administered intragastrically – new drug Hypertril (1-(β-phenylethyl)-4-amino-1,2,4-triazolium bromide)-3.5 mg/kg, metoprolol - 15 mg/kg, Nebivolol -10 mg/kg, Carvedilol 50 mg/kg, Bisoprolol, 10 mg/kg. In the myocardium, the main indices of energy metabolism were determined - ATP, ADP, AMP, malate, lactate, pyruvate, succinate dehydrogenase (SDH) activity, NAD-dependent malate dehydrogenase (NAD-MDH) activity. Results: traditional second-generation beta-blockers (Metoprolol and Bisoprolol) did not affect the studied indices of energy metabolism, and third-generation beta-blockers with additional properties - Carvedilol and, especially, Nebivalol and Hypertril improved myocardial energy metabolism. Conclusions: obtained results will help to expand our understanding of the effect of beta-blockers of various generations used to treat cardiovascular diseases on energy metabolism, and are also an experimental justification for the practical choice of these drugs in the complex therapy of CHF.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"eedb26e3683dd791489064616fb5328e46444553a22ab1966969cba2ee0b6a8b","category":"Interdisciplinary"}