{"title":"Using passive acoustic monitoring to assess the overlap between endemic endangered Hector's dolphin (Cephalorhynchus hectori hectori) and mussel farms in the Banks Peninsula Marine Mammal Sanctuary, New Zealand","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4207?af=R","date":1717731888000,"content":"<h2>Abstract</h2>\n<p>\nAquaculture has maintained a sustained growth trend over the last 50 years, worldwide and in Aotearoa New Zealand.\nThis industry is known to have environmental consequences, such as impacts on benthos, water column and higher trophic levels. Some of these impacts have been thoroughly studied, while others, such as the effects on cetaceans, are not well understood.\nThis study used passive acoustic monitoring (PAM) to assess, for the first time, the overlap between kūtai—New Zealand greenlipped mussel (<i>Perna canaliculus</i>)—farms and habitat use by endemic endangered Hector's dolphins (<i>Cephalorhynchus hectori hectori</i>) within the Banks Peninsula Marine Mammal Sanctuary.\nT-PODs were deployed in six bays, three with mussel farms and three without, between 2018 and 2019. Occurrence of dolphins, expressed as ‘dolphin positive minutes per day’ (DPM/day), was modelled using generalized linear mixed models.\nResults showed a strong interaction between farm (presence/absence) and season (summer/winter), with fewer acoustic detections of dolphins in winter if farms were present. Furthermore, in bays with mussel farms, there were significantly more click train detections on the opposite side of the bay, compared to the side by the mussel farm.\nConsidering that results from this study suggest potential displacement of the dolphins due to the mussel farms, the recommendation is a precautionary approach. Further expansion of aquaculture in Hector's dolphin habitat should be done carefully, taking into account their habitat use, and conducting intensive monitoring including a robust ‘before and after’ design prior to the establishment of new farms.\n</p>","author":"María Jesús Valdés Hernández, \nStephen Dawson, \nHeloise Pavanato, \nEva Leunissen, \nWilliam Rayment","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"eee063d8e54c0a04231b46029f5faefdb50a5d708360accfb2fad00bf8167fb7","category":"Environment"}