{"title":"Xray scans show why Apple’s Thunderbolt 4 Pro cable is so pricey","link":"https://www.macworld.com/article/2111667/apple-thunderbolt-4-pro-cable-scans-metal-shielding-printed-circuit-board-assembly.html","date":1697732338000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s pricing for items such as cables is always criticized because they’re more expensive than others. Take, for example, <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2111667-1-0-0&amp;u=https://www.apple.com/shop/product/MU883AM/A/thunderbolt-4-usb%E2%80%91c-pro-cable-1-m\">Apple’s Thunderbolt 4 (USB-C) Pro cable</a>—it starts at $69 for a 1-meter cable and goes up to $159 for 3 meters. It’s easy to go to Amazon or some other retailer and find a similar cable at a fraction of the price.</p>\n\n\n\n<p>It turns out that those high prices might be worth it. Lumafield, a manufacturing company that specializes in industrial image scanning, decided to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.lumafield.com/article/usb-c-cable-charger-head-to-head-comparison-apple-thunderbolt-amazon-basics&amp;xcust=1-1-2111667-1-0-0&amp;sref=https://www.macworld.com/feed\">scan Apple’s cable and compare it to others that are much more affordable</a>. What they found is that Apple’s cable is much more intricate than the cheaper cables–in short, you are getting more for your money.</p>\n\n\n\n<p>The main takeaway from Lumafield’s scan and examination of Apple’s cable is that it’s truly built to be durable and support the specs it touts. It contains metal shielding, strong strain relief, and a printed circuit board assembly (PCBA) with 24 pins that are all in use. Apple even goes to the extent of making sure the circuit board traces are the same length to ensure proper data transmission. Apple also uses three different wires that correspond to its data and charging abilities. Lumafield calls the Apple Thunderbolt Pro cable a “stunning piece of precision engineering.”</p>\n\n\n\n<p>Lumafield also looked at cables from Amazon, NiceTQ, and Atyfuer–all priced at $10 or lower–and found that these cables are much more basic than Apple’s cable. Of the three, the Amazon cable was the only one that had metal shielding and a “simpler” form of stain relief. Lumafield also found that the NiceTQ cable (which has been discontinued) didn’t have enough pins and wires to support the 10Gbps data transfer speeds it touted. The Atyfuer cable, the cheapest cable ($4) they scanned, is advertised as a charging cable only, but Lumafield found that it was configured for USB 2.0 data transfers.</p>\n\n\n\n<p>The one glaring issue with Lumafield’s study–which the company doesn’t directly point out–is that the Amazon, NiceTQ, and Atyfuer cables are <em>not</em> Thunderbolt cables, they’re only meant to be used with USB-C. Thunderbolt 4’s data transfer rate is specified at 40Gbps, which is much higher than USB 3.2 (10Gbps) or USB 2.0 (480Mbps). That could explain why the cheaper cables don’t do or have some of the things the Apple cable does, such as using all the pins in their PCBA (or even having one in the first place). But that doesn’t excuse the engineering shortcuts that these cables have.</p>\n\n\n\n<p>So, if you’ve balked at the prices of Apple’s Thunderbolt 4 Pro Cable, Lumafield’s study does an excellent job of showing what you get for your money. Users who require the fast speed that Thunderbolt offers can rest assured that Apple’s cable has the tech to do what it’s supposed to do.</p>\n\nComputer Accessories</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"eee749965bf160b608b1dbd78a5defad2e58dae8749b5b987c0edc16403ea4fe","category":"Apple"}