{"title":"Chemichal and Thermal Changes in Mg3Si2O5 (OH)4 Polimorf Minerals and Importance as a Industrial Material","link":"https://www.preprints.org/manuscript/202409.1957/v1","date":1727257630000,"content":"Serpentine (Mg3Si2O5(OH)4), like quartz, dolomite and magnesite minerals, is a versatile mineral group characterized by silica and magnesium silicate contents with multiple polymorphic phases. Among the phases composed of antigorite, lizardite, and chrysotile, lizardite and chrysotile are the most prevalent phases in the serpentinites studied here. The ΣLREE/ΣHREE ratios of the samples are between 0.16 and 4 ppm. While Ce shows a strong negative anomaly (0.1–12), Eu shows a weak positive anomaly (0.1–0.3). This indicates that fluid interacts significantly with rock during serpentinization, and Highly Incompatible Elements (HIEs) gradually become involved in the serpentinization process. The large differential thermal analysis (DTA) peak at 810–830 °C is an important sign of dehydration, transformation reactions and thermal decomposition, and is com-patible with H2O phyllosilicates in the mineral structure losing water at this temperature. In SEM images, chrysotile, which has a fibrous structure, and lizardite, which has a flat appearance, trans-form into talc as a result of dehydration with increasing temperature. Therefore, the sudden tem-perature drop observed in DTA graphs is an indicator of crystal form transformation and CO2 loss. In this study, the mineralogical and structural properties and the formation of serpentinites were examined for the first time using thermo-gravimetric analysis methods. In addition, the mineralogical and physical properties of serpentinites can be recommended for industrial use as additives in polymers or in the adsorption of organic pollutants. As a result, the high refractory nature of examined serpentine suggests that it is well-suited for applications involving high temperatures. This includes industries such as metallurgy and steel production, glass manufacturing, ceramic production, and the chemical industry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"eeed329a37125400e41d422e1bc122c1e9e444265c97e8712e6432a3f19bcc7d","category":"Interdisciplinary"}