{"title":"Artificial intelligence‐based prediction of the rheological properties of hydrocolloids for plant‐based meat analogues","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13334?af=R","date":1718348660000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Methylcellulose has been applied as a primary binding agent to control the quality attributes of plant-based meat analogues. H owever, a great deal of effort has been made to search for hydrocolloids to replace methylcellulose because of increasing awareness of clean labels. In this study, a machine learning framework was proposed in order to describe and predict the flow behavior of six hydrocolloid solutions, and the predicted viscosities were correlated with the textural features of their corresponding plant-based meat analogues.</p>\n<h2>RESULTS</h2>\n<p>Different shear-thinning and Newtonian behaviors were observed depending on the type of hydrocolloid and the shear rate. Methylcellulose exhibited an increasing viscosity pattern with increasing temperature, compared to the other hydrocolloids. The machine learning algorithms (random forest and multilayer perceptron models) showed a better viscosity fitting performance than the constitutive equations (power law and Cross models). In addition, three hyperparameters of the multilayer perceptron model (optimizer, learning rate, and the number of hidden layers) were tuned using the Bayesian optimization algorithm.</p>\n<h2>CONCLUSION</h2>\n<p>The optimized multilayer perceptron model exhibited superior performance in viscosity prediction (<i>R</i>\n<sup>2</sup> = 0.9944–0.9961/RMSE = 0.0545–0.0708). Furthermore, the machine learning-predicted viscosities overall showed similar patterns to the textural parameters of the meat analogues. © 2024 Society of Chemical Industry.</p>","author":"Dayeon Lee, \nSungmin Jeong, \nSuin Yun, \nSuyong Lee","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"eef0e6581fe4e5f5c478586107fb0130c73b395a2ed9bae73ed3a0279e0c1644","category":"Environment"}