{"title":"Facebook Releases Llama 2 Under an ‘Open for Everyone Other Than Really Large Rivals’ License","link":"https://about.fb.com/news/2023/07/llama-2/","date":1689897226000,"content":"\n<p>Facebook:</p>\n\n<blockquote>\n  <p>We’re now ready to open source the next version of Llama 2 and are\nmaking it <a href=\"http://ai.meta.com/llama\">available free of charge for research and commercial\nuse</a>. We’re including model weights and\nstarting code for the pretrained model and conversational\nfine-tuned versions too. As Satya Nadella announced on stage at\nMicrosoft Inspire, we’re taking our partnership to the next level\nwith Microsoft as our preferred partner for Llama 2 and expanding\nour efforts in generative AI. Starting today, Llama 2 is available\nin the Azure AI model catalog, enabling developers using Microsoft\nAzure to build with it and leverage their cloud-native tools for\ncontent filtering and safety features. It is also optimized to run\nlocally on Windows, giving developers a seamless workflow as they\nbring generative AI experiences to customers across different\nplatforms. Llama 2 is available through Amazon Web Services (AWS),\nHugging Face, and other providers too.</p>\n</blockquote>\n\n<p>First, this is yet <a href=\"https://daringfireball.net/2023/07/apple_gpt_bloomberg\">another</a> sign that OpenAI <a href=\"https://daringfireball.net/linked/2023/06/20/regulation-altman\">has no moat around LLM AI technology</a>. Second, I’m glad to see Facebook drop their awkward “LLaMA” letter-casing style. Third, there’s a notable restriction <a href=\"https://ai.meta.com/llama/license/\">in Llama 2’s license</a>:</p>\n\n<blockquote>\n  <p>2. Additional Commercial Terms. If, on the Llama 2 version\nrelease date, the monthly active users of the products or services\nmade available by or for Licensee, or Licensee’s affiliates, is\ngreater than 700 million monthly active users in the preceding\ncalendar month, you must request a license from Meta, which Meta\nmay grant to you in its sole discretion, and you are not\nauthorized to exercise any of the rights under this Agreement\nunless or until Meta otherwise expressly grants you such rights.</p>\n</blockquote>\n\n<p>700 million seems oddly specific. Obviously the other companies in the Big Five exceed that number (Apple, Google, Amazon, Microsoft), but who else? Ben Thompson, in today’s subscriber-only Stratechery update (and — spoiler — tomorrow’s episode of Dithering) notes:</p>\n\n<blockquote>\n  <p>Probably the closest company to that 700 million monthly active\nuser (MAU) figure is Snap, which said <a href=\"https://www.marketwatch.com/story/snap-says-it-has-passed-750-monthly-active-users-5ca90792\">it passed 750 million MAUs\nearlier this year</a>. Obviously all of the other big consumer\ntech companies have more than 700 million MAUs, as well as other\nservices like Telegram, which <a href=\"https://techcrunch.com/2023/07/18/telegram-raises-210-million-through-bond-sales/\">just surpassed 800 million\nMAUs</a>.</p>\n</blockquote>\n\n<p>Good news for Elon Musk, though: <a href=\"https://www.businessofapps.com/data/twitter-statistics/\">Twitter is free to use it</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/07/20/facebook-open-llama-2\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"eef3857a50278b9a65bd13a9db28acdffe0a8e2030fec008573cf77a6df68a87","category":"Tech"}