{"title":"Following expert advice, FDA authorizes boosters for people 65+, high risk","link":"https://arstechnica.com/?p=1797594","date":1632366403000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/05/GettyImages-496532228-800x512.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/05/GettyImages-496532228.jpg\">Enlarge</a> <span>/</span> The Food and Drug Administration headquarters in White Oak, Maryland. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/the-outside-of-the-food-and-drug-administration-news-photo/496532228?adppopup=true\">Getty | Congressional Quarterly</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The US Food and Drug Administration late Wednesday <a href=\"https://www.fda.gov/news-events/press-announcements/fda-authorizes-booster-dose-pfizer-biontech-covid-19-vaccine-certain-populations\">authorized booster doses of the Pfizer/BioNTech COVID-19 vaccine</a> for people ages 65 and up. Also eligible for boosters will be those ages 18 to 64 who are at high risk of severe COVID-19 or at high risk from frequent occupational or institutional exposures to SARS-CoV-2, such as health care workers and teachers.</p>\n<p>The single booster dose should only be given at least six months after the two initial doses. The authorization comes as an amendment to an emergency use authorization.</p>\n<p>The FDA's authorization largely follows <a href=\"https://arstechnica.com/science/2021/09/fda-advisors-greenlight-pfizer-boosters-for-people-65-and-at-risk-groups/\">the recommendations from a committee of independent experts</a> that advises the agency, known as the Vaccines and Related Biological Products Advisory Committee (or VRBPAC). The committee met all day Friday to review and deliberate over the data surrounding boosters. The meeting concluded with an 18-0 vote in favor of recommending boosters for people 65 and up plus high-risk groups. But, prior to that, the committee voted 16-2 against recommending boosters for everyone ages 16 and up, rejecting the Biden administration's plans to roll out additional doses to nearly all vaccinated people.</p></div><p><a href=\"https://arstechnica.com/?p=1797594#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1797594&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"eefd44a156d0843166090e371143fe542da19801311ee53fa8eda81f0b9cc096","category":"Tech"}