{"title":"Phenology, voltinism, and brood development of Xylosandrus (Coleoptera: Curculionidae) ambrosia beetles in New York","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae102/7828205?rss=1","date":1729382400000,"content":"<span><div>Abstract</div>The ambrosia beetles <span>Xylosandrus germanus</span> (Blanford) and <span>Xylosandrus crassiusculus</span> (Motschulsky) are nonnative pests in orchards and nurseries in North America. They construct galleries in the sapwood of stressed woody hosts and culture a symbiotic fungus as food for their offspring. Preventing attacks is preferred but a better understanding of their biology may elucidate additional avenues for control. Recent phenological studies are lacking for <span>X. germanus</span> that is common in New York, and biological information on brood and gallery development is lacking for the less abundant <span>X. crassiusculus</span>. We conducted both outdoor rearing and laboratory studies to better understand the timing of key events in the maturation of their galleries, particularly associated with the symbiotic fungi. Two and a partial third summer generation were consistently observed over 2 yr for <span>X. germanus</span>; and thus, 3 flights of adult females (foundresses) occurred each summer from mid-April to late September. In both the field and laboratory, initial growth of the symbiotic fungus occurs within a few days of gallery initiation. The rapid development of the reproductive tract and oviposition by <span>X. germanus</span> appears to be stimulated by the presence of the fungus. Fungal, reproductive, and brood development are similar for the related <span>X. crassiusculus</span> in laboratory studies; the 2 species mainly appear to differ in size. The lag between beetle colonization and reproduction currently seems too brief to be exploited for management. Disruption of other stages in gallery development should also be explored to minimize the beetle damage if attacks cannot be prevented.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"ef12498a36b043693fbc5f291baccb509e54f8dc7fed06cd43ee919db9012564","category":"Environment"}