{"title":"Reconciling Global Terrestrial Evapotranspiration Estimates From Multi‐Product Intercomparison and Evaluation","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037608?af=R","date":1725886186000,"content":"<h2>Abstract</h2>\n<p>Terrestrial evapotranspiration (ET) is a vital process regulating the terrestrial water balance. However, significant uncertainties persist in global ET estimates. Focusing on the area between 60°, we performed an intercomparison of 90 state-of-the-art ET products from 1980 to 2014. These products were obtained from various sources or methods and were grouped into six categories: remote sensing, reanalysis, land surface models, climate models, machine learning methods, and ensemble estimates. It is shown that global ET magnitudes of categories differ considerably, with averages ranging from 518.4 to 706.3 mm yr<sup>−1</sup>. Spatial patterns are generally consistent but with significant divergence in tropical rainforests. Global trends are mildly positive or negative (−0.10 to 0.37 mm yr<sup>−2</sup>) depending on categories but with distinct spatial variability. Evaluation against site measurements reveals various performances across land cover types; the ideal point error values range from 0.45 to 0.83, with wetlands performing the worst and open shrublands the best. Using the three-cornered hat method, there are spatial differences in ET uncertainty, with lower uncertainty for ensemble estimates, showing less than 15% relative uncertainty in most areas. The best global ET data set varies depending on the intended use and study region. Distinct spatial patterns of controlling factors across categories have been identified, with precipitation driving arid and semi-arid regions and leaf area index dominating tropical regions. It is suggested to include advancing precipitation inputs, incorporate vegetation dynamics, and employ hybrid modeling in future ET estimates. Constraining estimates using complementary data and robust theoretical frameworks can enhance credibility in ET estimation.</p>","author":"Yaoting Cai, \nQingchen Xu, \nFan Bai, \nXueqi Cao, \nZhongwang Wei, \nXingjie Lu, \nNan Wei, \nHua Yuan, \nShupeng Zhang, \nShaofeng Liu, \nYonggen Zhang, \nXueyan Li, \nYongjiu Dai","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"ef1546be0bbcef07f0afcc93b913eed4ea991bd1bbe4c24689f8499b0f74b36e","category":"Environment"}