{"title":"CeramicSpeed’s extraordinary chainless drivetrain seeks investors to continue development","link":"https://www.bikeradar.com/news/ceramicspeed-driven-technologies/","date":1619435776000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2019/09/Full-Driven-Sideview-640a984.jpg?quality=45&amp;resize=620,413\" />                                            <p>CeramicSpeed is seeking investors to help turn its extraordinary Driven chainless drivetrain into a rideable product with an aim to start manufacturing in 12 to 18 months.</p>\n<p>CeramicSpeed, best known for its friction-reducing drivetrain components, <a href=\"https://www.bikeradar.com/news/faster-than-any-chain-ceramicspeed-driven/\">first teased Driven back in 2018</a>, showing off a concept that combined a shaft with a unique method for transferring drive that featured bearings engaging with gear teeth.</p>\n<p>Now, the brand has formed a spin-off company called Driven Technologies Inc. Based in Boulder, its sole focus will be turning Driven into an actual product.</p>\n<p>This “spinout entity” is seeking investment from the public, with a minimum $1,000 investment available.</p>\n<h2>What is CeramicSpeed Driven?</h2>\n<p>Driven was originally conceived as a way to drastically reduce drivetrain friction, by reducing the number of “points of articulation”.</p>\n<p>When the concept was first unveiled, its designers claimed it could reduce friction by 49 per cent compared to a stock Dura-Ace drivetrain.</p>\n<p>In 2019, CeramicSpeed doubled down and <a href=\"https://www.bikeradar.com/news/ceramicspeed-driven-most-aero-drivetrain/\">declared Driven to be the most aero drivetrain in the world</a> and that a rideable prototype had been constructed.</p>\n<p>The brand quickly followed up by demonstrating <a href=\"https://www.bikeradar.com/news/ceramicspeed-driven-chainless-shifting/\">a shifting mechanism for Driven</a> that used an ingenious “split pinion” design. This was on static display and the brand didn’t claim to have road-tested it.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Driven’s proposed shifting arrangement relies on a complex “split pinion” that engages with the flat “cassette”.</span></figcaption><span> <i>Oliver Woodman / Immediate Media</i></span></div>\n<p>Driven Technologies’ goal is to combine “rideability and shiftability” into a “durable package”, and claims “the finish line isn’t far away”.</p>\n<p>Executive Vice President of CeramicSpeed, Martin Banke, says: “as Driven enters its final stages of development it needs a bigger scale of production to be finalised, so it’s only natural that we get other parties on board to help drive the development forward.</p>\n<p>“CeramicSpeed will always be a part of Driven as I truly believe it will become the benchmark within drivetrain technology”.</p>\n<p>Despite the optimistic language, it’s important to note that Driven remains very much a prototype design, and no third parties have yet had a chance to ride it.</p>\n<p>The Driven crowdfunding campaign is being hosted on <a href=\"https://www.seedinvest.com/driven/seed\" target=\"_blank\">SeedInvest</a>.</p>\n","author":"Matthew Loveridge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"ef1fe4f488c5cf5c3b36d151028859ef47507952f86951457f7227c20db7b3a1","category":"Cycling"}