{"title":"Zwift signs on as title sponsor for Tour de France Femmes","link":"https://cyclingtips.com/2021/06/zwift-signs-on-as-title-sponsor-for-tour-de-france-femmes/","date":1623942054000,"content":"<div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/CORVOS_00025365-007-650x433.jpg\" /></div>\n<p>The women’s Tour de France is well and truly in the works, now with the backing of Zwift as their presenting partner. Zwift confirmed on Thursday that they will partner with the A.S.O. to create the Tour de France Femmes avec Zwift in 2022. Furthermore, the virtual platform has signed a four year deal with the A.S.O. that will guarantee the race is on the calendar through 2025.</p>\n\n\n\n<p>Rumblings of a women’s Tour de France began circulating in 2020, fueled by hope but with little hard evidence. In May of 2021, Christian Prudhomme, the race director for the men’s Tour de France, announced that <a href=\"https://cyclingtips.com/2021/05/a-womens-tour-de-france-is-looking-more-likely/\" target=\"_blank\">there would indeed be a women’s Tour de France in 2022</a>. At the time he did not give firm information on the number of stages or the general idea of the race. </p>\n\n\n\n<p>Within weeks the UCI announced the <a href=\"https://cyclingtips.com/2021/06/2022-womens-worldtour-calendar-includes-tour-de-france-femmes-and-giro-ditalia-donne/\" target=\"_blank\">Women’s WorldTour calendar in 2022</a>, and on it was an eight-day Tour de France Femmes event. </p>\n\n\n\n<p>The first stage of the Tour de France Femmes avec Zwift will take place on the Champs-Élysées in Paris on July 24th, the same day the men ride onto the finishing circuit. </p>\n\n\n\n<p>“This is a huge moment for professional women’s cycling”, said current World Champion Anna van der Breggen of SD Worx. “The Tour de France is the most famous race in cycling and it’s long been a dream for many of us to compete in a women’s Tour de France. I’m hopeful that the race will help us grow our sport even more by providing us with a media platform to take the excitement of women’s cycling to new audiences.”</p>\n\n\n\n<p>Zwift and the A.S.O. worked together in 2020 to create a virtual women’s and men’s Tour de France on the Zwift platform. The event was the first time the women were on equal footing with the men when it came to the iconic French race. The UCI Cycling Esports World Championships on Zwift at the end of 2020 was another example of equality on the virtual platform, with the men and women racing the same distances with the same amount of coverage and the same financial rewards. </p>\n\n\n\n<p>“This is an incredibly important announcement for us as we look to build on our investment in women’s cycling and really help grow and develop the sport,” said Eric Min, CEO and co-founder of Zwift. “I’ve long been a fan of the attacking style of women’s racing. I really believe the women’s peloton puts on some of the most exciting bike racing to watch and it deserves a much bigger platform to exhibit these talents and skills. I’m proud that we can play a big part in making the Tour de France Femmes avec Zwift a reality in 2022. Together we can bring women’s cycling to a larger audience and inspire new generations of female cyclists for years to come.”</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/06/zwift-signs-on-as-title-sponsor-for-tour-de-france-femmes/\">Zwift signs on as title sponsor for Tour de France Femmes</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"ef20a5d8b1e3ce5fc750b28e70e23f9caabee14b9d3f190d89c8d417ee40bb58","category":"Cycling"}