{"title":"Estimation equation of limb lean soft tissue mass in Asian athletes using bioelectrical impedance analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300911","date":1724853600000,"content":"<p>by Yeong-Kang Lai, Chu-Ying Ho, Ai-Chun Huang, Hsueh-Kuan Lu, Kuen-Chang Hsieh</p>\r\nBackground <p>The lean soft tissue mass (LSTM) of the limbs is approximately 63% of total skeletal muscle mass. For athletes, measurement of limb LSTM is the basis for rapid estimation of skeletal muscle mass. This study aimed to establish the estimation equation of LSTM in Asian athletes using bioelectrical impedance analysis (BIA).</p> Methods <p>A total of 198 athletes (121 males, 77 females; mean age 22.04 ± 5.57 years) from different sports in Taiwan were enrolled. A modeling group (MG) of 2/3 (n = 132) of subjects and a validation group (VG) of 1/3 (n = 68) were randomly assigned. Using the InBody S-10, resistance and reactance were measured at 50 kHz from the right palm to the right sole while the participant was in the supine position. Predictor variables were height (h), weight (W), age, Sex, Xc, resistance index (RI; RI = h<sup>2</sup> / R). LSTM of arms and legs measured by dual-energy X-ray absorptiometry (DXA) was the response variable. Multivariate stepwise regression analysis method was used to establish BIA estimation equations as ArmsLSTM<sub>BIA-Asian</sub> and LegsLSTM<sub>BIA-Asian</sub>. Estimation equations performance was confirmed by cross-validation.</p> Results <p>Estimation equation \"ArmsLSTM<sub>BIA-Asian</sub> = 0.096 h<sup>2</sup>/R– 1.132 Sex + 0.030 Weight + 0.022 Xc– 0.022 h + 0.905, r<sup>2</sup> = 0.855, SEE = 0.757 kg, n = 132\" and \"LegsLSTM<sub>BIA Asian</sub> = 0.197h<sup>2</sup>/R\" + 0.120 h– 1.242 Sex + 0.055 Weight– 0.052 Age + 0.033 Xc –16.136, r<sup>2</sup> = 0.916, SEE = 1.431 kg, n = 132\" were obtained from MG. Using DXA measurement results of VG for correlation analysis and Limit of Agreement (LOA) of Bland-Altman Plot, ArmsLST is 0.924, -1.53 to 1.43 kg, and LegsLST is 0.957, -2.68 to 2.90 kg.</p> Conclusion <p>The established single-frequency BIA hand-to-foot (whole body) estimation equation quickly and accurately estimates LSTM of the arms and legs of Asian athletes.</p>","author":"Yeong-Kang Lai","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ef25e0066a9e1d76aab568d91187cff49b648a3b9ae32d5890b3434c48344b55","category":"Interdisciplinary"}