{"title":"iPhone 15 Pro Max Expected to Feature 5-6x Optical Zoom","link":"https://www.macrumors.com/2023/04/18/iphone-15-pro-max-5-6x-optical-zoom/","date":1681837292000,"content":"While the iPhone currently maxes out at 3x optical zoom, rumors suggest that will change this year. The next-generation iPhone 15 Pro Max is widely expected to feature a so-called \"periscope lens\" that would allow for up to double the optical zoom.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/iPhone-15-Pro-Periscope-Mock-Feature.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nIn <a href=\"https://www.macrumors.com/2022/07/14/periscope-lens-iphone-15-pro-max-kuo/\">July 2022</a>, Apple analyst Ming-Chi Kuo said a periscope lens would be exclusive to the high-end iPhone 15 Pro Max and enable 5-6x optical zoom. Periscope technology would be built into the Telephoto lens and allow for up to 6x zoom when shooting photos with the rear camera, without any blurriness or reduction in image quality.\r<br />\n\r<br />\nWith a periscope lens, light absorbed by the image sensor is bent or \"folded,\" allowing for a greater distance between the camera elements within the compact design of a smartphone. This technology allows for increased optical zoom and is already used by some Android brands like Samsung, Google, and Huawei, with phones like the Pixel 7 Pro and Galaxy S23 Ultra offering between 5x and 10x optical zoom.\r<br />\n\r<br />\n5-6x optical zoom would be a significant camera upgrade for the iPhone. Unfortunately, Kuo said the periscope lens would <a href=\"https://www.macrumors.com/2023/01/31/kuo-iphone-16-pro-max-periscope-lens/\">remain limited to the iPhone 16 Pro Max</a> next year, meaning that the technology would only be available on the most expensive iPhone model for at least the next two and a half years or so.\r<br />\n\r<br />\nApple is expected to announce the iPhone 15 lineup in September. For more details, read our guide about <a href=\"https://www.macrumors.com/guide/periscope-lens/\">iPhone periscope lens rumors</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/18/iphone-15-pro-max-5-6x-optical-zoom/\">iPhone 15 Pro Max Expected to Feature 5-6x Optical Zoom</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-pro-max-expected-to-feature-5-6x-optical-zoom.2387138/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"ef313a49dcfc690cdcb4700cc86381e62c057486a1d5ab6e79fa655415f59df5","category":"Apple"}