{"title":"Temporal evolution of plankton and particles distribution across a mesoscale front during the spring bloom","link":"https://onlinelibrary.wiley.com/doi/10.1002/lno.12566?af=R","date":1713769200000,"content":"<h2>Abstract</h2>\n<p>The effect of mesoscale features on the distribution of planktonic organisms are well documented. Yet, the interaction between these spatial features and the temporal scale, which can result in sudden increases of the planktonic biomass, is less known and not described at high resolution. A permanent mesoscale front in the Ligurian Sea (north-western Mediterranean) was repeatedly sampled between January and June 2021 using a SeaExplorer glider equipped with an Underwater Vision Profiler 6 (UVP6), a versatile in situ imager. Both plankton and particle distributions were resolved throughout the spring bloom to assess whether the front was a location of increased zooplankton concentration and whether it constrained particle distribution. Over the 5 months, the glider performed more than 5000 dives and the UVP6 collected 1.1 million images. We focused our analysis on shallow (300 m) transects, which gave a horizontal resolution of 900 m. About 13,000 images of planktonic organisms were retained. Ordination methods applied to particles and plankton concentrations revealed strong temporal variations during the bloom, with a succession of various zooplankton communities. Changes in particle abundance and size could be explained by changes in the plankton community. The front had a strong influence on particle distribution, while the signal was not as clear for plankton, probably because of the relatively small number of imaged organisms. This work confirms the need to sample both plankton and particles at fine scale to understand their interactions, a task for which automated in situ imaging is particularly adapted.</p>","author":"Thelma Panaïotis, \nAntoine Poteau, \nÉmilie Diamond Riquier, \nCamille Catalano, \nLucas Courchet, \nSolène Motreuil, \nLaurent Coppola, \nMarc Picheral, \nJean‐Olivier Irisson","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"ef35ce99235dbe0e14e99f3d52606615930eae269118065ef02b63d548aaae1e","category":"Environment"}