{"title":"Comparability of radar and optical methods in identifying surface water in a semi‐arid protected area","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13301?af=R","date":1721235295000,"content":"<h2>Abstract</h2>\n<p>Surface water assumes a pivotal role in sustaining a wide range of wildlife species in semi-arid protected areas. However, differences in surface water body typology, underlying soil type, wildlife activity, the presence of phytoplankton amongst other factors, result in high variability of surface water spectral reflectance and detection accuracy. In this study, the performance of radar and optical methods was evaluated in detecting surface water of variable spectral reflectance in Hwange National Park, Zimbabwe using Sentinel-1 radar and Sentinel-2 optical images for the period 2016–2023. Results demonstrated that radar methods had low surface water detection accuracy which was highly variable as shown by overall accuracy and kappa statistic measures which continuously changed over time compared with optical methods. The overall best-performing method was the optical AWEI<sub>nsh</sub> (sharpened) which showed high surface water detection accuracy and consistency (OA: 94%–100%) and (<i>κ</i>: 0.88–1.00) from 2016 to 2023. Therefore, optical methods present a stable and robust way for surface water monitoring in heterogeneous semi-arid protected areas. However, radar-based methods should be continually explored where optical-based technologies are impeded as a result of vegetation cover and cloud conditions.</p>\n<h2>Résumé</h2>\n<p>Les eaux de surface jouent un rôle essentiel dans le maintien d'un nombre important d'espèces sauvages vivant dans les zones protégées semi-arides. Cependant, les différences dans la typologie des masses d'eau de surface, le type de sol sous-jacent, l'activité de la faune, la présence de phytoplancton, entre autres facteurs, entraînent une grande variabilité de la réflectance spectrale de l'eau de surface et de la précision de la détection. Dans cette étude, la performance des méthodes radar et optiques a été évaluée pour la détection des eaux de surface de réflectance spectrale variable dans le parc national de Hwange, au Zimbabwe, en utilisant les images radar Sentinel-1 et les images optiques Sentinel-2 pour la période 2016-2023. Les résultats ont démontré que les méthodes radar offraient un faible niveau de précision de détection des eaux de surface, qui était très variable, comme l'illustrent les mesures de précision globale et de statistique kappa qui ont continuellement changé au fil du temps par rapport aux méthodes optiques. La méthode la plus performante était la méthode optique AWEI<sub>nsh</sub> (sharpened) qui a offert un niveau de précision élevé et constant dans la détection des eaux de surface (OA : 94 %-100 %) et (κ : 0,88-1,00) de 2016 à 2023. Par conséquent, les méthodes optiques constituent un moyen stable et efficace pour la surveillance des eaux de surface dans les zones protégées semi-arides hétérogènes. Cependant, les méthodes basées sur le radar devraient continuer à être explorées lorsque les performances des technologies basées sur l'optique sont compromises en raison de la couverture végétale et des conditions nuageuses.</p>","author":"Zorodzai Dzinotizei, \nHilton G. T. Ndagurwa, \nHenry Ndaimani, \nAngella Chichinye","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"ef35271e6f7a8511e583965d6ea1ba25e3d9204dd6aca6baa76518089215a8c1","category":"Environment"}