{"title":"Assessment of associations between inhaled formaldehyde and lymphohematopoietic cancer through the integration of epidemiological and toxicological evidence with biological plausibility","link":"https://academic.oup.com/toxsci/article/199/2/172/7636988?rss=1","date":1711584000000,"content":"<span><div>Abstract</div>Formaldehyde is recognized as carcinogenic for the portal of entry sites, though conclusions are mixed regarding lymphohematopoietic (LHP) cancers. This systematic review assesses the likelihood of a causal relationship between formaldehyde and LHP cancers by integrating components recommended by NASEM. Four experimental rodent bioassays and 16 observational studies in humans were included following the implementation of the <span>a priori</span> protocol. All studies were assessed for risk of bias (RoB), and meta-analyses were conducted on epidemiological studies, followed by a structured assessment of causation based on GRADE and Bradford Hill. RoB analysis identified systemic limitations precluding confidence in the epidemiological evidence due to inadequate characterization of formaldehyde exposure and a failure to adequately adjust for confounders or effect modifiers, thus suggesting that effect estimates are likely to be impacted by systemic bias. Mixed findings were reported in individual studies; meta-analyses did not identify significant associations between formaldehyde inhalation (when measured as ever/never exposure) and LHP outcomes, with meta-SMRs ranging from 0.50 to 1.51, depending on LHP subtype. No associations with LHP-related lesions were reported in reliable animal bioassays. No biologically plausible explanation linking the inhalation of FA and LHP was identified, supported primarily by the lack of systemic distribution and <span>in vivo</span> genotoxicity. In conclusion, the inconsistent associations reported in a subset of the evidence were not considered causal when integrated with the totality of the epidemiological evidence, toxicological data, and considerations of biological plausibility. The impact of systemic biases identified herein could be quantitatively assessed to better inform causality and use in risk assessment.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"ef5488b8b2c08b0692740db31ee4ddcf745a3d47f8e056ce32e2d9367207eca2","category":"Environment"}