{"title":"Anion and Cation Co-doping of NiO for Transparent Photovoltaics and Smart Window Applications","link":"https://www.preprints.org/manuscript/202406.0821/v1","date":1718186327000,"content":"Materials engineering based on metal oxides for manipulating the solar spectrum and producing solar energy have been under intense investigation over the last years. In this work, we present NiO thin films double-doped with niobium (Nb) and nitrogen (N) as cation and anion dopants (NiO:(Nb,N)) to be used as p-type layers in all oxide transparent solar cells. The films were grown by sputtering a composite Ni-Nb target on room-temperature substrates in plasma containing 50% Ar, 25% O2 and 25% N2 gases. The existence of Nb and N dopants in the NiO structure was confirmed by the Energy Dispersive X-Ray and X-Ray Photoelectron Spectroscopy techniques. The nominally undoped NiO film, which was deposited by sputtering a Ni target and used as the reference film, was oxygen-rich, single-phase cubic NiO, having a visible transmittance of less than 20%. Upon double doping with Nb and N the visible transmittance of NiO:(Nb,N) film increased to 60%, which was further improved after thermal treatment to around 85%. The respective values of the direct band gap in the undoped and double-doped films were 3.28 eV and 3.73 eV just after deposition and 3.67 eV and 3.76 eV after thermal treatment. The changes in the properties of the films such as structural disorder, direct and indirect energy band gaps, Urbach tail states and resistivity were correlated with the incorporation of Nb and N in their structure. The thermally treated NiO:(Nb,N) film was used to form a diode with a spin-coated two-layer, mesoporous on top of a compact, TiO2 film. The NiO:(Nb,N)/TiO2 heterojunction exhibited visible transparency of around 80%, showed rectifying characteristics and the diode’s parameters were deduced using the I-V method. The diode revealed photovoltaic behavior upon illumination with UV light exhibiting a short circuit current density of 0.2 mA/cm2 and open-circuit voltage of 500 mV. Improvements of the output characteristics of the NiO:(Nb,N)/TiO2 UV-photovoltaic by proper engineering of the individual layers and device processing procedures are addressed. Transparent NiO:(Nb,N) films can be potential candidates in all-oxide ultraviolet photovoltaics for tandem solar cells, smart windows and other optoelectronic devices.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ef5bb926b596315079b43ac668ed5b025a1ed7c22b546a2fba532e36a6b3842c","category":"Interdisciplinary"}