{"title":"How to use Quick Look from Terminal in macOS","link":"https://www.macworld.com/article/189187/macos-command-line-terminal-quick-look.html","date":1625382900000,"content":"\n<div>\n<section><div></div></section><p>Quick Look is one of the more compelling features in macOS. Introduced in <a href=\"http://www.macworld.com/topics/mac_os_x_leopard.html\">OS X 10.5</a>, you no longer do you have to open an application just to glance at a file—a press of the Space Bar in the Finder is all it takes. </p>\n\n\n\n<p>But you may be surprised to find that you can use Quick Look when working in Terminal, a decidedly non-GUI application. This feature can be useful if you’re working in Terminal and want to be sure a certain file is what you think it is before you do something to it. Instead of switching out to the Finder, or using the <code>open</code> command, you can Quick Look the file directly from Terminal. </p>\n\n\n\n<p>How? The key is a Unix program, <code>qlmanage</code>, introduced in OS X 10.5 and built into macOS. This program was really designed for programmers writing Quick Look generators, but we can use it for our own purposes. To see the Quick Look preview for any file, just type<strong> <code>qlmanage -p somefile</code></strong>, where <code><strong>somefile</strong></code> is the full name of a file in the current directory.</p>\n\n\n\n<p>As an example, here’s how you could use Quick Look from Terminal to examine a PNG file. The two commands below first change to the Mac’s User Pictures/Fun folder in the Library folder, then ask the system to display the Quick Look preview for one of the images: </p>\n\n\n\n<pre>cd /Library/User\\ Pictures/Fun\nqlmanage -p \"Gingerbread Man.tif\"</pre>\n\n\n\n<p>After you see quite a bit of text go flowing past in Terminal, a Quick Look window will open, displaying the Gingerbread Man user picture. It’s important to note that this is <em>not</em> the Finder’s Quick Look window—in fact, if you switch out to the Finder with the Terminal’s Quick Look window still showing, you’ll see that you can open new Quick Look windows in the Finder. To close the Terminal’s Quick Look window, you can either use the mouse and click the preview window’s close box, or (much simpler) just press Command-C to end the <code>qlmanage</code> program. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/macos-big-sur-terminal-quick-look-1.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>What about all that text that goes flowing by? That’s there to help developers debug their Quick Look code. To you and I, though, it’s completely extraneous.</figcaption></figure><p>IDG</p></div>\n</div>","author":"Rob Griffiths","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ef5d631e838bb7c0ead41dcdca8921d92fdfb8dd7e72ae4c821ea75eea1db4ff","category":"Apple"}