{"title":"Comparative analysis of mechanical conditions in bone union following first metatarsophalangeal joint arthrodesis with varied locking plate positions: A finite element analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303752","date":1715868000000,"content":"<p>by Agnieszka Sabik, Karol Daszkiewicz, Wojciech Witkowski, Piotr Łuczkiewicz</p>\r\nBackground <p>First metatarsophalangeal joint arthrodesis is a typical medical treatment performed in cases of arthritis or joint deformity. The gold standard for this procedure is arthrodesis stabilisation with the dorsally positioned plate. However, according to the authors’ previous studies, medially positioned plate provides greater bending stiffness. It is worth to compare the mechanical conditions for bone formation in the fracture callus for both placements of the locking plate.</p> Methods <p>Two finite element models of the first metatarsophalangeal joint with the dorsally and medially positioned plate were defined in the Abaqus software to simulate differentiation of the fracture callus. A simplified load application, i.e. one single step per each day and the diffusion of the mesenchymal stem cells into the fracture region were assumed in an iterative hardening process. The changes of the mesenchymal stem cells into different phenotypes during the callus stiffening were governed by the octahedral shear strain and interstitial fluid velocity according to Prendergast mechanoregulation theory. Basing on the obtained results the progress of the cartilage and bone tissues formation and their distribution within the callus were compared between two models.</p> Findings <p>The obtained results suggest that after 6 weeks of simulation the healing progress is in general comparable for both plates. However, earlier closing of external callus was observed for the medially positioned plate which had greater vertical bending stiffness. This process enables faster internal callus hardening and promotes symmetrical bridging.</p>","author":"Agnieszka Sabik","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ef6479daf6e905d14729588615bb48a308d733e3069387e18b471a18c848c54f","category":"Interdisciplinary"}