{"title":"Evaluation of Chronic Pain Development in Patients Undergoing Shoulder Arthroscopy","link":"https://www.preprints.org/manuscript/202409.1862/v1","date":1727168682000,"content":"Background/Objectives: Chronic postoperative pain remains a significant barrier in postoperative management, particularly in patients who have undergone shoulder surgery. We evaluated the predictors of chronic pain following shoulder arthroscopy.\nMethods: This was a retrospective, observational study of patients who underwent shoulder arthroscopy at a university hospital  between 2012 and 2017. Telephone contact was established with 178 patients who met the study criteria. Demographic data, comorbidities, preoperative interscalene block application, intraoperative opioid use, and records of postoperative patient-controlled analgesia were obtained by reviewing patient files. Upon contact, each patient's psychological state and pain level were assessed. Results: Interscalene block was administered to 33 (18.5%) of the patients, while patient-controlled analgesia was provided to 97 (54.5%). The analgesic method of 48 patients’ were not achieved from the records. Chronic pain was identified in 92 patients (51.7%). Body weight,\ncomorbidities, and the combined use of opioids and non-opioids were found to be significant risk factors (p-values of 0.024, 0.016, and 0.010, respectively) for chronic pain. Multivariate Logistic Regression analysis revealed that the risk of chronic pain in patients with comorbidities and combined opioid-non-opioid use was 9.27 times higher than in those without comorbidities. In the presence of comorbidities, the risk of chronic pain was found to be 7.18 times higher in patients who did not use a combination of opioids and non-opioids.\nConclusion: This study indicates that higher body weight, the presence of comorbidities, and the use of both opioids and non-opioids are significant predictors of increased chronic postoperative pain following shoulder arthroscopy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ef651f90c508892493b9f480bb82ea35b9716594110f8a02d7612b01d35be814","category":"Interdisciplinary"}