{"title":"Modelling agricultural landscape complementation for natural pest control","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14790?af=R","date":1729051266000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/1357ecd1-0461-453f-bf88-72db5685459d/jpe14790-toc-0001-m.png\" alt=\"Modelling agricultural landscape complementation for natural pest control\" />\n<p>Our modelling study provides insights in the role of landscape complementation for natural pest control in arable crops by revealing where resource discontinuities can become bottlenecks. Effective natural pest control relies on a variety of different habitats that provide floral and prey resources during different times of the year, for example a woody habitat, an early crop such as winter wheat, a late crop such as potato and flowering field margins next to these crops. If any of these (or similarly functioning) habitats are absent from the landscape we can expect higher pest densities in the crops and larger fluctuations in pest densities over the years.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPest-regulating natural enemies often require crop and non-crop habitats to persist and be effective. These habitats offer hibernation sites, alternative prey or floral resources but can also be complementary in when they provide resources. The relative contribution of these different habitats to the performance of pest-regulating insects is largely unknown, since it is difficult to study empirically. Landscape-based population-dynamical modelling can fill this research gap.\n\nIn this study, we modelled the dynamics of predatory hoverflies (Diptera: Syrphinae) and their aphid prey in a collection of habitats. These hoverflies are dependent on different habitats for different reasons. While their larvae predate on aphids, adult hoverflies require floral resources. Resources are often segregated in different habitats. In addition, they are only temporarily available in any habitat type. In our model, hoverflies move between different habitats and select where to feed and where to produce off-spring based on optimal foraging considerations. The model represents habitats common in arable landscapes and their temporal availability of resources is parameterized based on field observations.\n\nThe model shows that effective pest suppression will only occur in the presence of at least three different habitats, including two crops that provide prey resources at different times of the year. A woody habitat with shrubs and trees provide aphid prey very early and late in the season, whereas an early crop and a late crop cover the period in between. In addition, these habitats need to provide floral resources in the same period as aphids, for example by flower strips in the margins of crop fields or blossoming trees or shrubs in the woody habitat. Under the model assumptions, the best pest suppression is obtained when the woody habitats take up 6% to 10% of the landscape. In addition to yearly population fluctuations, also bi- or multi-yearly cycles may occur, depending on the composition of the landscape.\n\n<i>Synthesis and applications</i>. Our model shows when an agricultural landscape is ‘complete’ for natural enemies (and for effective pest control). For this, it needs to contain multiple habitats that supply floral and prey resources in different periods of the year.\n</p>\n<h2>Samenvatting</h2>\n<p>\n\nVeel natuurlijke vijanden die gewasplagen helpen bestrijden, hebben in het agrarische gebied diverse habitats nodig om te overleven en effectief te zijn. Deze habitats bieden overwinteringsplaatsen, alternatieve prooien, en bloemenvoedsel zoals pollen en nectar, maar kunnen ook complementair zijn doordat ze op verschillende momenten in het jaar voedsel bieden. De relatieve bijdrage van deze verschillende habitats aan de effectiviteit van plaagregulerende insecten is nog grotendeels onbekend, omdat het moeilijk is om dit proefondervindelijk te bepalen. Populatie-dynamische modellering op landschapsniveau kan echter meer inzicht geven.\n\nIn deze studie hebben we de populatie-dynamiek gemodelleerd van luisetende zweefvliegen (Diptera: Syrphinae) en hun prooi, bladluizen, in een landschap met verschillende habitats. Deze zweefvliegen zijn om uiteenlopende redenen afhankelijk van verschillende habitats. Terwijl de larven zich voeden met bladluizen, hebben volwassen zweefvliegen bloemenvoedsel nodig. Deze voedselbronnen zijn vaak gescheiden in verschillende habitats en bovendien in elk type habitat slechts tijdelijk beschikbaar. In ons model kunnen zweefvliegen zich verplaatsen tussen de verschillende habitats en kiezen daarbij de plekken om zich te voeden en om nakomelingen te produceren op basis van optimale foerageerstrategieën. Het model omvat een verzameling van habitats dat veel voorkomt in akkerbouwgebieden, en de gemodelleerde beschikbaarheid van voedsel is gebaseerd op veldwaarnemingen.\n\nOns model laat zien dat effectieve plaagonderdrukking alleen mogelijk is bij de aanwezigheid van ten minste drie verschillende habitats, waaronder twee gewassen die op verschillende tijdstippen in het jaar prooien bieden. Een houtig habitat met struiken en bomen biedt de zweefvliegen prooien zeer vroeg en laat in het seizoen, terwijl een vroeg gewas en een laat gewas de periode daartussen overbruggen. Bovendien moeten deze habitats bloemenvoedsel bieden in dezelfde periode dat de bladluizen actief zijn, bijvoorbeeld door bloemstroken in de akkerranden of door vroegbloeiende bomen en struiken in het houtige habitat. Volgens de modelaannames wordt de beste plaagonderdrukking verkregen wanneer de houtige habitats 6% tot 10% van het landschap beslaan. In aanvulling op de populatiefluctuaties gedurende het jaar kunnen ook twee- of meerjarige cycli optreden, afhankelijk van de samenstelling van het landschap.\n\n<i>Synthese en toepassingen</i>. Ons model laat zien wanneer een agrarisch landschap ‘compleet’ is voor de natuurlijke vijanden (en daarmee voor effectieve natuurlijk plaagbestrijding). Hiertoe moet het landschap bestaan uit meerdere habitats die verschillen in het tijdstip waarop ze geschikte bloemen en prooien aanbieden. Het biedt daarmee richtlijnen voor een meer optimale inrichting van het landschap.\n</p>","author":"Laura Mansier, \nPaul C. J. van Rijn","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"ef6f0e80b052aade91f7b3dc4968a08500cfd08029e668c41c319ac7177f6419","category":"Environment"}