{"title":"Does Climate Change and Energy Consumption Affect the Food Security of European Union Countries? Empirical Evidence from a Panel Study","link":"https://www.preprints.org/manuscript/202405.1444/v1","date":1716445262000,"content":"This study aims to provide empirical evidence on whether using renewable and non-renewable energy, CO₂ emissions and the resulting changes in temperature and precipitation can alter cereal yields in European Union countries. To this end, a panel data set covering 1992-2021 has been used to analyse the impact of climate change and economic factors on cereal production in European Union countries. The study employed various analytical techniques to understand better the relationship between climate change, energy consumption, and economic growth. These included using annual average temperature and rainfall to measure climate change and energy consumption and economic growth to analyse the economic aspects. To achieve the objective, feasible generalised least squares (FGLS) models with robust standard errors and bootstrap and a quantile regression (QR) model with marginal analysis were employed. The Westerlund cointegration test confirmed the presence of cointegration between cereal production and climate variables, economic growth, and energy consumption. The results indicate that increases in temperature and precipitation may contribute to increased cereal production in European Union countries. In contrast, energy consumption, including renewable energy and CO₂ emissions, may have a nonlinear effect on cereal production. Quantile regression analysis suggests climate change may impact crop yields most in countries with low and moderate cereal production per hectare. Increased CO₂ emissions may increase yields in the initial period, but excessive CO₂ may negatively impact cereal production in the long term. It would be advisable for countries with low and moderate crop productivity to consider implementing technological advances and combating global warming by modernising cultivation methods and making greater use of renewable energy sources.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ef7142480c804e8dfc1d406f5e6f5f574ae177598746e98709a0d65d4406611c","category":"Interdisciplinary"}