{"title":"ลูกสาว Robin Williams นักแสดงผู้ล่วงลับ วิจารณ์การใช้ AI ที่สร้างเสียงของพ่อเธอขึ้นมาใหม่ว่า “มันรบกวนจิตใจ”","link":"https://www.blognone.com/node/136053","date":1696325142000,"content":"<div><div><div><p>Zelda Williams ลูกสาวของ Robin Williams ออกมาวิพากษ์วิจารณ์การใช้ปัญญาประดิษฐ์ (AI) ที่สร้างเสียงของพ่อผู้ล่วงลับของเธอ และนักแสดงคนอื่น ๆ ที่ไม่สามารถฟื้นขึ้นมาเซ็นต์ยินยอมได้</p>\n<p>รายงานนี้มาจาก Deadline สำนักข่าวบันเทิงของวงการฮอลิวู๊ดว่า เมื่อเร็ว ๆ นี้คุณ Zelda Williams ได้ใช้ Instagram Stories เพื่อส่งเสียงของเธอเพื่อสนับสนุนการต่อสู้กับ AI ของ Screen Actors Guild (SAG) โดยเธอประณามถึงการใช้เทคโนโลยี AI เพื่อสร้างเสียงของพ่อของเธอมานานเป็นปี</p>\n<p>คุณ Zelda บอกผ่าน Instagram Stories ว่าตัวเธอไม่ได้เป็นกลางที่ SAG ต่อต้าน AI พร้อมเขียนวิจารณ์ฉบับยาวว่า มีหลายคนที่ต้องการฝึกโมเดลพวกนี้เพื่อสร้างหรือทำซ้ำนักแสดงที่ล่วงรับที่ไม่สามารถเซนต์ยินยอมได้เหมือนพ่อของเธอ</p>\n<p>Zelda กล่าวว่า AI เคยใช้เสียงของ Robin Williams เพื่อพูดอะไรก็ตามที่ต้องการ และพบว่ามันรบกวนจิตใจสำหรับเธอ (disturbing) แต่การใช้ AI สร้างเสียงมันก็ไปไกลกว่านั้น เธอกล่าวว่านักแสดงที่ยังมีชีวิตอยู่สมควรได้รับโอกาสมากกว่า และมองว่าการใช้ AI ทำแบบนี้เป็นเหมือนการสร้างสัตว์ประหลาดแฟรงเกนสไตน์ที่รวมทุกชิ้นส่วนที่เลวร้ายที่สุดในอุตสาหกรรมเข้าด้วยกัน</p>\n<p>สำหรับ Robin Williams เสียชีวิตด้วยการฆ่าตัวตายในปี 2014 ด้วยวัย 63 ปี หลังจากต่อสู้กับความวิตกกังวล อาการซึมเศร้า และโรคพาร์กินสัน จากการชันสูตรศพพบว่าเขามีภาวะสมองเสื่อมด้วย</p>\n<p><em>ภาพของ Robin Williams ในหนังเรื่อง Bicentennial Man ที่ Robin Williams แสดงเป็นหุ่นยนต์ที่อยากเป็นมนุษย์</em><br />\n<img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/982742bc2d9b732dc58cb92b6de12084.png\" /></p>\n<p>ตอนนี้ไม่มีสิ่งใดที่ป้องกันการใช้ AI ได้ เทคโนโลยีนี้ใช้รูปลักษณ์ของนักแสดงโดยที่ไม่ได้รับความยินยอม หรือให้ค่าตอบแทน ซึ่งถือเป็น 1 ในประเด็นสำคัญสำหรับสหภาพแรงงานที่เป็นตัวแทนของนักเขียน และนักแสดง ต่างมองหาการรักษากฎระเบียบเกี่ยวกับการใช้ AI</p>\n<p>เมื่อสัปดาห์ที่แล้วสมาคมนักเขียนแห่งอเมริกา (WGA) เพิ่ง<a href=\"https://www.blognone.com/node/135956\">ยุติการประท้วงหยุดงานนาน 5 เดือน หลังบรรลุข้อตกลงใหม่กับสตูดิโอหนังโดยเฉพาะเรื่อง AI</a></p>\n<p>ที่มา - <a href=\"https://www.ign.com/articles/robin-williams-daughter-calls-out-disturbing-ai-recreate-late-fathers-voice\">IGN</a> via <a href=\"https://deadline.com/2023/10/robin-williams-daughter-zelda-ai-recreate-voice-1235561299/\">Deadline</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/wga\">WGA</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ef79a5d7c60e077c8812c17da26428bb37f95ea7af8ffef245dfbc788daaa194","category":"Thai"}