{"title":"The Influence of Taste Genes on Body Fat and Alcohol Consumption","link":"https://www.preprints.org/manuscript/202404.0335/v1","date":1712228350000,"content":"Dietary intake and alcohol consumption might be influenced by genetic variations in taste receptor genes. The objectives of this study were to examine the relationship between polymorphisms in bitter taste receptor genes TAS2R13 (rs1015443) and TAS2R38 (rs1726866, rs10246939, and rs713598) as well as alcohol consumption and body fat percentage in college students. Four hundred and two students with a mean age of 20.2 years participated in this study. An NIH Diet History Questionnaire (DHQ II) was used to collect data on their dietary intake, while AUDIT survey was used to determine their level of alcohol consumption. Bitter taste receptor gene polymorphisms were assessed by TaqMan allelic discrimination assays. Despite significant associations between TAS2R13 (rs101544) and certain aspects of alcohol consumption, including the frequency of alcohol intake, no indeed significant associations were found between TAS2R13 (rs1015443) and alcohol consumption after accounting for confounding variables in the regression model. Neither association was found regarding percent of body fat. In contrast, ethnicity and gender significantly influenced percent of body fat (p &lt; 0.001), while no significant association was observed between TAS2R13 (rs1015443) and percent of body fat. Likewise, TAS2R38 (rs1726866, rs10246939 and rs713598) demonstrated no significant association with alcohol consumption and percent of body fat. These results were controlled for confounding factors, such as ethnicity and gender. Body fat percentage and alcohol consumption may be influenced by ethnicity, gender and age rather than SNPs of TAS2R13 and TAS2R38 genes. Assessing the taste genes’ interactions with diet and body composition might be useful in identifying human disease risk.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ef81d2899089e11ac1d659727516e8c9b2f8a19b6cf66d630dc9b4feda5d5297","category":"Interdisciplinary"}