{"title":"Apple is selling Vision Pro all wrong","link":"https://www.macworld.com/article/2249666/apple-retail-fails-at-the-human-touch-the-vision-pro-needs.html","date":1709119800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple really sweated the launch of the Vision Pro. It brought select retail employees to Cupertino for multi-day training sessions in which participants tried the hardware and memorized the script to be used while demonstrating the hardware in stores. Those participants then went back to their Apple Stores and taught their co-workers what they had learned.</p>\n\n\n\n<p>When the doors opened on launch day, the demos seemed to go pretty well. But it turns out that the Vision Pro is perhaps the most ergonomically complicated device Apple has ever made–getting it to fit on an array of faces requires more than a large selection of Light Seal sizes and a fancy app that scans your face.</p>\n\n\n\n<p>Getting a good fit for the Vision Pro, it turns out, takes a human touch. And on this front, Apple has failed its retail employees and its customers alike.</p>\n\n\n\n<h2>Lost in the details</h2>\n\n\n\n<p>From the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://sixcolors.com/post/2023/06/eyes-and-head-on-with-the-apple-vision-pro/&amp;xcust=1-1-2249666-1-0-0&amp;sref=https://www.macworld.com/feed\">first time</a> I put on the Vision Pro, I never could get Optic ID to work quite right. I couldn’t set it up to work for the longest time, and when I finally did, using it to unlock the device only worked sporadically. After talking to friends about it, I started to wonder if the issue was that my Vision Pro’s Light Seal was too big. I re-scanned my face, only to discover that the Apple Store app no longer recommended my original size–24W–but a new size, 21W.</p>\n\n\n\n<p>I decided to go into my local Apple Store to see if I could exchange the Light Seal. The people in the store were incredibly nice, but it quickly became apparent that they weren’t really confident in how this process was going to work. I was told that the store was sold out of size 21W but that I could go through a sizing procedure with a team member in order to figure out if that was the right size for me.</p>\n\n\n\n<p>This makes sense. What better than me trying on Light Seals in the store until I found the right fit?</p>\n\n\n\n<p>But that’s not what happened. The Apple Store employee who would be leading me through my fitting had me use the app to measure my face again–and again, 21W was the winner. He went over to a drawer and brought back a sample 21W for me to test, and… it seemed fine? But without wearing it for a few hours, I wouldn’t really know–and I couldn’t take it home since they were sold out and this was the demo model.</p>\n\n\n\n<p>Worse, though, is that I also wasn’t offered other Light Seals to compare and contrast, or asked questions about my fit. I didn’t get the sense that the person I was working with knew anything about fitting someone properly. The experience was very friendly, but also quite underwhelming. It’s hard for me to blame an Apple employee for being poorly trained. I blame his employers.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-light-seal.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Vision Pro light seal\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-light-seal.jpg?quality=50&amp;strip=all 2331w, https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-light-seal.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-light-seal.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-light-seal.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-light-seal.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-light-seal.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-light-seal.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-light-seal.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" loading=\"lazy\" /><figcaption><p>The Light Seal–the big gray band that sits between your face and the main Vision Pro unit–is crucial to a proper experience.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>My store sent me home to see about exchanging my Light Seal online. But Apple’s support website wouldn’t let me enter in 21W, the size I had measured twice and tried on. Instead, the site insisted on asking me a series of questions about how the Vision Pro fit on my face, many of them regarding things I had absolutely no opinion on. I eventually figured out that if I clicked around in different orders, I could get offered different sizes of Light Seal. So while I couldn’t just say, “Send me the size I want,” I could try to game the system. It shouldn’t be this way.</p>\n\n\n\n<p>It doesn’t help that Apple has named the Light Seal sizes in a way that makes it difficult for anyone — including Apple Store employees — to understand. Did you know, for example, that the first digit in the Light Seal size apparently refers to the balance between your forehead and cheekbones? A “1” is for protruding foreheads, a “3” is for protruding cheekbones, and “2” is for in-betweeners. This makes sense, because I did eventually try a 14W Light Seal and it killed my cheekbones. Totally out of balance.</p>\n\n\n\n<p>I learned this tidbit about sizing from a source in Apple Retail who only learned it recently. While Apple flew retail envoys to Cupertino for demo practice, store employees have been given a couple of handouts about fitting Vision Pro to customers.</p>\n\n\n\n<h2>Lessons of the Apple Watch</h2>\n\n\n\n<p>I’m not sure what led to Apple’s decision to focus on hard-sell demos (for a pricey 1.0 product!) while seemingly not giving the proper attention to fitting the Vision Pro, but I’ve got a few guesses. Clearly the company decided to put its faith in an app that scans your face in order to find the right fit, and perhaps that was misguided. It’s a good start, but it’s not going to be enough on its own–take it from the guy who got two different results from the app.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Store\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Store-1.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" loading=\"lazy\" /><figcaption><p>For the Vision Pro shopping experience, Apple needs to take cues from its Apple Watch launch.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Think back to the launch of the Apple Watch. Apple retail was deeply focused on a try-on experience with different bands and materials. It was perhaps a lesson learned by former Retail chief <a href=\"https://www.macworld.com/article/232417/angela-ahrendts-impact-apple.html\">Angela Ahrendts</a> from her years in luxury retail, but it meant you could make an appointment, sit down at a table, and have an Apple Store employee walk you through your options.</p>\n\n\n\n<p>The Vision Pro experience could’ve been like that–and indeed, it probably needs to be revamped to be that. Because it turns out that it can be extremely difficult to fit, with issues many customers have never even considered? (I, for one, have never spent any time reflecting on the balance between my cheekbones and my forehead, let alone the proper adjustment of a band to hold a heavy headset on my face with comfort.)</p>\n\n\n\n<p>Instead, it feels like Apple built a measurement tool into an app and figured that would be good enough. It’s not.</p>\n\n\n\n<h2>What’s next for Vision Pro?</h2>\n\n\n\n<p>Apple seems committed to Vision Pro and visionOS for the long haul. I can accept that maybe Apple didn’t anticipate all of the complexities of fitting customers with the device before it launched, but now is the time to take lessons from the launch and apply them to the next wave of Vision Pro customers.</p>\n\n\n\n<p>The top priority is better training for retail employees when it comes to fitting. Getting them to memorize a demo script is great, but the goal should be to have every customer leave the store with confidence that their Vision Pro is going to fit properly. When a customer comes in complaining of fit issues, store employees should be able to diagnose the issues and offer different options to correct the problem.</p>\n\n\n\n<p>Apple should also formally extend the amount of time a Vision Pro buyer has to exchange their Light Seals for a different size. I think it’s still technically 14 days, but it can be difficult for busy people to get to an Apple Store in time, and it can take time for a customer to realize that they might not be using the right size.</p>\n\n\n\n<p>Apple also needs to allow users to explicitly choose a different size when exchanging their Light Seals online. I wasn’t able to get a replacement in my store, and while I knew the size I was supposed to get, I couldn’t enter it anywhere. (To Apple’s credit, when I did order a replacement, the company shipped it to me free of charge and when it didn’t fit, took it right back. That was impressive service.)</p>\n\n\n\n<p>Finally, Apple needs to demystify what the different sizes of Light Seal actually mean–for employees and customers alike. This shouldn’t be a trade secret. Right now, it feels like Apple wants to keep things obscure so that it can force people into its measurement feature in the Apple Store app or walk through the decision tree on its support pages. I understand why those might be preferable outcomes, but it’s not serving anyone for Light Seal sizes to be <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/VisionPro/comments/19ardw5/all_light_seal_sizes/&amp;xcust=1-1-2249666-1-0-0&amp;sref=https://www.macworld.com/feed\">compiled on Reddit</a> rather than being transparently disclosed on Apple’s own site.</p>\n\n\n\n<p>If all goes as Apple hopes, the number of people who have bought a Vision Pro will be a tiny fraction of the total long-term visionOS user base. First-generation products in new categories are bound to uncover all sorts of unexpected issues–I get it. But here we are. It’s time for Apple to reprioritize fit and comfort, even if it means a little less time spent making sure the in-store demo patter is correct.</p>\n\nVirtual Reality, Wearables</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ef893a7d78965cf13b7ae94f150f8c04c690137eba74b62df70b29d9c3460b34","category":"Apple"}