{"title":"Probabilistic seismic hazard assessment of Delhi (National Capital Region) and its adjoining region, India","link":"http://link.springer.com/10.1007/s12665-024-11895-6","date":1728518400000,"content":"<h3>Abstract</h3>\n                    <p>Over the past decade, the Delhi (National Capital Region, NCR) has witnessed significant growth and has emerged as a vital center for commerce and education. This rapid urbanization owes itself to its strategic location, connecting important cities like Gurugram, Faridabad, Noida, Sonipat, and Rohtak. However, its proximity to active geological features such as the Main Himalayan Thrust (MHT), Main Boundary Thrust (MBT), and Main Central Thrust (MCT), the city has been susceptible to devastating earthquakes, making it imperative to conduct a comprehensive probabilistic seismic hazard assessment for the Delhi NCR area. To perform this assessment, a homogenized earthquake database from 1720 to 2023 within a 300 km radius of the epicenter of Delhi was utilized. This data enabled the calculation of peak ground acceleration (PGA) and Spectral Acceleration (Sa) at different time periods, representing 50%, 20%, 10%, 5%, and 2% probabilities of exceedance in 50 years at the bedrock level. A logic tree approach, incorporating Ground Motion Prediction Equations (GMPEs) with appropriate weighted factors, was applied to ensure accuracy. The findings of the updated seismic hazard assessment reveal that Delhi and its neighboring cities are highly vulnerable to seismic hazards, with expected PGA values of 0.10 g, 0.18 g, 0.26 g, 0.33 g, and 0.48 g for the respective probabilities of exceedance. These results are comparable with the Indian code IS:1893 Part I and Malhotra’s (2005) standards that validate their reliability. Furthermore, the seismic hazard results have been used to create a deaggregation plot, which helps to quantify the contributions of seismic sources in terms of magnitude and epicentral distance. This comprehensive understanding of seismic hazards in Delhi and its adjoining regions will aid in implementing appropriate measures to enhance preparedness and mitigate potential risks.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"ef8befaaa76debbbe8ca1801c180694c62f2fd3655c615b664844cddb099cb83","category":"Environment"}