{"title":"Four rumored changes that will change your opinion about the iPhone 15 Pro Max","link":"https://www.macworld.com/article/2061389/iphone-15-pro-max-2.html","date":1694432291000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It’s not long now. In mere hours, the <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15</a> will be here, and just like every September, we’ll all be poring through the new features to decide which model we want to buy. But this year could be a little different, as Apple is expected to make several significant changes to the <a href=\"https://www.macworld.com/article/1487037/iphone-15-pro-max-ultra-design-display-camera-price-rumors.html\">iPhone 15 Pro Max</a> that may make big phone haters consider trying one out.</p>\n\n\n\n<h2>It’ll be Apple’s lightest 6.7-inch phone ever</h2>\n\n\n\n<p>One of the biggest drawbacks to using an iPhone 14 Pro Max is its weight. Yes, it’s a big phone, but it feels even bigger due to its hefty 240-gram body. The titanium frame on the iPhone 15 Pro Max will <a href=\"https://www.macworld.com/article/2044133/iphone-15-pro-max-weight-titanium-stainless-steel.html\">reportedly cut the weight by 19 grams</a>, making it the lightest 6.7-inch iPhone Apple has ever made.</p>\n\n\n\n<h2>It’ll be the only iPhone with an actual zoom lens</h2>\n\n\n\n<p>You’ve been able to buy an iPhone with a telephoto camera since the iPhone 7 Plus, but up until the iPhone 14, they weren’t very zoomy. The best iPhone telephoto lens has only offered 3X optical zoom and 15X digital zoom, which gets you somewhat closer to a distant object but still not enough to make much difference.</p>\n\n\n\n<p>The iPhone 15 Pro Max is expected to double the optical zoom to 6X, a significant bump over the current telephoto lens. But we’re more interested in what Apple will be able to do with its hybrid zoom, which uses AI and computational wizardry to piggyback on the capabilities of the camera hardware to take telephoto photos to the next level. And the only way you’ll be able to get it is on the iPhone 15 Pro Max.</p>\n\n\n\n<h2>It’ll be nearly all screen</h2>\n\n\n\n<p>The iPhone 15 Pro Max is expected to have a very similar design to the iPhone 14 Pro Max, with one exception—the bezels are expected to be <a href=\"https://www.macworld.com/article/2021930/iphone-15-pro-leaks-bezels-action-button-2tb-storage.html\">significantly smaller</a>, which will either make the phone smaller or the screen larger, depending on which rumor you want to believe. Either way, the iPhone 15 Pro Max will be one of the sleekest phones ever made. The iPhone 15 Pro won’t be ugly, mind you, but it’ll be hard to pass up those ultra-skinny bezels.</p>\n\n\n\n<h2>It’ll last all day—and then some</h2>\n\n\n\n<p>The iPhone 14 Pro Max has very good battery life, but the iPhone 15 Pro Max is supposed to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-09-10/apple-september-12-wonderlust-event-what-to-expect-from-iphone-15-apple-watch-lmdgq14o?srnd=technology-vp&amp;xcust=1-1-2061389-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">last longer than ever</a>, thanks to the energy-efficient M3 processor. The iPhone 15 Pro Max could be the first flagship iPhone that’s guaranteed to last all day no matter how much you use it.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ef9d039270d95b7e1356a1ea7de1861937eb6192c1dfbfb0faa2689941c82b87","category":"Apple"}