{"title":"Apple Announces 'Tech Talks' Where Developers Can Interface With Apple Experts","link":"https://www.macrumors.com/2021/10/20/apple-tech-talks-2021/","date":1634746920000,"content":"Apple <a href=\"https://developer.apple.com/tech-talks/\">today informed developers</a> about a Tech Talks 2021 venture, which will allow developers to <a href=\"https://www.apple.com/newsroom/2021/10/apple-introduces-tech-talks-2021-live-online-sessions-for-developers/\">connect with Apple experts</a> in more than 100 live online sessions and 1,500 available office hour appointments.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/apple-tech-talks.jpg\" />\r\n<br />\r\nApple says that developers can use the sessions to dive into technical content, get answers to questions, and seek one-on-one meetings for guidance. Sessions will be held online from Apple locations around the world in multiple time zones, including Bengaluru, India; Cupertino, California; London; Mexico City; São Paulo; Seoul, South Korea; Shanghai; Singapore; Sydney; Tel Aviv, Israel; and Tokyo.<blockquote>\"Every single day, developers around the world are creating incredible apps and games for our platforms, and it's our goal to provide them with every resource we can to help make the hard work they put in that much easier and more impactful,\" said Susan Prescott, Apple's vice president of Worldwide Developer Relations. \"Our team is looking forward to connecting with even more developers around the world so we can better support the important work of this incredibly valued community, and listen to and learn from them.\"\r\n<br />\r\n</blockquote>Live sessions will provide developers with details on how to integrate the latest technologies into their apps, while 30 minute office hour sessions can be used to make app improvements, design revisions, and bug fixes.\r\n<br />\r\n\r\n<br />\r\nTech Talks will take place from October 25 to December 17, and developers can register for sessions and submit office hour requests starting today. The first Tech Talks will start on October 25 and new sessions and office hours will be posted every two weeks.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-developer-program/\">Apple Developer Program</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/20/apple-tech-talks-2021/\">Apple Announces 'Tech Talks' Where Developers Can Interface With Apple Experts</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-announces-tech-talks-where-developers-can-interface-with-apple-experts.2318241/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=eEPBTeCU0mA:SdmDu44RddQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=eEPBTeCU0mA:SdmDu44RddQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/eEPBTeCU0mA\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"efa7238743614dde1f2e4718abc5c46540aa7b6c87e3db2da37a6cce8a2bcf7c","category":"Apple"}