{"title":"A theory-based assessment of mpox: Findings from a nationally representative survey of U.S. adults","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299599","date":1710511200000,"content":"<p>by Margaret L. Walsh-Buhi, Rebecca F. Houghton, Danny Valdez, Eric R. Walsh-Buhi</p>\r\n\r\nThe purpose of this research was to examine individual differences related to fear of, perceived susceptibility to, and perceived severity of mpox as well as mpox knowledge, fear, perceived susceptibility, and perceived severity as predictors of vaccine intention in a national survey of U.S. adults (aged ≥18 years). Address-based sampling (ABS) methods were used to ensure full coverage of all households in the nation, reflecting the 2021 March Supplement of the Current Population Survey. Internet-based surveys were self-administered by Ipsos between September 16–26, 2022. N = 1018 participants completed the survey. The survey included items, based partially on the Health Belief Model, assessing vaccine intention (1 item; responses from 1 [Definitely not] to 5 [Definitely]), fear of mpox (7-item scale; α = .89; theoretical mean = 7–35), perceived susceptibility to mpox (3-item scale; α = .85; theoretical mean = 3–15), and perceived severity of mpox (4-item scale; α = .65; theoretical mean = 4–20). Higher scores indicate greater fear, susceptibility, and severity. One-way ANOVAs were run to examine mean score differences by demographic groups (e.g., gender, race/ethnicity, sexual orientation), and multiple regression analyses assessed the relationship between predictors (mpox knowledge, susceptibility/severity, fear) and a single outcome (vaccination intention), while controlling for demographic covariates. Sampling weights were applied to all analyses. Only 1.8% (n = 18) of respondents reported having received the mpox vaccine. While mpox vaccine intention was low (M = 2.09, SD = 0.99), overall differences between racial/ethnic, sexual orientation, education, and household income groups were statistically significant. Fear of mpox was very low (M = 13.13, SD = 5.33), and there were overall statistically significant differences in both fear and perceived severity among gender, race/ethnicity, sexual orientation, education, and household income groups. While respondents reported not feeling very susceptible to mpox (M = 5.77, SD = 2.50), they generally rated mpox as just above the theoretical mean in terms of severity (M = 11.01, SD = 2.85). Mpox knowledge, fear, severity, and susceptibility, as well as race/ethnicity, were all statistically significant predictors of intention to vaccinate, with susceptibility representing the strongest predictor. Overall, Americans’ vaccination for mpox/vaccine intent was low. Gay/lesbian and racial/ethnic minority respondents felt more susceptible to and viewed mpox more severely, compared with heterosexual and White respondents, respectively. These data may be used to tailor risk and prevention (e.g., vaccination) interventions, as cases continue to surge in the current global mpox outbreak. Greater perceptions of susceptibility, severity, and fear about mpox exist largely among minority populations. While public health messaging to promote mpox vaccination can focus on improving knowledge, as well as addressing fear and perceived severity of, and susceptibility to, mpox, such messages should be carefully crafted to prevent disproportionate negative effects on marginalized communities.","author":"Margaret L. Walsh-Buhi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"efa98d95be6fd29a0990331eafe4acdf798b4b202d3ea2eb7cdbd77f79939ba6","category":"Interdisciplinary"}