{"title":"Land use history and landscape forest cover determine tropical forest recovery","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14754?af=R","date":1723452541000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/2416758b-4eca-48dc-b92d-684f593540c1/jpe14754-toc-0001-m.png\" alt=\"Land use history and landscape forest cover determine tropical forest recovery\" />\n<p>Both a higher land use intensity and fragmented forest landscape decreases the speed of forest recovery, indicating that human actions and landscape transformation shape the course of succession. Restoration in fragmented forest landscapes through natural regeneration is more suitable in areas with low previous land use intensity, higher forest connectivity and abiotically dispersed species. Effective restoration should therefore consider both land use history and landscape forest cover and be tailored to local socio-ecological conditions.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nTo conserve biodiversity and combat climate change it is vital to restore forest ecosystems. Natural forest regrowth is a nature-based solution to restore forests, but it has rarely been evaluated how this is affected by the combination of previous land use intensity and surrounding forest cover, and how this varies between the two main tropical forest types; dry and wet forests.\n\nThirty-three plots were established on abandoned agricultural fields in a dry (13 plots) and wet (20 plots) tropical forest in Mexico and monitored 3 years for the following tree community attributes: structure, diversity, regeneration mode, potential symbioses with N fixing bacteria and mycorrhizal fungi. Previous land use intensity was described using interviews, and landscape forest cover and fragmentation within a 1000 m radius surrounding the plots were quantified using satellite images.\n\nVariable importance analyses indicated that land use intensity was more important than forest cover and fragmentation for the state of the tree community attributes after 3 years. This suggests that previous land use impacts the start of succession and leaves important legacies on the vegetation. Land use intensity, forest cover and fragmentation were equally important in determining the change in tree community attributes over time, indicating that both management practices and dispersal shape subsequently community assembly.\n\nA higher land use intensity decreases tree richness recovery, while size of the largest forest patch decreases tree density and connectivity of these patches increases tree density.\n\nThe dry forest had a faster increase in tree density recovery compared to the wet forest through a high initial resprouting capacity and abiotically dispersed trees.\n\n<i>Synthesis and applications</i>: Both a higher land use intensity and fragmented forest landscape decreases the speed of forest recovery, indicating that human actions and landscape transformation shape the course of succession. Restoration in fragmented forest landscapes through natural regeneration is more suitable in areas with low previous land use intensity, higher forest connectivity and abiotically dispersed species. Effective restoration should therefore consider both land use history and landscape forest cover and be tailored to local socio-ecological conditions.\n</p>\n<h2>Resumen</h2>\n<p>\n\nLa restauración de los ecosistemas forestales es esencial para conservar la biodiversidad y enfrentar el cambio climático. Aunque la regeneración natural de los bosques es una solución basada en la naturaleza para recuperar la superficie forestal, todavía no se ha evaluado adecuadamente cómo este proceso se ve afectado por la combinación de la intensidad del uso del suelo previo al abandono del terreno y la cubierta forestal circundante, y qué tanto difiere entre los dos principales tipos de bosques tropicales, es decir, los bosques tropicales secos y los húmedos.\n\nSe establecieron 33 parcelas en campos agrícolas abandonados en un bosque tropical seco (13 parcelas) y un bosque tropical húmedo (20 parcelas) en México para monitorear durante tres años los siguientes atributos de la comunidad arbórea: estructura, diversidad, modo de regeneración, y simbiosis potenciales con bacterias fijadoras de N y hongos micorrícicos. La intensidad del uso del suelo se describió mediante entrevistas y se usaron imágenes de satélite para cuantificar la cobertura forestal en el paisaje y la fragmentación del bosque en un radio de 1000 m alrededor de las parcelas.\n\nEl análisis de la importancia de las variables mostró que la intensidad del uso del suelo fue más importante que la cobertura y fragmentación del bosque para definir el estado de los atributos de la comunidad arbórea después de tres años. Esto sugiere que el uso previo del suelo impacta el inicio de la sucesión y deja importantes legados en la vegetación. La intensidad del uso del suelo, la cubierta forestal y la fragmentación del bosque fueron igualmente importantes para la determinación del cambio en los atributos de la comunidad arbórea a lo largo del tiempo, lo que indica que las prácticas de manejo y más adelante la dispersión dan forma al ensamble comunitario.\n\nAl aumentar la intensidad del uso del suelo se reduce la recuperación de la riqueza arbórea, mientras que el tamaño del parche forestal más grande disminuye la densidad de árboles y la conectividad entre parches de bosque aumenta la densidad de árboles.\n\nEn el bosque tropical seco la densidad de árboles se recuperó más rápido que en el bosque húmedo gracias a una alta capacidad de rebrote inicial y a la presencia de árboles con dispersión abiótica.\n\n<i>Síntesis y aplicaciones</i>: Un uso del suelo más intenso previo al abandono del terreno y un paisaje forestal más fragmentado repercuten negativamente en la velocidad de recuperación del bosque, lo que indica que tanto las acciones humanas como la transformación del paisaje moldean al curso de la sucesión. La restauración de paisajes forestales fragmentados mediante la regeneración natural es más adecuada en áreas donde la intensidad del uso del suelo fue menor, y donde hay una mayor conectividad forestal y las especies tienen dispersión biótica. Por lo tanto, una restauración efectiva debe considerar tanto la historia del uso del suelo como las características de la cubierta forestal del paisaje y ajustarse a las condiciones socioecológicas locales.\n</p>","author":"Iris Hordijk, \nLourens Poorter, \nJorge A. Meave, \nFrans Bongers, \nMasha T. van der Sande, \nRey David López Mendoza, \nPascual Jamangapé Romero, \nJohan de Jong, \nMiguel Martínez‐Ramos","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"efbae0ae7e0aba0df4480afb41c862397e5b33faec8eaee4299e71a5921d6fec","category":"Environment"}