{"title":"หัวเว่ยเตรียมในไทยเพิ่ม ระบุที่ผ่านมาอัตราการใช้งานคลาวด์เติบโตสูงปีละเท่าตัว เตรียมบุกตลาดพลังงาน","link":"https://www.blognone.com/node/124181","date":1628700104000,"content":"<div><div><div><p>หัวเว่ยจัดงานแถลงข่าวประจำปี ยืนยันถึงแนวทางลงทุนในประเทศไทยต่อเนื่องไปพร้อมๆ กับความช่วยเหลือทั้งด้านการศึกษาและการสนับสนุนเทคโนโลยีสำหรับการใช้งานทางการแพทย์ในช่วง COVID-19 โดยการลงทุนในไทยแบ่งออกเป็น 4 ด้าน ได้แก่ เทคโนโลยี 5G, ศูนย์ข้อมูลและคลาวด์, พลังงานดิจิทัล, และการพัฒนาทักษะดิจิทัล</p>\n<p>ปีนี้หัวเว่ยจะลงทุนพัฒนาคลาวด์ในประเทศไทยรวม 700 ล้านบาท โดยเฉพาะการสร้างศูนย์ข้อมูลแห่งที่สามในประเทศไทย เนื่องจากที่ผ่านมาลูกค้าใช้งานคลาวด์ของหัวเว่ยเพิ่มขึ้นอย่างรวดเร็วอัตราเพิ่มถึงปีละ 100% โดย<a href=\"https://twimbit.com/cloud/aws-leads-again-with-36-share-in-thailand\">ผลสำรวจตลาดต้นปีที่ผ่านมา</a>หัวเว่ยเป็นผู้ให้บริการคลาวด์อันดับสามในประเทศไทยตามจาก AWS และ Azure โดยทิ้งห่าง Google Cloud ค่อนข้างมาก</p>\n<p>ธุรกิจด้านพลังงานดิจิทัลของหัวเว่ยอาจจะไม่เป็นที่รู้จักในวงกว้างนัก  โดยธุรกิจนี้รวมทั้งศูนย์ข้อมูลสำเร็จรูป, ระบบโซลาร์เซลล์อัจฉริยะ, และระบบจ่ายไฟตามไซต์งาน (site power facility - ระบบจ่ายไฟตามเสากล้องวงจรปิด หรือจ่ายไฟเสาสัญญาณโทรศัพท์) นอกจากนี้ยังพัฒนาระบบชาร์จไฟให้กับรถไฟฟ้า ตอนนี้หัวเว่ยกำลังขยายธุรกิจนี้ในประเทศไทยโดยเพิ่มพาร์ทเนอร์เพื่อให้บริการติดตั้งและโซลูชั่นมากกว่า 50 ราย</p>\n<p>ที่มา - จดหมายข่าวและงานแถลงข่าวหัวเว่ย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/53a91aa978b23984d1a49ba964098806.jpg\" /></p>\n<p>ภาพการพัฒนา<a href=\"https://blog.huawei.com/2021/04/13/moving-forward-times-uncertainty/\">สินค้ากลุ่มพลังงานของหัวเว่ย</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/huawei\">Huawei</a></div><div><a href=\"/topics/cloud\">Cloud</a></div><div><a href=\"/topics/thailand\">Thailand</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"efc3c3dca944b4698e55239e7366ba2e74c0132ef4bc753e88bd0154abb6b15b","category":"Thai"}