{"title":"Kidney Measurement and Glomerular Filtration Rate Evolution in Children With Polycystic Kidney Disease","link":"https://www.preprints.org/manuscript/202404.1749/v1","date":1714285278000,"content":"Autosomal dominant polycystic kidney disease (ADPKD) is an inherited disorder characterized by renal tubular cystic dilatations. The cysts can develop anywhere along the nephron and over time the cystic dilatation lead to kidney enlargement. On the other hand, the cysts begin to reduce the number of functional nephrons as a consequence of cystic expansion that further contributes to the decline in renal function over the years. The pressure exerted by the dilated cysts lead to compensatory mechanisms that further contribute to the decline in renal function. These structural changes are responsible of glomerular hyperfiltration states, albuminuria, proteinuria, and haematuria. However, the presentation of ADPKD varies in children from a completely asymptomatic child with incidental ultrasound detection of cysts to a rapidly progressive disease. There have been reports of early onset of ADPKD in children younger than 2 years that showed a more rapid decline in renal function. ADPKD is caused by mutation in PKD1 and PKD2 genes. Today, the PKD1 gene mutation seems to account for up to 85% of the cases worldwide, and it is associated with worse renal outcomes. Individuals with PKD2 gene mutation seem to present a milder form of the disease, with a more delayed onset of end stage kidney disease. The cardinal sign of ADPKD is the presence of renal cysts during renal ultrasound. The current guidelines provide the clinicians the recommendations for genetic testing in children with a positive family history. Given that the vast majority of children with ADPKD present with normal or supra normal kidney function we explored the glomerular filtration rates dynamics and the renal ultrasound adjusted percentiles. 14 out of 16 patients had kidney percentile over 90%. The gene mutations were equally distributed among our cohort. In addition, we compared the modified Schwartz formula to the quadratic equation after adjusting the serum creatinine measurements. It seems that even though children with ADPKD have enlarged kidneys, the renal function is more likely normal or near normal when the quadratic estimation of glomerular filtration rate is used (qGFR tended to be lower, 111.95 ± 12.43 ml/min/1.73m2 compared to Schwartz eGFR 126.28 ± 33.07ml/min/1.73m2, p=0.14). Also, when the quadratic equation was employed, not even a patient reached the glomerular hyperfiltration thresholds. The quadratic formula showed that glomerular filtration rates are linear or slightly decreasing after 1-year of follow-up (Quadratic ΔeGFR=0.32±5.78ml/min/1.73m2) as opposed to Schwartz formula that can falsely classify children in a hyperfiltration state ΔeGFR=7.51±19.46ml/min/1.73m2), p=0.019.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"efc7f2f9a98c1e2c58855314320ffb32a16ff8bdcd968067ec9b12755c02a3f7","category":"Interdisciplinary"}