{"title":"Prevalence, associated factors and consequence of problematic smartphone use among adolescents and young adults in Bangladesh: A cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308621","date":1724680800000,"content":"<p>by Md. Rabiul Islam, Archok Arigan Mondol, Ripa Kundu, Juliana Aditi Baroi, Sayma Akter, Taslima Jamal Urmi, A. S. M. Roknuzzaman, Md. Alamgir Hossain, Mohammad Masud Parves, Humair Bin Md. Omer, Eva Rahman Kabir</p>\r\nBackground <p>Problematic smartphone use (PSU) and attention deficit hyperactivity disorder (ADHD) in children, adolescents, and young adults are of major concern to parents. However, the prevalence and associated factors related to these issues in Bangladeshi adolescents and young adults remain unclear to the best of our knowledge. The aim of this study is to assess PSU and ADHD in the context of adolescent and young adult age groups in Bangladesh.</p> Methods <p>The present study collected data from diverse geographical locations in Bangladesh via face-to-face surveys using stratified random sampling methods. We considered age, sex, and geographic location stratification criteria. A total of 578 respondents participated in the survey initially. From this, we discarded 36 responses after screening because the information provided was insufficient or incomplete response. In the end, 542 replies were incorporated into the final analysis. PSU and ADHD depend on several factors, including the individual’s demographic background.</p> Results <p>The prevalence of PSU and ADHD symptoms in adolescents and young adults in Bangladesh is 61.44% and 37.45%, respectively based on our findings. The symptoms of PSU are correlated with age, education level, family type (nuclear/joint), sleeping pattern, physical exercise, and residence area. ADHD symptoms are correlated with age, education level, living with family, smoking habit, physical disability, sleeping pattern, physical exercise, residence area, and PSU. Also, we observed that ADHD and PSU symptoms are positively correlated with each other.</p> Conclusion <p>A large proportion of young adults and adolescents reported PSU and ADHD symptoms. The present findings have practical implications in clinical psychology, psychotherapy, and related policy considerations. We propose to develop an inclusive interventional strategy and community-based programs to address PSU and ADHD-related issues.</p>","author":"Md. Rabiul Islam","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"efca7152e8c03511024ed3c8aeed43a1244304ff68cf3afde9141fc56dd8852a","category":"Interdisciplinary"}