{"title":"Suppression of hemp russet mite, Aculops cannabicola (Acari: Eriophyidae), in industrial hemp in greenhouse and field","link":"https://academic.oup.com/ee/article/53/1/18/7236706?rss=1","date":1691020800000,"content":"<span><div>Abstract</div>Hemp russet mite, <span>Aculops cannibicola</span> Farkas (Acari: Eriophyidae), is one of the key pests of hemp, <span>Cannabis sativa</span> L. (Rosales: Cannabaceae). Hemp russet mite feeds primarily on new growth and can reach high densities, frequently exceeding a thousand mites per leaf, and leading to a decrease in yield and quality of cannabinoids. The objective of this experiment was to determine the efficacy of reduced-risk pesticides used in organic crop protection as well as conventional insecticides in managing hemp russet mites in a greenhouse and field. Hemp (var. Unicorn) was exposed to leaves heavily infested with hemp russet mites, and once mite densities reached an average of 50 mites per leaf, the following insecticides were applied to the plants: abamectin, etoxazole, fenpyroximate, rosemary oil, and 2 concentrations of a mineral oil. An application of sulfur was also included in the field experiment. Treatments were replicated 9 times in the greenhouse and 6 times in the field. Each of the pesticides significantly reduced hemp russet mite densities in the greenhouse, with all treatments resulting in significant decrease in mite populations 10 days after the initial treatment that persisted until the end of the experiment. On the other hand, only fenpyroximate, sulfur, and rosemary oil provided strong and effective suppression of the mites in the field. This is the first study to test these products against hemp russet mites in hemp, and our outcomes indicate that several pesticides available for organic crop production can provide effective control of the pest.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"efdd283c00e4a3194687ff4bc48f43a99f858ddf96071bf1489d4c4595dd2c78","category":"Environment"}