{"title":"How to troubleshoot Contact Key Verification for extra-secure iMessage chats","link":"https://www.macworld.com/article/2178725/how-to-troubleshoot-contact-key-verification-for-extra-secure-imessage-chats.html","date":1704963600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>With iOS 17.2, iPadOS 17.2, macOS Sonoma 14.2, and watchOS 9.2, Apple released an option for further ensuring the private communication of iMessages. Called Contact Key Verification (CKV), this extra step performs additional checks on your device to see whether anyone has managed the difficult-but-not-impossible feat of inserting themselves into your secure end-to-end iMessage conversation.</p>\n\n\n\n<p>This problem has long been seen as a threat because of how Apple maintains central storage of one component of the pair of encryption keys used to secure these conversations. (Apple stores what’s called the public key in a public/private key pair; your device retains the private part, which never leaves your iPhone, iPad, Mac, or Watch.) If Apple’s central storage were fiddled with in a very nuanced way or an exploit managed to allow an attacker to insert replacement secrets on a target’s device, it’s possible no one would be the wiser. CKV monitors and alerts users to what are extreme but possible interceptions.</p>\n\n\n\n<p>Most people don’t need CKV—it’s really intended for people with a high risk of direct attack, typically by a government, or what Apple calls “sophisticated threats.” Others may simply like the notion that they are adding a level of integrity and protection against come what may.</p>\n\n\n\n<p>Apple has stuck CKV controls in weird places, the awkwardness of rolling out a feature after major operating systems have already shipped. Find the switch in iOS/iPadOS and macOS in the <em>Account Name</em> section at the top of System Settings (macOS) or Settings (iOS/iPadOS). Scroll to the bottom of the main Apple ID view, below all your associated hardware, to find the Contact Key Verification item. Tap or click in sequence the label, the switch, and a <em>Continue</em> button to proceed.</p>\n\n\n\n<p>Your operating system will alert you if all of your connected devices aren’t updated to the required minimum version, as noted above. You have to update or remove all devices in your iCloud set to use CKV.</p>\n\n\n\n<p>Once enabled, you can tap <em>Show Public Verification Code</em> &gt; <em>Copy Verification Code</em> (iOS/iPadOS) or click<em> Copy Public Verification Code</em> in macOS. This code is safe to publish or distribute, as it’s tightly associated with your iCloud-connected phone number(s) and email address(es). Someone can use that code to verify your identity in Messages even if you or they are offline—but they have to know an email address or phone number associated with your account to do so.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-public-verification-key-bordered.png\" alt=\"macOS Contact Key Verification\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-public-verification-key-bordered.png?quality=50&amp;strip=all 958w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-public-verification-key-bordered.png?resize=300%2C188&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-public-verification-key-bordered.png?resize=768%2C482&amp;quality=50&amp;strip=all 768w\" width=\"958\" height=\"601\" /><figcaption><p>Once you enable CKV, your public verification code appears.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>More frequently, you’ll go to Messages. In a conversation with someone, click the i info button in the upper-right of Messages or tap the person’s avatar. If they have CKV on, there will be a Verify Contact button you can click or tap to enable verification. You have to do this at the same time as the other person. I suggest having a live phone call or video during which you confirm an eight-digit number each of you sees on your devices. (Apple blanks the code out in screen captures made in iOS/iPadOS.) Tap or click <em>Mark as Verified</em>, which then prompts you to update a contact card for the individual, which now includes their public verification key.</p>\n\n\n\n<p>Once verified, Messages displays a tiny checkmark in the conversation in Messages next to the person’s avatar in iOS/iPadOS or name in macOS. In Contacts, a checkmark and the message “verified” appear to the right of their verified addresses.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-verified-in-contacts-bordered.png\" alt=\"macOS verified contact\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-verified-in-contacts-bordered.png?quality=50&amp;strip=all 818w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-verified-in-contacts-bordered.png?resize=300%2C158&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-verified-in-contacts-bordered.png?resize=768%2C406&amp;quality=50&amp;strip=all 768w\" width=\"818\" height=\"432\" /><figcaption><p>A person you’ve verified appears with this “verified” label in their contact card next to associated addresses and phone numbers.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>If you can’t get the verification numbers to appear at all, something’s wrong. In testing, I found that because Contact Key Verification is tightly tied to your iCloud contact information, you have to make sure you aren’t accidentally communicating with someone using a method that isn’t connected to their iCloud account. In one test, a colleague had an outdated phone number listed for me, but that was the way they previously communicated with me on iMessage. They had to delete that number from their Contacts and start a new conversation using the email address associated with my iCloud account.</p>\n\n\n\n<p>If your numbers don’t match—note that they changed every several seconds—tap <em>No Match</em>. It’s unlikely to be snoopers unless you’re a high-profile target. Get in touch with Apple Support if you aren’t. (If you are, check <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://citizenlab.ca/&amp;xcust=1-1-2178725-1-0-0&amp;sref=https://www.macworld.com/feed\">Citizen Lab</a> for resources.)</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-verify-key-ios-bordered.png\" alt=\"iOS verify contact\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-verify-key-ios-bordered.png?quality=50&amp;strip=all 1174w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-verify-key-ios-bordered.png?resize=300%2C272&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac911-verify-key-ios-bordered.png?resize=768%2C695&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"927\" /><figcaption><p>Apple blanks the verification number in screen captures, but imagine eight digits in the blank space above the buttons.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>I’ve noticed that Messages sometimes seems out of sync with verification. That is, you can have matching codes, both tap Mark as Verified, and one or both people’s entries don’t update. In some cases, I have had to restart the device or disable and re-enable Contact Key Verification in Settings. This seems like the teething pains of a 1.0 feature.</p>\n\n\n\n<p>With CKV enabled, you’ll get inline or other notifications if something changes with the other person’s encryption information, requiring a new verification step. Apple will provide details about what to do—and what to worry about.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nApple Watch, iOS, iPad, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"efe4c735d23aadaea56f499c84c5d6b387fa478355fe138ea24ea9121093beb3","category":"Apple"}