{"title":"Environmental conditions in the Massif Central during the Upper Palaeolithic using stable isotope tracking (13C, 15N) of bone collagen from large herbivores","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3617?af=R","date":1720420898000,"content":"<h2>ABSTRACT</h2>\n<p>The environmental conditions experienced by hunter-gatherers during the second part of the Upper Palaeolithic (ca. 28 000–15 000 cal <span>bp</span>) are poorly known in the mid-elevation volcanic mountains of the Massif Central in southern France. The stable isotope ratios of carbon and nitrogen (<sup>13</sup>C/<sup>12</sup>C and <sup>15</sup>N/<sup>14</sup>N expressed as δ<sup>13</sup>C and δ<sup>15</sup>N values) in bone collagen of large herbivores can track their diet and habitat, reflecting local abiotic conditions (temperature, aridity, altitude). Due to poor preservation of skeletal organic matter in the region, new radiocarbon dating was conducted on a limited number of quality-controlled collagen samples, based on a minimum carbon content of 30%. They document three main phases of occupation corresponding to the Final Gravettian, the Badegoulian and the Magdalenian, each of which is represented in different regions of the Allier and Loire valleys. Over time, a decrease in horse δ<sup>15</sup>N values, the best documented species of large herbivores, is found between the Final Gravettian (ca. 26 700–25 600 cal \n<span>bp</span>), around the Last Glacial Maximum and the Badegoulian (ca. 21 900–19 200 cal \n<span>bp</span>), followed by an increase in δ<sup>15</sup>N and δ<sup>13</sup>C values during the Magdalenian (ca. 19 100–16 600 cal \n<span>bp</span>). During the Badegoulian, the δ<sup>15</sup>N values of the horses were lower than those of their counterparts in southwestern France, testifying to harsh climatic conditions favourable to a tundra-like landscape, also reflected in the higher horse and reindeer δ<sup>13</sup>C values in the Allier valley compared to those in southwestern France. The relatively high δ<sup>13</sup>C and low δ<sup>15</sup>N values of a Final Gravettian wolf from the Allier valley suggests reindeer as a preferred prey, in line with their high abundance in the archaeological sites. Game access, rather than climatic conditions or lithic resources, seems to have motivated human groups to occupy the Massif Central during the Upper Palaeolithic.</p>","author":"Dorothée G. Drucker, \nLaure Fontana","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"efe5ed702a9a30768d83b4506104410a115a99b8207c8f3ec98f074b614151ff","category":"Environment"}