{"title":"DOS_deck offers free, all-timer DOS games in a browser, with controller support","link":"https://arstechnica.com/?p=1986461","date":1701114613000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/Screenshot-2023-11-27-at-1.40.04%E2%80%AFPM-800x371.png\" alt=\"Layout of games on DOS_deck\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/Screenshot-2023-11-27-at-1.40.04%E2%80%AFPM.png\">Enlarge</a> <span>/</span> DOS_deck is an impressive technical feat, sure. But it's also a very keen curation of some DOS shareware classics (pun somewhat intended). (credit: DOS_deck/Martin Kool)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Revisiting a classic game from the AUTOEXEC.BAT/CONFIG.SYS era of MS-DOS can be a fun distraction. But the more friction and configuration between you and a playable game, the more likely you are to fall off before you ever hit the menu screen. You spend enough time fine-tuning your modern systems; doing so within an arcane framework, for a single game, is not everybody's idea of fun.</p>\n<p><a href=\"https://dosdeck.com/\">DOS_deck</a> seems to get this, providing the most frictionless path to playing classic DOS shareware and abandonware, like <em>Doom</em>, <em>Jazz Jackrabbit</em>, <em>Command &amp; Conquer</em>, and <em>Syndicate</em>, with reconfigured controller support and a simplified interface benevolently looted from the Steam Deck. You can play it in a browser, right now, the one you're using to read this post.</p>\n<p>In fact, I stopped between that last sentence and this one to play a couple levels of <em>Doom</em> in a Chrome browser. And now I've taken another punctuation break to play the first level of <em>Syndicate</em>, which moves much faster than I remember. The control schemes are clever, the interface is easy to get used to and move around, and there's a host of little extras to appreciate, including constant game progress (game state) saving, and linking and setting certain games as favorites.</p></div><p><a href=\"https://arstechnica.com/?p=1986461#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1986461&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"efe88a37e4f9ee8a14ffe8dc52964df6fb7b21acfe6df7fd5207e61b61614cb6","category":"Tech"}