{"title":"“There was no doubt in Cav's head he would come back and win” Brian Holm on Mark Cavendish’s return to the Tour de France","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/there-was-no-doubt-in-cavs-head-he-would-come-back-and-win-brian-holm-on-mark-cavendish-s-return-to-the-tour-de-france","date":1626365102000,"content":"\n      <p><span>“I said Patrick, I have a brilliant idea. What about having Mr. Cavendish back?” </span></p>\n<p><span>One of the stories of this year’s Tour de France has been the resurgence of Mark Cavendish. After years of suffering with illness and being written off by press and fans alike, Cavendish has exploded back on to the professional racing scene in 2021, winning 4 stages in the Tour de France and equalling the record of the great Eddy Merckx.</span></p>\n<div></div>\n<p><span>Brian Holm and Mark Cavendish go back a long way. Holm first worked with the Manx sprinter in 2006 as part of T-Mobile, and the two now find themselves together again, all these years later, with Holm as a Directeur Sportif at Deceuninck Quick-Step. So much history means the two have a close relationship, and Holm knows the complex character of Cavendish very well.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><em><strong>Tour de France 2021 Guide</strong></em></a></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IMG_2339_1024x1024.jpg?v=1626359058\" /></span></p>\n<p><span>It’s not surprising, then, that it was Holm who Cavendish called when he wanted to return to the Wolfpack for the 2021 season. “Patrick Lefevere called me and said ‘Brian, do you think Cav can win a race again?’” Holm explains. “I said yes. I'm sure he can win again.” But what Holm thought was one thing, the road back to success for Cavendish was another matter altogether. “I remember the December training camp, with our trainer, we had a coffee in the afternoon and said, holy sh*t, the numbers of Cav, they're good,” Holm says. “Then the next camp in January, he was already better. He did the smaller races in Belgium, strange, smaller races that he actually loved.”</span></p>\n<p><span>“We knew he was on the right track. But the next thing was getting into the Tour de France,” Holm explains. He might have had high hopes for Mark Cavendish, and believed in him when others didn’t, but Holm admits that even he didn’t expect these wins at the Tour. “To be honest, I did not see this coming,” he says. “I remember I called Patrick and said ‘maybe Cav will go to the Tour, I think he could have a few stage wins’ Patrick's only answer was: ‘it's nice to have ambition.’”</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-podcast/rouleur-conversations-podcast-brian-holm-on-mark-cavendish-at-the-tour-de-france\"><em><strong>Related – Rouleur conversations podcast: Brian Holm on Cav's Tour</strong></em></a></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/mark-cavendishs-transcendent-win\">Related – Mark Cavendish's transcendent wins</a></strong></em></p>\n<p><span>It would have been hard for anyone to predict the turn of events this season. Winner of the green jersey last year, Sam Bennett was thought to have pretty much booked his seat in the Deceuninck Quick-Step Tour team. But a crash in Belgium a few weeks before, and high tensions with team boss Patrick Levefere meant that the Irishman ended up not making selection, leaving the door open for a keen Mark Cavendish.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1326467744_4c6d3468-ed2a-475e-b572-63a44552e9c7_1024x1024.jpg?v=1626364857\" /></span></p>\n\n<p><span><em><span>Photo credit: Stephane Mahe - Pool/Getty Images</span></em></span></p>\n<p><span>“Cav always believed in himself,” Holm explains. “There was no doubt in Cav's head he would come back and win, he just had to get into the Tour. It was a major disappointment for him two years ago with Dimension.” In 2019, Team Dimension Data didn’t select Cavendish for their Tour de France squad, a decision which the Manx rider publicly disagreed with.</span></p>\n<p><span>His non-selection for the race was the start of a difficult few years for the sprinter. He suffered with Epstein Barr virus and was often finishing outside of time limits, unable to perform at his best. At the end of last season, he finished Gent Wevelgem tearfully, unsure if he would even have a contract to race in 2021. “When Cavendish is going bad he can dig himself into a deep black hole and he did that, for sure, last year,” Holm says.</span></p>\n<p><span>“I think it was a good lesson for Cav, you know, he was out a few years and he learned a lot about real life,” he explains. “About how, at a certain moment, life is going to go downhill. I think now that we see him, it's hard for me to see Cav ever being completely humble, but I think as humble as he can be.”</span></p>\n<p><span>Holm explains that Cavendish returned to Quick Step this year for very little money, (“more like a new professional money”), but he wanted to keep racing, simply because he loves cycling. “Cav came back for, not zero, but quite small money compared to a green jersey winner,” he says. It’s definitely been a transition for the sprinter this season. His attitude has taken a clear shift as he appears positive, relaxed and confident in interviews. This is a long way from the Mark Cavendish of old who was famous for his fiery temper and controversial responses to journalists.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Holm-Cav-inside2_1024x1024.jpg?v=1626359268\" /></span></p>\n<p><span>“With Cav, he can be a prick,” Holm says. “There was a lot of stuff written about him, when people wrote him off, they would say he's finished. You sometimes feel that people hope he doesn't come back because then he can learn to behave well.”</span></p>\n<p><span>Cavendish has certainly had a complicated relationship with the media, often unhappy with questions which doubted his form or his commitment. Holm explains that the sprinter used to get frustrated with the constant pressure he felt to prove himself. “I really understand him because even when he was young, when he came to the team, he always had to prove himself,” Holm says. “He was always on the edge for the selection because he probably was about to screw it up in the Dauphine or Switzerland or whatever he did. He was always thrown out for something.”</span></p>\n<p><span>Holm references 2010, when Cavendish was withdrawn from the Tour de Romandie as a result of his \"inappropriate actions\" after his victory in stage two. As he crossed the line, Cavendish made a two-fingered gesture towards critics who \"know jack sh*t about cycling\", he explained afterwards. He said that it was for those who had written him and his team off on the basis of his poor form that season.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tadej-tommorow-always\"><em><strong>Related – Tadej, Tomorrow, Always</strong></em></a></p>\n<p><span>Holm explains that Cavendish used to ask why he constantly had to fight to get recognition. “I said because sometimes you can be such a rubbish cyclist. You can pass a bloody bridge, a highway bridge and you're dropped,” Holm says. “That's probably a part of the explanation.”</span></p>\n<p><span>“He can complain a lot,” Holm explains. “When I say a lot, I'm being diplomatic. He can be noisy.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210709TDF1053-A.S.O._Pauline_Ballet_1024x1024.jpg?v=1626358792\" /></span></p>\n<p><em><span>Image credit: ASO</span></em></p>\n<p><span>But Holm is quick to say that this is just one part of the complex make-up of the Manxman’s character. “He will always be the life of the party. You go to breakfast, or you go to the dinner table and you always feel a good atmosphere. He can be a nightmare one or two hours after the stage, but after a massage and a shower, he's going around saying sorry to everybody for what he said. Then, at the dinner, it's just a good atmosphere in the team again. And that's a part of Cav also, he always creates a very good atmosphere.”</span></p>\n<p><span>This claim can certainly be backed up by the relationship that Cavendish has with his teammates, something which has shown in France this year. He’s quick to thank them for their work, and there is clearly a strong bond between them all. “He's always very, very dedicated to the team,” Holm says. “He really gets the best out of his people, so I think people have to thank him also.”</span></p>\n<p><span>Cavendish and his Quick Step team have been dominant in this Tour de France so far, giving many cycling fans the fairytale final chapter of the sprinter’s career. But, will this be the last Tour Cavendish does? “I think even next year, there could be a few stage wins at the Tour.” Holm says. “But if you ask me, I will say please don't. Enough is enough.” Holm argues that Cavendish should do smaller races and find pleasure within cycling, then retire into a job in the industry.</span></p>\n<p><span>But Holm knows better than anyone that Cavendish will stick to his guns, he won’t listen to critics or advice, and will likely race until he alone wants to stop. This Tour de France has surely taught us the lesson to never count the Manxman out.</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"eff22e1797bbdd7e2cbf491a78fe241038da38f0f23226969e9ddad6bd27cb2f","category":"Cycling"}