{"title":"Effects of Salinity on Muscle Nutrition, Fatty Acid Composition, and Substance Anabolic Metabolism of Blue Tilapia Oreochromis aureus","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/5549406?af=R","date":1704700800000,"content":"<p>A 60-day culture in brackish water (0, 3, 5, 7, 9, and 11 ppt) was conducted to study the effects of salinity on muscle nutrition, fatty acid composition, and anabolic metabolism of blue tilapia <i>Oreochromis aureus</i>. Current research showed that WGR, SGR, and FCR indicators of tilapia were better improved in brackish water. In addition, the physical properties of <i>O. aureus</i> muscle demonstrated a positive correlation with salinity levels. The content of amino acids and fatty acids in <i>O. aureus</i> muscles grown under salinity was higher than that in freshwater (<i>P</i> &gt; 0.05). Venn analysis showed that 2343 common differentially expressed genes (DEGs) were identified in the four groups (0, 3, 7, and 11 ppt), of which 767 were up-regulated and 1576 were down-regulated. GO and KEGG analysis revealed 39 significant pathways, mainly including unsaturated fatty acid biosynthesis, fatty acid elongation, and <i>α</i>-linolenic acid metabolism. The heat map and trend analysis showed that the expression levels of key genes involved in the physiological processes of ELOVL, SPLA2, and FADS2 in the test group were significantly higher than those in the control group (<i>P</i> &gt; 0.05). The above results suggested that <i>O. aureus</i> can not only adapt to the saline habitat but also improve muscle quality by regulating the body’s metabolic pathways.</p>","author":"Kangqi Zhou, \nZhong Chen, \nJunqi Qin, \nYin Huang, \nXuesong Du, \nCaiqun Zhang, \nXianhui Pan, \nYong Lin, \nMohamed Abdelsalam","siteTitle":"Wiley: Journal of Applied Ichthyology: Table of Contents","siteHash":"411fbab4e21e579add0b45892c8bae33151f2fc1dcfa886f71382f3516ee5117","entryHash":"eff3eb166ef39cbc7e9745cb7585796e0075cc182f16e5d1515ac7cb4dbcda2d","category":"Environment"}