{"title":"Preparation and Characterization of Cellulose/Silk Fibroin Composites Microparticles for Drug Controlled-Release Applications","link":"https://www.preprints.org/manuscript/202409.1442/v1","date":1726732385000,"content":"Microparticles derived from biomaterials are becoming increasingly popular for various applications, particularly in drug delivery systems. In this study, the water-in-oil (W/O) emulsification-diffusion method was used to create cellulose (C), silk fibroin (SF), and C/SF composite microparticles. We then observed the morphology of all obtained microparticles using scanning electron microscopy (SEM), evaluated their functional groups using attenuated total reflection Fourier transform infrared spectroscopy (ATR-FTIR), and conducted thermogravimetric analysis using a thermogravimetric analyzer (TGA). SEM micrographs indicated that the native SF microparticles have the highest spherical shape with smooth surfaces. With blue dextran, the C microparticle was smaller compared to the native microparticle, while the drug-loaded SF microparticles were bigger than the native microparticle. The morphological surfaces of the C/SF composite microparticles were varied in shape and surface depending on the C/SF ratio used. The spherical shape of the C/SF composite microparticle was increased as SF content increased. Furthermore, the size of drug-loaded C/SF composite microparticles was gradually increased by the SF content. The significant functional groups in the C and SF structures were identified based on the ATR-FTIR data, and a suggestion was made regarding the interaction between the functional groups of each polymer. When compared to both native polymers, the C/SF composite microparticles exhibit improved thermal stability. The C/SF composite microparticle at a 1:3 ratio had the lowest drug release content, whereas the hydrophilicity of the C microparticle affected the highest drug release content. As a result, one crucial factor affecting the medication released from the microparticle is its thermal stability. According to the obtained results, C, SF, and C/SF composite microparticles show promise as delivery systems for drugs with controlled release.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"effdd78197861f9ca2283b1f8e5cb5ca4119606b84069767d2ea15f9e112b8ac","category":"Interdisciplinary"}