{"title":"Tour de France history: Magne holds on to win his first Tour","link":"https://www.cyclist.co.uk/in-depth/9770/tour-de-france-history-magne-holds-on-to-win-his-first-tour","date":1624275500000,"content":"<span>\n      <span><a href=\"/authors/giles-belbin\">Giles Belbin</a></span>\n  </span><div>  \n  <div>      <div><span>21 Jun 2021</span></div>    </div></div><p>\nMagne could easily have lost yellow in the final week of the 1931 Tour but for the arrival of an anonymous letter. Photo: L'Equipe</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/06/tour_history_magne.jpg?itok=rZPubMLc\" />  </div>\n<div>\n      <p> The 25th Tour de France started in Eaux-Bonnes, at the foot of the Col de l’Aubisque,’ reported Le Miroir des Sports on 11th July 1931. ‘Until then, like all previous years, it had been nothing but a joke. From Paris, frankly speaking, we had been bored to death; but, all of a sudden, what change and what compensation!’</p>\n<p>The journal was referring to the fireworks that had lit up the race three days earlier. The first of two days in the Pyrenees, Stage 9 was 231km from Pau to Luchon and featured ascents of the Aubisque and Tourmalet before a sharp descent into the Campan valley and a 95km blast along flatter roads to the finish.</p>\n<p>Charles Pélissier had gone into the stage as race leader while the next best-placed Frenchman was Antonin Magne in sixth, 1min 59sec behind. Magne, in his fifth Tour, had four stage wins to his name and had never finished outside the top 10, taking third in 1930.</p>\n<p>Other strong results included third in Paris-Roubaix and fourth in Bordeaux-Paris, but without a major race win to his name Magne was forming a reputation as someone who could fare well against the best without actually winning.</p>\n<p>As the riders rolled out from Pau, Magne knew he was as well prepared as anyone. The Frenchman, who in his teens reportedly forced himself to move a heavy rock in the garden every day to build strength, had prepared for the 1931 Tour by spending an extended period in the Pyrenees ‘to learn them metre by metre’. Nevertheless as the stage developed things looked to be turning against him.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Tour de France 2021: Everything you need to know</a></div>      <div><a href=\"/in-depth/9797/gallery-emotional-mathieu-van-der-poel-wins-tour-de-france-stage-2-to-take-yellow\">Gallery: emotional Mathieu van der Poel wins Tour de France Stage 2 to take yellow</a></div>      <div><a href=\"/in-depth/9460/tour-de-france-history-the-hardest-stage-ever\">Tour de France history: The hardest stage ever?</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 115: on sale now!</a></div>    </div></div><p>\nPunctures on the Aubisque and Tourmalet – at one point he was forced into pushing his bike on the Aubisque – meant he reached the top of the final climb more than four minutes behind Belgium’s Joseph Demuysere.</p>\n<p>But Magne remained calm and after stopping for a drink alongside Italy’s Antonio Pesenti at the top of the Tourmalet, set off in hot pursuit. What followed had cycling writers purring.</p>\n<p>‘He hurtles down, eyes attentive, jaws tight, muscles tense, along the endless labyrinth and in terrifying turns,’ gushed Le Miroir des Sports. ‘His performance will remain as an illustration of patient and determined effort… His descent from the Tourmalet was fantastic, both daring and masterly. During the last 60km of flat, while he was alone in the lead, his pace, his freshness, his energy amazed everyone.’</p>\n<p>Magne had ripped up the race, passing all who had summited the Tourmalet before him and finishing 4min 42sec ahead of runner-up Pesenti. A three-minute time bonus meant he was now in yellow with a lead of 9min 32sec.</p>\n<h3>A fortuitous letter</h3>\n<p>Magne now had more than two weeks to defend his lead. Punctures and mechanicals still blighted him – this picture of him changing his tyre was taken during the second Pyrenean stage, at the foot of the Col d’Aspet.</p>\n<p>The France team had swung behind the race leader though, and he fought off repeated attacks from the Italian squad. As the Tour reached Charleville, with only two stages remaining, Magne had a lead of more than five minutes over Pesenti and nearly 13 minutes over Demuysere.</p>\n<p><a href=\"http://www.dennismags.co.uk/cyclist\"><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/01/clickable_subs_promo.jpg\" /></a></p>\n<p>In Charleville Magne was relaxing in the room he was sharing with the 1930 Tour winner André Leducq. On the table was a pile of letters. Normally Magne would leaf through them, opening only those he knew to be from family and leaving the others for after the race. But<br />\nthis time one caught his eye.</p>\n<p>‘He never revealed why: intuition, chance, luck?’ Pierre Chany wrote. ‘Call it whatever you like, but it was certainly good fortune.’</p>\n<p>The anonymous letter warned of a potential threat to Magne’s lead. The author revealed they had just returned from Menin, where the parents of Belgian rider Gaston Rebry had a cafe.</p>\n<p>Rebry’s parents had said their son had forged a plan for him and Demuysere to attack Magne on the cobblestones of the penultimate stage – from Charleville to Malo-les-Bains. Magne was bemused but resolved not to let the two Belgians out of his sight the following day.</p>\n<p>The attack came 170km from the finish. Magne, aided by Leducq, went with Rebry and Demuysere, sitting on their wheels much to their annoyance. The Belgians repeatedly tried to get away, then threatened to push Magne off his bike if he didn’t at least take a turn at the front.</p>\n<p>Wave after wave of attacks came but Magne wouldn’t be distanced, despite a crash. Rebry took the stage but Magne retained his lead and the next day was crowned winner of the Tour. He told reporters that if it meant he had to suffer the psychological pain he’d just endured, he wouldn’t start another race for all the money in the world.</p>\n<h3>Making victory a virtue</h3>\n<p>Magne won the Tour again in 1934, teammate René Vietto twice sacrificing his own chances to help Magne win by offering a wheel and then his bike when his leader suffered mechanicals on successive mountain stages. ‘That Antonin, he doesn’t know how to ride a bike,’ Vietto said. ‘I’m not going to play the slave forever, you know.’</p>\n<p>Magne also won the World Championships in 1936, for once not suffering a single incident on a day when heavy rain loosened stones and grit on the roads and forced many of his rivals into unplanned stops as their tyres punctured.</p>\n<p>After retirement Magne entered the world of management, directing the Mercier team for 25 years, and such was his success that his exploits as a rider were sometimes forgotten.</p>\n<p>Magne’s motto was ‘glory is never where virtue is not’. In 1962 he was made a Chevalier de la Légion d’Honneur. He died in 1983 at the age of 79.</p>\n<p><em>Giles Belbin is the author of Tour de France Champions: an A to Z (<a href=\"http://www.thehistorypress.co.uk\" target=\"_blank\">thehistorypress.co.uk</a>)</em> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/events\">Events</a></div>    </div></div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"effd344432ef79873e353792f5f9ef5de744eb5cdb9ba3040b376aa1e52d0a8a","category":"Cycling"}