{"title":"The race that never lies: Remco Evenepoel is a cut above","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-cut-above-remco-evenepoel-wins-a-race-of-three-at-the-worlds","date":1691775711000,"content":"\n      <p>The beauty and the cruelty of the race of truth is that there is simply nowhere to hide. If you’ve ever had the dubious pleasure of riding a time trial, you’ll know that invariably there are two ways of experiencing it: either you feel horrifically bad and get a good result, or you feel horrifically bad and get a bad result. If you’ve avoided either of these two feelings, you’re not doing it right.</p>\n<div></div>\n<p>At the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uci-road-world-championship-2023-route-all-you-need-to-know-about-the-routes-for-the-men-s-and-womens-races\">World Championships</a>, the organisers decided a steep cobbled climb to Stirling Castle to end the course would really drive home any feelings of physical anguish, though the rolling roads of central Scotland had already put paid to the chances of many of the world’s top time trialists by the time they arrived at the foothills of the 12th century castle.</p>\n<p>Wout van Aert was perhaps the most notable of those to suffer early on in the 47.8km course. The Belgian was hotly tipped as a favourite for the rainbow jersey on Friday, but even a rider of his prodigious talent could not hide from the ruthless nature of time trialling when below his very best.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/chloe-dygert-back-on-top\"><em><strong>Read more: Chloe Dygert, back on top</strong></em></a></p>\n<p>The same can be said for the former two-time champion Stefan Küng (Switzerland), whose efforts in the road race and the Mixed Relay in the last six days may have caught up with him. The same could be said for the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> runner-up and third place in Sunday’s road race Tadej Pogačar (Slovenia), while the returning Geraint Thomas (Great Britain) and the defending champion Tobias Foss (Norway) were among those to succumb to a testing route on British roads.</p>\n<p><img alt=\"Josh Tarling and Wout van Aert World Championships\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_8114.jpg?v=1691775324\" /></p>\n<p>Put simply, they were all out of contention for a podium spot before they’d really got underway in earnest. The remarkable Josh Tarling, Britain’s 19-year-old fledgling superstar, helpfully set what would be the benchmark for any medal hopefuls before the major favourites rode off the start ramp. With Van Aert following behind him as next man, the Welshman was surprisingly 28 seconds up on the Belgian champion at the first time check, then a minute at the next two. In fact, the only person who could get close to Tarling at the latter two checkpoints was the USA’s Brandon McNulty, who was still over 40 seconds down at both points. Tarling’s time in the hot seat, 38 seconds ahead of McNulty and 49 ahead of Van Aert, is even more impressive considering he was winning the junior competition in this discipline just 12 months ago in Australia.</p>\n<p>It’s unlikely, then, that he’ll be too upset that there were two men out on the course another level above everyone altogether. Even Tarling’s fantastic ride could do nothing to halt the incomprehensible power of first, Filippo Ganna (Italy), and second, Remco Evenepoel (Belgium). Ganna, the winner of this race in 2020 and 2021, was looking to equal Australia’s Mick Rogers with a hat trick in the discipline, while Evenepoel, the winner of World Championships road race last year, was aiming to become the first Belgian winner in the time trial and eclipse Rogers as the youngest ever winner.</p>\n<p>As Ganna began stronger than Evenepoel, riding through the first checkpoint four seconds ahead, it switched on its head through the following two time checks. But the gap never strayed too far between the pair, with a 12-second advantage to Evenepoel dropping to a 10-second advantage, providing a tense tussle for victory between them that served up a level of entertainment that can often be lacking from a type of racing that does not always make for scintillating television.</p>\n<p><img alt=\"World Championships 2023 men's time trial final podium\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PB1_8437.jpg?v=1691775352\" /></p>\n<p>It was to be Evenepoel’s triumph in the end by just 12 seconds, both men gritting their teeth amongst the torturous final efforts over the cobbles to the finish. It’s a win for the Evenepoel that’s been on the cards for some time, ever since he overpowered everyone but Rohan Dennis in Yorkshire in 2019 to finish second, then just 19 years old (so perhaps a good omen for Josh Tarling).</p>\n<p>The race of truth never lies, and today in Scotland there were three who were simply a cut above the rest.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f00617b3d9e3c5fa19df5b2f386183ccc81f0518a744480bbad65bd3582eda7c","category":"Cycling"}