{"title":"Optimization of adiabatic flame temperature of natural gas combustion under different conditions","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14356?af=R","date":1715141849000,"content":"<h2>Abstract</h2>\n<p>The combustion of natural gas consisted of methane CH4, ethane C2H6, and propane C3H8 is theoretically investigated to obtain the optimum adiabatic flame temperature (AFT). The investigation includes the development of combustion equations that take into consideration different compositions of natural gas. The final equation to calculate the AFT is derived and used in the optimization study. The optimization study using genetic algorithm investigates the effect of changing the composition of the gas mixture, the inlet temperature of used air, and the amount of excess air used on the AFT. It is possible to get the required composition of each component, the air inlet temperature, and the excess air by reading the chart to get the required AFT. The heat capacity of all reactants and products is used as a function of temperature. Results showed that the optimum values for CH4,C2H6,C3H8, percentages in the gas mixture, air inlet temperature, and the amount of excess air are 0.478, 0.166, 0.356 mol %, 1.848, 382.104 K, respectively. These optimum values lead to a value of about 1300 K for the AFT. The derived equation shows the AFT at different natural gas compositions along with different process parameters such as the amount of excess air. Thus, the required combustion temperature can be controlled by adjusting the natural gas composition or the combustion temperature can be specified based on the provided composition of the natural gas stream by using either the derived equations or output chart. (R1. 1).</p>","author":"Ehab Hussein Bani‐Hani, \nFadi Al‐Khatib, \nMamdouh El Haj Assad, \nMohammad Alshabi, \nHumberto Garcia Castellanos, \nYashar Aryanfar, \nAhmed Deifalla, \nAdham E. Ragab","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"f012d0c3673b9d0704706e2e00e57d53b75620f6ef8eec6a92a155bdfc49fb43","category":"Environment"}