{"title":"Investigation of COVID-19 outbreak at a refugee transit centre, Kisoro District, Uganda, June–July 2022","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002428","date":1709733600000,"content":"<p>by Peter Kawungezi, Richard Migisha, Robert Zavuga, Brenda Nakafeero Simbwa, Jane Frances Zalwango, Mackline Ninsiima, Thomas Kiggundu, Brian Agaba, Irene Kyamwine, Daniel Kadobera, Benon Kwesiga, Lilian Bulage, Robert Kaos Majwala, Alex Riolexus Ario</p>\r\n\r\nDue to conflict in the Democratic Republic of Congo (DRC), approximately 34,000 persons arrived at Nyakabande Transit Centre (NTC) between March and June 2022. On June 12, 2022, Kisoro District reported &gt;330 cases of COVID-19 among NTC residents. We investigated the outbreak to assess its magnitude, identify risk factors, and recommend control measures. We defined a confirmed case as a positive SARS-CoV-2 antigen test in an NTC resident during March 1–June 30, 2022. We generated a line list through medical record reviews and interviews with residents and health workers. We assessed the setting to understand possible infection mechanisms. In a case-control study, we compared exposures between cases (persons staying ≥5 days at NTC between June 26 and July 16, 2022, with a negative COVID-19 test at NTC entry and a positive test at exit) and unmatched controls (persons with a negative COVID-19 test at both entry and exit who stayed ≥5 days at NTC during the same period). We used multivariable logistic regression to identify factors associated with contracting COVID-19. Among 380 case-persons, 206 (54.2%) were male, with a mean age of 19.3 years (SD = 12.6); none died. The attack rate was higher among exiting persons (3.8%) than entering persons (0.6%) (p&lt;0.01). Among 42 cases and 127 controls, close contact with symptomatic persons (aOR = 9.6; 95%CI = 3.1–30) increased the odds of infection; using a facemask (aOR = 0.06; 95% CI = 0.02–0.17) was protective. We observed overcrowding in shelters, poor ventilation, and most refugees not wearing face masks. The COVID-19 outbreak at NTC was facilitated by overcrowding and suboptimal use of facemasks. Enforcing facemask use and expanding shelter space could reduce the risk of future outbreaks. The collaborative efforts resulted in successful health sensitization and expanding the distribution of facemasks and shelter space. Promoting facemask use through refugee-led efforts is a viable strategy.","author":"Peter Kawungezi","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"f013ae2893624cb33d17e42357720c8e4b2e285b523c0f3c501e59c8b754a988","category":"Environment"}