{"title":"A ‘tiny’ kid from the Scottish Borders taking on the world: The making of Oscar Onley","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-tiny-kid-from-the-scottish-borders-taking-on-the-world-the-making-of-oscar-onley","date":1705738590000,"content":"\n      <p><span>Oscar Onley has the date of September 29, 2022, bookmarked in his head. Throughout the decade leading up to that specific day, Onley had been waking up, putting his leg over his bike, clipping his feet into the pedals and training. As the years rolled on, he spent his time riding his bike through the rolling, grey Scottish countryside around Kelso where he grew up, then in the mountainous terrain of Chambéry when he joined AG2R Development Team, then on the flat roads of Sittard where he was part of DSM’s under-23 squad. As he trained and raced, the results that came were respectable for the young Scot, but he was by no means making headlines like the prodigious young super talents of today’s cycling era. On September 29, however, everything changed.</span></p>\n<div></div>\n<div></div>\n<p><span>Onley started in the CRO Race as a member of Team DSM’s Development squad, at the race to learn, without any pressure on his shoulders. The fact that the Tour de France champion, Jonas Vingegaard, was also starting was of little concern to him – that was until he found himself battling the Danish rider for victory on stage two. A few days later, Onley proved that it was no fluke, pushing Vingegaard to his limits once again on the fifth hilly stage to Labin. It was then that the interview requests came, that the headlines were written, that the WorldTour contract started to be discussed. Oscar Onley had arrived in professional cycling, and dsm-firmenich had a star in their ranks.</span></p>\n<p><span>“It was really special,” Onley reflects. Two years on from that day in the CRO Race, the 21-year-old is now in his second season with dsm-firmenich’s WorldTour squad and is about to start his first race of 2024 at the Tour Down Under. “Everything just clicked into place. I think it was a gradual process with nice stepping stones.”</span></p>\n<p><span>By today’s standards, where young riders can enter the WorldTour and win in their first year out of the junior ranks, Onley’s pathway from starting out on a bike aged ten, to racing head-to-head with Vingegaard, has been steady. While the Scottish rider’s route to the top would once have been considered a normal rate of progression, the likes of Remco Evenepoel and Josh Tarling have skewed things with incredible results so soon in their careers. Onley, on the other hand, credits riding as an under-23 in development programmes as crucial making him the rider he has become.</span></p>\n<p><span>“I was never that good as a youth,” Onley admits. “I’m still quite small now, but as an under-14 and an under-16 I was really tiny, so I think the track and the criterium courses we did, they didn’t suit me very well. I never really got any results.</span></p>\n<p><span>“I think it’s quite interesting that if you look down the results of people doing well in the youth category, the names of the people who have actually moved up [to being a professional] can often be quite far down the list.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-01898_1024x1024.jpg?v=1705737929\" /></span><em><span>Onley racing during the AJ Bell Tour of Britain 2022 (Image: Zac Williams/SWpix)</span></em></p>\n<p><span>Onley explains how running was the sport that suited him best as a child, and it wasn’t until he turned 18 and joined the junior ranks that he began to take cycling seriously. Although he credits Scottish Cycling for giving him a number of opportunities during his development, Onley points out that not being suited to the track meant that he never spent time as part of the British Cycling programme, which often gives riders a clear pathway to the top of the sport.</span></p>\n<p><span>“I got more committed when I was a junior – I just preferred the training for cycling compared to running. I always wanted to be on my bike,” Onley explains.</span></p>\n<p><span>Racing on the continent where there were hills to conquer was the best option for the Scot who would likely never excel on the relatively flat courses that are most common on the UK domestic scene. Onley joined the Van Rysel-AG2R La Mondiale development team with designs on racing in France during his second year in the junior category, but the pandemic in 2020 curtailed his plans and he missed almost an entire season of racing. Second year junior is one of the most crucial development phases for young riders, something Onley says he notably felt the impact of not having.</span></p>\n<p><span>“I really noticed [missing the 2020 season] when I came to the DSM Development team in 2021. I went straight to pro races, because there still weren't many under-23 races. It was quite a big step up. It took me some time to get back into that kind of racing rhythm,” Onley explains. “I got in contact with the team through Matt Winston. I was really surprised when I heard that they were interested because I didn't really have any results that stood out or anything.</span></p>\n<p><span>“I think it's really a credit to the team that they found me. If we look from where I was in 2020, to where I am now, it’s really impressive how they can help riders like that.”</span></p>\n<p><span>It was no fairytale for Onley when he stepped into the under-23 ranks – he reflects on how he “DNF’d the first five races” and then broke his collarbone, leading him to question if joining DSM’s squad was the right choice.</span></p>\n<p><span>“I got to a point at the end of May where I started thinking that it was too big of a step and I should have gone somewhere else and done some smaller races, but the team were really good with me and there was never any pressure,” he says. “From the summer onwards, I started to get into more of a rhythm and did some more stage races. I wasn’t getting results, but I was starting to feel more comfortable in the races.”</span></p>\n<p><span>The 21-year-old credits his steady development that season to spending time in the under-23 ranks without any pressure. Despite more and more riders turning WorldTour directly from junior, Onley believes that time to learn race craft outside of the highest level is crucial.</span></p>\n<p><span>“I wouldn't have been able to turn pro immediately after junior, even turning pro after two years under-23 was really quick and wasn’t my plan. I think the under-23 category is really important and a lot of riders are still developing physically at that age,” he explains.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/26f63f34-9c25-43f0-1ce6-ceaf678354bf_1024x1024.jpg?v=1705738140\" /></span><em><span>Onley during the 2023 Tour Down Under (Image: Team dsm-firmenich PostNL)</span></em></p>\n<p><span>In 2022 – the year of that now famous battle with Vingegaard on the roads of Croatia – everything started to click into place for Onley. The seasons of setbacks and hard work started to pay off in a way that exceeded even his own expectations.</span></p>\n<p><span>“I probably got a little bit stronger from doing more races the year before. I was more consistent as well, up there and able to help the team,” Onley says of why he noticed such a marked step up in his results that year. </span></p>\n<p><span>Victory in the queen stage of Giro Ciclistico della Valle d'Aosta (a prestigious under-23 race) was the first sign that Onley was a winner in his own right, as well as a reliable domestique.</span></p>\n<p><span>“I cramped up on one of the stages and lost a lot of time on GC in Aosta,” Onley says, looking back on that first ever victory. “But I knew on paper, I was still one of the strongest in the race, so it was just about finding a day where I could try and slide in the break. The DS there was convinced that the break would stay away so that was my only focus for the day, getting into break. From there, everything just clicked into place.”</span></p>\n<p><span>Things got better and better for Onley after that win, with the CRO Race battle against Vingegaard going down as the pinnacle of his season in 2022. Despite the attention Onley got after that result, however, he stresses that remaining level headed was integral to ensuring that he came into the 2023 season with realistic expectations.</span></p>\n<p><span>“It's important to stay calm after that result and have perspective that is just one race. Vingegaard is a really strong rider, but it doesn't mean that I'm then going to be able to go into the Tour and compete against him,” Onley says. “I think maybe it is finding that balance between coming into races being confident and not being overconfident. Being realistic.”</span></p>\n<p><span>It was no surprise that DSM offered Onley a WorldTour contract after his results in Croatia, and the Scottish rider believed it was a natural progression given the time he had spent as part of the Dutch team’s development squad. He explains that the team gave him options on the programme he would race during his first year in the WorldTour and a long term plan that he felt suited him.</span></p>\n<p><span>“An important part was that I didn't want to change anything going into my first pro season. I was really happy in the team as well, so it made sense to sign with DSM, but yeah, it felt like nothing changed and I felt comfortable,” Onley says. “To actually put pen to paper and sign the contract was a childhood dream.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Winning_shot_-_Oscar_Onley_1024x1024.jpg?v=1705738229\" /><em><span>Onley wins on Willunga Hill during the 2024 Tour Down Under (Image: Tour Down Under)</span></em></span></p>\n<p><span>The Scottish rider’s first year with dsm-firmenich’s WorldTour team was about learning, and he explains that he did plenty of it during 2023. One of the main changes ahead of 2024 was to Onley’s race calendar – he will split the season into more manageable blocks this year in order to manage how long he needs to carry his form for. </span></p>\n<p><span>“I think I found the limits last year in the Dauphine. I really cracked when all the racing from the start of the year caught up with me,” Onley says. “This year I won’t do as much back to back.”</span></p>\n<p><span>Describing himself as a punchy climber, Onley says he hopes that British Cycling takes notice of his progression because he hopes to represent the country and have a shot at winning the World Championships one day. The course around Zurich in a few months time could be perfect for the versatile dsm-firmenich rider, who is quietly confident that he would make it count if he was given the chance to start for the British team.</span></p>\n<p><span>“I’d love to try and ride World Champs, it really suits me,” Onley says. “Becoming world champion one day would be such a special experience.”</span></p>\n<p><span>A few days after our conversation, Onley already proved that his progression this winter has been twofold – he took victory on Willunga Hill in stage five of the Tour Down Under, outsprinting the likes of Simon Yates, Stephen Williams and Julian Alaphilippe. Those rides in the CRO Race were far from the last people are going to see of this plucky Scottish talent, who hasn’t let his unconventional path to the top discourage him from getting what he wants out of the sport.</span></p>\n<p><span>After his stage win atop the famed Willunga Hill, journalists and cameras surrounded Onley – questions were asked and pictures were taken of his youthful face. If they didn’t already, everyone now knows the name of the Kelso born rider who dared to dream. This isn’t the last we are going to hear of Oscar Onley.</span></p>\n<p><em><span>Cover image: Zac Williams/SWpix</span></em></p><div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f01480677cf97a14e132f8035540507a8c8cf956c67a5f85d818b2cee949e539","category":"Cycling"}