{"title":"Working: What We Do All Day","link":"https://markpeak.net/working-what-we-do-all-day/","date":1687182097000,"content":"<p><a href=\"https://www.netflix.com/tudum/articles/barack-obama-working-docuseries\">Working: What We Do All Day</a> เป็นสารคดีสั้นความยาว 4 ตอนที่สร้างโดย Working: What We Do All Day บริษัทของประธานาธิบดีโอบามา ที่หันมาเอาดีเรื่องการทำสื่อหลังลงจากตำแหน่งประธานาธิบดี ฉายทาง Netflix มาตั้งแต่เดือนพฤษภาคม 2023</p>\n<p>Working: What We Do All Day ได้แรงบันดาลใจมาจากหนังสือปี 1974 ที่ดังมากเล่มหนึ่งชื่อยาวมาก <a href=\"https://en.wikipedia.org/wiki/Working_(Terkel_book)\">Working: People Talk About What They Do All Day and How They Feel About What They Do</a> เขียนโดย Studs Terkel นักเขียน-นักจัดรายการวิทยุฝ่ายซ้าย ที่ลงไปสัมภาษณ์ชาวอเมริกัน 100 คน ว่าทำ “งาน” อะไร มีรายละเอียดอย่างไรบ้าง ถือเป็นหนังสือบันทึกประวัติศาสตร์เรื่อง “งาน” ของชาวอเมริกันในยุคนั้นได้เป็นอย่างดี</p>\n<p>สารคดีชิ้นนี้มองว่ารูปแบบของ “งาน” เปลี่ยนไปจากยุคนั้นมากแล้ว คนรุ่นปัจจุบันมีปัญหาเรื่อง “งาน” ในวิถีที่แตกต่างไปจากเดิมมาก จึงลงไปสัมภาษณ์ “คนทำงาน” ประเภทต่างๆ เพื่อเรียนรู้วิถีชีวิต และปัญหาของคนแต่ละกลุ่ม</p>\n<p>สารคดีมีด้วยกันทั้งหมด 4 ตอน แยกตามระดับ “ชั้น” ของงาน</p>\n<ol>\n<li>Service Jobs คนทำงานระดับล่าง คนใช้แรงงาน งานบริการ แม่บ้าน</li>\n<li>The Middle งานระดับที่สูงขึ้นมา เช่น หัวหน้าคนงาน (supervisor) โอเปอเรเตอร์รับโทรศัพท์แขกในโรงแรม</li>\n<li>Dream Jobs งานใช้สมอง ค่าตอบแทนดี เช่น โปรแกรมเมอร์ ล็อบบี้ยิสต์ ผู้จัดการโรงแรม</li>\n<li>The Boss งานระดับสูงสุด ซีอีโอ ประธาน เจ้าของธุรกิจ</li>\n</ol>\n<p>Working เลือกไปสัมภาษณ์เจาะลึกงานทั้ง 4 ระดับใน 3 องค์กร ได้แก่ โรงแรมหรู Pierre Hotel ในนิวยอร์ก, บริษัทสตาร์ตอัพรถยนต์ไร้คนขับ Aurora และ บริษัทรับจ้างดูแลคนป่วยตามบ้านชื่อ At Home Care โดยทั้ง 3 องค์กรจะสัมภาษณ์ทั้ง 4 ระดับ (รวม 12 เซ็ต)</p>\n<p>รูปแบบการนำเสนอเป็นการตามถ่ายชีวิตของ “คนทำงาน” แต่ละคน รวมถึงคนข้างเคียง ครอบครัว พี่น้อง เพื่อนร่วมงาน ให้เล่าเรื่องจากมุมมองของตัวเอง โดยที่ไม่มีพิธีกรโผล่มาในกล้องให้เห็น อาจมีบางซีนที่โอบามาลงไปเป็นคนสัมภาษณ์เองด้วย เราจึงมีโอกาสได้เห็นโอบามาได้ลองทำงานเป็นคนส่งอาหารในออฟฟิศ เดินซื้อของในซูเปอร์มาร์เก็ต เยี่ยมบ้านของผู้คนจนถึงห้องนอน ไปจนถึงสัมภาษณ์ประธานบริษัท Natarajan “Chandra” Chandrasekaran ประธานของ Tata Group บริษัทยักษ์ใหญ่ของอินเดีย ที่เป็นเจ้าของ Pierre Hotel</p>\n<p></p>\n<p>สารคดีชิ้นนี้เล่าเรื่องความยากลำบากของคนทำงานระดับล่าง ที่ต้องวิ่งหาเงินมาให้พอกับค่าใช้จ่ายเดือนต่อเดือน (ที่เพิ่มสูงขึ้นเรื่อยๆ) แล้วเปรียบเทียบกับงานระดับบนๆ ที่เป็น “งานในฝัน” ของใครหลายคน อย่างไรก็ตาม วิธีการเล่าเรื่องเป็นแบบไปเรื่อยๆ ตั้งคำถามโดยไม่มีข้อสรุปใดๆ ไม่มีการขมวดปมให้คนทำงานแต่ละระดับต้องมาปะทะกัน ออกไปในเชิงว่า แต่ละคนมีวิถีชีวิตแตกต่าง มีข้อจำกัดของแต่ละคนแตกต่างกันไปมากกว่า</p>\n<p>จุดเดียวที่โอบามาวิจารณ์เรื่องค่าตัวของ CEO เทียบกับพนักงานระดับล่าง ที่ความถ่างเพิ่มขึ้นมาก เป็นเพราะแนวคิดเรื่องธุรกิจต้องทำกำไรสูงสุดจากนักเศรษฐศาสตร์ Milton Friedman ที่เริ่มแพร่หลายในยุครัฐบาลเรแกน (ซึ่ง Friedman เป็นที่ปรึกษาให้) แต่ก็เป็นการวิจารณ์ไปที่ตัวแนวคิดของ Friedman โดยตรง ไม่ได้วิจารณ์เหล่า CEO ที่ไปถ่ายทำแต่อย่างใด</p>\n<p>ซีนที่ชอบที่สุดคือตอนที่ 2 ที่กลุ่มพนักงานสัญญาจ้างของ Aurora มานั่งคุยกันว่าเคยทำงานอะไรมาบ้าง ทุกคนมีความสุขกับการอัพเกรดจากชีวิตพนักงานแบบ service jobs เพราะได้ค่าตอบแทนดีขึ้น สวัสดิการมากขึ้น พนักงานคนหนึ่งเล่าว่าชีวิตของเขาเคยต้องเลือกระหว่างใช้เงินเติมน้ำมัน กับซื้อของสดเข้าบ้าน เพราะถ้าเติมน้ำมันเยอะเกินไปจะไม่มีเงินซื้อของสด แต่หลังจากเขามาทำงานนี้ (กับ Aurora) เขาสามารถเติมน้ำมันได้ตามต้องการแล้ว</p>\n<p>ดูจบแล้วคงไม่ได้คำตอบนักว่า เราจะแก้ปัญหาเรื่อง “งาน” และความเหลื่อมล้ำในโลกสมัยใหม่ได้อย่างไร แต่ก็เข้าใจบริบทของปัญหามากขึ้น ได้เห็นชีวิตของคนทำงานในแง่มุมที่แตกต่างไป โดยเฉพาะชีวิตของคนทำงานใน <a href=\"http://at-home-care.com/\">At Home Care Inc.</a> ซึ่งเป็นบริษัทท้องถิ่นในรัฐมิสซิสซิปปี้ ทางตอนใต้ของอเมริกา คนทำงานเหล่านี้เกือบทั้งหมดเป็นผู้หญิงผิวดำ (ด้วยบริบททางประวัติศาสตร์การเมืองท้องถิ่น) และได้รับผลกระทบจากนโยบายระดับรัฐ ที่ทำให้เงินชดเชยจากโครงการ Medicaid มาจ่ายคนทำงานลดลง เป็นสิ่งที่อาจไม่ได้ปรากฏให้เห็นในสื่อกระแสหลักมากนัก</p>\n<p></p>\n<p>หมายเหตุ: Aurora เป็นสตาร์ตอัพรถยนต์ไร้คนขับที่ก่อตั้งโดย superstar ของวงการรถยนต์ไร้คนขับรุ่นบุกเบิก 3 คนได้แก่</p>\n<ul>\n<li><strong>Chris Urmson</strong> <a href=\"https://www.blognone.com/node/88138\">อดีต CTO โครงการรถยนต์ไร้คนขับของ Google</a> (ปัจจุบันคือ Waymo), จบ PhD หุ่นยนต์จาก CMU และเคยชนะ DARPA Grand Challenges ในปี 2007</li>\n<li><strong>Sterling Anderson</strong> อดีต Director of Autopilot ของ Tesla, จบ PhD หุ่นยนต์จาก MIT</li>\n<li><strong>Andrew (Drew) Bagnell</strong> จบ PhD หุ่นยนต์จาก CMU และเคยเป็น<a href=\"https://www.ri.cmu.edu/ri-faculty/j-andrew-drew-bagnell/\">อาจารย์ Robotics Institute ที่ CMU</a> ด้วย, เคยเป็นหัวหน้าทีม Autonomy ของ Uber เป็นช่วงสั้นๆ ซึ่งภายหลัง <a href=\"https://www.blognone.com/node/119994\">Aurora ซื้อทีมรถยนต์ไร้คนขับของ Uber</a> เข้ามาในปี 2021</li>\n</ul>The post <a href=\"https://markpeak.net/working-what-we-do-all-day/\">Working: What We Do All Day</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"f015fd933d03d56087abd6c15349f05abf74cf24bdc3a519b6f3c5f133ab355b","category":"Thai"}