{"title":"Psychometric Property of the Chinese Version of the Core Symptom Index: A Study Among Chinese Parents of Children with Autistic Spectrum Disorders","link":"https://www.preprints.org/manuscript/202405.1706/v1","date":1716796511000,"content":"(1) Background: Parents of children with autism spectrum disorders often experience psychological distress, which can affect the quality of childcare they provide. It is crucial to screen for psychiatric symptoms among these parents. The Core Symptom Index (CSI) is a widely used tool for assessing general symptoms such as depression, anxiety, and somatic symptoms, with demonstrated validity and reliability across various populations. However, there is limited research on the validity and reliability of the CSI in the general Chinese population. This study aimed to investigate the psychometric properties of the Chinese version of the CSI among parents of children with autism spectrum disorders using Confirmatory Factor Analysis (CFA). (2) Methods: A total of 794 Chinese parents raising children with autism participated in this study. All completed the CSI, along with the social inhibition subscale of the Interpersonal Problems Inventory and the Couple Satisfaction Index. Factorial validity was assessed using CFA to determine how well the bifactor three-factor model fits the data. Various structural models were compared using model fit indices. Convergent and discriminant validity were examined by exploring correlations with the social inhibition subscale and the Couple Satisfaction Index. Invariance testing of the CSI was conducted across multiple groups based on gender, age, and education using CFA. The reliability of the CSI was evaluated using McDonald’s omega coefficients. (3) Results: The bifactor model emerged as the best-fitting model for the data, suggesting that the total score of the CSI adequately represents overall psychiatric symptoms. The CSI exhibited significant correlations with the social inhibition subscale (r = 0.41, p &amp;lt; 0.01) and smaller correlation coefficients with the Couple Satisfaction Index (r = -0.16, p &amp;lt; 0.05), indicating both convergent and discriminant validity. Invariant tests supported scalar invariance levels based on gender and age but only partial invariance for education. The Chinese version of the CSI demonstrated high consistency, with McDonald's omega coefficients ranging between 0.86 and 0.95. (4) Conclusions: The bifactor model of the Chinese version of the CSI is validated, making it a suitable tool for measuring depression, anxiety, and somatization symptoms among parents of children with autism spectrum disorders. Further research on other Chinese populations is encouraged.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f01a392b8c5bf94a9e2d91307909be95b70273b83b9fb43833d034d12709cc5b","category":"Interdisciplinary"}