{"title":"Improvising in the Aladağlar – Ryan Wilson","link":"https://theradavist.com/2021/09/improvising-in-the-aladaglar/?utm_source=rss&utm_medium=rss&utm_campaign=improvising-in-the-aladaglar","date":1632139243000,"content":"<p>I rolled into the small village of Çamalan. There was a lone shop at the main intersection of town that had a steady flow of locals driving up in their cars. Typically they’d grab bread from the cupboard outside, maybe some Ayran from the fridge, and (most likely) a few packs of cigarettes. These are the Turkish staples.</p>\n<p>It was almost dark and I had no clue where I would spend the night.  This is a fairly typical situation for me at this point. I’ve grown comfortable with the feeling.  That’s not to say it can’t be stressful, but when you’ve felt that uncertainty dozens of times before, it gives you more confidence that you’ll be able to make it work out somehow.<span></span></p>\n<p>As I picked up a loaf of Somun bread, I asked the shop owner (in a terrible rendition of Turkish) if there was a hotel nearby. After 4 days of riding dusty tracks and camping in the mountains, I was overdue for a shower and clean clothes. He looked up for a moment, thinking, and then pointed toward the highway nearby that I could hear droning along with trucks in the background.<span>  </span>“20 Kilometers!” he said… Ugh.</p>\n<p>With no desire to ride the edge of a highway at night (or anytime), I asked if there was a spot I could camp in town. He then shifted his gaze to the unmarked building across the street to point out his teahouse. He hunted for the keys and then walked me over.  It would do just fine.  “Sivrisinekler!” he said on his way out the door. I had no clue what it meant, which must have been pretty obvious by my puzzled look. He motioned with his hand flying around and pinching his arm.<span>  </span>Ahhh, mosquitos.<span>  </span>I guess I’ll pitch my tent anyways, rather than turn into dinner for the bugs.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/RyanWilson_AladaglarCircuit-02.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/09/RyanWilson_AladaglarCircuit-15.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>In the morning we shared a classic Turkish breakfast of bread, boiled eggs, fresh cheese, olives, tomatoes, and (of course) tea while villagers slowly gathered around to socialize outside of the teahouse.  This is a sight you’ll find in virtually every town in Turkey, no matter how big or small.</p>\n<p>The shop owner stuffed my bags with a few extras and I set off toward Belemedik Canyon. I had been curiously eyeing its steep cliffs on topographical maps for a while, but on most maps I saw, no road connected all the way through. One showed a hiking trail for one section and a road for the rest.<span>  </span>Needless to say, I wasn’t entirely sure of what I was getting into, but I was certainly happy to take a shot on this rather than be forced onto the highway.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/RyanWilson_AladaglarCircuit-04.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/09/RyanWilson_AladaglarCircuit-05.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>A super loose and steep descent began just as big views of the canyon below started to open up. Immediately this was one of the most spectacular places I’d been to in all of Turkey. A shelf road that occasionally tunnels into the side of the mountain or simply clings to the edge of it. At one point a giant boulder blocked the road from edge to edge.<span>  </span>There was just enough space to sneak by. There’s no doubt that this track becomes impassable regularly, and it would almost certainly be a bad idea to head here during prolonged rains. Thankfully, it was nothing but clear skies these days.</p>\n<p>For obvious reasons, the road was deserted. Just me, the roaring river below, and the occasional herd of mountain goats clinging to the cliffs.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/RyanWilson_AladaglarCircuit-47.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>My evening search for a campsite would be useless here, with basically nothing resembling flat ground around, so I would be forced to push on, out of the canyon walls.<span>  </span>Eventually, the cliffs opened up into a valley and I found myself at something resembling a campground filled with locals. <span> </span></p>\n<p>I hadn’t seen anybody out camping to this point in Turkey, so I was a bit shocked to see dozens of tents lining a small grassy field and kids running around screaming. While it’s not my ideal campsite, nearby there was an outdoor restaurant serving all sorts of Turkish favorites that looked pretty amazing, so that seems like an even trade to me!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/RyanWilson_AladaglarCircuit-42.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>After a few more valleys and mountain passes, I began inching my way closer to Aladağlar Milli Parkı.<span>  </span>It was when I first came across this area while surfing through various rabbit holes of Google Earth one day that I became interested in touring this region.<span>  </span>The sharp peaks combined with the web of old 2-track roads reaching up beyond 3,000 meters were calling my name. <span> </span></p>\n<p>Finally, I was here, but I still hadn’t actually locked down what kind of route I’d take. Instead, I simply mapped every possibility out that looked interesting, picked up some hints on potential resupply points from locals, and made up the rest as I went along. <span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/RyanWilson_AladaglarCircuit-44.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Mixed in were some of the most challenging and rewarding roads I’d been on since my time in Kyrgyzstan.  A relentless uphill grind followed by a brake-burning descent. Rinse and repeat. The Turkish road builders are not always kind with the gradients in the high mountains, but they do take you to some amazing places.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/RyanWilson_AladaglarCircuit-45.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/09/RyanWilson_AladaglarCircuit-49.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>As I made my way to the northern edge of the range, where the Anti-Taurus mountains give way to the arid Anatolian plateau, the temperatures began to rapidly drop. After a couple of months of nothing but sandal weather, nights at altitude were suddenly dipping down around -10°C. Storms blew in on consecutive days and put a fresh dusting of snow on the peaks.<span>  </span>Crisp mornings were spent waiting for the sun to finally thaw out the thick coating of nightly frost.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/RyanWilson_AladaglarCircuit-59.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/09/RyanWilson_AladaglarCircuit-60.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Reluctantly, I descended from the Anti-Taurus mountains one last time before high-tailing it back toward Antalya. There I could take advantage of the warmer coastal weather and dive a bit deeper into the history of the region along the Lycian Way…</p>\n<p></p>","author":"Ryan Wilson","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"f0299943e6d9955674e0dd769b53841e4f3d976079fd2bffbef1a7e2211983fe","category":"Cycling"}