{"title":"Southern right whale behavioral changes due to interactions with whale‐watching vessels: evidence‐based calculations aimed at improving management policies","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13149?af=R","date":1720155579000,"content":"<h2>Abstract</h2>\n<p>Interactions between whale-watching vessels and cetaceans have raised questions regarding the sustainability of whale-watching. This study aimed to build a model for managing whale-watching activity. The approach involved establishing vessel-exposure thresholds based on changes in short-term behavioral responses of southern right whales in the Bahía San Antonio Marine Protected Area of Argentina. The model serves as a source of information for management decision-making in whale-watching operations, with an estimated framework for the maximum carrying capacity dictating the vessel-exposure level that can be maintained with no significant changes in the whales' activity budgets. The model, based on Markov chains, indicated that surface active behavior was the form most sensitive to the presence of tourism vessels. However, vessel exposure always remained below nonsustainability threshold, defined as the amount of time that a whale could be disturbed by vessels without significantly changing its activity budget. Therefore, the observed changes were biologically insignificant. Thus, whale watching in this area is developing with minimal impact on southern right whales. An understanding of the exposure thresholds is essential for establishing management strategies that enable sustainable whale watching. This approach is crucial for setting limits within a scenario of future growth and reducing activity when demand exceeds the carrying capacity.</p>","author":"Magdalena Arias, \nSilvana Dans, \nEnrique A. Crespo, \nRaúl A. C. González","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"f02ad9ca30852967ac65d65ee532cd1bf926d841b3a38439a28aa35b8532727e","category":"Environment"}