{"title":"Health system adaptations for extreme heat: Protocol for an international scoping review of reviews","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307417","date":1721311200000,"content":"<p>by John Richmond, Mark Clowes</p>\r\nObjective <p>The objective of this study is to map the international evidence for extreme heat related adaptation strategies by health systems, with a particular focus on how heat-vulnerable populations and local situational awareness are considered in these strategies.</p> Introduction <p>Since the Paris Climate Accords in 2015, awareness has increased of the health risks posed by extreme heat along with interest in adaptations which aim to reduce heat-health-risks for vulnerable populations. However, the extant literature on these adaptations suggest they are insufficient, and call for research to examine whether, how, and what adaptations for extreme heat are effective as public health interventions.</p> Inclusion criteria <p>We will include English-language review articles describing and/or evaluating health system adaptations for extreme heat. Health systems will be defined broadly using the WHO Building Blocks model [1] and adaptations will range from the individual level to institutional, regional and national levels, with particular attention to localisation and the protection of vulnerable individuals.</p> Methods <p>A comprehensive literature search of the published literature will be conducted using MEDLINE, Embase, CINAHL, the Cochrane Library and Web of Science. Searches will be limited to reviews published since 2015 in the English language. Results will be exported to EndNote for screening (with a sample checked by two reviewers to ensure consistency). A complementary search for related reports by major international agencies (e.g. WHO; International Association of Emergency Managers), as well as local searches for current guidance and case studies, will be conducted in parallel. Data from included papers will be presented in tables with a narrative commentary.</p>","author":"John Richmond","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f03afd38d944b6dd909c1573a349201aa485deaeca86663cf1ba852cfc8506d3","category":"Interdisciplinary"}