{"title":"Planning for climate change resilience—Collation, update and assessment of Mozambique’s marine fisheries data and management","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000494","date":1728050400000,"content":"<p>by Jorge Mario Mafuca, Rui Jorge Mutombene, Osvaldo Filipe, Silvia Abdula, Bernardino Sergio Malauene, Nilza Dias, Rex Arthur Jubb Quick, Sean Fennessy, Bernadine Everett, Mike Roberts</p>\r\n\r\nFisheries are recognized as important in Mozambique, yet they are increasingly threatened by over-exploitation and climate change. We collate and synthesize the available literature and data on marine fisheries in Mozambique; assess the status of the main fishery species/stocks; give an overview of current management of the fishery, and discuss planning for fisheries resilience in the face of climate change predictions. In Mozambique there is a heavy reliance on marine fisheries. From a food security and local economy perspective, the critical sector is the artisanal fisheries which comprises over 90% of the total landings and provides food and livelihood for millions of people, particularly in the coastal zone. Regarding economic value and earning foreign currency, the most valuable industrial / semi-industrial fisheries are the shallow-water shrimp, the deep-water crustacean and the rocky bottom demersal. Current stock assessment for these sectors indicates that the core stock species are fully- or over-exploited. Limited data are available for the artisanal fishery, but it is likely that the same status applies to this sector. Globally, well-managed fisheries have been among the most resilient to climate change—overall, fisheries best practices confer ecological resilience by providing a portfolio of options to fishers and a buffer against losing target stock. Ideally, best practices include scientifically-informed catch limits, accountability measures, regional flexibility in policy practices, protection of essential fish habitat (Marine Protected Areas), and effective monitoring, control and surveillance. Mozambique has a relatively well-managed industrial/semi-industrial fishery. However, the artisanal fishery, due to its spatial scattering, multi-gear and multi-species nature, presents a huge challenge. Facing the future with climate change will require increased attention to reduce stressors to the social–ecological systems in which fisheries exist and persist. Specific recommendations in this context are presented.","author":"Jorge Mario Mafuca","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"f03dffcb4bfc3e7ede4345f86c92cfac7a6d530577bf16dc25c8d60b50752452","category":"Environment"}