{"title":"Windows 95, 98, and other decrepit versions can grab online updates again","link":"https://arstechnica.com/?p=1952418","date":1689010438000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Screenshot-2015-07-21-07.56.59-800x600.png\" alt=\"The Windows 95 desktop.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Screenshot-2015-07-21-07.56.59.png\">Enlarge</a> <span>/</span> The Windows 95 desktop. (credit: Andrew Cunningham)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>If you have any interest in retro-computing, you know it can be difficult to round up the last official bug fixes and updates available for early Internet-era versions of Windows like 95, 98, and NT 4.0. A new independent project called \"<a href=\"http://windowsupdaterestored.com/\">Windows Update Restored</a>\" is aiming to fix that, hosting lightly modified versions of old Windows Update sites and the update files themselves so that fresh installs of these old operating systems can grab years' worth of fixes that aren't present on old install CDs and disks.</p>\n<p>These old versions of Windows relied primarily on a Windows Update web app to function rather than built-in updaters like the ones used in current Windows versions. Microsoft took down the version of the site that could scan and update Windows 95 and 98 <a href=\"https://msfn.org/board/topic/153149-i-cant-access-windows-update-v4/\">sometime in mid-2011</a>. The Windows Update Restored site is a lightly modified version of Microsoft's original code, and the site itself doesn't use any kind of SSL or TLS encryption, so ancient Internet Explorer versions can still access it without modification.</p>\n\n<p>You'll need at least Internet Explorer 5 to access the Windows Update Restored update sites; that browser is no longer available directly from Microsoft, but the Windows Update Restored site <a href=\"http://windowsupdaterestored.com/en/ie.htm\">offers download links</a> to IE5 and IE5.5 in all supported languages.</p></div><p><a href=\"https://arstechnica.com/?p=1952418#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1952418&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f041b70ca94bbcbd5e833d775bf977affff37cbd926899dfcc475c4ca74339ba","category":"Tech"}