{"title":"Jostling for Position book extract: We were invincible","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/jostling-for-postion-we-were-invincible","date":1693031400000,"content":"\n      <p><strong>This piece is an extract from Laura Meseguer's new book, <em>Jostling for Position</em>. Within this, she conducts personal interviews with Spain's greatest cyclists from over the past two decades, exploring the winning years without shying away from the more controversial issues that cast a shadow over this generation. </strong></p>\n<p><strong><em><span>﻿Jostling for Position is available to <a href=\"https://go.skimresources.com?id=173655X1642184&amp;xs=1&amp;url=https%3A%2F%2Fwww.amazon.co.uk%2FJostling-Position-Insights-First-Hand-Accounts%2Fdp%2FB0C9SF2761\" target=\"_blank\">buy now</a>. </span></em></strong></p>\n<div></div>\n<p>Of the many things that characterised this generation, there is one in particular that stands out, with this being their knack to make history by continuously pushing the limits of what had been thought possible. And of all the groundbreaking seasons, 2008 was without a doubt the most remarkable. Spain was ranked the best nation in the UCI World Tour ranking, although this was nothing new given that it had held this title since 2006 and continued to do so until 2017, with the exception of 2011, when it was topped by Italy. Valverde was once again ranked as the top cyclist at the end of the season, as was his team Caisse d’Epargne. Spaniards also dominated the three Grand Tours with Alberto Contador winning the Giro d’Italia as well as the Vuelta a España and Carlos Sastre prevailing in the Tour de France. The triumphant summer was rounded off with the country’s first green jersey in the Tour by the hand of Óscar Freire; the first Spanish, road cycling Olympic gold medal courtesy of Samuel Sánchez and Iván Gutiérrez’s victory in the Eneco Tour. During the spring, Freire had already made history with his victory in the Flemish Ghent-Wevelgem classic, with Contador also taking the general classification of the Tour of the Basque Country. Alejandro Valverde won the Liège-Bastogne-Liège cycling monument for the second time, the Criterium du Dauphiné and the Clásica de San Sebastián in which he sported the Spanish champion’s jersey. In track cycling, Joan Llaneras retired from competition taking gold in the points race and silver in the Madison at the 2008 Summer Olympics, as did Leire Olaberría, who claimed the bronze in the points race.</p>\n<h3>The Golden Generation’s First Tour</h3>\n<p><span>Following Lance Armstrong’s retirement and the end of his era of dominance, the Tour de France was ready to accept new candidates to don the yellow jersey on the Champs-Élysées in Paris. Fellow American Floyd Landis had been one of Armstrong’s best gregarios for three seasons at US Postal. In 2005 he sought his own luck with the Phonak team and finished ninth in what was his former team leader’s last Tour. In 2006 he returned as one of the favourites for the throne in Paris. A day before the start of the race, race organisers ASO refused entry to a string of top riders including Ivan Basso, Jan Ullrich and Paco Mancebo in the wake of the revelations of </span><i><span>Operación Puerto</span></i><span>. Alexander Vinokourov also missed out as most of his Astana teammates had also been excluded from the race. Spaniards Iban Mayo, Alejandro Valverde, Óscar Pereiro and Carlos Sastre, who was appointed leader of the CSC team after Basso’s exclusion, had a fantastic opportunity before them. Levi Leipheimer, Andreas Klöden, Denis Menchov, Cadel Evans, Gilberto Simoni and Damiano Cunego completed the list of favourites.</span></p>\n<p>Thus, the 2006 Tour de France was a bit like a ship adrift in need of a captain. By the tenth stage there had already been five different riders leading the race. Óscar Freire had already won two stages with Juan Miguel Mercado, leader of the Agritubel team, prevailing on the tenth day. As the race passed through the Pyrenees, the dust finally settled and the first serious contender showed their head to take the yellow jersey. This was none other than Floyd Landis of the Phonak team. However, wearing yellow can be as big of a burden as it can a blessing, especially in the earlier stages. Thus, as the race made its way towards the Alps, Phonak decided to relinquish the lead in order to save their strength for the coming mountain passes. Hence, on the thirteenth stage, which started on the coast in Béziers and finished at the foot of the Alps in Montélimar, a breakaway comprised of Pereiro, Jens Voigt, Manuel Quinziato, Sylvain Chavanel and Andrey Grivko gained a lead that is rarely seen in modern cycling. In a flat stage without major complications, the bunch attained a 30-minute lead over the favourites, sufficient time for the Galician rider Pereiro to become the new leader of the race. After the suspension of Ivan Basso, the leadership of the CSC team fell to Carlos Sastre. “I told Riis that we couldn’t let Pereiro take the yellow because he had done so well the year before, which meant that we needed to push to reduce the breakaway. It went in one ear and straight out the other. Riis didn’t pay any heed to my words”, laments Sastre. “It was hard. I could have won that Tour, and perhaps others as well…”.</p>\n<p>They underestimated Óscar Pereiro (Mos, Pontevedra, 1977) of the Caisse d’Epargne team, who was certainly no rookie in the French Grand Tour, having already won a stage as well as having been awarded the combativity award in the 2005 edition. That day in Montélimar, his former teammates from the Swiss Phonak team, where he had ridden for two seasons, conceded him the privilege of wearing yellow for the next two days. At that point, Sastre was sixth overall. Mayo and Valverde had already withdrawn from the race a few days earlier and David de la Fuente, of the Saunier Duval team, was leading the mountains classification, which was eventually taken from him by Michael Rasmussen. </p>\n<p><span>As the race entered the Alps, Landis regained the jersey on Alpe d’Huez, with Pereiro managing to finish just ten seconds behind the American. In the following stage to La Toussuire, the Galician came in third behind Carlos Sastre and the winner Rasmussen, catching everyone off guard and reclaiming the yellow jersey as his own. To the astonishment of everyone, the Phonak leader bonked at the base of the last climb, leaving Pereiro at the top of the general classification, with Sastre at 1:50” and the German Andreas Klöden at 2:29”. Haimar Zubeldia rounded off the top ten, while Landis, who had lost more than eight minutes on the yellow jersey, had dropped down to eleventh. With just four days to go before the end of the Tour, it was an unprecedented sequence of events. For his part, Sastre was simply thankful that Spanish cycling was finally making the headlines for their accomplishments rather than the ongoing allegations stemming from </span><i><span>Operación Puerto</span></i><span>.</span></p>\n<p>The Caisse d’Epargne team in that Tour de France was made up of Valverde, Pereiro, David Arroyo, Isaac Gálvez, Chente García Acosta, Vladimir Karpets, Xabier Zandio, the Frenchmen Florent Brard and Nicolas Portal, who would become the future directeur of the Sky team. For the first time since Miguel Indurain’s five-year winning streak in the early nineties, the team once again found itself at the helm of the race. Things were looking good but the sentiment of hope was short-lived. In the seventeenth stage, Landis staged a comeback that defied logic and attacked from the start. On the Col des Saisies, the first climb of the day, he was already three minutes ahead of his rivals. The Spanish team no longer had the manpower to overthrow the breakaway and the CSC showed little appetite to do so. Landis won the stage with a lead of 5:42” over second-placed Carlos Sastre and was now only thirty seconds behind the yellow jersey, with his sights firmly set on the time trial the following day.</p>\n<p>Although Landis’ performance in the time trial quashed Pereiro’s hopes of winning the Tour, the Galician nonetheless put on a solid display in that penultimate stage, finishing 1:29” behind Landis and salvaging second place on the podium. Carlos Sastre lost more than three and a half minutes and dropped down to fourth in the general classification. It seemed that Armstrong’s former gregario was set to fill the void left by this giant. However, in a shocking turn of events, less than a week after his victory, the UCI announced that the American had tested positive for testosterone in a doping control carried out after the seventeenth stage ending La Toussuire, in which he had put on a god-like display, closing the eight-minute gap between his contemporaries. As is so often the case in life, miracles are not always what they seem. As such, Óscar Pereiro had to wait more than a year for the UCI to formally declare him the winner of the 2006 Tour de France, making him the fifth Spaniard to win the race.</p>\n<h3><strong>The Triumph of Determination</strong></h3>\n<p>In 2008, as the yellow-clad rider stepped off the upper tier of the podium on the Champs-Élysées with his four-year-old son still on his shoulders, he was immediately surrounded by anti-doping agents and escorted to receive the mandatory drug test.</p>\n<p><span>“What do these men want, Daddy?”</span></p>\n<p><span>“They want to make sure I haven’t cheated. What do you think?”</span></p>\n<p><span>“I don’t think you’ve cheated”.</span></p>\n<p>Carlos Sastre was the first cyclist of his generation to win the Tour de France without any ties to doping. Unfortunately the same could not be said about Lance Armstrong’s seven consecutive victories or that of Floyd Landis in 2006, with the leader of the 2007 race, Michael Rasmussen, being ousted by his own team on the eve of the seventeenth stage in connection with the same. After a decade of scandals in the world’s biggest race, Sastre’s victory does not get the recognition it deserves. “I’m probably the most discreet cyclist to have won the Tour”, he admits. In a generation that has forced the history of this sport to be rewritten on too many occasions, at least the 2008 Tour was mostly faithful to its narrative, with only a few partial results having to be rectified, namely Stefan Schumacher’s and Bernard Kohl’s positives, leading to the mountains jersey also being bestowed on Carlos Sastre and the third place podium going to Denis Menchov.</p>\n<p><span>Sastre’s victory marked the triumph of perseverance and patience. He himself has summed up his career with Frank Sinatra’s famous line, </span><i><span>I did it my way</span></i><span>, a trait that, at the time, did not always work in his favour, for it was difficult to be true to oneself. After the Tour, the international headlines alluded to a virtually unknown cyclist who had just won the most important race on the calendar, with some casting doubt on the legitimacy of his accomplishment. </span><i><span>Ma, chi è?</span></i><span> (But who is he?) stated the Italian </span><i><span>Tutto Bici </span></i><span>on its front page. True, Sastre was perhaps not as electrifying as ‘The Cobra’, Ricardo Riccò, who incidentally tested positive for CERA in that Tour de France, as did his Saunier Duval teammate, Leonardo Piepoli. The innocent suffer for the guilty, as the saying goes. </span><i><span>Let’s hope his yellow remains untarnished</span></i><span>, read the headline of the German newspaper </span><i><span>Bild</span></i><span>. Given the times, people were bound to be suspicious, and Sastre’s connection with Manolo Saiz and his then-team manager Bjarne Riis, who had famously doped in his 1996 Tour win, did little to fortify his case. “In the same way that there will always be cheats, there will always be honest people who do everything they can to achieve their goals. And this will become a growing trend. Cycling is on the right path”, declared the Spaniard the day before his arrival in Paris.</span></p>\n<p><span>There is no taking away from the fact that Carlos Sastre’s win confirmed his status as one of the best Grand Tour riders of his generation, with ten top-ten finishes—which would amount to 15 by the time he retired—including two podiums in the Tour de France and another two in the Vuelta a España. He spent much of his career working in the shadow of great leaders such as Laurent Jalabert, Igor González de Galdeano, Joseba Beloki and later Ivan Basso. But when the Italian was implicated in </span><i><span>Operación Puerto</span></i><span>, he was finally able to take on the role that he had been chasing for years. The state of affairs in cycling at that time had given him little choice but to mature fast and stay grounded; he overcame his frustration at the lack of opportunities and ingrained deceit around him by holding onto the belief that the path was more important than the end result, with this also being the fruit to all learning. He assures that he could have won more races if those around him had believed in him. “I have always tried to stay true to myself and this has led me to follow a certain path or to make certain decisions. This is why people like Riis or Manolo [Saiz] never felt they could fully count on me because they had no control over me. I don’t know if I’m making myself very clear…”. The ambiguity in his statements allows one to read between the lines. He does not want to talk about doping, although he says it is one of the hundred words he would, unfortunately, use to describe the sport. In cycling circles, he was known as ‘Don Limpio’ (Mr Clean), “You have to be at ease with yourself in certain environments, otherwise this will get the better of you”, he explains.</span></p>\n<p>He first learned the tricks of the trade at his father’s cycling club, the Fundación Víctor Sastre; he signed his first contract with Manolo Saiz when he joined the ONCE team in 1997 and went on to lead the CSC team under Bjarne Riis. During his time as gregario he repeatedly proved his worth by winning the mountain classification in the 2000 Vuelta a España, a stage in the Vuelta a Burgos in 2001 and another in the 2003 Tour de France, now under Bjarne Riis. His time with the ONCE team was the happiest of his sporting career. “Manolo knew I had something but there were certain people he trusted more. I never minded working for others but the one time I asked him for a chance I managed to win a stage in the Vuelta a Burgos”.</p>\n<p><span>Five years after his leap into the professional field, he left ONCE to join the Danish CSC team in 2002 to see “how far he could go”. To his surprise, the promised freedom would be conditional to the other newcomer to the team, the American Tyler Hamilton. The Italian Ivan Basso arrived two years later, again to lead the team. “They were difficult years. It seemed like the role of leader would always pass me by. I worked as hard as I could for them and then tried to place as high as I could. I was always in the top ten and often quite by accident”. With the eruption of </span><i><span>Operación Puerto</span></i><span> in 2006, the finger was pointed at the two leaders of the team and a few years later, with the publishing of the book </span><i><span>The Secret Race: Inside the Hidden World of the Tour de France: Doping, Cover-ups, and Winning at All Costs</span></i><span> written by journalist Daniel Coyle after conducting hundreds of hours of interviews with former professional cyclist Tyler Hamilton, Riis’ knowledge of the doping practices within his own team would also come to light, something that would be confirmed in 2015 by the </span><i><span>Report on doping in Danish cycling</span></i><span> (1998-2015). “When you are on the inside and see how things are done, very few people have peace of mind. Looking back on all my second, third and fourth place finishes, I can’t help but wonder if I wouldn’t have been first under different circumstances”.</span></p>\n<p>Thus, the discreet and cool-headed rider finally stuck his neck out and demanded to be appointed leader in the up-and-coming 2008 Tour de France. The CSC team, however, was divided between those in favour of the Schleck brothers and those in favour of Sastre. The team was rounded off by Fabian Cancellara, Kurt Asle Arvesen, Volodymyr Gustov, Stuart O’Grady, Nicki Sorensen and Jens Voigt. A few days before the start of the race in Brest, Brittany, Riis brought the team together to clarify the roles for the next three weeks. Sastre made his intentions clear: “I intend to win this Tour de France, whether it be with or without your help. It will of course be much easier if I can count on you because, on the contrary, we’ll probably put on a terrible show”. As training for the race began, the riders positioned themselves accordingly. “I was never one to stand out in races. I always tried to give everyone their chance to shine, pushing them to make it into the breakaways, encouraging them to go for the win... Because when it came down to negotiating a contract they’d ask you what you’d done, not who you’d worked for”.</p>\n<p>A few months before the French Grand Tour, during the Tour of Switzerland, in which Frank Schleck was racing, Bjarne Riis gathered the team at his house to reconnoitre the stages they would be traversing in the Alps. When it came to training, Riis and Sastre never saw eye to eye: for Riis, it was all about pushing their physical capabilities, while Sastre preferred to train on feeling. At that training camp, I told him: “Bjarne, all I ask is that you listen to me for once”, to which the Dane, somewhat reluctantly, acceded. The training route spanned 250 kilometres and took them over six hours to complete. A portion of the day was spent on the climbs on that day’s fifth stage of the Tour of Switzerland. Here Frank Schleck was riding out front with Germany’s Markus Fothen and was the virtual leader of the race when, with 4 kilometres to go and on the descent to the finish, he plunged over the guardrail causing everyone to fear the worst. “We were watching the stage on TV at Bjarne’s house after our training ride and it was terrifying to see Frank fall like that. When he got back on his bike and we realised that he was OK, Bjarne, stopwatch in hand, looked over at me beaming from ear to ear: ‘Carlos, you reached the summit 20 seconds faster than the two breakaways, and we didn’t even give it our all’. That was the turning point for Riis, knowing that I was ready for the Tour”, recalls Sastre.</p>\n<p>The 2008 Tour de France was perfect terrain for climbers. Over the course of its 3,500 kilometres, the peloton would traverse the Massif Central in the first week before reaching the Pyrenees with the alluring Peyresourde and Aspen in the ninth stage followed by the Tourmalet and the first summit finish at Hautacam in the tenth stage. In the second week, the peloton would make its way over gentler terrain until reaching the Alps in the third week with the dreaded Col de la Bonette, a 30-kilometre pass with a 6.2% gradient and an altitude of 2,800 metres, which was making its return to the Tour after a 15-year hiatus. The seventeenth stage concluding on Alpe d’Huez marked the final major test in the mountains, followed by three comparatively calm days before the final 53-kilometre time trial between Cérilly and Saint-Amand-Montrond. Alejandro Valverde was the first to lay claim to the yellow jersey. And although he lost it the very next day, he won it back again on the sixth stage, ahead of Cadel Evans and Frank Schleck. Spain triumphed again the following day with Luis León Sánchez taking the win in Aurillac. British rider Mark Cavendish dominated the sprints, although Óscar Freire managed a partial victory during the second week and was steadily racking up points for the green jersey that he would eventually wear in Paris.</p>\n<p>Sastre remembers the race as one of the smoothest and most straightforward of his career. He had Cancellara, O’Grady and Voigt working for him at all times in order to carry him forwards. “Every morning Riis would come to me with a thousand different ideas and I had to tell him to give me some room to breathe. For instance, I totally disagreed with his approach to the Hautacam stage. He wanted the Schleck brothers to break away on the Tourmalet. The stage was practically flat up to that point. I told him that if they did that they wouldn’t make it to the descent, so I suggested to Cancellara that he should be the one to get into the breakaway and do the whole descent from the Tourmalet. So that’s what we did and Frank Schleck came in just a second behind the yellow jersey, which was taken by Cadel Evans”. CSC set a hellish pace on the stage that put an end to the aspirations of Samuel Sánchez and Alejandro Valverde in the general classification, with the Murcian losing nearly six minutes to leader Leonardo Piepoli and more than two and a half minutes to Carlos Sastre. That day marked another turning point that helped to strengthen Bjarne Riis’ confidence in the rider from Ávila.</p>\n<p>Going into the second week, CSC rider Kurt Asle Arvesen engaged in a successful breakaway in the eleventh stage, finishing just two centimetres ahead of the Swiss Martin Elmiger. Arvesen’s victory and the team’s favourable situation in the general classification with Frank Schleck in second and Sastre in sixth, just 1:28” behind Evans, was a source of great motivation for everyone. “I wanted to give my teammates the chance to shine on their own, and that was the most important thing about that Tour, aside from my victory”, recalls Sastre. “The fact that everyone had their moment of glory is what made my victory all the more special. I knew how unfair it was to have to work for someone with that same person always taking all the credit. When teammates feel that they are involved and are given the chance to do things they didn’t know they could do, it marks a before and after in their lives”.</p>\n<p>In the twelfth stage, doping would once again shake the foundations of the sport with the third positive for EPO in the race. After Manuel Beltrán (Liquigas) and Moisés Dueñas (Barloworld), Ricardo Riccó was the next to be expelled after testing positive for a third-generation EPO, otherwise known as CERA, in a test at the end of the fourth stage, on the same day as Dueñas. His team Saunier Duval subsequently withdrew from the race and terminated its sponsorship at the end of the year, as did Barloworld at the end of the Tour.</p>\n<p>On the fifteenth stage, Frank Schleck managed to take the yellow jersey, allowing the team to enter the second rest day and the third week with a renewed sense of confidence. All their options were still intact since Sastre was sixth overall, just 49” behind his teammate. Having overcome the scare that Óscar Pereiro gave the world after his spectacular fall on the descent of the Col d’Agnel which, miraculously, only resulted in a fractured humerus, the peloton entered the third week with the last two important days in the mountains. On the first day, the CSC team controlled the race and squeezed the leaders a little more on the Col de la Bonette leaving Denis Menchov and Christian Vandevelde out of the top positions, which meant that Sastre was already fourth behind a surprising Bernard Kohl, who only had the 2006 Austrian National Road Race Championship to his name. Andy Schleck donned the white jersey for the best young rider in the general classification. </p>\n<p>Stage 17 was the last of the major mountain finishes; something of a D-Day, if you will, because this battle was sure to change the tide of the war. For Sastre, it was a buzz of emotions from the get-go. At the starting point in Ebrun, Bjarne Riis climbed aboard the team bus and excitedly informed Sastre that he hadn’t slept all night and that he had 20-plus strategies for the day. The cyclist crossed himself. As his manager barraged the team with dozens of options and counter options for the day, Sastre calmly dressed into his gear without paying too much attention.</p>\n<p><span>“So then, what’s your plan of action?”, asked an incredulous Riis before Sastre’s blatant indifference.</span></p>\n<p><span>“Me? Win at Alpe d’Huez”.</span></p>\n<p><span>No one said a word.</span></p>\n<p><span>“Was that not our objective? You already have the yellow with Frank. Just give us one strategy and one that works, Bjarne”, replied the cyclist.</span></p>\n<p>As the team descended from the bus, there was confusion all around. They approached Sastre for some guidance. “Don’t worry”, he told them. “We’ll do as we have done every other day”. As the race approached Alpe d’Huez the team knew that they had to step things up a notch if they were to lose Evans and Menchov. Sastre had lingered at the tail end of the peloton throughout the day while the team gave it their all at the front. “200 metres into the start of the climb no one was making any moves and so I said to myself ‘Let’s go!’ and that was it, I set off”, he recalls. Menchov followed closely behind his wheel, putting the yellow jersey at risk, but this ferocious pace served to be his downfall and he soon fell behind as the Ávila native attacked again. He knew he had to push hard from afar to gain as much time as possible on Evans ahead of the time trial on the penultimate day. He started to open a significant gap from the fourth kilometre of the ascent. “As we were climbing, I remembered what one of the soigneurs had told me the night before: ‘Carlos, you’re going to fight like a lion and climb like an eagle’”. He surpassed all expectations, reaching the summit with more than a two-minute advantage over Samuel Sánchez, the Schleck brothers, Valverde, Evans, Kohl and Menchov, dethroning his teammate Frank Schleck in the process and leaving him second in the general classification at 1.24”. “I’m still criticised to this day for having taken the yellow jersey. But it became clear in the time trial that I was the only one capable of taking the maillot all the way to Paris after Frank dropped more than three minutes with me. He wasn’t able to hang onto a place on the podium”. In the 53-kilometre time trial in Montrond, Fabian Cancellara took the third partial victory for the CSC in that Tour. Sastre confirmed the maxim that whoever wins at Alpe d’Huez wins the Tour de France and thus became the sixth Spaniard to win the prestigious race.</p>\n<p>“My Tour was a dream come true. However, there were a few things bubbling under the surface that had yet to fully manifest”. Along this line, he cites his experience a month later during the 2008 Vuelta a España. He had informed Riis a few weeks earlier that he was planning on leaving to ride for the newly created Cervélo team, in which he was also financially involved. This project could also represent an avenue for him to pursue a career after cycling. He wanted to give Riis plenty of notice because the Schleck brothers’ and Cancellara’s contracts meant that he had to find new sponsors who could afford to keep him on the team. “I don’t have the money to make you an offer but I’m doing my best”, Riis had told him after the Tour. “After the Beijing Games, I called him to tell him that I wasn’t going to continue with the team. It wasn’t about the money, it was more because I felt that there wasn’t a place for all of us there. It was time to give others the chance to lead. Bjarne never understood this and refused to accept it, and from that moment until the end of the Vuelta a España he made my life impossible”, he recalls.</p>\n<p>At the hotel reception in Granada, before the start of the race, Bjarne berated Sastre for wanting to destroy the team, when in fact Sastre did not want to take any riders with him “so as not to create one team to the detriment of another”. The insults and lies were a constant. Sastre recounts how Bjarne sought to quarrel and destabilise him before the start of each stage. In the team time trial on the first day, he didn’t even bother to organise the race and Sastre had to do it himself. The situation got so bad that his wife Piedad, who never used to accompany him to the races, spent the first seven nights of the Vuelta with him to help calm his nerves. The whole team suffered the consequences and it was an extremely stressful race for all of them. Fortunately for Sastre, they were able to see that he was the victim in the matter and so supported him wholeheartedly. He is especially thankful to Michael Blaudzun, without whom he says he would have fully disconnected from the race on the flats. “In the stages in Andorra, my legs kept cramping up at the start of each climb. I was exhausted from the stress. I was really struggling, but then he [Bjarne] left for Denmark and the atmosphere became more relaxed and I was able to get my head back into the race”. He was ultimately third in that Vuelta a España, finishing behind Alberto Contador and Levi Leipheimer. “When someone asks me how much my victory in the Tour de France meant to me, my mind instantly turns to that podium finish in the 2008 Vuelta, because of everything it entailed”. </p>\n<p><span>After his stint with the Cervélo team, which folded in 2010 following the tightening of the UCI’s rules for continental professional teams, he joined the newly created Geox-TMC led by Mauro Gianetti and Joxean Fernández Matxin in 2011. There he would coincide with his long-time rival, Denis Menchov. He regards the year he spent with the Spanish team as the worst of his professional career. He is convinced that the real reason for his signing was to ensure the team’s inclusion in the Tour de France, from which Mauro Gianetti had been vetoed for years. Sastre made sure to keep his distance. “I learned everything you shouldn’t do in cycling that season”. The Vuelta a España, which was won by his teammate Juanjo Cobo</span><span>3</span><span>, was not supposed to be his last race, but ultimately was because “what had always given me peace of mind began to cause me stress”. </span></p>\n<p>Thus, Carlos Sastre brought his 15-year-long career to an end. As he looks back, there is a certain episode that always stands out in his mind. During his rookie year in 1998, shortly after the outbreak of the Festina Affair, he went to give a talk at a school in his hometown of Ávila. A young boy opened the Q&amp;A with, “Carlos, how do you feel when they call you a druggie?”, to which he replied, “How would you feel if you had spent the whole year studying hard for an exam only for the teacher to fail you on the pretext of copying?”</p>\n<p><span>“I’d be upset”.</span></p>\n<p><span>“Is there anything you could do about it?”</span></p>\n<p><span>The boy shook his head.</span></p>\n<p><span>“Well, that’s exactly what’s happened to me”.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f0476c39f8272846b2d0af1e4ee6bc88d85c1c5a0fd5f86e10892bebd7dececb","category":"Cycling"}