{"title":"Apple Says Notch is a 'Smart Way' to Give Users More Space for Content on New MacBook Pros","link":"https://www.macrumors.com/2021/10/24/xapple-executive-interview-on-macbook-pro-notch/","date":1635104139000,"content":"The notch on the newly redesigned MacBook Pro offers a \"smart way\" to give users more room for their content and allowed Apple to make the bezels thinner and provide more screen real-estate to customers, an Apple official has said during a recent media interview.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/macbook-pro-2021-notch-feature.jpg\" />\r\n<br />\r\nThe inclusion of a notch on the entirely revamped MacBook Pros was a surprise and was one of the <a href=\"https://www.macrumors.com/2021/10/15/new-macbook-pro-could-have-a-notch/\">few last-minute rumors</a> that surfaced ahead of Apple's \"Unleashed\" event last week. As expected, some social media users have criticized Apple's design choice for adding a notch to the display.\r\n<br />\r\n\r\n<br />\r\nAddressing the company's decision, Shruti Haldea, a manager for the Mac Product Line and one of the presenters of last week's <a href=\"https://www.macrumors.com/guide/apple-event/\">Apple event</a>, said during an interview on the <a href=\"https://youtu.be/RWcPHC9RCNk\">Same Brain podcast</a> that the notch offers a \"smart\" solution to the Mac as it provides users more room for their content.\r\n<br />\r\n<blockquote>What we've done is we've actually made the display taller. Like on the 16-inch notebook, you still have a 16.0 active area on the diagonal in that 16:10-inch window, and we just grew the display up from there and put the menu bar up there. We just kind of moved it up and out of the way. So it's a really smart way to give you more space for your content, and when you're in full-screen mode, you have that 16:10 window, and it looks great. It's seamless.</blockquote><div></div>\r\n<br />\r\nCompared to previous iterations of the MacBook Pro design, the new 14-inch and 16-inch models do feature significantly smaller bezels. Apple says the bezels are 24% thinner than the previous generation on the left and right sides of the display, measuring only 3.5mm. On the top, thanks to the notch, the bezel is 60% thinner, also measuring at 3.5mm.\r\n<br />\r\n\r\n<br />\r\nWhile the notch is noticeable at first, Apple is betting on some macOS software features, including dark mode, to help minimize its influence on some users in day-to-day use. For example, when macOS apps are in full-screen mode, the system <a href=\"https://www.macrumors.com/2021/10/18/macos-hides-notch-on-new-macbook-pros/\">adds a black border to the top of the display</a>, hiding the notch while not interfering in a user's content. Developers <a href=\"https://www.macrumors.com/2021/10/19/macos-app-compatibility-mode-notch/\">can choose</a> to have their app's content shown on either side of the notch. \r\n<br />\r\n\r\n<br />\r\nThe notch is one aspect of a plethora of changes the new MacBook Pros include. The new laptops feature an entirely redesigned chassis, additional ports such as HDMI, an SD-card slot, <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a>, a mini-LED display with ProMotion, and either the <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> Pro or ‌M1‌ Max chips, the first Apple silicon chips designed for professional consumers.\r\n<br />\r\n\r\n<br />\r\nBoth 14-inch and 16-inch MacBook Pro models became available for pre-order last week and will start arriving at customers on Tuesday, October 26. Both sizes can be configured with either the ‌M1‌ Pro or ‌M1‌ Max chips, giving users substantial performance gains compared to the ‌M1‌ Apple silicon chip. Learn more about the new MacBook Pros using our <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">detailed roundup</a>.  <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">14 &amp; 16\" MacBook Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_16\">14\" &amp; 16\" MacBook Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macbook-pro.90\">MacBook Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/24/xapple-executive-interview-on-macbook-pro-notch/\">Apple Says Notch is a 'Smart Way' to Give Users More Space for Content on New MacBook Pros</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-says-notch-is-a-smart-way-to-give-users-more-space-for-content-on-new-macbook-pros.2319036/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=i6XG3Dhc00E:FQkEb4L0yho:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=i6XG3Dhc00E:FQkEb4L0yho:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/i6XG3Dhc00E\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f04a2377776cbeb790da21f3d1823a1308ea2b5ebd6ff0913907ff54af68c5d2","category":"Apple"}