{"title":"How to cut your ex out of your iCloud account","link":"https://www.macworld.com/article/358219/how-to-cut-your-ex-out-of-your-icloud-account.html","date":1632387600000,"content":"<div>\n<section><div></div></section><p>Mac 911 receives email regularly from people severing relationships—and not realizing how their digital lives remain entwined. An iCloud account can be the hub of your online life, and if you chose to share an account with a partner (even for limited purposes), they may still continue to have access to personal information and media when they are no longer a part of your life. Based on the email we get, you might like to disable that access.</p>\n\n\n\n<p>Fortunately, Apple makes it quite easy to sever remote links to your set of iCloud information because each device that accesses iCloud data must be logged into an iCloud account. Once removed, it can no longer access new data or archived information related to that iCloud (like new photos or messages), but may retain local copies of everything downloaded.</p>\n\n\n\n<p>Here’s how to proceed.</p>\n\n\n\n<h2>Remove devices from your Apple ID account</h2>\n\n\n\n<p>First, remove the unwanted devices from your account. (This is good security hygiene, ex-partner aside.) Apple offers a lot of options. Start in any of the following locations:</p>\n\n\n\n<ul><li><strong>iOS/iPadOS:</strong> Go to <em>Settings</em> &gt; <em>Account Name</em> and scroll to the bottom.</li><li><strong>macOS 10.15 Catalina or later:</strong> Open the <em>Apple ID</em> system preference and look in the left-hand devices list.</li><li><strong>macOS 10.14 Mojave or earlier:</strong> Open the <em>iCloud</em> system preference, click <em>Account Details</em>, and click <em>Devices</em>.</li><li><strong>Apple ID website:</strong> Log in to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://appleid.apple.com/account/manage&amp;xcust=1-1-358219-1-0-0&amp;sref=https://www.macworld.com/feed\">appleid.apple.com</a> and look under <em>Devices</em>.</li><li><strong>In the Find My app in iOS, iPadOS, or macOS:</strong> In the <em>Devices</em> view, select a device; in macOS, you have to also tap the i info button.</li></ul><p>In any of the methods above, click or tap <em>Remove This Device</em>. You’re prompted to confirm and the device is removed. This severs any sync operations with that device.</p>\n\n\n\n<h2>Change password and remove trusted phone numbers</h2>\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/mac911-trusted-numbers.png\" /><figcaption>Apple presents a similar interface for changing your Apple ID password and removing (or adding) trusted phone numbers across all platforms and its Apple ID Web site.</figcaption></figure></div></div>\n\n\n\n<p>Next, you need to make sure this other person can’t log back into your iCloud account. (This doesn’t necessarily impugn that person: they may not realize that you still use the account, that they’re synced to it, etc.)</p>\n\n\n\n<p>Since most Apple IDs have two-factor authentication enabled, that requires two changes:</p>\n\n\n\n<ul><li>Change your Apple ID password for the account you use with iCloud.</li><li>Disable any trusted phone numbers that remain in the account which can be used to receive a numeric code to confirm a login. (Removing the device above disables its use as a trusted device that similarly receives such codes, but doesn’t affect trusted phone numbers.)</li></ul><p>To perform both those tasks, go to any of the following locations:</p>\n\n\n\n<ul><li><strong>iOS/iPadOS:</strong> Go to <em>Settings</em> &gt; <em>Account Name</em> &gt; <em>Password &amp; Security</em>.</li><li><strong>macOS 10.15 Catalina or later:</strong> Open the <em>Apple ID</em> system preference and select<em> Password &amp; Security</em>.</li><li><strong>macOS 10.14 Mojave or earlier:</strong> Open the <em>iCloud</em> system preference, click <em>Account Details</em>, and click <em>Security</em>.</li><li><strong>Apple ID website:</strong> Log in to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://appleid.apple.com/account/manage&amp;xcust=1-1-358219-1-0-0&amp;sref=https://www.macworld.com/feed\">appleid.apple.com</a> and scroll to the <em>Security</em> section.</li></ul><p>To change your password, click or tap <em>Change Password</em> and follow the prompts. You may be prompted on all your other devices to enter the new password or confirm the login with a trusted device or phone number.</p>\n\n\n\n<p>To remove a trusted phone number from the locations above, click or tap <em>Edit</em> next to <em>Trusted Numbers</em> if there’s an Edit button. Then either click or tap the remove X icon to the number’s right or select the number and click the remove – (minus) icon below the list. Click or tap <em>Done</em> to exit.</p>\n\n\n\n<h2>Final clean-up stages</h2>\n\n\n\n<p>A couple of steps remain for extra assurance. At <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://appleid.apple.com/account/manage&amp;xcust=1-1-358219-1-0-0&amp;sref=https://www.macworld.com/feed\">the Apple ID site</a>, make sure the address set for Notification Email in the Security section belongs to you. If not, change it.</p>\n\n\n\n<p>On an iPhone, ensure that no accidental message or other forwarding continues to be in place:</p>\n\n\n\n<ul><li>In<em> Settings &gt; Messages &gt; Text Message Forwarding</em>, disable any unwanted device.</li><li>In <em>Settings &gt; Phone &gt; Calls on Other Devices</em>, do the same.</li></ul><p>Starting with iOS 15/iPadOS 15, you can also add a person for <a href=\"https://www.macworld.com/article/353830/ios-15-how-to-add-a-recovery-contact.html\">iCloud Data Recovery Service</a>. (That’s found in <em>Settings</em> &gt; <em>Account Name</em> &gt; <em>Password &amp; Security &gt; Account Recovery</em>.) If you’ve signed up for it, make sure to change your setting if you set a partner as your recovery contact and you no longer want them to perform that role for you.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by an <em>anonymous</em> Macworld reader.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f04b1e6af02d6ace6beeb866712d13c1e5a8db8a7bd38ac2980b1d4b4820ab49","category":"Apple"}