{"title":"PSIX-29 Effects of including sprouted barley in the diets of feeder lambs","link":"https://academic.oup.com/jas/article/102/Supplement_3/802/7757579?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Rapid global population growth is driving up the demand for animal protein, while urbanization and shifting weather patterns strain traditional agricultural methods. Controlled environment systems offer a solution by reducing land use and weather dependence. However, the effect of sprouted barley grown in such systems in the diets of feeder lambs remains uncertain. Western white face wether feeder lambs (n = 80) were stratified by body weight (BW; 40.9 ± 0.84 kg) into four different diet groups (n = 20/group). Diet groups consisted of a typical ration for the region as the control diet (CON) and diet groups with 10%, 20%, or 30% dry matter (DM) inclusion of sprouted barley (SB), replacing some rolled barley. On d 0, 30, and 58 BW and ruminal pH were measured, with BW also being assessed on d 15 and 65. Individual animal feed intakes and feeding behavior were measured throughout the trial using Vytelle technology, and averaged over designated time points on d 15, 30, 45, and 69. All animals were harvested at a commercial lamb abattoir and carcasses were camera graded on d 69. The PROC MIXED procedure of SAS was used to analyze all carcass traits. Day was used as a repeated measure to determine the main effect of diet for BW, dry matter intake (DMI), feed efficiency (gain to feed; G:F), ruminal pH and feeding behavior. It was observed that no diet × day (<span>P</span> = 0.99) or diet (<span>P</span> = 0.94) differences were observed in BW, but day (<span>P</span> &lt; 0.0001) did, observed by an increase (<span>P</span> &lt; 0.0001) in BW over time. No diet × day (<span>P</span> = 0.29) for DMI was observed. However, diet (<span>P</span> = 0.0006) and day (<span>P</span> = 0.004) both impacted DMI, such that DMI increased (<span>P</span> = 0.02) over time and DMI of all SB diets was less (<span>P</span> = 0.0001) than CON, with a maximum of a 12% reduction in DMI. Feed efficiency (G:F) was impacted by diet (<span>P</span> = 0.003), such that all SB diets had increased (<span>P</span> = 0.001) G:F compared with CON. Ruminal pH was impacted by diet × day (<span>P</span> = 0.02); however, each diet was within an acceptable range for ruminal pH. Both feed bouts and bunk visits had no diet × day (<span>P</span> = 0.99) but diet (<span>P</span> &lt; 0.0001) and day (<span>P</span> &lt; 0.005) impacted feed bouts and bunk visits described by SB having an overall increase in feed bouts and bunk visits compared with CON. No differences (<span>P</span> ≥ 0.17) in commercially measured carcass traits were observed. Findings from the present research suggest that incorporating SB into the diet of feeder lambs at levels of 10, 20, or 30% (DM) can enhance feed efficiency by lowering DMI. This enhancement is achieved while ensuring that desirable carcass characteristics are maintained, thereby offering potential benefits in a commercial lamb market. Further economic analysis needs to be done to determine the viability of these systems.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f05128f0ab482ffd28f14bf5c337d5f338f7e6ce0de248c85373d481b1469934","category":"Environment"}