{"title":"Thermal tolerance and survival are modulated by a natural gradient of infection in differentially acclimated hosts","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae015/7645982?rss=1","date":1713139200000,"content":"<span><div>ABSTRACT</div>Wild ectotherms are exposed to multiple stressors, including parasites, that can affect their responses to environmental change. Simultaneously, unprecedented warm temperatures are being recorded worldwide, increasing both the average and maximum temperatures experienced in nature. Understanding how ectotherms, such as fishes, will react to the combined stress of parasites and higher average temperatures can help predict the impact of extreme events such as heat waves on populations. The critical thermal method (CTM), which assesses upper (CT<sub>max</sub>) and lower (CT<sub>min</sub>) thermal tolerance, is often used in acclimated ectotherms to help predict their tolerance to various temperature scenarios. Despite the widespread use of the CTM across taxa, few studies have characterized the response of naturally infected fish to extreme temperature events or how acute thermal stress affects subsequent survival. We acclimated naturally infected pumpkinseed sunfish (<span>Lepomis gibbosus</span>) to four ecologically relevant temperatures (10, 15, 20 and 25°C) and one future warming scenario (30°C) for 3 weeks before measuring CT<sub>max</sub> and CT<sub>min</sub>. We also assessed individual survival the week following CT<sub>max</sub>. Parasites were counted and identified following trials to relate infection intensity to thermal tolerance and survival. Interestingly, trematode parasites causing black spot disease were negatively related to CT<sub>max</sub>, suggesting that heavily infected fish are less tolerant to acute warming. Moreover, fish infected with yellow grub parasites showed decreased survival in the days following CT<sub>max</sub> implying that the infection load has negative survival consequences on sunfish during extreme warming events. Our findings indicate that, when combined, parasite infection and high prolonged average temperatures can affect fish thermal tolerance and survival, emphasizing the need to better understand the concomitant effects of stressors on health outcomes in wild populations. This is especially true given that some parasite species are expected to thrive in warming waters making host fish species especially at risk.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"f053eb6b136864065e5a21cc57a5dae3061db9aba280e710cd3ba88aa01f4539","category":"Environment"}