{"title":"Perioperative PD-1/PD-L1 inhibitors for resectable non-small cell lung cancer: A meta-analysis based on randomized controlled trials","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310808","date":1727100000000,"content":"<p>by Hai Huang, Lianyun Li, Ling Tong, Houfu Luo, Huijing Luo, Qimin Zhang</p>\r\nBackground <p>PD-1/PD-L1 inhibitors (PI) have shown promising results in both neoadjuvant and adjuvant therapies for resectable non-small cell lung cancer (NSCLC). However, substantial evidence from large-scale studies is still lacking for their use in the perioperative setting (neoadjuvant plus adjuvant). This meta-analysis aims to evaluate the integration of perioperative PI (PPI) with neoadjuvant chemotherapy for resectable NSCLC.</p> Methods <p>To identify appropriate randomized controlled trials (RCTs), we thoroughly explored six different databases. The primary endpoint was survival, while the secondary measures included pathological responses and adverse events (AEs).</p> Results <p>Six RCTs involving 2941 patients were included. The PPI group significantly improved overall survival (OS) (hazard ratio [HR]: 0.62 [0.51, 0.77]), event-free survival (EFS) (HR: 0.57 [0.51, 0.64]), pathological complete response (risk ratio [RR]: 5.81 [4.47, 7.57]), and major pathological response (RR: 2.60 [1.77, 3.82]). Benefits in EFS were seen across all subgroups. OS rates at 12–48 months and EFS rates at 6–48 months were higher in the PPI cohort. Furthermore, the advantages in OS and EFS increased with prolonged survival times. The PPI group also exhibited higher rates of surgery and R0 resections. However, the PPI group experienced more grade 3–5 AEs, serious AEs, and treatment discontinuations due to AEs.</p> Conclusions <p>The integration of perioperative PI with neoadjuvant chemotherapy can significantly improve survival and pathological responses for resectable NSCLC. However, the increased incidence of grade 3–5 AEs must be carefully evaluated.</p>","author":"Hai Huang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f054be98443f0e4da9b56e2200c52eb20a7a4b529a18e75383841fc9aa2a266a","category":"Interdisciplinary"}