{"title":"BUILD OF THE WEEK; ROSSI’S ROUTT RSL + HUNTER ANO","link":"https://moots.com/build-of-the-week-rossis-routt-rsl-hunter-ano/","date":1615505833000,"content":"<p>This week we are taking a look at Nick “Rossi” Resignolo’s Routt RSL adorned in the NEW HUNTER finish. This build goes<span></span> back a little bit as it’s a 2019 geometry Routt RSL, so that puts it in the time frame before we changed geometry of the Routt line and the move to GRAVEL WIDE drive trains. So, let that be understood that he’s running a standard road group set on his rig. Let’s dive in……</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0003.jpeg\" /></p>\n<p>Nick played a vital part in the development of the HUNTER finish over the last several months, dating back to the fall when Nick worked in our finish department (he has now moved on to the miter shop) where he was applying complex finishes to our frames in the form of Stanley and Skyline among others. His love of camo patterns started him experimenting and with help of the finish team, they brought the HUNTER finish to life. The team rose to the challenge and we believe they nailed it.<span> </span></p>\n<p>Talking to Nick about what he had in mind for his Routt RSL, he said;<span>  </span>“It’s just such a great all-around bike for most everything I ride on a drop bar bike.” “It’s the perfect mixed surface build.”<span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0004.jpeg\" /></p>\n<p>Two brands that have stood the test of 40+ years in the business. Chris King + Moots</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0012.jpeg\" /></p>\n<p>Titanium cages by King Cage, proudly made in Durango, Colorado.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0008.jpeg\" /></p>\n<p>Our 3D printed Dropout with Mr. Moots riding along.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0013.jpeg\" /></p>\n<p>HUNTER in-house anodized finish. To be seen or not to be seen?</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0016.jpeg\" /></p>\n<p>Gritty, dirty bike….just the way they are meant to be.  The HUNTER finish hides some of the grime.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0021.jpeg\" /></p>\n<p>A touch of HUNTER on the non-drive chainstay and a look at the 3D printed RSL drop out. The flatmount brake mount is printed into the structure, which allows for precise alignment of brake caliper, rotor and thru-axle. Fender eyelets just above the rear axle make for an easy foul weather set up.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0025-scaled.jpeg\" /></p>\n<p>External mechanical shift routing with internal rear brake. Clean and functional. The barrel adjusters are titanium as stock.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0027.jpeg\" /></p>\n<p>Nick used a 2 x 11 speed SRAM road group made up of mainly Force level parts and a Red level crank to complete the build. Mechanical shifting runs externally on the frame, with the rear brake run internally. Easy to set up and easy to maintain goes a long way in a versatile build.<span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0017-2.jpeg\" /></p>\n<p>Nick went big on the wheel set using an ENVE G23 rims, laced to Chris King R45 disc hubs. Made in U.S.A.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0030-1.jpeg\" /></p>\n<p>Interesting spec on Nick’s bike are the pedals, which are HT brand in the T1 model. Nick has been using their pedals for 5-6 years and loves the adjustable tension feature, as well as the option to use a cleat for more or less float if he wants. Gravel pedals are evolviing and we see more and more going towards a supportive platform like these.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0022.jpeg\" /></p>\n<p>Stay tuned as spring weather rolls in and more fun builds come to light. We always feel that the more we ride as a whole the better our product becomes. So, let’s go ride and talk about bikes!</p>\n<p>See you out there.</p>\n<p>The post <a href=\"https://moots.com/build-of-the-week-rossis-routt-rsl-hunter-ano/\">BUILD OF THE WEEK; ROSSI’S ROUTT RSL + HUNTER ANO</a> appeared first on <a href=\"https://moots.com\">Moots</a>.</p>","author":"Jon Cariveau","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"f05b62f75b8f910bb7c9d88760a0cdd866d4c5f3ebd43ea89fc7c15fca1a1da9","category":"Cycling"}