{"title":"Facebook to stop using facial recognition, delete data on over 1 billion people","link":"https://arstechnica.com/?p=1809777","date":1635890288000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-1182969866-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/GettyImages-1182969866.jpg\">Enlarge</a> <span>/</span> With an image of himself on a screen in the background, Facebook co-founder and CEO Mark Zuckerberg testifies before the House Financial Services Committee in the Rayburn House Office Building on Capitol Hill October 23, 2019, in Washington, DC. (credit: Chip Somodevilla/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Facebook introduced facial recognition in 2010, allowing users to automatically tag people in photos. The feature was intended to ease photo sharing by eliminating a tedious task for users. But over the years, facial recognition became a headache for the company itself—it drew regulatory scrutiny along with lawsuits and fines that have cost the company hundreds of millions of dollars.</p>\n<p>Today, Facebook (which recently <a href=\"https://arstechnica.com/tech-policy/2021/10/facebooks-rebrands-as-meta-amid-a-new-metaverse-first-outlook/\">renamed itself Meta</a>) <a href=\"https://about.fb.com/news/2021/11/update-on-use-of-face-recognition/\">announced</a> that it would be shutting down its facial recognition system and deleting the facial recognition templates of more than 1 billion people.</p>\n<p>The change, while significant, doesn't mean that Facebook is forswearing the technology entirely. \"Looking ahead, we still see facial recognition technology as a powerful tool, for example, for people needing to verify their identity, or to prevent fraud and impersonation,\" said Jérôme Pesenti, Facebook/Meta's vice president of artificial intelligence. \"We believe facial recognition can help for products like these with privacy, transparency and control in place, so you decide if and how your face is used. We will continue working on these technologies and engaging outside experts.\"</p></div><p><a href=\"https://arstechnica.com/?p=1809777#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1809777&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f06375994a993b783238aa6b971e499e6d3d681886185e3910909bb718919f65","category":"Tech"}