{"title":"Discover Ecosystem Service Value Growth Characteristics of a Subtropical Soil Erosion Area Using a Remote Sensing Driven Mountainous Equivalent Factor Method","link":"https://www.preprints.org/manuscript/202407.1778/v1","date":1721732578000,"content":"Evaluation ecosystem service value (ESV) is critical for “lucid waters and lush mountains are invaluable assets”. However, the ESV estimation and spatial-temporal analysis for mountainous soil erosion area is rare, e.g., Changting county, China. In this study, we developed a remote sensing driven mountainous equivalent factor (RS-MEF) method to estimate the ESV of soil erosion area in subtropical mountain. It is a hybrid of a conventional equivalent factor framework and the remote sensing techniques for mountains, and achieves several highlights of spatial adjustment using carbon sink with vegetation canopy, improvement spatial resolution, and removal topographic effect. Using the RS-MEF method, we estimated that the ESV of Changting county was about 15.80 billion CNY in 2010 and 34.83 billion CNY in 2022. Specifically, the ESV per unit area of major soil erosion area (MSEA) in the county was less than that of non-major soil erosion area (n-MSEA), however, the ESV growth rate of MSEA from 2010 to 2022 was faster than that of n-MSEA. Therefore, the ESV gap between two areas was shortened from 28.99% in 2010 to 15.83% in 2022. Topographic gradient effect analysis illustrates that the area with high elevation and small slope is one control focus in the next step. Our study indicates that the ecological restoration in the county has made great achievements in the ESV perspective, with low ESV area shrank evidently in MSEA; and the achieved knowledge of the ESV growth and inherent factors is valuable and instructive for the next soil and water conservation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f0775efbccb2e7270b4fb61e092460efd4ae1a978313ad4f312e11d531568f4d","category":"Interdisciplinary"}