{"title":"Human antibodies against <i>Mycobacterium avium</i> ssp. <i>paratuberculosis</i> combined with cytokine levels for the diagnosis and selection of Crohn’s disease patients for anti-mycobacterial therapy—A pilot study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308911","date":1728050400000,"content":"<p>by J. Todd Kuenstner, Peilin Zhang, Raghava Potula, Jean-Michel Galarneau, Horacio Bach</p>\r\n\r\nIncreasing evidence links a worldwide bacterial infection of cattle and other animal species by <i>Mycobacterium avium</i> ssp. <i>paratuberculosis</i> (MAP) to Crohn’s disease (CD). A large, FDA phase 2/3 controlled clinical trial of combination antimycobacterial antibiotic therapy for CD has been completed, and the report describing the trial is pending publication. The identification of MAP infection in CD patients will become increasingly important. Thus, it is desirable to develop MAP-based tests that accurately predict which CD patients have a MAP infection. A prospective, case-control laboratory test study of 199 subjects (61 CD patients and 138 non-CD controls) was performed using a panel of MAP antigens, including Hsp65, PknG, PtpA, CL1, and MAP IDEXX, which were measured under blind conditions in the plasma of the 199 subjects. Results showed that compared to any individual MAP antigen, combinations of antigens showed improved CD classification performance. For the Hsp65 antigen, the sensitivity (SEN), specificity (SPE), positive predictive value (PPV), negative predictive value (NPV), correct classification (CC), and area under the curve (AUC) were 59.02%, 58.70%, 38.71%, 76.42%, 59.3% and 0.606, respectively. For the best combination of MAP antibodies (Hsp65 and PknG), the SEN, SPE, PPV, NPV, CC, and AUC were 59.02%, 60.87%, 40.00%, 77.06%, 60.30%, and 0.631, respectively. Further improvement of the CD classification performance was achieved by combining IFN-γ, IL-8, and IL-17 cytokines with antibodies against MAP antigens, yielding SEN, SPE, PPV, NPV, CC, and AUC of 62.3%, 62.32%, 42.22%, 78.9%, 62.31% and 0.708, respectively. Thus, combinations of antibodies against MAP antigens and cytokine levels yield better CD diagnostic predictive performance than any individual antibodies against MAP antigens.","author":"J. Todd Kuenstner","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f078cb0f92d40a75665379a862b91c0a9b6c6e49a6cf8ecb86b842f1d1f87e63","category":"Interdisciplinary"}