{"title":"Identification of exosomal circSLC26A4 as a liquid biopsy marker for cervical cancer","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305050","date":1718114400000,"content":"<p>by Yutong Tong, Lanlan Jia, Minghui Li, Hongjuan Li, Shuli Wang</p>\r\nObjective <p>Circular RNA SLC26A4 (circSLC26A4) functions as an oncogene in the initiation and progression of cervical cancer (CC). However, the clinical role of plasma exosomal circSLC26A4 in CC is poorly known. This study aims to develop an accurate diagnostic method based on circulating exosomal circSLC26A4.</p> Methods <p>In this study, exosomal circSLC26A4 derived from CC cell lines (CaSki, SiHa, and HeLa) and human cervical epithelial cells (HcerEpic) was measured and compared using quantitative reverse transcriptase polymerase chain reaction (qRT-PCR). Additionally, 56 volunteers, including 18 CC patients, 18 cervical high-grade squamous intraepithelial lesion (HSIL) patients, and 20 healthy volunteers, were enrolled. qRT-PCR was also performed to measure the plasma exosomal circSLC26A4 levels in all participants.</p> Results <p>The exosomal circSLC26A4 expression level derived from CC cells was significantly elevated compared to it derived from HcerEpic cells. Plasma exosomal circSLC26A4 levels in CC patients were significantly higher than in healthy women and HSIL patients (<i>P</i> &lt; 0.05). In addition, high plasma exosomal circSLC26A4 expression was positively associated with lymph node metastasis and FIGO stage (all <i>P</i> &lt; 0.05). However, no significant correlation was found between plasma exosomal circSLC26A4 expression and age, intravascular cancerous embolus, and perineural invasion (<i>P</i> &gt; 0.05).</p> Conclusions <p>The high exosomal circSLC26A4 expression is closely related to the occurrence of CC. Plasma exosomal circSLC26A4 can be used as a diagnostic marker for CC.</p>","author":"Yutong Tong","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f07a4ac8c17844bc2ea91095ed3bc79beac91e6b90255ac334818cb460d59cb8","category":"Interdisciplinary"}