{"title":"BikeRadar Podcast | Coaching Q&A with Wahoo’s Mac Cassin","link":"https://www.bikeradar.com/news/bikeradar-podcast-indoor-training/","date":1636992000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/08/KICKR_road_tight_male_DS-62be00d-scaled.jpg?quality=45&amp;resize=620,413\" />                                            <p>It’s official, winter is coming. If you live anywhere like us (Bristol, in the south-west of England, if you were wondering), the clocks have now changed, the roads and trails are a carpet of fallen leaves, and there’s a distinct chill in the air.</p>\n<p>For an increasing number of riders, winter riding season is now <a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\">indoor cycling</a> season.</p>\n<p>That’s not to say there’s no joy in riding on a crisp, clear winter’s day – it can be <a href=\"https://www.bikeradar.com/features/routes-and-rides/10-reasons-to-love-winter-cycling/\">one of our favourite times of the year</a> – but with short days, long nights and inclement weather, indoor training is a way for many riders to keep the pedals turning and fitness up.</p>\n<p>Indoor training is also more interactive than ever, thanks to the rise of smart trainers and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">indoor cycling apps</a>. You can throw yourself into a structured training plan, pedal through virtual worlds or compete against other riders.</p>\n<p>With that in mind, we’re here with a new mini-series of the BikeRadar Podcast, dedicated to indoor training. Over four episodes, we’ll cover setup tips, how to choose a smart trainer, coaching advice and plenty more.</p>\n<h2>Episode three | Coaching Q&amp;A with Wahoo’s Mac Cassin</h2>\n\n<p>It’s time for episode three of the series and this time BikeRadar’s editor-in-chief, George Scott, is joined by Mac Cassin, senior physiologist at Wahoo Fitness.</p>\n<p>Want to get the most out of your indoor training sessions? George quizzes Mac on training zones, workouts, training plans, bike fit, nutrition and much more.</p>\n<p>To read more on the topics discussed, follow these links:</p>\n<ul><li><a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">Functional Threshold Power</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">Training zones</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/fitness-and-training/base-training-cycling/\">Base training</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/fitness-and-training/sweetspot-training/\">Sweetspot training</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/fitness-and-training/vo2-max/\">VO2 max</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/fitness-and-training/power-vs-heart-rate/\">Power vs heart rate</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-train-with-power/\">How to train with a power meter</a></li>\n</ul><h2>Episode two | How to choose the best smart trainer</h2>\n\n<p>BikeRadar’s George Scott and Simon Bromley are back for episode two and this time it’s a deep dive into the world of smart trainers.</p>\n<p>We take a closer look at how to choose the right smart trainer for your needs, covering budget, our favourite options and the key features to look out for.</p>\n<p>Make sure you also check out our round-up of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">best smart trainers</a>, with our pick of the very best products on the market at a range of prices, as rated and reviewed by the BikeRadar team.</p>\n<h2>Episode one | Our indoor training setup tips and tricks</h2>\n\n<p>For the first episode, BikeRadar’s editor-in-chief, George Scott, is joined by senior technical writer, Simon Bromley.</p>\n<p>George and Simon discuss what you need to get started with indoor training, chat through their personal training setups, and share a few tips and tricks for using a smart trainer.</p>\n<hr /><h2>Subscribe to the BikeRadar Podcast</h2>\n<p>Make sure you subscribe to the <a href=\"https://www.bikeradar.com/bikeradar-podcast/\">BikeRadar Podcast</a> via <a href=\"https://podcasts.apple.com/gb/podcast/the-bikeradar-podcast/id1461106709\" target=\"_blank\">Apple Podcasts</a>, <a href=\"https://open.spotify.com/show/6aLvE13Bge7WC7AWbiR3LS\" target=\"_blank\">Spotify</a> or your chosen podcast provider, so you don’t miss a future episode.</p>\n<p>The BikeRadar Podcast takes you to the heart of the issues that matter whether you’re a roadie, mountain biker, gravel rider or commuter.</p>\n<p>From the latest tech news, reviews and debates, to interviews with the biggest personalities in cycling, the podcast is your direct line into the BikeRadar team.</p>\n<p></p>","author":"BikeRadar","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f07bd3f6279953a62aaa5bafbcf42917d1e3ce30bf5159b33ce1fe11925ace3c","category":"Cycling"}