{"title":"Reuters แฉ พนักงาน Tesla เข้าถึงภาพกล้องรถลูกค้าได้ แชร์กันภายในเป็นมีม","link":"https://www.blognone.com/node/133340","date":1680858011000,"content":"<div><div><div><p>Tesla บริษัทผลิตรถยนต์ไฟฟ้าที่ยืนยันว่าความเป็นส่วนตัวของลูกค้าเป็นเรื่องสำคัญแต่ในบทความของ Reuters ได้เขียนถึงภาพและวิดีโอในกล้องหน้ารถยนต์ที่หลุดมาจากพนักงานของ Tesla นำมาซึ่งข้อสงสัยเรื่องความปลอดภัยและการละเมิดความส่วนตัวของผู้ใช้</p>\n<p>ช่วงปี 2019-2022 มีกลุ่มพนักงาน Tesla ได้แชร์ภาพและวิดีโอ ที่บันทึกจากกล้องหน้ารถยนต์ผ่าน Mattermost ช่องแชตภายในของบริษัท มีตั้งแต่ภาพทั่วไปเช่น ป้ายจราจร, สุนัข, ภาพคนล้ม ที่พนักงานนำมาทำเป็นมีมตลกและพูดเป็นเรื่องขำขันกัน หรือเหตุการณ์อุบัติเหตุรุนแรงที่เกิดในปี 2021 โดยเนื้อหาแสดงภาพรถ Tesla ขับด้วยความเร็วสูงอยู่ในชุมชนที่มีเด็กขี่จักรยานอยู่และเกิดอุบัติเหตุชนเข้าอย่างแรง ซึ่งวิดีโอตัวนี้ได้กระจายไปทั่วออฟฟิศ Tesla</p>\n<p>ผู้บริหาร Tesla ยังโดน ภาพหลุดในโรงรถของ Elon musk</p>\n<p>อีกเหตุการณ์เป็นภาพจากกล้องที่อยู่ในโรงรถแห่งหนึ่งที่แสดงให้เห็นทรัพย์สินส่วนบุคคล ซึ่งมีรถยนต์ Wet Nellie จากหนัง James Bond “The Spy Who Loved Me” จอดอยู่ภายในโรงรถ โดยเจ้าของรถยนต์ก็ไม่ใช่คนอื่นไกล เป็นของ Elon musk ซึ่งเป็น CEO ของ Tesla เอง ที่ได้ทำการประมูลมาด้วยมูลค่า 968,000 เหรียญสหรัฐในปี 2013</p>\n<p>จากรายงานการติดต่อสัมภาษณ์พนักงานเก่าของบริษัทประมาณ 300 คน ที่มีส่วนเกี่ยวข้องกับการพัฒนาระบบขับเคลื่อนอัตโนมัติ โดยพนักงานบางส่วนบอกว่าไม่ได้เห็นวิดีโอหรือภาพเก็บไว้ รวมไปถึงไม่สามารถระบุได้ว่าขั้นตอนการบันทึกภาพสามารถทำได้อย่างไร</p>\n<p>แต่บางคนก็บอกว่ามีการบันทึกภาพเพื่อวัตถุประสงค์ของการทำงาน เช่น ขอความช่วยเหลือจากเพื่อนร่วมงานหรือหัวหน้างาน โดยพนักงานมีทั้งมองว่าเรื่องนี้เป็นเรื่องปกติเพราะได้รับการยินยอมจากลูกค้าแล้ว แต่อีกส่วนก็ไม่พึงพอใจเพราะสิ่งนี้เป็นการละเมิดความเป็นส่วนตัวอย่างแท้จริง และลูกค้าที่ซื้อรถก็คงไม่คิดว่ารถที่พวกเขาซื้อนั้นจะมีความไม่เป็นส่วนตัวอยู่</p>\n<p>ในเดือนกุมภาพันธ์ที่ผ่านมาหน่วยงานคุ้มครองข้อมูลของเนเธอร์แลนด์ Dutch Data Protection Authority (DPA) ได้แถลงว่า ภาพหลุดจากกล้องเกิดจาก \"Sentry Mode\" ฟีเจอร์แจ้งเตือนสิ่งผิดปกติ โดยจะแจ้งเตือนไปยังเจ้าของรถเมื่อพบความผิดปกติโดยจะบันทึกเก็บไว้ให้เจ้าของสามารถย้อนกลับไปดูได้</p>\n<p>ซึ่งข้อสรุปจาก DPA ปรากฏว่า Tesla ไม่ได้เป็นฝ่ายผิด แต่เจ้าของรถยนต์ที่ไปจอดไว้ ณ จุดต่างๆ ผิด เพราะสามารถเห็นทุกสิ่งทุกอย่างที่คนอื่นกำลังทำอยู่ได้ ถือเป็นการละเมิดความเป็นส่วนตัวของผู้อื่น หลังจากนั้น Tesla ได้ปรับปรุง Sentry Mode หลายอย่าง เช่น มีไฟหน้ารถกะพริบแจ้งเตือนให้ผู้เดินผ่านรู้ว่าอาจถูกบันทึกภาพ</p>\n<p>ถึงแม้ว่าบริษัทจะพูดถึงเหตุการณ์ที่เกิดขึ้นว่าภาพหรือวิดีโอที่ถูกแชร์ไม่ได้แสดงถึงข้อมูลส่วนตัวของผู้ใช้โดยตรง และตอนนี้ได้มีการร่วมมือกับผู้เชี่ยวชาญด้านข้อมูลส่วนตัวถึงวิธีการจัดการกับเนื้อหาเพื่อไม่ให้ละเมิดความเป็นส่วนตัวของลูกค้า ซึ่งเรื่องนี้ก็ยังไม่ได้มีการประเมินผลในทางกฎหมายในหลายประเทศ</p>\n<p>แต่จากเหตุการณ์ที่เกิดขึ้นทำให้ตอนนี้มีผู้ใช้หลายคนเริ่มกังวลใจในการใช้รถ Tesla ว่าระบบเทคโนโลยีของรถยนต์จะสามารถรักษาความเป็นส่วนตัวได้มากน้อยแค่ไหน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/a40c6bca53967f39fb1634b304408b55.jpg\" /></p>\n<p>ที่มา: <a href=\"https://www.reuters.com/technology/tesla-workers-shared-sensitive-images-recorded-by-customer-cars-2023-04-06/\">Reuters</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tesla\">Tesla</a></div><div><a href=\"/topics/elon-musk\">Elon Musk</a></div><div><a href=\"/topics/sentry-mode\">Sentry Mode</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f07d4dea007c6cc4e9af0522011fffc0e8acffa2930e5f734d016ddb60d28228","category":"Thai"}