{"title":"How the heck did Apple make so much money last quarter?","link":"https://www.macworld.com/article/344773/apple-earnings-q2-2021-iphone-ipad-mac-services-wearables.html","date":1619680500000,"content":"\n<div>\n<section><div></div></section><p>The last few years, Apple has been on such a ride that it can be hard to put it into proper context. Almost every quarter sets a business record. And yet this quarter, covering the first three months of calendar 2021, are something special.</p>\n\n\n\n<p>I’ve been reading Apple financial statements and generating charts about those statements for the better part of a decade now. And this is the first time that I’ve looked at <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/04/apple-reports-second-quarter-results/&amp;xcust=1-1-344773-0-0-0&amp;sref=https://www.macworld.com/feed\">the numbers posted on Apple’s website</a> and thought that some sort of clerical error had been made. Perhaps a harried Apple accountant had gotten a little twitchy with their numeric keypad and put in a few extra digits here and there.</p>\n\n\n\n<p>But no, it’s true. Apple generated nearly $90 billion in revenue during the second quarter of 2021. Not only is that a whole lot of money, but it’s just a couple billion shy of the amount of revenue it generated during the holiday quarter of calendar year 2019. That quarter set an all-time record for Apple, bested only by the holiday quarter of calendar 2020.</p>\n\n\n\n<p>Apple’s business is more seasonal than an outside observer might think. People buy a lot of iPads and Macs during the holidays, it turns out—and of course, the iPhone launching in the fall pours even more revenue into that bucket. Holiday quarters are the biggest and have been for ages now. This quarter, this <em>second quarter</em>, this January through March quarter… it’s the size of a holiday quarter. It’s unprecedented. It’s the third-largest fiscal quarter Apple has ever had.</p>\n\n\n\n<p>Why did it happen? It’s a confluence of a lot of different events. What Apple CEO <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://sixcolors.com/post/2021/04/this-is-tim-transcript-of-apples-q2-2021-analyst-call/&amp;xcust=1-1-344773-0-0-0&amp;sref=https://www.macworld.com/feed\">Tim Cook said on his quarterly post-results conference call</a> with financial analysts was that it reflected “both the enduring ways our products have helped our users meet this moment in their own lives, as well as the optimism consumers seem to feel about better days ahead.”</p>\n\n\n\n<h2>iMac and iPad have their moment</h2>\n\n\n\n<p>It’s hard to pick out one Apple product category for focus when they were all up, but I think the iPad and Mac deserve top billing. Mac revenue was $9.1 billion, up 70 percent versus last year’s second quarter and an all-time record. iPad revenue was $7.8 billion, up 79 percent versus the year-ago quarter.</p>\n\n\n\n<p>Obviously, the pandemic is a big part of this. Cook admitted that lockdowns and school and office closures have driven the need for devices at home. Presumably, the arrival of the M1 late in Q1 helped, too. The result, though, is worth admiring.</p>\n\n\n\n<p>As Apple CFO Luca Maestri put it, “The last three quarters of Mac have been the best three quarters ever in the history of the product. So we are experiencing an incredible level of demand, which certainly is favored by the working from home and learning from home environment, but also by the incredible amount of new products and innovation that we put into the products that we launched during the last couple of quarters.”</p>\n\n\n\n<p>Alas, the iPad can’t claim such records. In the very early days of the iPad (2012 through 2014), the iPad generated enormous sales figures for Apple. So while the last two quarters of iPad sales aren’t records, they <em>are</em> the two biggest iPad quarters in the last six years. And the last time the iPad sold better in a non-holiday quarter was eight years ago. iPad sales haven’t quite hit those heights, but it’s closer than anyone might have imagined even a couple of years ago, when iPad sales had bottomed out.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/04/historical-ipad-macworld.png?w=1024\" /></figure><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://sixcolors.com/&amp;xcust=1-1-344773-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Jason Snell</a></div>\n\n\n\n<p>Unfortunately for the Mac and iPad, Apple sounded a warning that the quarter we’re currently in won’t be nearly as successful. But it’s not because of lagging demand. Instead, semiconductor shortages that are affecting many industries will limit how many iPads and Macs Apple can make at a time of high demand.</p>\n\n\n\n<p>“We will do our best, that’s what I can tell you,” Cook said. As for this quarter’s record sales? Apple managed that by burning through all of its reserves in order to keep production going as long as possible. “You wind up collapsing all of your buffers and offsets,” Cook said. “And that happens all the way through the supply chain.”</p>\n\n\n\n<p>The buffers are running out now, though. Reduced availability of Macs and iPads–perhaps even the new iMac and iPad Pro models–may be the result.</p>\n\n\n\n<h2>iPhone relives its glory days</h2>\n\n\n\n<p>iPhone sales growth has been pretty solid lately, but nothing like what happened in this quarter: $47.9B in sales, up 66 percent versus the year-ago quarter. A slower roll-out of the iPhone 12 family in the fall probably helped drive later sales, but last quarter’s sales were still pretty good and this quarter’s are spectacular, especially in what is typically a pretty sleepy iPhone quarter.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/04/phone-12-purple-4.png?w=1024\" /><figcaption>Apple’s second quarter blowout iPhone sales didn’t even include the new purple model.</figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Cook cited “double digit increases” of iPhone sales for both customers who had never before bought an iPhone, and to people upgrading existing iPhones. In fact, Cook said “there was actually a record number of upgraders for a March quarter.”</p>\n\n\n\n<p>The pandemic? Probably. The appeal of the new look of the iPhone 12 line driving some belated upgrades? Probably. 5G upgrades in countries with strong 5G stories like China and the U.S.? Sure, probably that too. You don’t grow sales 66 percent year-over-year without a bunch of different reasons.</p>\n\n\n\n<h2>Margin check</h2>\n\n\n\n<p>Apple didn’t just generate $89.6B in revenue this quarter. It generated $23.6B in profit, making the last two financial quarters Apple’s most profitable ever.</p>\n\n\n\n<p>How do you drive profits? It’s no mystery–if you can have solid margins on the products you sell, you’ll make money. Apple’s always been good at this, and this quarter its margin on products was 36 percent. That’s pretty good. It’s really good, actually.</p>\n\n\n\n<p>But if you’ve ever wondered why Apple makes such a big deal about how it’s growing its Services line, which covers services as disparate as AppleCare and Apple TV+, this is why: Apple’s services margins for the quarter were 70 percent. And while the Services line didn’t grow at eye-popping hardware sales rates, it continued its run of double-digit growth with a 27 percent year-over-year boost of its own, netting Apple $16.9B in revenue. And Apple keeps a higher percentage of that revenue as profit than it does for an iPhone, iPad, or Mac.</p>\n\n\n\n<p>That’s why Tim Cook loves services.</p>\n\n\n\n<h2>The future is unknowable</h2>\n\n\n\n<p>Finally, a word about Apple dodging questions. Analysts, like journalists, are always trying to find a crack in the armor that will allow an interesting tidbit that isn’t widely known to leak out of any conversation with someone from Apple.</p>\n\n\n\n<p>The quarterly calls are always an opportunity for an analyst to take their shot–and more often than not, come up empty. Apple doesn’t want to comment on future products, or future financial possibilities. In fact, Apple again refrained from offering any guidance about how it would do next quarter, because it feels it can’t accurately gauge what will happen in our COVID-affected world.</p>\n\n\n\n<p>I have heard many analysts take a shot at getting Tim Cook to accidentally pre-announce a new product on the quarterly conference call. It never goes well. And I frequently mock them for it. But I want to give a gold star to analyst Kyle McNeely of Jefferies, who asked a good question about how having Apple retail stores closed might have made it more difficult for Apple to sell more Apple Watches, AirPods, and accessories. Cook’s response wasn’t incredibly enlightening—Apple does think it can do better with those products with stores open, though online sales did better than expected—but I appreciated the question.</p>\n\n\n\n<p>Then there’s Harsh Kumar of Piper Sandler, who asked Cook what he expected for Mac and iPad sales for the second half of the year. Cook’s reply: “You know, we don’t predict to product level detail. We’re not even [providing guidance] to [overall revenue] at this point because of COVID, and so I’ll sidestep that question.”</p>\n\n\n\n<p>Classic Tim Cook. He’s so polite that he’ll even tell you when he’s going to avoid answering your question.</p>\n</div>","author":"Jason Snell","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f07eec3d0556f7b4363d1c078fec9a753e238c862e934fa89b0dea4bad072c8c","category":"Apple"}