{"title":"Migrating ripples create streambed heterogeneity altering microbial diversity and metabolic activity","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12631?af=R","date":1723833029000,"content":"<h2>Abstract</h2>\n<p>Sandy sediments of lowland streams are typically transported at low flow in the form of migrating ripples. In these bedforms, microbial communities spanning all trophic guilds (heterotrophic bacteria, fungi, photoautotrophic and phagotrophic protists) are exposed to highly frequent moving–resting cycles of sediment grains. Up to date, it is unknown to what extent ripple migration impacts community metabolism and composition as well as the vertical zonation of sediment-associated multitrophic microbial communities compared to stationary sediments. We hypothesize that, as a result of mechanical abrasion and limited light supply, migrating ripple sediments have lower microbial abundance, diversity, metabolism and resource acquisition and no vertical zonation compared to stationary sediments. We collected samples from five lowland streams in north-eastern Germany between May and June 2020. The coarser and better sorted sediments of migrating ripples had a higher oxygen concentration and less organic matter than stationary sediments. Photosynthetic pigments, potential extracellular enzyme activities, bacterial cell counts, and fungal gene copies were lower in migrating ripples than in stationary sediments. In contrast, cell-specific bacterial production was higher in migrating ripples. Metabarcoding revealed that bedform migration was important in shaping the community structure of bacteria, fungi, and phagotrophic protists. Dry mass-related net community production, respiration, and bacterial production were higher in superficial compared to underlying layers irrespective of sediment transport. By modulating the abundance, diversity, and structure of different trophic guilds of microbial communities and their resource acquisition, migrating bedforms create streambed heterogeneity, shaping regional biodiversity and the flow of matter through the benthic food web.</p>","author":"Anna Oprei, \nJosé Schreckinger, \nNorbert Kamjunke, \nAnja Worrich, \nMichael Mutz, \nUte Risse‐Buhl","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"f080a3ad8d201afd987b74700ff7499ea57ba295f7e7fa425611718805d29c1f","category":"Environment"}