{"title":"Alpha-Bisabolol-Loaded Cosmetic Micellar Solution with Cleansing and Antimicrobial Action for Facial Skin Hygiene","link":"https://www.preprints.org/manuscript/202408.1447/v1","date":1724146427000,"content":"The current research is focused on the discovery and optimization of an effective cosmetic carrier of alpha-bisabolol as a first step in the development of a cosmetic product with cleansing and antimicrobial action for facial skin hygiene. A micellar solution of Poloxamer 407 was selected as a cosmetic base because of the good washing ability, easy application, and high tolerability of this polymeric surfactant. The solubilization capacity of a 5% micellar solution with respect to α-bisabolol was investigated by applying varying solubilization techniques and increasing concentrations of the oily active substance. The test samples were subjected to an accelerated physical stability test, viscosimetry, dynamic light scattering (DLS), electrophoretic light scattering (ELS), foamability test, and antimicrobial screening. In the course of research, the advantage of the film-hydration method over direct solubilization was demonstrated by the narrower size distribution and smaller hydrodynamic size of the micellar nano-carriers (ranging from 29.02-116.5 nm) and the respective higher physical stability of the dispersions. The optimized composition was found to possess a suitable for application on large skin areas viscosity in the temperature range from 20°C to 40°C (3.4-2.3 mPa.s). Preservation of the washing capacity of the micellar solution in the presence of solubilized α-bisabolol was established. The active composition demonstrated inhibitory activity against Staphylococcus aureus and Escherichia coli, and fungicidal activity against Candida albicans. The study concludes that the optimal concentration of α-bisabolol to be solubilized in a 5% Poloxamer 407 micellar solution by the film-hydration technique is 1% considering the desirable physical endurance and antimicrobial activity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f084d41dc26b55d81850edb3d9eca53ecc1eb9098c1b8c08b2dd9b8cc49c8de3","category":"Interdisciplinary"}