{"title":"Assessment of the impacts of constructing artificial structures on the water quality and hydrological environment of a meandering river","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11120?af=R","date":1726114412000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c23829a1-d1c2-45a0-8b5e-af046201c707/wer11120-toc-0001-m.png\" alt=\"Assessment of the impacts of constructing artificial structures on the water quality and hydrological environment of a meandering river\" />\n<p>The color bar in each contour plot indicates concentrations of each water quality parameter, such as pH, DO, BOD<sub>5</sub>, COD, SS, TN, TP, water temperature, specific conductivity, total coliform, soluble TN, NH<sub>3</sub>-N, NO<sub>3</sub>-N, soluble TP, PO<sub>4</sub>-P, Chlorophyll-<i>a</i>, and fecal coliform, as the color goes from blue to red.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>When an artificial structure is built in a river, the river changes significantly in water quality and hydraulic properties. In this study, the effects of the weirs constructed in the middle section of a river as a four major rivers restoration project in Korea on water quality and hydrological characteristics were analyzed. For multi-dimensional data analysis, a self-organizing map was applied, and statistical techniques including analysis of variation were used. As a result of analysis, the cross-sectional area of the river increased significantly after the construction of the weir compared to before the construction of the weir, and the flow velocity decreased at a statistically significant level. In the case of water quality, nitrogen, phosphorus, and suspended solids tended to improve after weir construction, and chlorophyll-a and bacteria tended to deteriorate. Some water quality parameters such as chlorophyll-<i>a</i> were also affected by seasonal influences. In order to improve the water quality deteriorated by the construction of the weir, it is necessary to consider how to improve the flow velocity of the river through partial opening or operation of the weir. In addition, in order to determine the effect of sedimentation of particulate matter due to the decrease in flow rate, it is necessary to conduct investigations on sediments around weirs in the future.</p>\n<h2>Practitioner Points</h2>\n<p>\nCompared to before the construction of the weir, there was no significant change in the flow rate of the river after the construction of the weir.\nIn the case of chlorophyll-<i>a</i> and bacteria, the water quality was deteriorated after weir construction.\nTo improve the deteriorated water quality, it is required to consider the fundamental management of each pollutant source and the flexible operation of both weirs.\nFor some improved water quality parameters, further research is needed to determine whether these improvements are directly attributable to the construction of a weir.\n</p>","author":"Yongju Kwon, \nJongyeong Kim, \nJoowon Choi, \nTaeyang Kim, \nSung Min Cha, \nSoonchul Kwon","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"f087355f56d11c6e0606eeae4cf544039fc0f4488e23bbc617cfa36634c975ab","category":"Environment"}