{"title":"Microsoft comes under blistering criticism for “grossly irresponsible” security","link":"https://arstechnica.com/?p=1958508","date":1691017759000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/microsoft-800x533.jpg\" alt=\"Shadowy figures stand beneath a Microsoft logo on a faux wood wall.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/microsoft.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/search/photographer?family=editorial&amp;photographer=Drew+Angerer\">Drew Angerer | Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Microsoft has once again come under blistering criticism for the security practices of Azure and its other cloud offerings, with the CEO of security firm Tenable saying Microsoft is “grossly irresponsible” and mired in a “culture of toxic obfuscation.”</p>\n<p>The comments from Amit Yoran, chairman and CEO of Tenable, come six days after Sen. Ron Wyden (D-Ore.) blasted Microsoft for what he said were “<a href=\"https://arstechnica.com/security/2023/07/us-senator-blasts-microsoft-for-negligent-cybersecurity-practices/\">negligent cybersecurity practices</a>” that enabled hackers backed by the Chinese government to steal hundreds of thousands of emails from cloud customers, including officials in the US Departments of State and Commerce. Microsoft has yet to provide key details about the mysterious breach, which involved the hackers obtaining an extraordinarily powerful encryption key granting access to a variety of its other cloud services. The company has taken pains ever since to <a href=\"https://arstechnica.com/security/2023/07/microsoft-takes-pains-to-obscure-role-in-0-days-that-caused-email-breach/\">obscure</a> its infrastructure's role in the mass breach.</p>\n<h2>Critics pile on</h2>\n<p>On Wednesday, Yoran took to LinkedIn to <a href=\"https://www.linkedin.com/pulse/microsoftthe-truth-even-worse-than-you-think-amit-yoran\">castigate Microsoft</a> for failing to fix what the company <a href=\"https://www.tenable.com/security/research/tra-2023-25\">said on Monday</a> was a “critical” issue that gives hackers unauthorized access to data and apps managed by Azure AD, a Microsoft cloud offering for managing user authentication inside large organizations. Monday’s disclosure said that the firm notified Microsoft of the problem in March and that Microsoft reported 16 weeks later that it had been fixed. Tenable researchers told Microsoft that the fix was incomplete. Microsoft set the date for providing a complete fix to September 28.</p></div><p><a href=\"https://arstechnica.com/?p=1958508#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1958508&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f089a486fc31e84cf4443d2954bdcb0db9af135e5058f76933a9af8022cf2812","category":"Tech"}