{"title":"Faster-growing parasites threaten host populations via patch-level population dynamics and higher virulence; a case study in Varroa mites (Mesostigmata: Varroidae) and honey bees (Hymenoptera: Apidae)","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae049/7683868?rss=1","date":1716854400000,"content":"<span><div>Abstract</div>Honey bee parasites remain a critical challenge to management and conservation. Because managed honey bees are maintained in colonies kept in apiaries across landscapes, the study of honey bee parasites allows the investigation of spatial principles in parasite ecology and evolution. We used a controlled field experiment to study the relationship between population growth rate and virulence (colony survival) of the parasite <span>Varroa destructor</span> (Anderson and Trueman)<span>.</span> We used a nested design of 10 patches (apiaries) of 14 colonies to examine the spatial scale at which <span>Varroa</span> population growth matters for colony survival. We tracked <span>Varroa</span> population size and colony survival across a full year and found that <span>Varroa</span> populations that grow faster in their host colonies during the spring and summer led to larger <span>Varroa</span> populations across the whole apiary (patch) and higher rates of neighboring colony loss. Crucially, this increased colony loss risk manifested at the patch scale, with mortality risk being related to spatial adjacency to colonies with fast-growing <span>Varroa</span> strains rather than with <span>Varroa</span> growth rate in the colony itself. Thus, within-colony population growth predicts whole-apiary virulence, demonstrating the need to consider multiple scales when investigating parasite growth-virulence relationships.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"f08aca6635c99a8d075dfd8a82c8530303181b787d279711bab7ba55683671a7","category":"Environment"}