{"title":"Tracking and optimizing toxic chemical exposure pathways through food trade: A case study in SCCPs contaminated seafood in China","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae205/7680090?rss=1","date":1716422400000,"content":"<span><div>Abstract</div>Food safety is related to human health and sustainable development. International food trade poses food safety risks through the collateral transport of toxic chemicals that are detrimental to human health. Domestic interprovincial trade has similar effects within countries but has not been comprehensively investigated previously. Here, we assessed the effects of interprovincial trade on food safety and human dietary exposure to short-chain chlorinated paraffins (SCCPs), a group of emerging persistent toxic chemicals, in seafood across China by synthesizing data from field observation and various models. Our findings indicate that there is a higher level of SCCPs exposure risk in coastal provinces compared to inland provinces. Approximately, 70.3% of human exposure to SCCPs through seafood consumption in China was embodied in the interprovincial seafood trade in 2021. Specifically, the domestic trade led to a remarkable increase in SCCPs exposure in the coastal provinces in South China, attributable to low SCCPs pollution in these provinces and imported seafood from those provinces with high SCCPs pollution. In contrast, human exposure to SCCPs decreased in those coastal provinces in East China due to importing seafood from those provinces with low SCCPs concentrations. The interprovincial seafood trade routes were optimized by linear programming to minimize human exposure to SCCPs considering both shipping cost and health risk constraints. The optimized trade routes reduced the national per capita SCCPs exposure through seafood consumption by over 12%. This study highlights the importance of interprovincial food trade in the risk assessment of toxic chemicals.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"f08cf9e50d6c22630e6524e5deaea4d2e3f4944e720d41ca63a0f645fce5ddb8","category":"Interdisciplinary"}