{"title":"What is a ‘strong’ synapomorphy? Redescriptions of Murray’s type species and descriptions of new taxa challenge the systematics of Hypsibiidae (Eutardigrada: Parachela)","link":"https://academic.oup.com/zoolinnean/article/doi/10.1093/zoolinnean/zlad151/7420173?rss=1","date":1699920000000,"content":"<span><div>Abstract</div>Hypsibiidae are the most species-rich group within the Hypsibioidea, and three (Diphasconinae, Itaquasconinae, and Pilatobiinae) of its four subfamilies are characterized by a division of the foregut into a rigid buccal and a flexible pharyngeal tube. The aim of this work is to provide a comprehensive background for sound taxonomic studies on several hypsibiid lineages. We redescribe the type species for the genera <span>Adropion</span>, <span>Guidettion</span>, and <span>Platicrista,</span> and provide diagnostic keys for several genera. We also demonstrate that the presence of an apodeme at the border of the buccal and pharyngeal tube is not a discriminative criterion separating Diphasconinae from Itaquasconinae and that the apodeme does not have a uniform morphology among Hypsibiidae. <span>Itaquascon serratulum</span><strong>sp. nov.</strong> (Uganda) is the first integratively described species in the genus. Furthermore, new species of <span>Platicrista</span> are described: <span>Platicrista borneensis</span><strong>sp. nov.</strong> (Malaysia), <span>Platicrista carpathica</span><strong>sp. nov.</strong> (Poland), and <span>Platicrista nivea</span><strong>sp. nov.</strong> (Taiwan). Moreover, <span>Raribius minutissimus</span><strong>sp. nov.</strong> (Scotland) is described from leaf litter. Finally, <span>Pilatobius</span> is divided into four morphogroups by cuticular sculpturing and dorsal gibbosities, which serve as decisive criteria; two received phylogenetic support and are erected as <span>Degmion</span><strong>gen. nov.</strong> (the <span>oculatus</span> group) and <span>Fontourion</span><strong>gen. nov.</strong> (the <span>recamieri</span> group).</span>","author":"","siteTitle":"Zoological Journal of the Linnean Society Current Issue","siteHash":"60dddf4002fe346d902069d12617b89305afb00f9555e0dc9329b5ff91a03e42","entryHash":"f09808e7468c16f210f0c7354a964bcb00311f2ff6ec8e932eb7b54898f8e2d3","category":"Environment"}