{"title":"Lachlan Morton completes 5,510km Alt Tour, beating peloton to Paris by five days","link":"https://www.bikeradar.com/news/lachlan-morton-completes-alt-tour/","date":1626170408000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/The-Alt-Tour_Day-18_2_Credit-Rapha-0a5aab5.jpg?quality=90&amp;resize=620,413\" />                                            <p>Lachlan Morton has just completed his <a href=\"https://www.bikeradar.com/news/lachlan-morton-alt-tour/\" target=\"_blank\">Alt Tour</a>, beating the <a href=\"https://www.bikeradar.com/events/tour-de-france/\" target=\"_blank\">Tour de France</a> peloton to Paris by five days.</p>\n<p>Morton set out on the first day of the Tour de France with the aim to ride the entirety of the route unsupported, including transfers.</p>\n<p>This meant riding 5,510km and 65,000m of elevation – an extra 2,400km and 15,000m ascent over the peloton – all while sleeping outside and sourcing his own food and drink. (We’ve got a separate feature on <a href=\"https://www.bikeradar.com/features/pro-bike/lachlan-morton-alt-tour-bike/\">Morton’s Cannondale SuperSix EVO bikepacking setup</a>).</p>\n<blockquote><p>KM 5,510 - Lachy’s done it!<br /><br />18 days. 5,510-kilometers. 65,500-meters of elevation gain. 220-hours of riding.<br /><br />This morning at 05:30am, he finished up his Alt Tour in Paris, riding the laps of the Champs-Élysées in the dawn this morning.<br /><br />🎥 <a href=\"https://twitter.com/josselin_riou?ref_src=twsrc%5Etfw\">@josselin_riou</a> <a href=\"https://t.co/oFsjCKCNzF\">pic.twitter.com/oFsjCKCNzF</a></p>— EF Pro Cycling (@EFprocycling) <a href=\"https://twitter.com/EFprocycling/status/1414792643163435010?ref_src=twsrc%5Etfw\">July 13, 2021</a></blockquote><p>Morton finished the route – including laps of the Champs-Élysées – at 05:30 this morning, having ridden for 220 hours, which is 18 hours ahead of what he set out to do and with an average of just over 300km per day.</p>\n<p>When the EF-Education Nippo rider left Brittany, he quickly built up an advantage over the peloton, sometimes getting as little as four hours sleep.</p>\n<p>Five days in and Morton was 420km ahead of the peloton and was even ahead of the person responsible for putting up the signage for the Tour.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Footwear of the pros?</span></figcaption><span> <i>Rapha</i></span></div>\n<p>It hadn’t been without difficulties, though. Morton had been plagued with punctures, and knee pain led to him swapping out his cycling shoes for a pair of sandals, which stayed with him for much of the trip going through various alterations including cutting off one of the straps and adding carbon insoles, donated by a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-apps/#:~:text=if%20you%E2%80%99re%20into%20long-distance%20racing%2C%20dotwatcher%20is%20a%20must-visit.\" target=\"_blank\">dot watcher</a>.</p>\n<p>When <a href=\"https://www.bikeradar.com/news/lachlan-morton-podcast/\">BikeRadar spoke to Morton</a> midway through the Alt Tour as part of our <a href=\"https://www.bikeradar.com/news/tour-de-france-podcast/\">Tour de France podcast series</a>, he had climbed the Alps and the double pass of Mont Ventoux, explaining how he had subsisted on cider, melon and prosciutto.</p>\n\n<p>After the Alps, he still had to tackle the Pyrennes. He had a healthy buffer over the peloton, but he was still riding around 12 hours a day – a necessity to get back up to the north of France and complete the 700km of transfer from the end of Stage 20 and the final stage of the Tour coming into Paris.</p>\n<p>Out of the mountains, Morton remarked that it was practically downhill to Paris, but he was confronted with a virtually never-ending headwind and the ride became as much a mental battle as a physical one.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The ride wasn’t without its difficulties. Morton had many punctures as well as issues with his Di2 groupset.</span></figcaption><span> <i>Rapha</i></span></div>\n<p>On Sunday 11 June, Morton arrived at the campsite he was staying at to a surprise visit from his dad, David Morton, who had flown out to meet his son, and after the emotion of the ride there was said to not be a dry eye in sight.</p>\n<p>Morton set out from Pau for the final leg of the Alt Tour at 10am CEST yesterday morning. This was the longest stage of the route at 579km and helped Morton achieve his goal of doing a day that was as far as the longest ever Tour de France stage – a whopping 428km, which was part of the 1919 edition of the race.</p>\n<p>Morton set out with the intention of riding through the night, which he did coming into Paris in the early hours of the morning.</p>\n<p>Beyond being an epic ride, the Alt Tour was raising funds for World Bicycle Relief, a non-profit organisation that provides bicycles to people in need.</p>\n<p>Rapha and EF-Education Nippo both donated 500 bicycles to the charity, but over the course of the ride, the Alt Tour also raised a staggering £356,477 for the organisation, which will go to help 3,000 people.</p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f09b3067c31de85feb5bd1c67bafa37d4015ac9d8d0dffb0f0524d5a102cfcbb","category":"Cycling"}