{"title":"It's time to broaden what we consider a ‘blue carbon ecosystem’","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17261?af=R","date":1715065200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/5cdd3f9b-6bad-4399-b089-c1f56f3070aa/gcb17261-toc-0001-m.png\" alt=\"It's time to broaden what we consider a ‘blue carbon ecosystem’\" />\n<p>Marine ecosystems are important in mitigating rising atmospheric CO<sub>2</sub> because of their capacity to store significant quantities of carbon (called blue carbon). To date, three key blue carbon ecosystems have been recognized (seagrass meadows, mangrove forests, tidal marshes), however, evidence is emerging that other ecosystems may also be important. Here, we use meta-analysis of 253 research publications to investigating the role of other marine ecosystems in blue carbon. At present, mud/tidal flats, shallow sediments/fjords, some components of coral reef systems (e.g. lagoons), and coralline algal beds should also be considered important for blue carbon burial.</p>\n<br />\n<h2>Abstract</h2>\n<p>Photoautotrophic marine ecosystems can lock up organic carbon in their biomass and the associated organic sediments they trap over millennia and are thus regarded as blue carbon ecosystems. Because of the ability of marine ecosystems to lock up organic carbon for millennia, blue carbon is receiving much attention within the United Nations' 2030 Agenda for Sustainable Development as a nature-based solution (NBS) to climate change, but classically still focuses on seagrass meadows, mangrove forests, and tidal marshes. However, other coastal ecosystems could also be important for blue carbon storage, but remain largely neglected in both carbon cycling budgets and NBS strategic planning. Using a meta-analysis of 253 research publications, we identify other coastal ecosystems—including mud flats, fjords, coralline algal (rhodolith) beds, and some components or coral reef systems—with a strong capacity to act as blue carbon sinks in certain situations. Features that promote blue carbon burial within these ‘non-classical’ blue carbon ecosystems included: (1) balancing of carbon release by calcification via carbon uptake at the individual and ecosystem levels; (2) high rates of allochthonous organic carbon supply because of high particle trapping capacity; (3) high rates of carbon preservation and low remineralization rates; and (4) location in depositional environments. Some of these features are context-dependent, meaning that these ecosystems were blue carbon sinks in some locations, but not others. Therefore, we provide a universal framework that can evaluate the likelihood of a given ecosystem to behave as a blue carbon sink for a given context. Overall, this paper seeks to encourage consideration of non-classical blue carbon ecosystems within NBS strategies, allowing more complete blue carbon accounting.</p>","author":"Kelly James, \nPeter I. Macreadie, \nHeidi L. Burdett, \nIan Davies, \nNicholas A. Kamenos","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"f0a4982f0e19e9d8ac03dd266c68d3e7452b0c957b15602c1db6d28bb49a1dbb","category":"Environment"}