{"title":"Nucleic acid amplification‐based methods for diagnosis of shrimp viral diseases","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12873?af=R","date":1699869859000,"content":"<h2>Abstract</h2>\n<p>Viral diseases are one of the constraints affecting the sustainability of the shrimp farming industry worldwide. The common causes of viral infections include white spot syndrome virus, infectious hypodermal and haematopoietic necrosis virus, hepatopancreatic parvovirus, <i>Penaeus monodon</i> nudivirus, decapod iridescent virus 1, Taura syndrome virus, yellow head virus, infectious myonecrosis virus and <i>Macrobrachium rosenbergii</i> nodavirus. Accurate diagnostic methods are necessary for preventing the spread of these transboundary diseases. Many molecular diagnostic methods for shrimp viral diseases have been developed and are currently in use, including conventional polymerase chain reaction (PCR), nested PCR, loop-mediated isothermal amplification PCR, recombinase polymerase assay and real-time PCR. Although the World Organization for Animal Health (founded as OIE) recommends several PCR methods for shrimp disease diagnosis, there has been a lack of efforts to comparatively evaluate the performance of the available methods, resulting in a significant knowledge gap. Therefore, in this review, we compare various PCR assays and commercial PCR-based diagnostic kits that have been developed and/or published previously, and discuss pros and cons of each of these methods. Our objective of this review is to offer enhanced clarity and a comprehensive overview of molecular diagnostic methods for shrimp viral diseases. This endeavour would serve as an important resource for researchers engaged in relevant studies and professionals within the shrimp-farming industry, providing valuable guidance and insights.</p>","author":"Yoonhang Lee, \nJasna Vijayan, \nHyeongJin Roh, \nJiyeon Park, \nJu‐Yeop Lee, \nThanh Luan Nguyen, \nHyoung Jun Kim, \nWi‐Sik Kim, \nArun K. Dhar, \nChan‐Il Park, \nDo‐Hyung Kim","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"f0a984e5f7a1024356c769b69faa12eb947465dcd63bda5738cc497bd1f176f7","category":"Environment"}