{"title":"Copula-Probabilistic Flood Risk Analysis with Hourly Flood Monitoring Index","link":"https://www.preprints.org/manuscript/202404.0965/v1","date":1713173786000,"content":"Floods are a common natural disaster whose severity in terms of duration, water resource volume, peak and accumulated rainfall-based damage are likely to differ significantly for different geographical regions. In this paper, we first propose a novel hourly flood index (SWRI24−hr−S), derived from normalising the existing 24-hourly water resources index (WRI24−hr−S) in literature, to monitor flash flood risks on an hourly scale. The proposed SWRI24−hr−S is adopted to identify a flood situation and derive its characteristics, such as the duration (D), volume (V) and peak (Q). The comprehensive result analysis establishes the practical utility of SWRI24−hr−S in identifying flood situations at seven study sites in Fiji between 2014 and 2018 and deriving their characteristics (i.e., D, V, and Q). Secondly, this study develops a vine copula-probabilistic risk analysis system that models the joint distribution of flood characteristics (i.e., D, V, and Q) to extract their joint exceedance probability for the seven study sites in Fiji, enabling probabilistic flood risk assessment. The vine copula approach, particularly suited to Fiji’s study sites, introduces a novel probabilistic framework for flood risk assessment. The results show moderate differences in the spatial patterns of joint exceedance probability of flood characteristics in different combination scenarios generated by the proposed vine copula approach. In the worst-case scenario, the probability of any flood event occurring where the flood volume, peak and duration are likely to exceed the 95th-quantile value (representing an extreme flood event) is found to be less than 5% for all study sites. The proposed hourly flood index and the vine copula approach can be feasible and cost-effective tools for flood risk monitoring and assessment. The methodologies proposed in this study can be applied to other data-scarce regions where only rainfall data is available, offering crucial information for flood risk monitoring, assessment, and the development of effective mitigation strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f0b0d984d9aae5aac68d2b5608ec8430a7db0a375ac4e2eab25e588696ffddae","category":"Interdisciplinary"}