{"title":"A new hybrid subspecies of puffin is likely the result of climate change","link":"https://arstechnica.com/?p=1978857","date":1698328198000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/atlanticpuffin-800x533.jpg\" alt=\"A puffin\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/atlanticpuffin.jpg\">Enlarge</a> <span>/</span> Atlantic puffin, Spitsbergen, Svalbard Islands, Norway. (credit: Sergio Pitamitz/VWPics/Universal Images Group via Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The brisk increase in warming rates in the Arctic is bringing rapid shifts in range for plants and animals across the region’s tree of life. Researchers say those changes can lead species that normally wouldn’t encounter each other to interbreed, creating new hybrid populations.</p>\n<p>Now, scientists have presented the first evidence of large-scale hybridization that appears to have been driven by climate change. In a<a href=\"https://www.science.org/doi/10.1126/sciadv.adh1407\"> paper</a> published this month in the journal Science Advances, researchers report that a hybrid Atlantic puffin population on the remote Norwegian island of Bjornoya seems to have emerged in a period coinciding with the onset of a faster pace of global warming.</p>\n<p>The hybrid puffins likely arose from the breeding between two subspecies within the past 100 or so years, coinciding with the onset of the 20th-century warming pattern, the study concludes. Strikingly, the hybridization occurred after a subspecies migrated southward, not poleward toward cooler temperatures, as might have been expected, a finding that highlights the complexity of the changes underway in the Arctic ecosystem.</p></div><p><a href=\"https://arstechnica.com/?p=1978857#p3\">Read 32 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1978857&amp;comments=1\">Comments</a></p>","author":"Inside Climate News","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f0b3fe6e28b62160703f344faf55a7290043fd974363157015817ff98ee073ce","category":"Tech"}