{"title":"The Effect of Climate on the Regeneration Capacity of Strongly Disturbed Vegetation in a Central European Lower Montane Zone, Hungary","link":"https://www.preprints.org/manuscript/202404.0336/v1","date":1712203086000,"content":"The human landscape transforming activity contributes to the global change of vegetation in different forms. Hunting is one of the most ancient human landscape-shaping activities. Feeders for hunting are particularly disruptive to vegetation. In the present study, we conducted a vegetation survey in these highly disturbed places. We are investigating the vegetation dynamics over several years in in the turkey oak–sessile oak zone, in two areas with different moisture and shade conditions (forest and clearing). One important background factor is changes in precipitation and temperature. The novelty of our present study lies in the fact that the observation takes place with continuous disturbance, where the human influence is very large. Our results confirm that the weed infestation be detectable at bait sites over a long period, and the interannual changes were typical in every year, according to the fact that in August, more weed species are usually present with a greater cover at the bait sites. The main meteorological factors played a role in the degree of weed infestation in each year. There was a higher proportion of vegetation regeneration in wetter years, while dry periods do not favor successional processes. With the drying of the climate, the disturbed areas are constantly losing their natural value, but wetter weather is not an automatic solution either. A more precise understanding of vulnerable systems and careful planning of treatment interventions is necessary.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f0cb7bbec538436f443a3b3a3ff93e03e8dd0612a45e5305023a4a0808c1f65d","category":"Interdisciplinary"}