{"title":"Discovering the Perception Differences of Stakeholders on the Sustainable and Innovative Stormwater Management Practices","link":"http://link.springer.com/10.1007/s11269-024-03783-2","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>The overarching aim of the present work is to explore the perception differences of stakeholders, i.e., municipalities (MN), water administrations (WS), non-governmental organizations (NGO), and universities (UN), playing vital roles in the decision mechanisms regarding one of the sustainable flood mitigation techniques, i.e., low impact development (LID) practices. As being rewarding alternative to conventional drainage techniques, four different LID strategies, i.e., green roof (GR), bioretention cells (BC), permeable pavement (PP), and infiltration trench (IT), and three of their combinations were adopted to the densely urbanized Ayamama River basin, Istanbul, Turkey. The performances of the LIDs were comprehensively evaluated based on three pillars of sustainability (i.e., social, economic, and environmental) using a hybrid multi-criteria decision-making (MCDM) framework containing the implementation of fuzzy analytical hierarchy process (fuzzy AHP) and the VIKOR (VIse KriterijumsaOptimiz acija I Kompromisno Resenje) for finding the weights of constraining criteria and prioritizing the LID scenarios, respectively. The major outcomes of this research showed that experts from MN, WS, and UN put forward the environmental dimension of sustainability, whereas respondents from NGO concentrated on the social aspect. Furthermore, MN and WS highlighted initial investment cost as the most determining criterion in optimal LID selection. On the other hand, criteria weights regarding the judgments of the experts attended from NGO revealed the significance of community resistance in specifying the optimal LID practices, while aesthetic appearance was the major concern of the academia. Hence, the present study, as an initial attempt, enabled critical standpoints for discovering perceptions of stakeholders.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"f0d728004495ed2d994134417d13b903bb6405470dc1767381922e2168f4bca7","category":"Environment"}