{"title":"Eupatilin ameliorates postmenopausal osteoporosis via elevating microRNA‐211‐5p and repressing JAK2/STAT3 pathway","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24069?af=R","date":1709898124000,"content":"<h2>Abstract</h2>\n<p>Postmenopausal osteoporosis (PMOP) poses a significant threat to women's health worldwide. Eupatilin is a key bioactive component of the Chinese herbal medicine <i>Artemisia asiatica</i> Nakai. Recent research reports have proved the inhibitory function of Eupatilin in many diseases. MicroRNAs (miRNAs) are 21–23 nucleotide-long, single-stranded, noncoding RNA molecules generated endogenously, and many studies have indicated that miRNAs are involved in the development of osteoporosis. This study explored the role and potential mechanism of Eupatilin underlying PMOP. First, rats were given intragastric administration of Eupatilin every day and subcutaneous injections of oligonucleotides or plasmids that interfered with miR-211-5p or janus kinase 2 (JAK2) once a week. After 4 weeks, the PMOP rat model was established. Then, serum alkaline phosphatase, calcium, and phosphorus levels, as well as femur bone mineral density and biomechanical parameters, were detected. Hematoxylin–eosin staining and Masson staining were applied for detecting the pathological condition of femur, and immunohistochemical staining was for detecting osteocalcin. MC3T3-E1 cells were transfected with plasmid vectors interfering with miR-211-5p or JAK2; and cell viability, lactate dehydrogenase cytotoxicity, and cell mineralization were subsequently examined. The relationship between miR-211-5p and JAK2/signal transducer and activator of transcription 3 (STAT3) pathway was analyzed. The targeting relation between miR-211-5p and JAK2 was also verified. The experimental results revealed that Eupatilin improved the pathological conditions of PMOP rats by promoting the proliferation and mineralization of osteoblasts. MiR-211-5p was down-regulated and JAK2/STAT3 was upregulated in PMOP rats. Upregulation of miR-211-5p further improved the pathological conditions of PMOP rats based on Eupatilin treatment. MiR-211-5p inhibited the JAK2/STAT3 pathway. JAK2 offset the effects of elevated miR-211-5p on PMOP rats. Overall, Eupatilin attenuates PMOP through elevating miR-211-5p and repressing JAK2/STAT3 pathway, which suggests the utility of Eupatilin as a potential drug for POMP treatment.</p>","author":"Liu Hong, \nChao Yang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"f0f005fcfc9c6209d1ae690744ff6c075ed8da040c943feb303157fc1a5c1cc3","category":"Environment"}