{"title":"Xiaomi’s “Ultra” camera phone has a grip accessory, screw-on lens filters","link":"https://arstechnica.com/?p=1932672","date":1681850305000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/32-980x668.jpg\" alt /></div>\n          <p>\n            The Xiaomi 13 Ultra in its full camera mode regalia.                           [credit:\n                              Xiaomi                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Xiaomi's newest flagship smartphone is the 13 Ultra, and it wants to be the ultimate smartphone camera. There's a big 1-inch sensor, a dual-aperture lens, and a camera grip shutter button accessory. Along with the faux-camera-leather back and big, round camera bump, if you squint, this almost looks like a point-and-shoot camera.</p>\n<p>The headline feature is the 50 MP camera powered by a 1-inch Sony IMX989. We've seen this sensor make headlines before as the biggest, most powerful sensor on the market in phones like the non-Ultra <a href=\"https://arstechnica.com/gadgets/2022/12/xiaomis-new-phone-takes-a-ton-of-inspiration-from-apple-as-usual/\">Xiaomi 13</a>, the <a href=\"https://arstechnica.com/gadgets/2022/11/the-worlds-first-snapdragon-8-gen-2-phone-is-the-vivo-x90-pro-plus/\">Vivo X90 Pro Plus</a>, the <a href=\"https://arstechnica.com/gadgets/2022/05/japans-sharp-aquos-r7-is-the-cure-for-bad-smartphone-design/\">Sharp Aquos R7</a>, and the Leica-rebrand of that Sharp phone, <a href=\"https://arstechnica.com/gadgets/2022/11/leicas-leitz-phone-2-has-a-giant-1-inch-camera-sensor-magnetic-lens-cap/\">the Leitz Phone 2</a>.</p>\n<p>Xiaomi takes Sony's big sensor and adds a gimmick that we haven't seen since <a href=\"https://arstechnica.com/gadgets/2018/03/galaxy-s9-review-faster-specs-better-biometrics-in-a-familiar-package/5/\">the Samsung Galaxy S9</a>: a dual-aperture lens. Samsung's dual-aperture lens in 2018 could switch from f1.5 to f2.4. While that's technically interesting, that was not a big enough range to do much of anything. The goal of a smaller aperture on a real camera is to 1) take in less light if the environment is too bright, and 2) have a bigger depth of field so more things are in focus. None of that scales to a smartphone camera. First, the tiny lenses mean they can never get enough light, so a smaller aperture tends to be detrimental to your photos. Second, smartphone cameras don't have a big enough focal length to really do anything with depth-of-field effects.</p></div><p><a href=\"https://arstechnica.com/?p=1932672#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1932672&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f0f363b571b65b8ad14a88e54d8f18b9264a92e0132e85c85254005caa76151f","category":"Tech"}