{"title":"Machine-Learning Assisted Analysis of Battery Electrode by PFIB-SEM Tomography","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.136/7719537?rss=1","date":1721779200000,"content":"<span>Three-dimensional (3D) characterizations of battery electrodes and active materials are essential to understanding their microstructure. This in turn provides essential insight into the cell performance. During battery cycling, particle morphological change, including cracking and disintegration, can lead to cell degradation [<a href=\"#ozae044.136-B1\">1</a>]. These morphological degradations can range from micrometers to nanometers in scale. Micro-computed tomography (CT) and Ga<sup>+</sup> based focused ion beam-scanning electron microscopy (FIB-SEM) tomography are widely used for battery analysis, but they face challenges either at high resolution or large field of view respectively. Plasma based FIB-SEM fills the gap between these two techniques with <span>nm</span> scale spatial resolution and hundreds of <span>μm</span> field of view [<a href=\"#ozae044.136-B2\">2</a>]. Although the tomography techniques are well developed, gaining quantitative information from the representative 3D volume data is still challenging and diverse data processing methods must be developed. For a 3D data set of battery system, semantic segmentation is needed to extract the volume fraction of each component. On the other hand, instance segmentation is required for particle level morphology in order to have an in-depth understanding of the electrode’s structure-performance relationship [<a href=\"#ozae044.136-B3\">3</a>]. Thus, traditional image processing methods cannot guarantee a satisfying result for such statistical analysis. Machine learning (ML) is critical to fulfilling this requirement [<a href=\"#ozae044.136-B4\">4</a>]. In this work, we demonstrated an approach with the aid of ML to reveal the microstructure and nanostructure of a cathode electrode and individual particles from a lithium-ion battery using PFIB-SEM.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"f0f3de9b619678984d9a43853c0e4eaa00d9fc08e809b7d468adb65a88cabd2a","category":"Environment"}