{"title":"Remember how the iPod and iPhone failed? The 24-inch iMac is doomed too","link":"https://www.macworld.com/article/349267/macalope-24-inch-imac-doomed-expansion-design-thin-adapters-multitouch-crooked.html","date":1624703400000,"content":"\n<div>\n<section><div></div></section><p>The M1 iMacs have barely hit the streets and reports are that some of them are literally hitting the streets from being thrown out of people’s windows.</p>\n\n\n\n<p>Okay, technically, the Macalope doesn’t have any actual reports of that, but when you read the horrors of this new computer, you’ll wonder why that isn’t happening.</p>\n\n\n\n<p>Also, would it kill you to play along now and again?</p>\n\n\n\n<p>Writing for The Washington Post, Geoffrey A. Fowler says <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.washingtonpost.com/technology/2021/06/16/apple-imac-thin/&amp;xcust=1-1-349267-0-0-0&amp;sref=https://www.macworld.com/feed\">“The ultrathin new iMac lost a lot more than size.”</a> (Tip o’ the antlers to 5cat.)</p>\n\n\n\n<blockquote><p>An obsession with thin design has taken over consumer tech, and Apple is its leader.</p></blockquote>\n\n\n\n<p>It’s true. The new iMacs do not have USB-A ports and you cannot upgrade the RAM because <a href=\"https://www.macworld.com/article/234843/m1-macs-memory-isnt-what-it-used-to-be.html\">the memory is now part of the system on chip</a>. Just like that spell that forest warlock cast on the Macalope all those years ago, this is a curse but also a blessing. (The spell had to do with burritos.) While you can’t upgrade the RAM on the new M1 Macs, there is a speed benefit to having the RAM integrated and the speed of these machines is pretty impressive. However, you can’t upgrade the SSD other than attaching additional storage because Apple is a bunch of jerks. All these things are true.</p>\n\n\n\n<p>They’re still pretty good machines for the money.</p>\n\n\n\n<blockquote><p>…the new iMac I’ve been testing for a few weeks is a departure from my old one. It’s essentially an iPad on a stand.</p></blockquote>\n\n\n\n<p>Except for all the ways in which it is not. Like desktop multitasking, not being limited to the App Store, support for multiple users, ability to attach peripherals, etc. Other than all that, yes, just like an iPad.</p>\n\n\n\n<blockquote><p>Actually, it’s less useful than that, because the iMac doesn’t have a touch screen.</p></blockquote>\n\n\n\n<p>[A full 30 seconds of blinking.]</p>\n\n\n\n<p>Okay.</p>\n\n\n\n<blockquote><p>What this means is that anybody who plugs things into a computer either has to abandon old devices… or buy a bunch of unsightly adapters known as dongles.</p></blockquote>\n\n\n\n<p>I thought we didn’t care about what things looked like.</p>\n\n\n\n<p>Of course, if you really hate dongles, a variety of USB-A-to-USB-C cables are available, like the flat <a href=\"https://www.amazon.com/AmazonBasics-Type-C-USB-Male-Cable/dp/B01GGKYLW0/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">one</a>, the square <a href=\"https://www.amazon.com/Cable-Matters-Printer-USB-C-Black/dp/B00VKSF39O/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">one</a>, the little <a href=\"https://www.amazon.com/Cable-Matters-Micro-Braided-Jacket/dp/B00UUBRX0Y/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">one</a>, the weirdo <a href=\"https://smile.amazon.com/Cable-Matters-Type-C-Micro-USB-C/dp/B00UUBQ710/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">one</a> you can’t even believe is a real connector but actually is, and even the “Wait, when the heck did they ship this? I must have been out of the country when that happened” <a href=\"https://www.amazon.com/Cable-Matters-Type-C-USB-C-Black/dp/B00UXKTJE0/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">one</a>.</p>\n\n\n\n<blockquote><p>Apple also cut the flash-card reader included in past iMacs, making one more thing photographers need to buy.</p></blockquote>\n\n\n\n<p>If there’s one thing people who buy high-end camera equipment simply cannot afford, it’s a $10 flash card reader.</p>\n\n\n\n<p>The new iMac also does not come with a floppy drive, Zip drive or SCSI support. The floppy drive thing is something Apple defenders always trot out when noting that getting rid of things sometimes creates progress and the only reason they do that is because it’s true. That’s the only reason.</p>\n\n\n\n<p>Well, it’s funny, too. Not hilarious but, you know.</p>\n\n\n\n<p>It’s very possible Fowler has simply purchased the wrong Mac. If you want a Mac with USB-A ports and absolutely want your ethernet cable hanging down the back of your desk instead of out of sight on the floor, the Mac mini is just as fast as the M1 iMac and cheaper. Fowler gets around to pointing this out about two-thirds of the way through the article as a supposed “gotcha”.</p>\n\n\n\n<blockquote><p>And everything but the SD card reader is available on the latest Mac Mini…</p></blockquote>\n\n\n\n<p>Oh, you mean we have choice?! Who asked for <em>that?!</em></p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope.jpg?quality=50&amp;strip=all\" /></figure><p>IDG</p></div>\n\n\n\n<p>The upgradability of a machine (or lack thereof, in this instance) is certainly a consideration, and Apple’s relentless trend toward locked-down devices does give the Macalope pause. At the same time, he remembers the time he bought a USB expansion card for a Sawtooth G4. When the peripheral he plugged into it didn’t work right, the peripheral manufacturer said they only supported the built-in USB ports. The reality of endless expansion didn’t always live up to the dream.</p>\n\n\n\n<p>Meanwhile, the Forbes contributor network and 1970s Jell-O and Spam recipe-sharing site’s Ewan Spence has found another reason to dislike the M1 iMac.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.forbes.com/sites/ewanspence/2021/06/14/apple-imac-m1-mounting-display-problems/?sh=62eddc6f4e4b&amp;xcust=1-1-349267-0-0-0&amp;sref=https://www.macworld.com/feed\">“Apple Faces An Embarrassing iMac Problem.”</a> (Tip o’ the antlers to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/nwsayer/status/1405186352224694279&amp;xcust=1-1-349267-0-0-0&amp;sref=https://www.macworld.com/feed\">Nick</a>.)</p>\n\n\n\n<p>Apparently some M1 iMacs are slightly askew in their attachment to the stand, in the degree of a few millimeters. This is definitely embarrassing to a company that prides itself on its precision design and manufacturing, going to great lengths to make videos attesting to their market-leading products. As Spence points out, there’s no evidence this is widespread and Apple has offered to replace the affected units.</p>\n\n\n\n<p>It’s still worth pointing out that while he considers this an embarrassment, Spence is the same guy <a href=\"https://www.macworld.com/article/3304279/same-time-next-year-samsung-s-annual-winning.html\">who said</a> Samsung’s fast reaction to exploding Galaxy Notes was a feather in the company’s cap. The explosions do tend to focus you, yes.</p>\n\n\n\n<p>Well, based on these two data points there’s only one thing we can conclude: the M1 iMacs are doomed and Apple will be forced to start shipping Quadras again soon. You heard it here first.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f0f3dbf94a120be8afc12c4eb597b5861ba5ec2872bdcb76ad09f11994d42e2a","category":"Apple"}