{"title":"Cross-habitat utilization of fish in a tropical deltaic system as a function of climate variability and body size: Are mangroves fish nurseries in a tropical delta?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308313","date":1723816800000,"content":"<p>by David Alejandro Sánchez-Núñez, Efraín Viloria Maestre, Mario Rueda</p>\r\n\r\nThe temporal variability of fish habitat utilization is poorly understood in tropical deltaic systems due to high water turbidity, which limits visual censuses, and to the lack of long-term data incorporating climate variability events. We aimed to assess the influence of body size and El Niño Southern Oscillation (ENSO) variability on the cross-habitat utilization rate of 14 fish species of commercial relevance in the Ciénaga Grande de Santa Marta (CGSM). We estimated the utilization of mangroves and coastal lagoons based on relative catch frequencies from encircling gillnets used within a long-term catch monitoring program, and then tested for significant changes in each species’ habitat utilization as a function of body size and climate variability. Six species showed a high dependence on mangroves and four on coastal lagoons for most body size classes (including juveniles) and ENSO conditions. One species (<i>Elops smithi</i>) showed a high utilization of mangroves in some ENSO phases and body size classes, while three species showed a high utilization of both mangroves and coastal lagoons. Mangrove utilization by six species (<i>Megalops atlanticus</i>, <i>E</i>. <i>smithi</i>, <i>Centropomus undecimalis</i>, <i>Mugil incilis</i>, <i>Mugil liza</i>, and <i>Ariopsis canteri</i>) increased in larger body sizes at low depths, which usually occurs under dry ENSO conditions, when predatory risk is higher in coastal lagoons. Another species (<i>Caquetaia kraussi</i>) increased its mangrove utilization from the body size at which its feeding habits change. Mangroves and coastal lagoons are important nurseries and habitats for adults of the main commercial fish species in the CGSM. Seascape habitats and fringe/riverine mangroves must be conserved in tropical deltas to promote not only nurseries but also fish lifecycles.","author":"David Alejandro Sánchez-Núñez","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f1031bbf3281fc61d1fc3ce9742734873d3a91261485afdb11f031eaf982c6b5","category":"Interdisciplinary"}