{"title":"รัฐ Texas เตรียมบังคับให้สถานีชาร์จ EV ต้องมีหัวชาร์จ NACS ของ Tesla ด้วย","link":"https://www.blognone.com/node/134473","date":1687357635000,"content":"<div><div><div><p>หลายคนอาจไม่รู้ว่ารถ Tesla ในสหรัฐอเมริกา, แคนาดา ใช้หัวชาร์จแบบเฉพาะของตัวเอง ในขณะที่รถ Tesla ในทวีปอื่นรวมถึงประเทศไทยใช้หัวชาร์จ CCS เป็นมาตรฐาน (อาจมียกเว้นบ้าง เช่นจีน) โดย Tesla อ้างว่าตอนที่พัฒนารถยนต์แรกๆ ไม่มีหัวชาร์จมาตรฐานใดที่รองรับการจ่ายไฟแรงสูงแบบที่ Tesla ต้องการได้ จึงต้องออกแบบหัวชาร์จเฉพาะของตนเอง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c41e31bce45824ea3ec62b1c24991cc4.jpg\" alt /></p>\n<p>ต่อมาในขณะที่โลกเลือกหัว CCS เป็นมาตรฐาน ฝั่ง Tesla ก็พยายามทำให้หัวชาร์จของตนกลายเป็นมาตรฐานหัวชาร์จในสหรัฐอเมริกาโดยการออก \"มาตรฐาน\" ในชื่อ North American Charging Standard หรือ NACS (มาตรฐานหัวชาร์จแห่งอเมริกาเหนือ) พร้อมกับเปิดให้ผู้ผลิตรถยนต์สัญชาติอเมริกันรายอื่นเข้ามาใช้ได้ และดึงดูดด้วยการที่รถจากผู้ผลิตเหล่านั้นสามารถเข้ามาใช้งานสถานี Supercharger ของ Tesla ที่มีอยู่ทั่วประเทศได้เลย ซึ่งกลยุทธ์นี้ก็ดูจะสำเร็จ เพราะ <a href=\"https://www.blognone.com/node/134028\">Ford</a>, <a href=\"https://www.blognone.com/node/134255\">GM</a> และ Rivian เพิ่งประกาศว่ารถยนต์ไฟฟ้ารุ่นใหม่จะเปลี่ยนมาใช้หัวชาร์จ NACS ตั้งแต่ปี 2025 เป็นต้นไป แม้รัฐบาล Biden จะพยายามดันหัว CCS ให้เป็นมาตรฐานของประเทศก็ตาม</p>\n<p><img alt=\"alt=&quot;IpRnHg.jpg&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/2f7ace059af3152d8df9adedd8613f40.jpg\" /><em>(จากซ้ายไปขวา) หัวชาร์จ SAE J1772, NACS, CCS2 | ภาพโดย Paul Sladen</em></p>\n<p><img alt=\"alt=&quot;IpRGGJ.png&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/1e878d6fb1f8a13d19cab500092c83fc.png\" /><em>Tesla พยายามชูว่าหัวชาร์จ NACS มีขนาดเล็กกว่ามาตรฐานอื่นมาก</em></p>\n<p>ล่าสุดรัฐ Texas สถานที่ตั้งของสำนักงานใหญ่ Tesla ได้ประกาศเตรียมบังคับสถานีชาร์จรถยนต์ไฟฟ้า DC ต้องมีหัวชาร์จ CCS และ NACS อย่างน้อยแบบละ 1 หัว นับเป็นรัฐแรกในสหรัฐอเมริกาที่ออกข้อกำหนดลักษณะนี้</p>\n<p>ในมุมหนึ่ง เรื่องนี้ถือเป็นความสำเร็จอีกขั้นของ Tesla ที่ดันหัวชาร์จของตนให้กลายเป็นมาตรฐานได้จริง แต่อีกมุมหนึ่งก็เป็นการแสดงให้เห็นว่า Tesla ไม่สนใจมาตรฐานโลก</p>\n<p>ที่มา - <a href=\"https://www.reuters.com/business/autos-transportation/texas-require-state-backed-charging-stations-include-tesla-plug-2023-06-20/\">Reuters</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/texas\">Texas</a></div><div><a href=\"/topics/tesla\">Tesla</a></div><div><a href=\"/topics/electric-car\">Electric Car</a></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f1056457d52763e508ed487feb0e8b9c8f851a2f26b679bb60e62d2bb8f29b51","category":"Thai"}