{"title":"Rocket Report: Blue Origin protests Starship, China launches space station","link":"https://arstechnica.com/?p=1761451","date":1619780422000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/51143502370_5d24896bf4_k-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/51143502370_5d24896bf4_k.jpg\">Enlarge</a> <span>/</span> The Delta IV Heavy rocket launches on April 26, 2021. Yes, it's ok that the rocket is on fire. (credit: United Launch Alliance)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 3.43 of the Rocket Report! Please note that there will be no publication of this report next week as I will be taking several days off from work beginning Wednesday. The publication will return on May 13—thank you for your patience.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Vega rocket returns to flight</strong>. It was a success for Europe’s Vega small launch vehicle on Wednesday night, carrying a next-generation imaging satellite for Airbus Defence and Space into low-Earth orbit. It is Vega’s first mission since a Nov. 16 launch failure destroyed two Earth observation satellites, <a href=\"https://spacenews.com/vega-return-to-flight-creates-competition-for-30-centimeter-satellite-imagery/\" target=\"_blank\">Space News reports</a>. An independent investigation pinned that failure on cables that were improperly connected in the upper stage of the rocket, which Italian rocket maker Avio builds.</p></div><p><a href=\"https://arstechnica.com/?p=1761451#p3\">Read 28 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1761451&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f11f1794a88f3a380140366a0fa6404040392d40c99e12afa96db2129f130ee9","category":"Tech"}