{"title":"Applying Bourdieu&#039;s Theory to Public Perceptions of Water Scarcity During El Niño: A Case Study of Santa Marta, Colombia","link":"https://www.preprints.org/manuscript/202409.0015/v1","date":1725259504000,"content":"This study investigates the sociological dimensions informing public perceptions of water scarcity during the El Niño drought period in Colombia. We conducted this study in Santa Marta, Colombia, and surveyed 405 urban and rural residents to understand their perceptions of water scarcity, management, and the impacts of the El Niño phenomenon. The survey used a Likert scale to measure responses and employed a multivariate analysis of variance to analyze the data while considering factors such as location (urban versus rural) and gender. The study results indicated that urban residents often experience an irregular water supply all year, whereas most rural respondents noted a more consistent availability of water. The perception of water scarcity also differed notably between urban and rural areas due to their different historical and cultural experiences (habitus). Urban respondents mostly recognized the presence of water, while rural perspectives were less conclusive, likely influenced by their direct access to natural water sources. Participants across various demographics consistently reported that poor management by local, regional, and national governments contributes to the water scarcity crisis, highlighting the widespread call for urgent reforms in water management policies and practices. Our research suggests that better understanding the social foundations of such perceptions using Bourdieu's concepts of social fields, habitus, and capital forms can significantly enhance water management strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f121d7fc6fd6973c32019b61dd5bc93c2b2455a23c5e2694a424e35fe007a8ab","category":"Interdisciplinary"}