{"title":"Urban demand for cooking fuels in two major African cities and implications for policy","link":"https://journals.plos.org/sustainabilitytransformation/article?id=10.1371/journal.pstr.0000077","date":1709128800000,"content":"<p>by Ipsita Das, Leonard le Roux, Richard Mulwa, Remidius Ruhinduka, Marc Jeuland</p>\r\n\r\nNearly 2.3 billion people lack access to clean cooking fuels and technologies worldwide, representing a critical failure to achieve SDG7’s cooking energy access goal. In Sub-Saharan Africa, dependence on polluting cooking fuels is particularly high, resulting in considerable environmental, health, and time-related costs. Progress in the region has been greatest in urban areas, partly because incomes are higher and alternative fuels more widely available than in rural areas, but understanding of the dynamics of urban cooking energy transitions remains limited, and reasons for the divergent paths of different cities are unclear. Our primary objective is, therefore, to understand differences in the demand for several fuels among low-income households in two contrasting cities–Nairobi, where the transition is well advanced (N = 354), and Dar es Salaam, where progress has been slower (N = 1,100). We conducted a double-bounded, dichotomous choice contingent valuation experiment to elucidate how urban households would respond to changes in cooking fuels’ prices. Our analysis shows that fuel price responses vary across the income distribution and across these cities. Willingness to pay for the most commonly used cooking fuel in Nairobi–liquefied petroleum gas–is nearly twice that in Dar es Salaam, where more households prefer charcoal. In Dar es Salaam, low-income charcoal users appear especially entrenched in their cooking fuel choice. Our results have important implications for the effectiveness of different policy tools (e.g., bans, taxes, or clean fuel subsidies), since responses to pricing policies will depend on these varying price sensitivities, as well as targeting and the readiness of the supply chain (including policy enablers of supply) to meet increased demand. In conclusion, though policies are commonly designed at the national-level, policy-makers need to understand nuances in the local demand context very well when choosing instruments that best support energy transition among their most vulnerable citizens.","author":"Ipsita Das","siteTitle":"PLOS Sustainability and Transformation","siteHash":"5acd099bb614e5ebff1e724af0cad6ab2b3ef1c50ce1616dc0b5d51f3d4a8e96","entryHash":"f123c5a1646496998c0c78ea024c02f5b3d3d69104cb5b0ff18ee4a6d2dc9664","category":"Environment"}