{"title":"Friday Sports Tech Livestream Q&A Recorded Session Available!","link":"https://www.dcrainmaker.com/2021/04/friday-sports-tech-livestream-qa-recorded-session-available.html","date":1619817630000,"content":"<p></p>\n<p>Earlier I dusted off my YouTube livestreaming brainpower, and did a <a href=\"https://www.youtube.com/watch?v=tLwHYW8rii0\">Friday evening sports tech livestream covering a slew of topics</a> in the sports tech space. From aero sensors to power meters, watches to bike computers, action cameras to drones, and pretty much everything else in between. It’s about 70 minutes long and simply me chatting live with a boatload of you.</p>\n<p>Interestingly, it’s been just over a year since the last DCR livestream, where I did a dual Alpe d’Huez ride <a href=\"https://www.youtube.com/watch?v=F7DoRoK2SYA\">side-by-side comparing Zwift and FulGaz to see how close the courses mirrored each other</a> off the same dataset concurrently. Seriously, it was kinda crazy fun – you should watch it.</p>\n<p>In any event, normally for livestreams I try and give some advance notice, but alas, I wasn’t quite sure I’d have time today. But as it became clear I still had too much to finish on the <a href=\"https://truekinetix.com/\">TrueBike</a> In-Depth Review to make it out today (coming early next week instead) – I figured I’d squeeze in an hour of sports tech geeking out and funny tidbits.  This included approximately 2,187 instances of people asking when a Fenix 7 will arrive, and 373 instances of people asking about the recent Casio WearOS watch (GSW-H1000). On the second one, that’s supposed to have been shipped from Casio, but will let ya know when it arrives.</p>\n<p>In any case – go forth and hit play. And pro tip: The stream starts at exactly the 4:00 marker. Normally I trim off the front, but as I discovered today, if I trim off the front, then you can’t see the live chat window (which, you can see if you open the YouTube video so it shows on YouTube itself). There’s tons of chatter in there from all sorts of fun sports tech YouTube people popping in to chat.</p>\n<p>With that – <a href=\"https://www.youtube.com/watch?v=tLwHYW8rii0\">go forth, hit play</a>, and have a good weekend!</p>\n<p><em>Oh, and P.S. – for DCR Supporters, I’ve quietly posted the Episode 22 of the DCR Quarantine Corner to the </em><a href=\"https://www.dcrainmaker.com/exclusives\"><em>Supporter Exclusives page</em></a><em> at the very bottom. I’ll get the usual e-mail of all the exact topics written up and sent out by the morning, but if you’re looking for the longest QC episode to date – coming in at 35 minutes long, it’s a doozy! The Girl and I chat (from the shed with beers in hand, and M&amp;M’s in a kids snack trap balanced atop a bike seat) about the backstory of losing that drone and GoPro to the canal, testing raise-to-wake watches, PCR tests to see lions., and plenty more You know, just another episode. Enjoy!</em></p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"f1291354d2999e271d1ee2bf09fa4c1723a299d08128aac5a81fc44338a60c24","category":"Cycling"}