{"title":"Frond and mesophyll traits related to photosynthetic capacity and water‐use efficiency in ferns with different life‐forms ex situ","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12934?af=R","date":1723201771000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6c899def-9ba1-4267-b96c-a5acebf10761/aab12934-toc-0001-m.png\" alt=\"Frond and mesophyll traits related to photosynthetic capacity and water-use efficiency in ferns with different life-forms ex situ\" />\n<p>We studied four fern species with different life-forms in a glasshouse. Ferns differed by mesophyll thickness and cell volume with the smallest values in a terrestrial tree and the largest ones in epiphytic herbs. Photosynthesis rate was positively related to chloroplast number per cell and per leaf area, which were higher in a terrestrial tree compared to epiphytes. Water use efficiency was higher in epiphytes and negatively linked to chloroplast number per leaf area. We concluded that increasing cell volume among the studied ferns was not associated with photosynthetic performance but related to volumetric cytoplasm–chloroplast ratio meaningful to the water-storage function of fronds.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Leaf traits are known as indicative of species functional properties in angiosperms. Fern fronds are little studied in this concern, especially ex situ. We studied leaf mesophyll structure, pigments and gas exchange in four fern species grown in a glasshouse—<i>Sphaeropteris cooperi</i> (terrestrial tree fern), <i>Phlebodium aureum</i> (semi-epiphytic herbaceous), <i>Asplenium australasicum</i> (epiphytic shrubby) and <i>Platycerium bifurcatum</i> (epiphytic herbaceous). Saturated assimilation rate (<i>A</i>\n<sub>sat</sub>) decreased and intrinsic water use efficiency (iWUE) increased from a terrestrial tree fern to epiphytic ferns. <i>A</i>\n<sub>sat</sub> positively correlated with chloroplast number (<i>N</i>\n<sub>chl</sub>/<i>A</i>) and their surface area per leaf area (<i>A</i>\n<sub>chl</sub>/<i>A</i>). iWUE negatively related to <i>N</i>\n<sub>chl</sub>/<i>A</i> and chlorophyll/carotenoid ratio. Most differences between species were found in the mesophyll thickness (MT) and mesophyll cell volume (<i>V</i>\n<sub>cell</sub>) with the smallest values in <i>S. cooperi</i> and the largest ones in <i>P. bifurcatum</i>. We found that photosynthetic limitations in ferns were related to the chloroplast photosynthetic activity rather than to <i>N</i>\n<sub>chl</sub>/<i>A</i> or pigment content which did not differ from most angiosperms. Epiphytic ferns showed larger values of <i>V</i>\n<sub>cell</sub> per cell and per chloroplast compared to angiosperms and tree ferns. We concluded that an increase in MT and <i>V</i>\n<sub>cell</sub> in the studied ferns was not associated with photosynthetic performance, but was related to volumetric cytoplasm–chloroplast ratio meaningful to light absorption and the water-storage function of fern fronds.</p>","author":"Larissa A. Ivanova, \nAlyona S. Tretyakova, \nEvgeniy Savitsky, \nPolina K. Yudina, \nLeonid A. Ivanov","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"f1388403693d33d159e4a071857228988e80ce48cf0d6a610f18854064176987","category":"Environment"}