{"title":"Innovative Approaches in Pericardiocentesis Training: A Comparative Study of 3D-Printed Mannequins and Virtual Reality Simulations","link":"https://www.preprints.org/manuscript/202408.2059/v1","date":1724980232000,"content":"Background: The CoBaTrICE initiative standardized intensive care training throughout Europe. Pericardiocentesis, an important yet infrequent operation, poses unique training challenges often unmet by conventional methods. This study evaluates the efficacy of virtual reality (VR) simulations and 3D-printed mannequins in pericardiocentesis training, both crafted from scratch using highly affordable materials and free software. Methods: Thirty-five final-year medical students participated in this prospective, quasi-experimental study. Initially, students underwent VR simulation training, followed by training using 3D-printed self-made mannequins. Learning outcomes were assessed using the Objective and Structured Clinical Examination (OSCE) questionnaire. Heart rate variability (HRV) analysis was employed to monitor stress responses, while the NASA Task Load Index (NASA-TLX) was used to gauge self-perceived difficulty. Results: Although the mannequin model induced more stress reactions, it excelled in tasks requiring fine motor skills, such as correct placement and asepsis maintenance. In contrast, lower NASA-TLX scores indicated that the VR model imposed less mental demand and effort, reflecting a reduced cognitive load. Conclusion: Both VR simulations and 3D-printed mannequins effectively taught pericardiocentesis skills, each offering distinct advantages. Mannequins enhanced fine motor skills, whereas VR reduced cognitive load and increased engagement. The combination of both approaches could maximize training outcomes, particularly in resource-constrained environments, thus broadening access to advanced simulation education.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f1393ec4c2f9677fff45bb7c0c3d2a05825fee6591e8ef060635a47177efdb3e","category":"Interdisciplinary"}