{"title":"Effects of inlet height of detention basins on fish movement to refuges during floods","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4357?af=R","date":1722339251000,"content":"<h2>Abstract</h2>\n<p>Detention basins, typically installed adjacent to rivers, prevent the rise in water levels downstream by temporarily storing river water. Furthermore, these basins potentially promote biodiversity by creating floodplains as refuges during floods. The heights of the inlet dikes, which divert river water into the basins during floods, are designed just below the flood elevation to maximise disaster prevention. However, the accessibility of these artificial basins to organisms during floods is uncertain, primarily due to the design of the inlet dikes. Herein, we experimentally examined the effect of the height of these inlets on fish entering the detention basins during floods. The Aqua Restoration Research Center created small-scale detention basins next to the experimental streams to induce artificial flooding using movable water gates. We controlled the height of the inlet boards to simulate an inlet dike and recorded the number of fishes that entered these basins during an experimental flood. The number of individuals moving into the basins increased as the height of the inlet board decreased. No fish were captured in the basins with the highest inlet board, which was set just below the experimental flood level. While the detention basin needs to be of a certain height of the inlet for effective flood control, we suggest a solution that may be possible to achieve both objectives, disaster prevention and biodiversity conservation, by altering the inlet location, with reference to a Japanese traditional flood reduction installation, the Kasumi-tei.</p>","author":"Hikaru Nakagawa, \nYuki Matsuzawa, \nAkira Nagayama, \nYoshihiro Agata, \nSeiya Okamoto, \nShinichi Masuda, \nTakao Aikawa, \nTaihei Sakamoto, \nTakanori Kono, \nKazufumi Hayashida, \nTerutaka Mori","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"f13e19c0edc78a8248db9776625a39a82a41c26944d98d8a610370621b6312b6","category":"Environment"}