{"title":"DeepDate: A deep fusion model based on whale optimization and artificial neural network for Arabian date classification","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305292","date":1722348000000,"content":"<p>by Nour Eldeen Mahmoud Khalifa, Jiaji Wang, Mohamed Hamed N. Taha, Yudong Zhang</p>\r\nPurpose <p>As agricultural technology continues to develop, the scale of planting and production of date fruit is increasing, which brings higher yields. However, the increasing yields also put a lot of pressure on the classification step afterward. Image recognition based on deep learning algorithms can help to identify and classify the date fruit species, even in natural light.</p> Method <p>In this paper, a deep fusion model based on whale optimization and an artificial neural network for Arabian date classification is proposed. The dataset used in this study includes five classes of date fruit images (Barhi, Khalas, Meneifi, Naboot Saif, Sullaj). The process of designing each model can be divided into three phases. The first phase is feature extraction. The second phase is feature selection. The third phase is the training and testing phase. Finally, the best-performing model was selected and compared with the currently established models (Alexnet, Squeezenet, Googlenet, Resnet50).</p> Results <p>The experimental results show that, after trying different combinations of optimization algorithms and classifiers, the highest test accuracy achieved by DeepDate was 95.9%. It takes less time to achieve a balance between classification accuracy and time consumption. In addition, the performance of DeepDate is better than that of many deep transfer learning models such as Alexnet, Squeezenet, Googlenet, VGG-19, NasNet, and Inception-V3.</p> Conclusion <p>The proposed DeepDate improves the accuracy and efficiency of classifying date fruits and achieves better results in classification metrics such as accuracy and F1. DeepDate provides a promising classification solution for date fruit classification with higher accuracy. To further advance the industry, it is recommended that stakeholders invest in technology transfer programs to bring advanced image recognition and AI tools to smaller producers, enhancing sustainability and productivity across the sector. Collaborations between agricultural technologists and growers could also foster more tailored solutions that address specific regional challenges in date fruit production.</p>","author":"Nour Eldeen Mahmoud Khalifa","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f1420e933e4e3dd7ff9f56dca966765c9423c183b5fa3d544850b29fcd6f7d24","category":"Interdisciplinary"}