{"title":"The 2021 BMW M3: When you’re driving it, you don’t have to see its nose","link":"https://arstechnica.com/?p=1767685","date":1622035885000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/5-2-980x653.jpg\" /></div>\n        <p>\n          Yes, the grille is divisive, but you can't see it when you're driving the car.                   </p>\n        </div>\n      </li>\n      </ul><p>I have a confession to make. Over the past few months of gazing at images in wide-eyed awe and after spending a week with the new sixth-generation M3 in the flesh, I've grown accustomed to the look. The front end no longer stuns and confuses me; it's simply the new M3. While that's not exactly a ringing endorsement for the design, I'd like to think that it offers a semblance of hope: with time, you can see past the face.</p>\n<p>More importantly, this new M car is notable for more than just its schnoz—there's a reason the M3 has long been the benchmark by which all other luxury sports sedans are measured. Decades ago, the M3 helped establish the template for the everyday performance machine with a masterful blend of capability, comfort, and style. The mission remains much the same today, but the stakes are higher than ever.</p>\n<p>Starting at $70,895 and coming in at $90,295 as tested, this “base” M3 packs formidable performance cred, dishing out 473 hp (353 kW) and 406 lb-ft (550 Nm) of torque by way of the twin-turbocharged 3.0L S58 inline six-cylinder engine under the hood, and that boosted mill sends the power to the rear wheels through a six-speed manual transmission and an electronically controlled limited-slip differential. Spring for the Competition package and output jumps to 503 hp (375 kW) and 479 lb-ft (650 Nm), but it comes with the caveat that it can only be had with an eight-speed automatic transmission.</p></div><p><a href=\"https://arstechnica.com/?p=1767685#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1767685&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f145c5394b506d3c67b060cba7a89a85a4ada8be91444ba2dba07fcb2ed80c41","category":"Tech"}