{"title":"The Continuing Bizarre Decline in Science Reporting at The New York Times","link":"https://www.nytimes.com/2021/10/06/health/covid-vaccine-children-dose.html?searchResultPosition=1","date":1633994400000,"content":"\n<p>From an editors’ note appended to a New York Times report over the weekend, about COVID-19 vaccinations for children:</p>\n\n<blockquote>\n  <p>An earlier version of this article incorrectly described actions\ntaken by regulators in Sweden and Denmark. They have halted use of\nthe Moderna vaccine in children; they have not begun offering\nsingle doses. The article also misstated the number of Covid\nhospitalizations in U.S. children. It is more than 63,000 from\nAugust 2020 to October 2021, not 900,000 since the beginning of\nthe pandemic.</p>\n</blockquote>\n\n<p>The report is from Apoorva Mandavilli, the reporter who replaced longtime science report Donald J. McNeil on the Times’s COVID beat — the same reporter who last month <a href=\"https://daringfireball.net/linked/2021/09/11/decline-of-nyt-covid-reporting\">approvingly quoted an epidemiologist who was against booster shots for adults</a> on the nonsensical grounds that “the added benefit may be minimal — and obtained just as easily by wearing a mask, or avoiding indoor dining and crowded bars.”</p>\n\n<p>The difference between 63,000 and 900,000 hospitalized children is not a small error — it’s more than an order of magnitude difference. If nearly a million U.S. children had been hospitalized from COVID-19, our entire perception of this pandemic would be fundamentally different. How did this error even make it past editing? It’s not even a remotely plausible figure given our lived experience of this pandemic.</p>\n\n<p>Here’s a good example of how mind-boggling this error is. The median household income in the U.S. <a href=\"https://www.census.gov/library/publications/2021/demo/p60-273.html\">is about $68,000</a>. Imagine if The New York Times ran a story about economic policy which stated that the average household income in the U.S. was $900,000. That’s preposterous. Yet that’s exactly how bad the science reporting at the Times has gotten — an error of that magnitude regarding a crucial COVID statistic went into print.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/10/11/continuing-bizarre-decline-in-science-reporting-at-nyt\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"f14676b137effa9a865d7ba21bce2b0d403a3900316c8fb46ea4649907f3c22a","category":"Tech"}