{"title":"[ลือ] Apple ปรับลดยอดการผลิต AirPods หลังความต้องการลด ขายได้ไม่ถึงเป้าในปี 2020","link":"https://www.blognone.com/node/122425","date":1619676368000,"content":"<div><div><div><p>Nikkei Asian Review ระบุข้อมูลจากแหล่งข่าวในวงการอุตสาหกรรมที่ไม่เปิดเผยตัวตน ว่า Apple เตรียมปรับลดอัตราการผลิต AirPods ในปี 2021 ลงราว 25-30% จากเป้าเดิมที่เตรียมผลิต 110 ล้านชิ้น เหลือ 75-85 ล้านชิ้น หลังความต้องการปี 2020 ไม่แรงเท่าที่ Apple คาดหวังไว้ โดย AirPods ทำยอดขายได้ 72.8 ล้านชิ้นในปี 2020 น้อยกว่ายอดสั่งผลิตจาก Apple ที่ราว 80-90 ล้านชิ้น ทำให้มีสินค้าคงเหลือข้ามปีมากขึ้น</p>\n<p>หนึ่งในสาเหตุหลักอาจมาจากวิกฤต COVID-19 ที่ทำให้เศรษฐกิจย่ำแย่ เพราะแม้ Apple จะเป็นผู้บุกเบิกตลาด แต่ในช่วงปีที่ผ่านมา เริ่มมีแบรนด์ต่างๆ หันมาทำหูฟัง TWS กันมากขึ้น และผู้ใช้อาจหันไปซื้อหูฟังไร้สายแบรนด์อื่นที่มีราคาถูกกว่าและใช้แทนกันได้เมื่อเศรษฐกิจไม่ดี ทำให้ส่วนแบ่งตลาดของ Apple จาก <a href=\"https://www.counterpointresearch.com/true-wireless-hearables-market-beats-expectations-2019-apple-continue-dominating-2020/\">41% ในไตรมาสที่ 4 ของปี 2019</a> ลดลงเหลือ<a href=\"https://www.counterpointresearch.com/tws-drives-2020-wearables-growth-smartwatches-add-momentum-2021/\">เพียง 29% ในไตรมาสที่ 3 ของปี 2020</a></p>\n<p>AirPods ที่มีราคาแพงกว่าหูฟังแบรนด์อื่น จึงไม่ได้มียอดขายที่เพิ่มขึ้นมากนัก เมื่อเทียบกับอุปกรณ์อื่นๆ ของ Apple เช่น iPad หรือ Macbook ที่มียอดขายเพิ่มขึ้นในปี 2020 จากการที่บริษัทต่างๆ หันมาทำงานจากบ้าน และระบบอีโค่ซิสเท็มของ Apple ทำให้เป็นเรื่องยากที่ผู้ใช้จะใช้คอมพิวเตอร์แบรนด์อื่น หรือระบบปฏิบัติการอื่นมาทดแทน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1e8bbb8c9a7c2e04d2d25c43e7a2fa80.png\" /></p>\n<p>อีกความเป็นไปได้นอกจากดีมานด์ที่ลดลง คือการลดยอดการผลิต AirPods รุ่นปัจจุบัน อาจเป็นอีกสัญญาณว่า Apple กำลังเตรียมการออก AirPods รุ่นใหม่ภายในปี 2021 ตามที่มี<a href=\"https://www.blognone.com/node/119252\">ข่าวลือก่อนหน้านี้</a> และยอดการผลิตอาจถูกแบ่งไปยัง AirPods รุ่นใหม่นี้เพิ่มขึ้นแทน</p>\n<p>ที่มา - <a href=\"https://asia.nikkei.com/Business/Technology/Apple-trims-AirPods-production-plans-as-sales-lose-steam\">Nikkei Asia</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/airpods\">AirPods</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f159faf246d3c4a564d7d24f02ebcd66122f45e623d65c47c659310487dde2b4","category":"Thai"}