{"title":"Rumors and retail listings point to the return of actual mid-range GPUs","link":"https://arstechnica.com/?p=1938525","date":1683823494000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/IMG_0990-800x533.jpeg\" alt=\"Nvidia's RTX 4080 and 4070 could finally be getting some more reasonably priced relatives.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/IMG_0990.jpeg\">Enlarge</a> <span>/</span> Nvidia's RTX 4080 and 4070 could finally be getting some more reasonably priced relatives. (credit: Andrew Cunningham)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>There are two kinds of GPUs you can buy right now if you want to build or upgrade a gaming PC: affordable but old ones and new but expensive ones. Both Nvidia and AMD have been leaning on older products, sometimes with price cuts, to fill the very large gaps in the middle and low ends of their current lineups. But a slowly building buzz of rumors and leaks suggests things should change before long.</p>\n<p><a href=\"https://videocardz.com/newz/nvidia-geforce-rtx-4060-ti-8gb-to-launch-on-may-24th-a-day-before-radeon-rx-7600\">A source speaking to VideoCardz dot com</a> says there are <em>three</em> GeForce RTX 4060-series GPUs coming in the next couple of months, starting with an 8GB version of the 4060 Ti that could be announced as soon as next week and released by the end of the month. A 16GB version of the 4060 Ti and an 8GB version of the 4060 could be announced at the same time but launch at some point in July (Nvidia used the same simultaneous-announcement, staggered-release strategy for the 4090 and 4080 series).</p>\n\n<p>It's not surprising that the 4060 Ti looks like a big step down from the recently released <a href=\"https://arstechnica.com/gadgets/2023/04/rtx-4070-review-an-ideal-gpu-for-anyone-who-skipped-the-graphics-card-shortage/\">RTX 4070</a>—4,352 CUDA cores instead of 5,888, a 128-bit memory bus instead of 192-bit, 8GB instead of 12GB. But it also looks less-than-promising as a step up from 2020's RTX 3060 Ti, which used a 256-bit memory bus, 4,864 CUDA cores, and the same amount of RAM. Extra cache memory, higher clock speeds, and the updated Ada Lovelace architecture should all make the 4060 Ti faster than the 3060 Ti in the end, but it may not be a huge generational leap.</p></div><p><a href=\"https://arstechnica.com/?p=1938525#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1938525&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f1645d3f5600a546834be7490222de284b95aebce3b3672f8c31f278b19ed6ea","category":"Tech"}