{"title":"I Absorb Things Better at Speed: Fail 4 Migration Gravel Race Teaser – Ryan Le Garrec","link":"https://theradavist.com/2021/06/i-absorb-things-better-at-speed-fail-4-migration-gravel-race-teaser/?utm_source=rss&utm_medium=rss&utm_campaign=i-absorb-things-better-at-speed-fail-4-migration-gravel-race-teaser","date":1625056219000,"content":"<p><em>One of our contributors, Ryan Le Garrec, just took part in the Migration Gravel Race last week in Kenya. It is a 650 km off-road stage race with 8000 meters climbing in the Massai Mara. The grueling but rewarding course attracted lots of riders from all over the world. Among them was Unbound winner and second, Ian Boswell and Laurens Ten Dam. But more importantly, the race took pride in featuring local talents, riders from Kenya, Uganda, and Rwanda.</em></p>\n<p>The race organization wants to have an impact on African cyclists representation in gravel and road races around the world.<span></span></p>\n<p>By confronting international talents to come and race with them, but also sending those African riders to races in America and Europe. Thanks to projects like the Amani Team and the Masaka Cycling club, they have already managed to make an impact.</p>\n<p>A big impact.</p>\n<p>More on that later with an in-depth article by Ryan.</p>\n<p>But here is a teaser of what’s to come:</p>\n<p>Ryan also started a new series project called “Fail, fail again, fail better.”<br />\nIn which he sets himself for a challenge every month and documents his failing attempt.<br />\nThis was to be episode 4 already and we will have more of the previous episodes in the coming weeks.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DSC05607-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>23rd June 06:04</p>\n<p>“Am the last guy to start, I rush myself to the start line, I have way too many bags on my bike,<br />\nit looks like am going touring or bike packing, not gravel racing,<br />\nam still pinning my number as I jump on the bike when I hear James wondering why I don’t have a helmet on,<br />\n“Ryan, where is your helmet mate?!”<br />\nI rush back to the camp to get my helmet.<br />\nNeedless to say, I am beyond nervous about taking part in the gravel race this is set up to be.<br />\nI have about 10km of gravel experience and I once rode in the mud for about 5 meters.<br />\nyou’ll be fine, just don’t burn too many cartridges on the first day is what Mikel told me before the start.<br />\nI guess he understood I was nervous when I asked him how we do scratch off this race.”</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DSC05556-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>27th June 07:05</p>\n<p>Ian Boswell (ex-pro at Sky and Katusha)</p>\n<p>“I think what I learned here is that bicycles and humans are much more resilient than we think. I think, growing up in the US, you have this very narrow mind about what a bicycle should do, where it can go, how it should work, and everything and I think the biggest thing I have learned is that we shouldn’t complain as much as we do when it comes to the road or the conditions or just the adversity that we face. Seeing some of the African riders and what they did to be able to finish yeah it’s inspiring. Coming from a pro background you know, you want everything to be perfect, the bike should shift and brake, everything should be working perfectly, you complain if it’s not. These guys don’t complain, they just get on with it and keep on riding, it’s very inspiring to see.”</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DSC05559-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>25th June 11:17</p>\n<p>Duncan (Massai in charge of our security during the race but also at night in camp)</p>\n<p>“We live in harmony with all the animals yes.<br />\nNo, we don’t fear lions or elephants or rhinos.<br />\nThere is only one animal we are scared of and that’s the buffalo,<br />\nyou can’t trust the buffalo, he always charges, no matter what.<br />\nThe lions and other cats recognize us.<br />\nBecause we dress the same since always, they know, red massai is danger.<br />\nIn the old days, when we were to become adults, we had to leave the camp,<br />\nwe had to go and kill a lion.<br />\nNow we don’t do that anymore.<br />\nActually, I am now working in conservation,<br />\nI make sure the relationship between the massai and the animals is always good,<br />\nespecially during the migrations,<br />\ncause if a lion eats a massai cow, there will be retaliation<br />\nand then it is a problem.<br />\nFor example, when I was a kid, there was a lion that came to eat one of the cows,<br />\nthe massai went at him and throw lots of stones and attack the lion, he ran away.<br />\nThat evening, the lion came back with other lions, but the massai were waiting for that…<br />\nBut yes we live in harmony with all the animals, we love them all.<br />\nExcept the buffalo. The buffalo is stupid. He always charges.”</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DSC05693-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>21st June 12:05</p>\n<p><em>Two days prior to the race<br />\nBreakfast<br />\nHotel lobby<br />\nI am feeling out of place<br />\nI don’t even dare to build my bike out of the box<br />\nwhat if I have a mechanical<br />\nit will just add up stress to fix it now<br />\nI don’t wanna go out of the hotel<br />\nam not ready for African town bustle<br />\nam feeling out of place<br />\nI see everyone wearing their kit<br />\ngoing for rides<br />\nlooking sharp<br />\nfresh<br />\npro<br />\nam slightly hangover<br />\nI rolled a cigarette<br />\nthis must be my 25th coffee<br />\nam feeling out of place.</em></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DSC06640-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>23rd June afternoon-ish</p>\n<p>Shariff and I end up riding together battling a mind-breaking headwind,<br />\nCate tags along, Elsie scratches and get on the sweeper bus,<br />\nthere were a few other scratches today<br />\nand a lot of mechanicals<br />\nthe first day breaks a lot of people and even more bikes.<br />\nShariff does a lot of the work, pulling us<br />\nI take a turn,<br />\ntoo long for me.<br />\nI will end the last 20 km on my own, leaving them ride away.<br />\nShariff is riding at our pace (“party pace wins the race’ as he says)<br />\ncause he has to stop every now and then and explore bushes to deliver himself,<br />\nthe black tea had the wrong milk or something<br />\nWhen I pass the line a little bit later than him,<br />\nhe’s there waiting for me with a beer and a smoke<br />\n“you know there is no word for stranger in the massai language”<br />\nShariff is definitely the kind of journalist I love<br />\nHe had a knack for getting the priceless piece of info that will elevate his story<br />\nit elevates mine and I give more attention to the mass taking care of our security.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DSC06654-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>27th June 07:05</p>\n<p>Ian Boswell (ex-pro at Sky and Katusha)</p>\n<p><em>“I absorb things better at speed.”</em></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"f16db915d7d4f0e30753e8b8d4be797bf059e775f2bff6581fe28c92f43d20ea","category":"Cycling"}