{"title":"Protein kinase SnRK2.6 phosphorylates transcription factor bHLH3 to regulate anthocyanin homeostasis during strawberry fruit ripening","link":"https://academic.oup.com/jxb/article/75/18/5627/7684491?rss=1","date":1716940800000,"content":"<span><div>Abstract</div>Strawberry (<span>Fragaria</span> × <span>ananassa</span>) is a model plant for studying non-climacteric fruit ripening regulated by abscisic acid (ABA); however, the signaling of ABA in the regulation of fruit coloration is not fully understood. In this study, we identified the transcription factor BASIC HELIX-LOOP-HELIX 3 (bHLH3) as being key to fruit coloration via yeast two-hybrid library screening using the bait SUCROSE NONFERMENTING 1 (SNF1)-RELATED PROTEIN KINASE 2 (SnRK2.6), which is a core ABA signaling component that negatively regulates ripening. The interaction was also confirmed by firefly luciferase complementation assays and pull-down assays. RT-qPCR and western blot analysis confirmed that bHLH3 is expressed ubiquitously in strawberry tissues, and it is expressed stably during fruit development. Overexpression and RNAi of both <span>bHLH3</span> and <span>SnRK2.6</span> demonstrated that bHLH3 and SnRK2.6 promote and inhibit strawberry fruit coloration, respectively. Using EMSAs, we showed that bHLH3 promotes the expression of <span>UDP-GLUCOSE: FLAVONOL-O-GLUCOSYLTRANSFERASE</span> (<span>UFGT</span>), a key gene for anthocyanin biosynthesis, by directly binding to its promoter. We determined that SnRK2.6 can phosphorylate bHLH3 and that this inhibits its binding to the <span>UFGT</span> promoter, consequently suppressing expression. Altogether, we propose that increased ABA content during strawberry fruit ripening leads to decreased expression of <span>SnRK2.6</span>, which in turn releases the phosphorylation of bHLH3 and thereby enhances <span>UFGT</span> expression, ultimately promoting the coloration of the fruit.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"f1725aa97bc54953280940e039f7154b60a03a50905d1bc36406a79fd0c18de2","category":"Environment"}