{"title":"Reimagine Software Development With CodeWhisperer as Your AI Coding Companion","link":"https://aws.amazon.com/blogs/aws/reimagine-software-development-with-codewhisperer-as-your-ai-coding-companion/","date":1689782133000,"content":"<p><em><strong>July 19, 2023</strong>: Post updated with an animated image to show Amazon CodeWhisperer in action.</em></p> \n<p>In the few months since <a href=\"https://aws.amazon.com/codewhisperer/?trk=a325eb01-2134-4258-a88b-ffc101a7b548&amp;sc_channel=sm\">Amazon CodeWhisperer</a> <a href=\"https://aws.amazon.com/blogs/aws/amazon-codewhisperer-free-for-individual-use-is-now-generally-available/\">became generally available</a>, many customers have used it to simplify and streamline the way they develop software. CodeWhisperer uses generative AI powered by a foundational model to understand the semantics and context of your code and provide relevant and useful suggestions. It can help build applications faster and more securely, and it can help at different levels, from small suggestions to writing full functions and unit tests that help decompose a complex problem into simpler tasks.</p> \n<p>Imagine you want to improve your code test coverage or implement a fine-grained authorization model for your application. As you begin writing your code, CodeWhisperer is there, working alongside you. It understands your comments and existing code, providing real-time suggestions that can range from snippets to entire functions or classes. This immediate assistance adapts to your flow, reducing the need for context-switching to search for solutions or syntax tips. Using a code companion can enhance focus and productivity during the development process.</p> \n<p>When you encounter an unfamiliar API, CodeWhisperer accelerates your work by offering relevant code suggestions. In addition, CodeWhisperer offers a comprehensive code scanning feature that can detect elusive vulnerabilities and provide suggestions to rectify them. This aligns with best practices such as those outlined by the <a href=\"https://owasp.org\">Open Worldwide Application Security Project (OWASP)</a>. This makes coding not just more efficient, but also more secure and with an increased assurance in the quality of your work.</p> \n<p>CodeWhisperer can also flag code suggestions that resemble open-source training data, and flag and remove problematic code that might be considered biased or unfair. It provides you with the associated open-source project’s repository URL and license, making it easier for you to review them and add attribution where necessary.</p> \n<p>Here are a few examples of CodeWhisperer in action that span different areas of software development, from prototyping and onboarding to data analytics and permissions management.</p> \n<p><span><strong>CodeWhisperer Speeds Up Prototyping and Onboarding<br /> </strong></span>One customer using CodeWhisperer in an interesting way is <a href=\"https://www.buildstr.com\">BUILDSTR</a>, a consultancy that provides cloud engineering services focused on platform development and modernization. They use Node.js and Python in the backend and mainly React in the frontend.</p> \n<p>I talked with Kyle Hines, co-founder of BUILDSTR, who said, “leveraging CodeWhisperer across different types of development projects for different customers, we’ve seen a huge impact in prototyping. For example, we are impressed by how quickly we are able to create templates for <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a> functions interacting with other AWS services such as <a href=\"https://aws.amazon.com/dynamodb/\">Amazon DynamoDB</a>.” Kyle said their prototyping now takes 40% less time, and they noticed a reduction of more than 50% in the number of vulnerabilities present in customer environments.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/19/codewhisperer-lambda-handler-python.gif\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/19/codewhisperer-lambda-handler-python.gif\" alt=\"Code generated for an AWS Lambda function handler.\" width=\"1644\" height=\"646\" /></a></p> \n<p>Kyle added, “Because hiring and developing new talent is a perpetual process for consultancies, we leveraged CodeWhisperer for onboarding new developers and it helps BUILDSTR Academy reduce the time and complexity for onboarding by more than 20%.”</p> \n<p><span><strong>CodeWhisperer for Exploratory Data Analysis<br /> </strong></span><a href=\"https://aws.amazon.com/developer/community/heroes/wendy-wong/\">Wendy Wong</a> is a business performance analyst building data pipelines at <a href=\"https://www.service.nsw.gov.au\">Service NSW</a> and agile projects in AI. For her contributions to the community, she’s also an <a href=\"https://aws.amazon.com/developer/community/heroes/?community-heroes-all.sort-by=item.additionalFields.sortPosition&amp;community-heroes-all.sort-order=asc&amp;awsf.filter-hero-category=*all&amp;awsf.filter-location=*all&amp;awsf.filter-year=*all&amp;awsf.filter-activity=*all\">AWS Data Hero</a>. She says Amazon CodeWhisperer has significantly accelerated her exploratory data analysis process, when she is analyzing a dataset to get a summary of its main characteristics using statistics and visualization tools.</p> \n<p>She finds CodeWhisperer to be a swift, user-friendly, and dependable coding companion that accurately infers her intent with each line of code she crafts, and ultimately aids in the enhancement of her code quality through its best practice suggestions.</p> \n<p>“Using CodeWhisperer, building code feels so much easier when I don’t have to remember every detail as it will accurately autocomplete my code and comments,” she shared. “Earlier, it would take me 15 minutes to set up data preparation pre-processing tasks, but now I’m ready to go in 5 minutes.”</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/18/codewhisperer-exploratory-data-analysis-jupyter-notebook.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/18/codewhisperer-exploratory-data-analysis-jupyter-notebook-1024x766.png\" alt=\"Screenshot of exploratory data analysis using Amazon CodeWhisperer in a Jupyter notebook.\" width=\"1024\" height=\"766\" /></a></p> \n<p>Wendy says she has gained efficiency by delegating these repetitive tasks to CodeWhisperer, and <a href=\"https://dev.to/aws-heroes/imagine-and-create-get-started-with-generative-ai-on-aws-part-1-40ba\">she wrote a series of articles</a> to explain how to use it to simplify exploratory data analysis.</p> \n<p>Another tool used to explore data sets is SQL. Wendy is looking into how CodeWhisperer can help data engineers who are not SQL experts. For instance, she noticed they can just ask to “write multiple joins” or “write a subquery” to quickly get the correct syntax to use.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/18/codewhisperer-sql-queries-examples.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/18/codewhisperer-sql-queries-examples-1024x501.png\" alt=\"Asking Amazon CodeWhisperer to generate SQL syntax and code.\" width=\"1024\" height=\"501\" /></a></p> \n<p><span><strong>CodeWhisperer Accelerates Testing and Other Daily Tasks<br /> </strong></span>I had the opportunity to spend some time with software engineers in the<a href=\"https://aws.amazon.com/developer/\"> AWS Developer Relations</a> Platform team. That’s the team that, among other things, builds and operates the <a href=\"https://community.aws\">community.aws</a> website.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/18/codewhisperer-aws-community-website.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/18/codewhisperer-aws-community-website-1024x554.png\" alt=\"Screenshot of the community.aws website, built and operated by the AWS Developer Relations Platform team with some help from Amazon CodeWhisperer.\" width=\"1024\" height=\"554\" /></a></p> \n<p>Nikitha Tejpal’s work primarily revolves around TypeScript, and CodeWhisperer aids her coding process by offering effective autocomplete suggestions that come up as she types. She said she specifically likes the way CodeWhisperer helps with unit tests.</p> \n<p>“I can now focus on writing the positive tests, and then use a comment to have CodeWhisperer suggest negative tests for the same code,” she says. “In this way, I can write unit tests in 40% less time.”</p> \n<p>Her colleague, Carlos Aller Estévez, relies on CodeWhisperer’s autocomplete feature to provide him with suggestions for a line or two to supplement his existing code, which he accepts or ignores based on his own discretion. Other times, he proactively leverages the predictive abilities of CodeWhisperer to write code for him. “If I want explicitly to get CodeWhisperer to code for me, I write a method signature with a comment describing what I want, and I wait for the autocomplete,” he explained.</p> \n<p>For instance, when Carlos’s objective was to check if a user had permissions on a given path or any of its parent paths, CodeWhisperer provided a neat solution for part of the problem based on Carlos’s method signature and comment. The generated code checks the parent directories of a given resource, then creates a list of all possible parent paths. Carlos then implemented a simple permission check over each path to complete the implementation.</p> \n<p>“CodeWhisperer helps with algorithms and implementation details so that I have more time to think about the big picture, such as business requirements, and create better solutions,” he added.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/18/codewhisperer-method-signature-comment.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/18/codewhisperer-method-signature-comment.png\" alt=\"Code generated by CodeWhisperer based on method signature and comment.\" width=\"1174\" height=\"610\" /></a></p> \n<p><span><strong>CodeWhisperer is a Multilingual Team Player<br /> </strong></span>CodeWhisperer is polyglot, supporting code generation for 15 programming languages: Python, Java, JavaScript, TypeScript, C#, Go, Rust, PHP, Ruby, Kotlin, C, C++, Shell scripting, SQL, and Scala.</p> \n<p>CodeWhisperer is also a team player. In addition to Visual Studio (VS) Code and the JetBrains family of IDEs (including IntelliJ, PyCharm, GoLand, CLion, PhpStorm, RubyMine, Rider, WebStorm, and DataGrip), CodeWhisperer is also available for <a href=\"https://jupyter.org/\">JupyterLab</a>, in <a href=\"https://aws.amazon.com/cloud9/\">AWS Cloud9</a>, in the <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a> console, and in <a href=\"https://aws.amazon.com/pm/sagemaker/\">Amazon SageMaker Studio</a>.</p> \n<p>At AWS, we are committed to helping our customers transform responsible AI from theory into practice by investing to build new services to meet the needs of our customers and make it easier for them to identify and mitigate bias, improve explainability, and help keep data private and secure.</p> \n<p><strong>You can use <a href=\"https://aws.amazon.com/codewhisperer/?trk=a325eb01-2134-4258-a88b-ffc101a7b548&amp;sc_channel=sm\">Amazon CodeWhisperer</a> for free in the Individual Tier. See <a href=\"https://aws.amazon.com/codewhisperer/pricing/?trk=a325eb01-2134-4258-a88b-ffc101a7b548&amp;sc_channel=sm\">CodeWhisperer pricing</a> for more information. To get started, <a href=\"https://aws.amazon.com/codewhisperer/resources/#Getting_started/?trk=a325eb01-2134-4258-a88b-ffc101a7b548&amp;sc_channel=sm\">follow these steps.</a></strong></p> \n<p>— <a href=\"https://twitter.com/danilop\">Danilo</a></p>","author":"Danilo Poccia","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"f17f55356c59f4cf22f5bdf89b77b714c634f8752d6504adf684a6c0f49cff73","category":"Tech"}