{"title":"Daily Telescope: How small can the smallest star be?","link":"https://arstechnica.com/?p=1990921","date":1702558858000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Star_Cluster_IC_348_NIRCam_image-800x1072.jpg\" alt=\"This image from the NIRCam on the James Webb Space Telescope shows the central portion of the star cluster IC 348.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Star_Cluster_IC_348_NIRCam_image-scaled.jpg\">Enlarge</a> <span>/</span> This image from the NIRCam on the James Webb Space Telescope shows the central portion of the star cluster IC 348. (credit: NASA, ESA, CSA, STScI, and K. Luhman and C. Alves de Oliveira)</p>  </figure>\n\n\n\n\n      <p><em>Welcome to the <a href=\"https://arstechnica.com/tag/daily-telescope/\">Daily Telescope</a>. There is a little too much darkness in this world and not enough light, a little too much pseudoscience and not enough science. We'll let other publications offer you a daily horoscope. At Ars Technica, we're going to take a different route, finding inspiration from very real images of a universe that is filled with stars and wonder.</em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<p>Good morning. It's December 14, and today we're traveling about 1,000 light-years from Earth to a star cluster in the constellation Perseus. Astronomers using the James Webb Space Telescope have looked there as part of their search to answer a simple question: How small can a star be?</p>\n<p>Webb is an ideal tool for such a search because the smallest stars—brown dwarfs, which emit light from the fusion of deuterium—are most visible in infrared light. Astronomers focused on this star cluster, IC 348, because it is young and should have new brown dwarfs. Such small stars emit the most light when they're young, so the smallest stars would be at the most visible point of their lifetime.</p></div><p><a href=\"https://arstechnica.com/?p=1990921#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1990921&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f184e75bfee9ac4928b7b4b8af62f28cd2fdad19a6243b800a93d91362dbb45c","category":"Tech"}