{"title":"Albion Zoa collection is designed for adventures on and off the bike","link":"https://www.bikeradar.com/news/albion-zoa-collection-2022/","date":1636559535000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Albion-zoa-lifestyle-541893b.jpg?quality=90&amp;resize=620,413\" />                                            <p>Albion has just released a new collection called Zoa, which includes pieces of kit with features that extend their use beyond cycling.</p>\n<p>The Zoa range consists of three items: an insulated jacket, a rain shell and a ‘burner’, which resembles a scarf.</p>\n<p>Albion has previously released products under the Zoa name, but this new collection uses materials from the fabric company Pertex.</p>\n<p>Pertex is said to be a world leader in lightweight and durable technical fabrics. It has partnered with the likes of Patagonia and North Face and its fabrics use recycled yarns.</p>\n<p>This is the first time a cycling brand will have used Pertex’s Shield Air fabric, a breathable three-layer material said to be designed for intense activity.</p>\n<p>Graeme Raeburn, lead designer at Albion, says “Zoa products answer a direct need for cycling-specific clothing geared towards the outdoors and adventure, and feature a number of considered details to make time spent on or off the bike using them easier and more comfortable.”</p>\n<h2>Zoa Insulated Jacket</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Insulated Jacket uses Pertex Quantum and Primaloft insulation.</span></figcaption><span> <i>Albion</i></span></div>\n<p>Albion says the Zoa Insulated Jacket is suitable as an outer- or mid-layer jacket.</p>\n<p>The jacket uses a sandwich of recycled fabrics: PrimaLoft Gold Eco insulation in the middle with Pertex Quantum fabric on the outside and inside.</p>\n<p>Albion says the Pertex Quantum uses thin yarns and has a tight weave, trapping air better and maximising the effectiveness of the PrimaLoft insulation. Quantum also has a durable water repellent coating, which should provide extra protection in light rain.</p>\n<div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Albion-zoa-insulated-jacket-4-0e93f28.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>You put your helmet straps through the hood eyelets. </span>\n    </figcaption><span>\n                    <i>Albion </i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Albion-zoa-insulated-jacket-2-96c7ed8.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The jacket’s cut is said to be suitable for on-bike and off-bike activities. </span>\n    </figcaption><span>\n                    <i>Albion</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<p>Albion has equipped the Zoa Insulated Jacket with plenty of zippered pockets. There are two hand-warming pockets, a chest pocket and a rear pocket that doubles as a stuff sack. Albion says when the jacket packet is packed down into the stuff sack, it can double as a pillow.</p>\n<p>It’s not just plenty of pockets that make the Zoa Insulated Jacket stand out from more traditional cycling mid-layers. The jacket’s fit is said to be suitable for off- and on-bike use, plus it has a hood with eyelets for helmet straps.</p>\n<p>The jacket is available in black, orange or black and orange. It costs £185.</p>\n<h2>Zoa Rain Shell</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The three-layer fabric from Pertex is said to be suitable for high-intensity activity.</span></figcaption><span> <i>Albion</i></span></div>\n<p>The Zoa Rain Shell uses Pertex Shield Air Fabric throughout the main body of the garment.</p>\n<p>Some <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-jackets-for-cyclists/\">cycling rain jackets</a> opt for two-layer fabrics to keep breathability levels high. But despite Shield Air using three layers, it’s said to be suitable for intense activity.</p>\n<p>There are a number of pockets on the jacket, and the side pockets have a mesh liner so they can be unzipped for ventilation.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Albion-zoa-rain-shell-3-352e662.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Close-up of hood and shoulder of Albion Rain Shell Jacket with water beading on the fabric.</span>\n    </figcaption><span>\n                    <i>Albion </i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Albion-zoa-rain-shell-2-0b9695a.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The jacket comes in black, orange or a black and orange colourway. </span>\n    </figcaption><span>\n                    <i>Albion</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nThe hood can be worn over a helmet, and it has a drawcord to create a closer fit if you’re wearing the jacket without a helmet.\n<p>The cuffs of the jacket have zips that extend up the arm and the design is said to be good for on-bike use, as well as providing ventilation if needed.</p>\n<p>Reflective trim completes the jacket and, like the Zoa Insulated Jacket, it’s available in black, orange or a combined black and orange colourway. The Zoa Rain Shell costs £260.</p>\n<h2>Zoa Burner</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Zoa Burner resembles a scarf.</span></figcaption><span> <i>Albion</i></span></div>\n<p>This isn’t the first time Albion has used the term Burner to describe an accessory.</p>\n<p>While the brand’s previous <a href=\"https://www.bikeradar.com/features/albion-burner/\">Burner</a> was a rectangle that mimicked the old trick of stuffing a newspaper down a jersey for warmth, the Zoa Burner looks more like a scarf.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Burner can be packed down into its own stuff sack.</span></figcaption><span> <i>Albion</i></span></div>\n<p>The new Burner uses the same combination of Primaloft Gold Eco insulation and Pertex Quantum fabric as the Zoa Insulated Jacket. It has a built-in stuff sack and weighs 50g.</p>\n<p>The burner is available in black or orange and costs £35.</p>\n<p> </p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f18461aa3233c197836cacd4ff259b05a9bc7b620fea65c0e3ba2311bf76a8a4","category":"Cycling"}