{"title":"An Efficient Placement Approach of Visual Sensors Under Observation Redundancy and Communication Connectivity Constraints","link":"https://www.preprints.org/manuscript/202404.0009/v1","date":1711961956000,"content":"Visual Sensor Networks (VSNs) have been the focus of numerous studies, emphasizing the quality of the information they generate. The primary goal of these networks is to capture data from an area, extract the pertinent information from the visual scene, and facilitate communication. However, the presence of objects in the study area can impacted the network's efficiency, linking the quality of acquired data directly to the positioning of the cameras. Strategically positioning multiple cameras in a potentially complex area, while ensuring effective communication between nodes, presents a challenging issue in VSNs applications. This paper introduces a specific method to enhance the deployment of visual sensors in indoor environments. The research addresses the theme of multi-objective optimization of VSN deployment, integrating various criteria: maximizing overall visual coverage, maximizing the observation of zones of interest, maximizing observation redundancy of zones of interest and ensuring communication connectivity for data transfers. To tackle this problem, we simulate the observed environment incorporating cameras, obstacles, and considering zones of interest. Camera positioning is performed while considering visual constraints and the scene's characteristics. The quality of positioning is evaluated based on the defined objective functions. Initially, a comparative study is conducted with a state-of-the-art approach, integrating the first three objective functions. Subsequently, we incorporate the fourth objective function to ensure data transfers. The proposed method demonstrates efficient camera network deployments in indoor areas, considering global coverage and observation redundancy. In contrast to the state-of-the-art, these results are achieved in areas with visual obstacles while ensuring communication connectivity between the different cameras.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f187494cf6b99e164520902c60b9100eb4f2b975715c8c141628687ab3dbca8a","category":"Interdisciplinary"}