{"title":"A Probabilistic Approach to Characterizing Drought Using Satellite Gravimetry","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036873?af=R","date":1723020331000,"content":"<h2>Abstract</h2>\n<p>In the recent past, the Gravity Recovery and Climate Experiment (GRACE) satellite mission and its successor GRACE Follow-On (GRACE-FO), have become invaluable tools for characterizing drought through measurements of Total Water Storage Anomaly (TWSA). However, the existing approaches have often overlooked the uncertainties in TWSA that stem from GRACE orbit configuration, background models, and intrinsic data errors. Here we introduce a fresh view on this problem which incorporates the uncertainties in the data: the Probabilistic Storage-based Drought Index (PSDI). Our method leverages Monte Carlo simulations to yield realistic realizations for the stochastic process of the TWSA time series. These realizations depict a range of plausible drought scenarios that later on are used to characterize drought. This approach provides probability for each drought category instead of selecting a single final category at each epoch. We have compared PSDI with the deterministic approach (Storage-based Drought Index, SDI) over major global basins. Our results show that the deterministic approach often leans toward an overestimation of storage-based drought severity. Furthermore, we scrutinize the performance of PSDI across diverse hydrologic events, spanning continents from the United States to Europe, the Middle East, Southern Africa, South America, and Australia. In each case, PSDI emerges as a reliable indicator for characterizing drought conditions, providing a more comprehensive perspective than conventional deterministic indices. In contrast to the common deterministic view, our probabilistic approach provides a more realistic characterization of the TWS drought, making it more suited for adaptive strategies and realistic risk management.</p>","author":"Peyman Saemian, \nMohammad J. Tourian, \nOmid Elmi, \nNico Sneeuw, \nAmir AghaKouchak","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"f18dd49b0a9cc549941ee48bd8c4aebc74e173918e0bf9adf80813db9c415b76","category":"Environment"}