{"title":"Hydrogeologic Framework Model‐Based Numerical Simulation of Groundwater Flow and Salt Transport and Analytic Hierarchy Process‐Based Multi‐Criteria Evaluation of Optimal Pumping Location and Rate for Mitigation of Seawater Intrusion in a Complex Coastal Aquifer System","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035486?af=R","date":1718607600000,"content":"<h2>Abstract</h2>\n<p>A series of hydrogeologic framework model (HFM)-based steady- and transient-state numerical simulations is performed first using a coupled subsurface flow-transport numerical model to analyze groundwater flow and salt transport in an actual three-dimensional complex coastal aquifer system before and during groundwater pumping. A series of analytic hierarchy process (AHP)-based multi-criteria evaluations is then performed applying a multi-criteria decision-making approach to determine optimal pumping location and rate for a new pumping well in the complex coastal aquifer system during groundwater pumping. The complex coastal aquifer system is composed of six anisotropic fractured porous geologic media (five rock formations and one fault) and three isotropic porous geologic media (three soil formations) and shows high geometric irregularity and significant heterogeneity and anisotropy of the nine geologic media. Results of the steady-state numerical simulations show successful model calibration with 26 measured groundwater levels and two observed seawater intrusion front lines. The latter two are determined by spatial interpolation and extrapolation of electrical conductivity logging data and electrical resistivity survey data, respectively. Based on the status and prospect of necessary water uses and available groundwater resources, the field observations of groundwater and seawater intrusion, and the analyses of the steady-state numerical simulation after the model calibration, six candidate pumping locations are selected for the new pumping well. In addition, from six preliminary individual transient-state numerical simulations, maximum pumping rates at the six candidate pumping locations are calculated first, and a set of six incremental candidate pumping rates is then assigned at each of the six candidate pumping locations. Results of the transients-state numerical simulations show that groundwater flow and salt transport are spatially and temporally changed, and seawater intrusion is further intensified by groundwater pumping. In addition, the magnitudes of such spatial and temporal changes and intensification are significantly different depending on the candidate pumping locations and rates. Results of the steady- and transient-state numerical simulations also show that both complexity (geometric irregularity, heterogeneity, and anisotropy including the fault) and topography have significant effects on the spatial distributions and temporal changes of groundwater flow and salt transport in the coastal aquifer system before and during groundwater pumping. In addition, results of statistical estimations of the mesh Peclet and Courant numbers confirm acceptabilities of minimizing numerical dispersion in the steady- and transient-state numerical simulations. Based on the analyses of the transient-state numerical simulations, eight multiple criteria are chosen to judge, prioritize, and rank the six candidate pumping locations and six candidate pumping rates for optimal pumping. Results of the multi-criteria evaluations determine the optimal pumping location and rate for the new pumping well among the six candidate pumping locations and six candidate pumping rates. In addition, results of consistency checks confirm consistencies of judgments in the multi-criteria evaluations.</p>","author":"Jung‐Hwi Kihm, \nJun‐Mo Kim, \nYongje Kim, \nSung Kim, \nGour‐Tsyh Yeh","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"f19051c38353893d4a00847154e90abf0e2c9b0e4ce38007886a0f6891a41ea8","category":"Environment"}