{"title":"Lenovo’s gaming phone has an extreme dual-fan cooling system","link":"https://arstechnica.com/?p=1755378","date":1617901167000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/14-980x669.jpg\" alt=\"\"></div>\n        <p>\n          The Lenovo Legion Phone Duel 2, with its wild center-bump design.                       [credit:\n                        Lenovo                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>We're not quite sure there's a huge demand for them, but ~$1,000 gaming phones are something manufacturers continue to push onto the market. If nothing else, they're at least interesting, and the latest entry, the \"<a href=\"https://news.lenovo.com/pressroom/press-releases/next-mobile-gaming-powerhouse-lenovo-legion-phone-duel-2/\">Lenovo Legion Phone Duel 2</a>,\" has one of the most extreme cooling solutions in a phone, ever.</p>\n<p>The phone design revolves around the camera bump—it feels like underselling it to just call it a \"camera bump\"—smack in the middle of the phone body. This bump covers about 25 percent of the back of the phone and houses two cameras, an RGB LED lighting system, a landscape pop-up camera (!), and <em>two </em>internal cooling fans.</p>\n<p>Lenovo's internal diagrams show a large amount of copper and graphite cooling plates inside the phone; the plates contribute to the phone's impressive 259 g weight. In landscape mode, it looks like the fan in the bottom-left corner of the rear bump is exposed to the outside world and pulls in cool air. The air then travels along copper ducting and can exit out the vent at the bottom or get blown out the top by a second, totally internal fan in the top-right corner of the rear bump.</p></div><p><a href=\"https://arstechnica.com/?p=1755378#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1755378&comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f1955cd19b5392c47f9d470fee3a72dd15c93b48178879621d44de78e50d80f0","category":"Tech"}