{"title":"New Workspace Tags for Terraform Cloud","link":"https://www.hashicorp.com/blog/new-workspace-tags-for-terraform-cloud","date":1629388800000,"content":"<p>Managing infrastructure as code at scale can be a challenge to many organizations. While <a href=\"https://www.terraform.io/cloud\">HashiCorp Terraform Cloud</a> provides organizations with a fast and easy way to adopt Terraform, <a href=\"https://www.hashicorp.com/resources/a-practitioner-s-guide-to-using-hashicorp-terraform-cloud-with-github\">managing workspaces</a> can bring about obstacles requiring additional planning and visibility.</p>\n<p>Earlier this year, we announced a <a href=\"https://www.hashicorp.com/blog/new-workspace-overview-for-terraform-cloud\">new Overview page</a> to give you a quick and easy-to-reference panel for all the important details of each particular workspace. Now, we are announcing workspace tags that give you an easier way to organize and filter your workspaces within the top-level workspaces page.</p>\n<h2><a href=\"#workspace-tags\">»</a><a></a>Workspace Tags</h2>\n<p><a href=\"https://www.terraform.io/docs/cloud/workspaces/index.html\">Workspace</a> tags, which are now available for both Terraform Cloud and Terraform Enterprise, bring additional contextual awareness to the workspace level. The usage of tags allows you to correlate, organize, and even filter workspaces based on the assigned tags.</p>\n<p>The workspaces page, which lists all the available workspaces in an organization, now features the assigned tags next to their respective names. A “<a href=\"https://www.terraform.io/docs/cloud/workspaces/index.html#listing-and-filtering-workspaces\">Filter by Tag</a>” button is also available as an option. You can use the button to select one or multiple tags to isolate only those workspaces with the specified tags. The “Clear Filters” option will return you to the default list of workspaces. Your browser’s URL address bar will update so you can easily bookmark or share your filtered view with others.</p><img src=\"https://www.datocms-assets.com/2885/1629318734-tfcworkspacetags.gif\" /><p>The workspace overview page has been updated to provide an easy option to manage tags. There is an additional panel to create, assign, and remove tags through the “search for or create a new tag” dropdown box. Tag names are defined by a combination of alphanumeric characters and colons.</p>\n<p>Additionally, the workspace overview page provides an option for you to interact with the assigned tags. Clicking a tag will take you to the top-level workspaces page, presenting a filtered view of only those workspaces which also are assigned that tag.</p><img src=\"https://www.datocms-assets.com/2885/1629318780-tfcworkspacetagsadd.png\" /><p>Administrators have the ability to delete tags at the organization level and en masse. The organization’s Settings panel has a subsection for tags as well. Here, you can select one or more tags to remove from the organization. Alternatively, managing tags are also available at the API level through the <a href=\"https://www.terraform.io/docs/cloud/api/organization-tags.html\">Organization Tags API</a> and will soon be available in the <a href=\"https://registry.terraform.io/providers/hashicorp/tfe/latest\">TFE provider</a>.</p><img src=\"https://www.datocms-assets.com/2885/1629318815-tfcworkspacetagsmanage.png\" /><p>Tags also make themselves available in one other area. <a href=\"https://www.hashicorp.com/sentinel\">Sentinel</a>, HashiCorp’s policy as code framework, can reference tags as part of the <code>tfrun</code>data. This allows you to be able to dynamically apply Sentinel policies based on whether or not a specific tag has been applied to a workspace. One such example can be seen as follows:</p><pre><code>is_production = filter tfrun.workspace.tags as _, tag {\n\t\ttag is \"source:azure\"\n} is not empty</code></pre><p>You can find a more complete <a href=\"https://play.sentinelproject.io/p/WQCZeN0PL0j\">policy example</a> in the <a href=\"https://www.hashicorp.com/blog/announcing-the-sentinel-playground\">Sentinel Playground</a>. The example has mock <code>tfplan</code> and <code>tfrun</code> data alongside a Sentinel policy that includes the above code block to check for a particular tag.</p>\n<h2><a href=\"#get-started\">»</a><a></a>Get Started</h2>\n<p>HashiCorp Terraform Cloud is continuously improving the way workspaces are organized and managed. Workspace tags are the newest addition and provide a great new way to include actionable metadata to each workspace within an organization.</p>\n<p><a href=\"https://www.terraform.io/cloud\">Terraform Cloud</a> is free to get started, and organizations can <a href=\"https://www.hashicorp.com/products/terraform/pricing\">upgrade to the Team &amp; Governance or Business tiers</a> at any time. To get started, <a href=\"https://app.terraform.io/signup/account\">sign-up</a> for Terraform Cloud and follow our <a href=\"https://learn.hashicorp.com/collections/terraform/cloud-get-started\">Get Started</a> tutorial or contact <a href=\"https://www.hashicorp.com/contact-sales/terraform\">HashiCorp Sales</a>.</p>","author":"Kyle Ruddy","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"f1a4de5eb0b384234e8ff2e3b7bfe4749779eadf4bde6c81be07b2f481b63035","category":"Tech"}