{"title":"Phytoplankton assemblages in response to environmental variability in tropical coastal waters of the Malacca Straits, Malaysia","link":"https://onlinelibrary.wiley.com/doi/10.1111/maec.12822?af=R","date":1719399785000,"content":"<h2>Abstract</h2>\n<p>Surface phytoplankton community, abundance, and species spatial distributions were investigated in the Malacca Straits (MS) of Peninsular Malaysia during the late northeast monsoon (March) and southwest monsoon (August) in 2019 to understand factors controlling their community dynamics. This study reveals that the monsoonal transitions lead to changes in sea surface temperature (SST), sea surface salinity (SSS), total nitrogen (TN), total chlorophyll-<i>a</i> (Tchl-<i>a</i>), and phytoplankton density in the MS. A total of 204 and 163 phytoplankton species were identified during March and August, respectively, with diatoms representing the most (80.6%), followed by dinoflagellates (9.9%), cyanobacteria (8.3%), and others (1.2%). Meanwhile, the average total phytoplankton density was lower in March (10.78 × 10<sup>3</sup> ± 14.70 cell L<sup>−1</sup>) and greater in August (26.98 × 10<sup>3</sup> ± 45.63 cell L<sup>−1</sup>), with <i>Chaetoceros compressus</i> and <i>Thalassiosir</i>a sp. Seven found the highest in each season, respectively. There was no significant correlation between phytoplankton density and environmental parameters in the MS, except for the cyanobacteria and dinoflagellate communities. However, the Canonical Correspondence Analysis results showed that environmental parameters such as SST, SSS, and nutrients in the MS could affect the dominant phytoplankton species, particularly diatoms. The findings suggest that environmental changes between the seasons may act as ecological drivers in the formation of phytoplankton communities in marine habitats of the MS.</p>","author":"Erqa Shazira Sohaimi, \nRoswati Md Amin, \nMd Suffian Idris, \nPoh Seng Chee, \nMohd Fadzil Mohd Akhir","siteTitle":"Wiley: Marine Ecology: Table of Contents","siteHash":"9aeeb02fb4d0869ca2d9b47a9c219a8693576fd84433bf6b8b40db990539dbf7","entryHash":"f1a777743ad2803848ae56f8ecc7d760ebb173c3658d10b76fc4167f9f8d40ff","category":"Environment"}