{"title":"High-performance On-orbit Intelligent Computing and Real-time Services for Remote Sensing Satellites Based on Space Large-scale Computing Power","link":"https://www.preprints.org/manuscript/202410.1714/v1","date":1729587883000,"content":"The rapid advancement of Earth observation systems and satellite networks driven by commercial space has led to a significant increase in the number of remote sensing satellites, thereby establishing the groundwork for all-weather, continuous cluster collaborative observation. Following anti-irradiation hardening measures, low-cost commercial off-the-shelf (COTS) devices are effectively operated within intricate space environments, leading to substantial enhancements in on-orbit computing capabilities of individual satellites. Leveraging the on-board distributed processing framework, it fully utilizes wide-area scattered space computing resources and automatically establishes a network of neighboring satellites through inter-satellite communication links to construct a spatially distributed and computationally cooperative space cloud computing environment. This enables the sharing of space computing resources and facilitates satellite-based mission coordination, reducing reliance on ground-based remote sensing satellite services while enhancing the response efficiency of remote sensing application services. The present paper pro-vides a comprehensive review of the current development status, existing challenges, and problems faced by space-based remote sensing on-orbit processing platforms and on-board intelligent processing algorithms, starting from the immediate application requirements of remote sensing satellite in-orbit processing. In view of the anticipated surge in large-scale computing resources in space, a distributed remote sensing satellite data processing architecture based on large-scale on-board computing power is constructed, and the architecture is designed in detail from the aspects of physical architecture, software architecture, workflow and key technologies. Finally, three real-time service scenarios that align with the construction content of an ultra-low orbit satellite constellation and 6G technology have been designed to provide solutions and references for subsequent development of space-based intelligent remote sensing constellations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f1accd0b19d69b75ce660b3d04834006f6635371c6f7a27ca41f800c312bc4c0","category":"Interdisciplinary"}