{"title":"Species-specific ecological traits, phylogeny, and geography underpin vulnerability to population declines for North American birds","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duad046/7259962?rss=1","date":1693872000000,"content":"<span><div>Abstract</div>Species declines and extinctions characterize the Anthropocene. Determining species vulnerability to decline, and where and how to mitigate threats, are paramount for effective conservation. We hypothesized that species with shared ecological traits also share threats, and therefore may experience similar population trends. Here, we used a Bayesian modeling framework to test whether phylogeny, geography, and 22 ecological traits predict regional population trends for 380 North American bird species. Groups like blackbirds, warblers, and shorebirds, as well as species occupying Bird Conservation Regions at more extreme latitudes in North America, exhibited negative population trends; whereas groups such as ducks, raptors, and waders, as well as species occupying more inland Bird Conservation Regions, exhibited positive trends. Specifically, we found that in addition to phylogeny and breeding geography, multiple ecological traits contributed to explaining variation in regional population trends for North American birds. Furthermore, we found that regional trends and the relative effects of migration distance, phylogeny, and geography differ between shorebirds, songbirds, and waterbirds. Our work provides evidence that multiple ecological traits correlate with North American bird population trends, but that the individual effects of these ecological traits in predicting population trends often vary between different groups of birds. Moreover, our results reinforce the notion that variation in avian population trends is controlled by more than phylogeny and geography, where closely related species within one region can show unique population trends due to differences in their ecological traits. We recommend that regional conservation plans, i.e. one-size-fits-all plans, be implemented only for bird groups with population trends under strong phylogenetic or geographic controls. We underscore the need to develop species-specific research and management strategies for other groups, like songbirds, that exhibit high variation in their population trends and are influenced by multiple ecological traits.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"f1ba1b1bd22535f4d61da2be300954d3c7bbc5cff55280fc7489f8184e64b41a","category":"Environment"}