{"title":"FDA Warns Consumers Not to Use Smart Watches or Rings That Claim to Measure Blood Glucose Levels","link":"https://www.macrumors.com/2024/02/21/fda-smart-watch-blood-sugar-warning/","date":1708548285000,"content":"The United States Food and Drug Administration (FDA) does not want consumers to purchase or use smart watches or smart rings that claim to measure blood glucose levels using non-invasive methods. In <a href=\"https://www.fda.gov/medical-devices/safety-communications/do-not-use-smartwatches-or-smart-rings-measure-blood-glucose-levels-fda-safety-communication\">a safety warning shared today</a>, the FDA says that smart devices that claim to check blood sugar without piercing the skin can lead to errors in diabetes management, including taking too much or too little medication.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/Apple-Watch-Blood-Glucose-Monitoring-Feature-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nNo smart watch or smart ring that is intended to measure or estimate blood glucose values non-invasively has been authorized, cleared, or approved by the FDA. These non-invasive devices are different from continuous glucose monitoring devices (CGMs) that relay data through a smart watch app.\r<br />\n\r<br />\nApple is rumored to be working on a version of the Apple Watch that will be able to <a href=\"https://www.macrumors.com/2023/02/22/apple-blood-glucose-monitoring-technology/\">measure blood glucose non-invasively</a>, but launch of such a device is still several years away. Apple has been exploring optical absorption spectroscopy using a laser to shine light under the skin to determine a person's blood glucose level, but as of 2023, Apple's work remained at a proof-of-concept stage.\r<br />\n\r<br />\nAs of right now, there are several low-cost smart watches and smart rings that claim to be able to monitor glucose levels without a skin prick or without integrating with a CGM device. The FDA says patients should avoid such devices, and doctors should warn patients about the risks of using unauthorized blood glucose measuring products.\r<br />\n<blockquote>Sellers of these smartwatches and smart rings claim their devices measure blood glucose levels without requiring people to prick their finger or pierce the skin. They claim to use non-invasive techniques. These smartwatches and smart rings do not directly test blood glucose levels.\r<br />\n\r<br />\nThese smartwatches and smart rings are manufactured by dozens of companies and sold under multiple brand names. This safety communication applies to any smartwatch or smart ring that claims to measure blood glucose without piercing the skin, regardless of manufacturer or brand.</blockquote>\r<br />\nThe FDA says that it is working to ensure that manufacturers, distributors, and sellers do not illegally market unauthorized smart watches or smart rings that claim to measure blood glucose levels.\r<br />\n\r<br />\nIf Apple does end up releasing an Apple Watch that includes a sensor for non-invasive blood glucose monitoring, Apple will need to get FDA approval before it is allowed to sell it in the U.S. Other companies like Samsung are working on similar technology, but there is no proven and approved non-invasive blood sugar monitoring method on the market as of right now.<div>Tag: <a href=\"https://www.macrumors.com/guide/fda/\">FDA</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/21/fda-smart-watch-blood-sugar-warning/\">FDA Warns Consumers Not to Use Smart Watches or Rings That Claim to Measure Blood Glucose Levels</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/fda-warns-consumers-not-to-use-smart-watches-or-rings-that-claim-to-measure-blood-glucose-levels.2420089/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f1bbcf7851c880df1bbae1211c8f28bb0e6d3c3f7e71c94375e9642418ffbf0c","category":"Apple"}