{"title":"Apple Events 2023-2024: Apple’s event calendar","link":"https://www.macworld.com/article/672537/when-is-apples-next-event.html","date":1697761920000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple doesn’t often participate in big industry-wide events such as CES or E3. The most valuable company in the world holds its own events, thank you very much. Several times a year, Apple invites the press and industry professionals to Apple Park to hear all about its latest products and services. Apple calls these ‘events,’ and streams them live online to millions of watchers.</p>\n\n\n\n<p>In 2022, there were three such events: A spring event on March 8, WWDC on June 6, and the iPhone 14 launch on September 7. An additional event was expected in October or November but never materialized.</p>\n\n\n\n<p>So far in 2023, we’ve had two events: WWDC in June and the Wonderlust iPhone event in September. We could see one more Apple event before the year is over, but we aren’t convinced we will. Read on to find out what events and <a href=\"https://www.macworld.com/article/671090/new-apple-products.html\">new Apple product launches</a> the company has in store for 2023 and 2024.</p>\n\n\n\n<h2>When is Apple’s next event?</h2>\n\n\n\n<p>Apple’s <a href=\"https://www.macworld.com/article/831417/apple-september-iphone-event-date-time.html\">September 2023 iPhone 15 event</a> was held on September 12, and that may well be it for 2023. However, in some years Apple holds an <a href=\"https://www.macworld.com/article/1064916/apple-october-event-date-time-mac-ipad.html\">October or November event</a> and there is a possibility that it will do so in 2023. </p>\n\n\n\n<p>In the past, Apple has held a second fall event on the following dates:</p>\n\n\n\n<ul>\n<li>2022: No event</li>\n\n\n\n<li>2021: Monday, October 18</li>\n\n\n\n<li>2020: Tuesday, October 13 and Tuesday, November 10 </li>\n\n\n\n<li>2019: No event</li>\n\n\n\n<li>2018: Tuesday, October 30</li>\n\n\n\n<li>2017: No event</li>\n\n\n\n<li>2016: Thursday, October 27</li>\n\n\n\n<li>2015: No event</li>\n\n\n\n<li>2014: Thursday, October 16</li>\n\n\n\n<li>2013: Tuesday, October 22</li>\n\n\n\n<li>2012: Tuesday, October 23</li>\n\n\n\n<li>2011: Tuesday, October 4</li>\n</ul>\n\n\n\n<p>We are almost at the end of October so an October event in 2023 is very unlikely. It is feasible that Apple could hold an event in November, but this seems unnecessary for what we anticipate to be the launch of new iPads and new M3-powered Macs. </p>\n\n\n\n<p>We think <a href=\"https://www.macworld.com/article/1484151/apple-spring-2023-event-date-time-how-to-watch-rumors.html\">Apple’s next event will be in the spring</a> of 2024. The company has already said it will launch the Apple Vision Pro headset “early next year in the U.S.” which does seem to point to a spring launch. Apple could be ready to launch a number of other products by that time. </p>\n\n\n\n<h2>What time will the next Apple event start?</h2>\n\n\n\n<p>Apple’s keynotes tend to start at 10 am in California (where Apple is based).</p>\n\n\n\n<p>Here’s what that translates to in the countries where most of our readers live, note that if an event is held in late October/Early November there will be some timezone discrepancies as certain places won’t have switched to or from daylight saving.  </p>\n\n\n\n<ul>\n<li>U.S.: at 10 am (PST/PDT), 11 am (MST/MDT), noon (CST/CDT), 1 pm (EST/EDT)</li>\n\n\n\n<li>Canada: as above, and 2 pm (AST/ADT)</li>\n\n\n\n<li>U.K.: at 6 pm (GMT/BST)</li>\n\n\n\n<li>Europe: at 7pm (CET/CEST), 8pm (EEST)</li>\n\n\n\n<li>India: at 10.30 pm (IST)</li>\n\n\n\n<li>Australia: Following day at 1 am (AWST/AWDT), 2.30 am (ACST/ACDT), 3 am (AEST/AEDT)</li>\n\n\n\n<li>New Zealand: next day at 5 am (NZST/NZDT)</li>\n</ul>\n\n\n\n<h2>How long does an Apple event last?</h2>\n\n\n\n<p>Apple keynotes usually last between one and two hours and feature CEO Tim Cook along with various other Apple executives. WWDC and the September event tend to be longer keynotes; the spring and late-fall events can be slightly shorter. </p>\n\n\n\n<h2>When does Apple hold events?</h2>\n\n\n\n<p>Apple holds three or four live or live-streamed events throughout the year where the company unveils its latest products and plans during a keynote address. They are usually held during similar times of the year:</p>\n\n\n\n<ul>\n<li>March/April: Spring event</li>\n\n\n\n<li>June: WWDC (Worldwide Developers Conference)</li>\n\n\n\n<li>September: Fall event (aka iPhone launch event)</li>\n\n\n\n<li>October/November: Late-fall event(s)</li>\n</ul>\n\n\n\n<p>This event calendar is by no means set in stone, though, with the spring and October events being less regular. Some years, Apple doesn’t hold a spring event at all, as was the case in 2023. </p>\n\n\n\n<p>The summer and September events are more predictable, with software coming at WWDC in June and iPhones and Apple Watches in September. The October event often sees Apple launch new Macs, but this is another one that changes from year to year.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/New-Apple-Products-9-sept-event.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"New Apple Products Apple Event September\" width=\"1069\" height=\"743\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/New-Apple-Products-9-sept-event.jpg?quality=50&amp;strip=all 1246w, https://b2c-contenthub.com/wp-content/uploads/2022/09/New-Apple-Products-9-sept-event.jpg?resize=300%2C209&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/09/New-Apple-Products-9-sept-event.jpg?resize=768%2C535&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/09/New-Apple-Products-9-sept-event.jpg?resize=1200%2C836&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/09/New-Apple-Products-9-sept-event.jpg?resize=1240%2C868&amp;quality=50&amp;strip=all 1240w\" /><figcaption>Apple launched the new iPhone, Apple Watch, and AirPods Pro in September 2022.</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Will any more Apple events take place in 2023 and what will launch?</h2>\n\n\n\n<p>Based on past history and recent rumors, here are the events we could see across the remainder of 2023:</p>\n\n\n\n<h2>Late-fall event: October/November 2023 </h2>\n\n\n\n<p>Apple’s late-fall event, held in October or November as a follow-up to the usually bigger September launch, isn’t guaranteed to happen. In 2022, for example, there were rumors about an October event, but Apple opted instead to issue press releases for the new <a href=\"https://www.macworld.com/article/1371039/ipad-10th-generation-review.html\">10th-gen iPad</a> and M2 iPad Pro. Over the past six years, Apple has held a total of four late-fall events (including a double-header in 2020). We don’t expect there to be a fall event in 2023.</p>\n\n\n\n<p>Apple traditionally uses its late-fall event to unveil new Macs and iPads, in contrast to the September event’s usual focus on the iPhone and Apple Watch. In 2023, that could mean the launch of the M3 chip, which could appear in the new <a href=\"https://www.macworld.com/article/1511195/imac-apple-silicon-m2-m3-update-rumors.html\">24-inch iMac</a>, but we may be waiting until 2024 for that. Another contender for the late 2023 event is an update to the <a href=\"https://www.macworld.com/article/678361/ipad-mini-7-specs-design-processor-release.html\">iPad mini 7</a> or the rumored <a href=\"https://www.macworld.com/article/1835319/14-inch-ipad-pro-release-specs-features-price.html\">14-inch iPad Pro.</a></p>\n\n\n\n<h2>What Apple events will take place in 2024?</h2>\n\n\n\n<p>Here are the events we expect to see in 2024, and what could launch.</p>\n\n\n\n<h2>Spring event 2024 </h2>\n\n\n\n<p>There were no Apple spring events in 2023 or 2020, but when they do happen, they can be significant. In spring 2022, Apple announced the iPhone SE 2, iPad Air, and Mac Studio and Studio Display; in 2021, we got the iMac, AirTag, and Apple TV 4K. And in 2019, the event was devoted to Apple’s services: Apple TV+, Apple News+, and Apple Arcade. Could there be an Apple spring event in 2024? It looks likely. </p>\n\n\n\n<p>If there is, the event will most likely take place on a Monday or Tuesday in March or April. Here’s when Apple has held its past few spring events:</p>\n\n\n\n<ul>\n<li>2023: No event</li>\n\n\n\n<li>2022: Tuesday, March 8</li>\n\n\n\n<li>2021: Tuesday, April 20</li>\n\n\n\n<li>2020: No event due to Covid</li>\n\n\n\n<li>2019: Monday, March 25</li>\n\n\n\n<li>2018: Tuesday, March 27</li>\n\n\n\n<li>2017: No event</li>\n</ul>\n\n\n\n<p>We already know that Apple’s Vision Pro headset is set to launch in “early 2024” so a spring launch is entirely feasible. What else could we see? New iPad, M3 Macs, AirPods, a <a href=\"https://www.macworld.com/article/676817/homepod-with-screen-rumours-and-release-date.html\">HomePod with a screen</a>, a <a href=\"https://www.macworld.com/article/676887/apple-games-console-rumours-and-release-date.html\">gaming device</a>? </p>\n\n\n\n<h2>WWDC: June 2024</h2>\n\n\n\n<p>WWDC usually takes place in the first or second week of June. In 2023 the opening keynote was held on Monday, June 5. Apple announced three new Macs and the Vision Pro headset as well as revealing the new features coming to the various operating systems in updates later in the year. </p>\n\n\n\n<p>Following the keynote on the Monday, developer events and sessions will run throughout the week. You can read more about <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC date, times and everything you need to know</a> in a separate article.</p>\n\n\n\n<ul>\n<li>WWDC 2023: June 5-9</li>\n\n\n\n<li>WWDC 2022: June 6-10</li>\n\n\n\n<li>WWDC 2021: June 7-11</li>\n\n\n\n<li>WWDC 2020: June 22-26</li>\n\n\n\n<li>WWDC 2019: June 3-7</li>\n\n\n\n<li>WWDC 2018: June 4-8</li>\n\n\n\n<li>WWDC 2017: June 5-9</li>\n</ul>\n\n\n\n<p>Apple uses WWDC each year to unveil the latest versions of its operating systems, so in 2024 we’ll get a preview of iOS 18, iPadOS 18, macOS 15, watchOS 11, and tvOS 18, and possibly an update to Apple’s realityOS. New hardware sometimes makes an appearance at WWDC as well, as was the case in 2023 when we saw the 15-inch MacBook Air, and the U2 Ultra Mac Pro and Mac Studio.</p>\n\n\n\n<h2>iPhone 16 launch event: September 2024</h2>\n\n\n\n<p>Apple always holds an event in September, and almost always uses this to announce a new iPhone. (The only exception in recent memory was in 2020, as a result of Covid-related production issues. That year the iPhone was announced in October.) Here are the past few Apple September event dates:</p>\n\n\n\n<ul>\n<li>2023: Tuesday, September 12</li>\n\n\n\n<li>2022: Tuesday, September 13</li>\n\n\n\n<li>2022: Wednesday, September 7</li>\n\n\n\n<li>2021: Tuesday, September 14</li>\n\n\n\n<li>2020: Tuesday, September 15</li>\n\n\n\n<li>2019: Tuesday, September 10</li>\n\n\n\n<li>2018: Wednesday, September 12</li>\n\n\n\n<li>2017: Tuesday, September 12</li>\n</ul>\n\n\n\n<h2>October 2024 Event</h2>\n\n\n\n<p>There could be iPad and Mac events in October and/or November 2024. But this is a long way off so we won’t get into too much detail just yet.</p>\n\nApple Inc, iPad, iPhone, Mac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f1c88cf0cf89a971de04075803375eaef720a160971679772d60be8866b39540","category":"Apple"}