{"title":"Assessing the Impact of Eco-Labelling on Purchase Intentions of Young Consumers in Enugu State, Nigeria","link":"https://www.preprints.org/manuscript/202409.0602/v1","date":1725863249000,"content":"Eco-labelling plays a crucial role in encouraging sustainable consumer behaviour by giving clear information about a product's environmental impact. This study looks at how eco-labelling affects the buying decisions of young consumers in Enugu State, Nigeria. Using a cross-sectional survey approach, 430 undergraduate students from five universities participated in an online questionnaire. The research focused on understanding how aware young consumers are of eco-labels, how these labels influence their buying decisions, and whether they are willing to pay more for eco-labelled products. The data were analysed through descriptive statistics, including average scores and variations. The results showed that young consumers have a moderate to high level of awareness of different eco-labels, with the NAFDAC Green Dot being the most recognised (average score = 4.12, variation = 0.96). Eco-labelling was found to have a significant influence on their purchasing decisions, especially in building trust in the products (average score = 4.31, variation = 0.71) and their willingness to pay a higher price (average score = 4.21, variation = 0.83). Overall, the study shows that eco-labelling has a positive impact on young consumers’ buying choices and could be a valuable tool for promoting more sustainable consumption in Nigeria. The study recommends increasing awareness through educational campaigns, building consumer trust in eco-labelling, and using effective marketing strategies to boost recognition and adoption of eco-labelled products.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f1cdbbfc257d0b4c658227c81525aee2a54448bafe6e22e346beafe745ffef7d","category":"Interdisciplinary"}