{"title":"Colnago and Pope John Paul II: the Man with the Golden Bike","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/colnago-and-pope-john-paul-ii-the-man-with-the-golden-bike","date":1619607815000,"content":"\n      <p>How do you top that? Well, by creating one for God’s vessel on this Earth. </p>\n<div></div>\n<p>“I knew that Pope John Paul II was an avid cyclist in his youth, so I decided to prepare a special bike for him, a unique creation,” Colnago says.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/goldcolnago21024_1024x1024.jpg?v=1619606655\" /></p>\n<p>His audacious idea? A gold-plated bicycle. Making such a machine required experience from a different milieu. The finishing on the frame was entrusted to specialists more accustomed to decorating church furniture and ornaments.</p>\n<p>“The percentage of gold used is minimal, so there were no major problems in finding the necessary amount of precious metal,” he says.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/goldcolnago11024_1024x1024.jpg?v=1619606902\" /></p>\n<p>They used 18-carat gold for the 56cm frame with some choice custom details – well, it was hardly going to be off-the-rack.</p>\n<p>There are “Ernesto Colnago” pantographs on the chainring and a Colnago motif on the toe clips. The bicycle has white bar tape with, naturally, Italian tricolore finishing tape.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/goldcolnago31024_1024x1024.jpg?v=1619606991\" /></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-wisdom-of-ernesto-colnago\"><em><strong>Related – The Wisdom of Ernesto Colnago</strong></em></a></p>\n<p>“The bike is made of steel with lugs. The production of the frame, the painting and assembly took about 50 hours. It was the most beautiful frame I produced in that era,” he says. </p>\n<p>Colnago personally delivered the bike to John Paul II at an official event at St Peter’s Basilica in August 1979.</p>\n<p>“The Pope thanked me and told me that it was a gem, but unfortunately he couldn’t use it as he didn’t have much free time. One of his associates suggested that I make him a flat-bar one, easier to ride at his Castel Gandolfo retreat.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/popecolnago1024_1024x1024.jpg?v=1619607022\" /></p>\n<p><em>Ernesto Colnago presents Pope John Paul II with his bike</em></p>\n<p>Very few of these special golden Colnagos were made. “I do not remember the exact number, no more than ten were produced,” Colnago says. </p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2021-preview\">Related – Giro d'Italia 2021 Preview</a></em></strong></p>\n<p>A Colnago Mexico Oro version was also made for wider retail. It was equipped with a full <a href=\"https://rouleur.cc/campagnolo-c-record-1988-t-shirt.html\">Campagnolo</a> Super Record groupset and brakes, Nisi Solidal rims and Aeralpina spokes.</p>\n<p>No doubt, considering profit margins, it was covered with eighteen microns of gold plating: a barely-there shading.</p>\n<p>The papal pushbike has gone full circle. “It is in our Colnago museum in Cambiago,” says Colnago. “It has been returned because the Pope was using the white flat-bar bicycle that I gave him later; that’s now in the museum dedicated to him in Krakow, Poland.”</p>\n<p>89-year-old Colnago’s passion and drive remain undiminished. So, what about creating another golden bicycle – or even using another bold new material?</p>\n<p>“Who knows? Every day, there are new ideas,” Colnago replies.</p>\n<div></div>\n    ","author":"Andy McGrath","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f1cda72daca417e41cd72270ed1b6927e3d5007e13c086bb08bc05b052152d1e","category":"Cycling"}