{"title":"Giraffes, despite a relatively small brain, can handle statistics","link":"https://arstechnica.com/?p=1936753","date":1683217302000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-522613528-800x533.jpg\" alt=\"Image of a giraffe's head and upper neck, leaning to the right.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-522613528.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/rothschilds-giraffe-royalty-free-image/522613528?phrase=giraffe&amp;adppopup=true\">Arthur Morris</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Reasoning about probabilities is something humans can't always manage especially well, but it's clearly a skill we're capable of. In the wider world of animals, however, there are very few species we can say are able to make choices based on probabilities. So far, the only animals that have demonstrated the ability to make choices based on statistics are our fellow primates and the kea, an alpine parrot from New Zealand.</p>\n<p>All the species where this ability had been seen have a large brain relative to their body size, a feature that is associated with many advanced cognitive capabilities. So it was reasonable to conclude that statistical reasoning required some significant mental horsepower. But a study released on Thursday indicates that managing probabilities may be more widespread than we think since an animal with a relatively small brain—the giraffe—is apparently capable of it.</p>\n<h2>Chances are...</h2>\n<p>Reasoning based on probability and statistics sounds complicated, but we do it all the time. We weigh the likelihood of various factors when deciding what to bet in poker or which route to take on a commute. We're not always good about it; if we were, we'd freak out more about driving than we do about air travel. But the capacity to do so is there.</p></div><p><a href=\"https://arstechnica.com/?p=1936753#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1936753&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f1cff04000ff45a4c85ce7dbd09d081122fea3df992f35443f3f6661693911d5","category":"Tech"}