{"title":"Tadej Pogačar and his troubles taking the ‘Ardennes triple’","link":"https://www.cyclingtips.com/2023/04/tadej-pogacar-and-his-trouble-taking-the-ardennes-triple/","date":1681852812000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/04/cyclingimages-Amstel-Gold-2023-04336-scaled-1.jpg?width=1200\" alt=\"Tadej Pogačar and his troubles taking the ‘Ardennes triple’\" /></figure><p>No rider has swept Amstel Gold Race, La Flèche Wallonne and Liège-Bastogne-Liège in one season since Phillipe Gilbert took the so-called “Ardennes triple” more than a decade ago.</p>\n<p>Twelve years later, after steamrollering the bergs of Flanders and the walls of the Limburg, <a href=\"https://www.velonews.com/tag/tadej-pogacar/\">Tadej Pogačar</a> looks poised to take Phil-Gil’s Ardennes crown.</p>\n<p>Yet the unique horror of the Muur de Huuy and the steamrollering strength of <a href=\"https://www.velonews.com/tag/remco-evenepoel/\">Remco Evenepoel</a> make for two very sticky problems that will test the poise and power of “the modern Merckx” in a way not seen before.</p>\n<p>“The win in Amstel was a really nice way to start the Ardennes campaign and we can already say that it’s been a success,” Pogačar said this week.</p>\n<p>“Flèche and Liège are two other important targets and both hard races. There will be many others on the start line who also want to win so we’ll need to be at our best, but we’re up for the challenge.”</p>\n<p><strong>Also read:</strong></p>\n<ul>\n<li><a href=\"https://www.velonews.com/events/classics/mathieu-van-der-poel-tadej-pogacar-will-win-all-five-monuments-and-all-three-grand-tours/\">Van der Poel backs Pogačar to win all five monuments and all three grand tours</a></li>\n<li><a href=\"https://www.velonews.com/news/vn-ticker-evenepoel-braced-for-battle-with-pogacar-at-liege-tt-champ-waerenskjold-renews-with-uno-x/\">Evenepoel braced for Liège showdown with Pogačar</a></li>\n</ul>\n<p>That Davide Rebellin (in 2004) and Gilbert (in 2011) are the only male riders to have mastered the hilly three until now points to its unique eight-day test of form and racecraft.</p>\n<p>In the women’s peloton, only Anna van der Breggen took the Amstel-Flèche-Liège triple since it became possible 2017.</p>\n<p>If Pogačar becomes this week the third male rider to achieve the troublesome Ardennes hat trick, it won’t be the most celebrated record on his huge <em>palmarès.</em></p>\n<p>But it may be the hardest earned.</p>\n<h2>Pogačar and his Muur-shaped problem</h2>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2023/04/Z9A_6692.jpg?width=730\" alt width=\"1200\" height=\"883\" /><figcaption><span>Can Pogačar time it just right on the Mur? (Gruber Images/VeloNews)</span></figcaption></figure>\n<p>The infamous crowning wall of Flèche and the bludgeoning talent of Evenepoel have shown to be rare stones in Pogačar’s cycling shoes.</p>\n<p>Pogačar packs all the skills to serve victory atop Flèche’s Muur de Huuy but, after three times of trying, he’s still to pull it off.</p>\n<p>Last year, he blitzed the Muur’s leg-zappingly steep left-hander but flamed out for 12th when the gradients eased. The time before that in 2020 was a similar story.</p>\n<p>“Flèche is a hard race for me, I never did a good result there,” Pogačar said Sunday. “But I have good shape now, and with a good team, I think we can do a great result there.”</p>\n<p>Of course, Pogačar could just try rectifying his timing problem with raw power. He was a rare solo winner at Amstel Gold last weekend and made De Ronde his own with a long-range raid.</p>\n<p>But even he’s not sure he can go alone in Flèche’s bunch sprint playbook.</p>\n<p>“That race is really hard to go from far. I don’t think it’s really an option. But we’ll see,” he told <a href=\"https://www.wielerflits.be/nieuws/beroofde-tadej-pogacar-kijkt-uit-naar-duel-met-remco-evenepoel-nooit-echt-een-kans-gehad/\"><em>Wielerflits</em></a>.</p>\n<p>Riders with the punch of Tom Pidcock, Enric Mas, and David Gaudu will be heaving over their handlebars Wednesday if Flèche becomes a race to the top of the Muur.</p>\n<p>After twice burning out at the Muur’s 200-meter mark, Pogačar might this one time need to learn to wait for his win to come.</p>\n<h2>The delicious duel with Evenepoel</h2>\n<figure><img loading=\"lazy\" src=\"https://cdn.velonews.com/wp-content/uploads/2023/04/Z9A_5998-720x842.jpg?width=720\" alt width=\"720\" height=\"842\" /><figcaption><span>Evenepoel will roll into Liège with altitude legs and a title to defend.</span> (Photo: Gruber Images / VN)</figcaption></figure>\n<p>If Flèche makes for a race of timing, Liège-Bastogne-Liège might be all about brute strength Sunday.</p>\n<p>In Pogačar’s absence last year, Evenepoel blew the bunch out of his wheel when he won La Doyenne in what was a fittingly Pogačar-esque display of dominance.</p>\n<p>So far this spring, Evenepoel showed he got the legs to do it again in his title defense.</p>\n<p>“Whenever we were in a race together, he always won and I was way off the back,” Pogačar said after Amstel of himself and Evenepoel. “I hope it will be different on Sunday and that I will be in the front.”</p>\n<p>Pogačar might have been playing poker when he played up Evenepoel.</p>\n<p>The Slovenian couldn’t catch the “Remco Express” at the Wollongong worlds, but nearly all the road races before that went his way.</p>\n<p>What might not play in Pogačar’s favor Sunday is any fatigue of a long spring and the thorny presence of a rival as raw and raring as himself.</p>\n<p>Evenepoel hasn’t raced in four weeks and is straining at the leash after time atop Teide.</p>\n<p>Pogačar will be on the comedown from a packed northern and Ardennes classics campaign and with the weight of the Muur de Huuy in his legs.</p>\n<p>“He [Evenepoel] is not only the defending champion, he comes straight from altitude, where he’d built up good shape for the Giro. He showed this season he’s super good on short slopes, but also on long climbs. And he has a good sprint in his legs,” Pogačar told <em>Wielerflits</em>.</p>\n<p>“He will be one of the top candidates for Sunday.”</p>\n<p>Pogo vs Remco is a rare treat that puts two stellar supremos into the same orbit. The twosome only faced off on 12 days last year and haven’t shared a startline at all in 2023.</p>\n<p>Who might come out top Sunday?</p>\n<p>Like trying to tip Pogačar vs Jonas Vingegaard, not many bookies would dare lay odds, and it’s not unlikely Evenepoel proves the kryptonite that derails the Slovenian’s assault on the Ardennes.</p>\n<blockquote>\n<div> <a href=\"https://www.instagram.com/p/CrG5NUUM1vD/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <p></p>\n<div>\n<div></div>\n<div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div></div>\n<div></div>\n<div>\n<div>View this post on Instagram</div>\n</div>\n<div></div>\n<div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<p></p></a><p></p>\n<p><a href=\"https://www.instagram.com/p/CrG5NUUM1vD/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Tadej Pogačar (@tadejpogacar)</a></p>\n</div>\n</blockquote>\n<p></p>","author":"VeloNews.com","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f1d4d267d6925b84274e3a477a4ddf072591ad794407c42406e31d1d500b610e","category":"Cycling"}