{"title":"Reddit รายงานเว็บล่ม 5 ชั่วโมง หลังอัพเกรด เพราะ Kubernetes เลิกใช้ชื่อโหนดว่า master","link":"https://www.blognone.com/node/133168","date":1679767906000,"content":"<div><div><div><p>เมื่อกลางเดือนมีนาคมที่ผ่านมาในวันที่ 14 มีนาคมหรือวัน Pi  Reddit เว็บบอร์ดยอดนิยม ล่มไปเป็นเวลา 5 ชั่วโมง (ทางเว็บระบุว่าล่มนาน 314 นาทีตรงกับหมายเลข Pi เหมือนกัน) ตอนนี้ทางเว็บก็ออกราานงานว่าเกิดอะไรขึ้นในตอนนั้น</p>\n<p>การล่มครั้งนี้เกิดจากทีมงานอัพเกรด Kubernetes จากเวอร์ชั่น 1.23 ไปยัง 1.24 แล้วระบบล่ม โดยทีมงานค่อยๆ อัพเกรดมาแล้วหลายคลัสเตอร์ แต่วันเกิดเหตุนั้นเป็นการอัพเกรดคลัสเตอร์สำคัญที่สุด คือ ระบบ Reddit ดั้งเดิมที่มีโค้ดเก่า</p>\n<p>หลังการสั่งอัพเกรดไปสองนาทีเว็บดับลงทันที และทีมงานพบว่าระบบเน็ตเวิร์ค (container network interface - CNI) ของคลัสเตอร์ไม่ทำงาน คอนเทนเนอร์ calico-kube-controllers ค้างอยู่ที่สถานะ ContainerCreating ทีมงานพยายามลบคอนเทนเนอร์ทิ้งเพื่อให้ Kubernetes สร้างคอนเทนเนอร์กลับขึ้นมาแต่ก็ไม่สำเร็จ จนสุดท้ายทีมงานตัดสินใจกู้ระบบจาก backup</p>\n<p>หลังจากสอบสวนต้นต่อของปัญหาครั้งนี้ ทีมงานก็พบว่าปัญหาอยู่ในคอนฟิกของ Calilco ที่ใช้ควบคุมเน็ตเวิร์ค โดยคอนฟิก BGPPeer นั้นตั้ง nodeSelector ไว้ว่าต้องเป็น Kubernetes master แต่ทาง Kubernetes ตัดสินใจเปลี่ยนชื่อจาก main เป็น control-plane ทำให้คอนฟิกไม่ทำงาน</p>\n<p>Kubernetes ตัดสินใจเลิกใช้ว่า master เป็นชื่อโหนดมาตั้งแต่ปี 2020 เนื่องจากเป็นคำไม่เหมาะสม โดยเริ่มใช้คำว่า control-plane มาตั้งแต่เวอร์ชั่น 1.20 และ<a href=\"https://github.com/kubernetes/enhancements/blob/master/keps/sig-cluster-lifecycle/kubeadm/2067-rename-master-label-taint/README.md\">ในเวอร์ชั่น 1.24 ก็เลิกซัพพอร์ตคำว่า master</a></p>\n<p>ที่มา - <a href=\"https://www.reddit.com/r/RedditEng/comments/11xx5o0/you_broke_reddit_the_piday_outage/\">Reddit</a></p>\n<p><img src=\"https://preview.redd.it/k9plsuir26pa1.png?width=762&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=63e044094b1eba909bcfb9351c709b645eba635d\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/reddit\">Reddit</a></div><div><a href=\"/topics/kubernetes\">Kubernetes</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f1e01fbe4c9ee8d7f63ce0e2e164f8db8d75372b2ec9a93b797b0494c620ed66","category":"Thai"}