{"title":"How B2B Sales Help Us Understand Our Role As UX Designers Better","link":"https://smashingmagazine.com/2023/01/b2b-sales-understand-role-ux-designers-better/","date":1675153800000,"content":"<p>This article is a sponsored by <a href=\"https://www.gong.io/\">Gong.io</a></p>\n<p>Perhaps this is a controversial statement, but I hate it when UI and UX designers are referred to interchangeably. To my mind, at least, they are different roles, with the clue being in the names.</p>\n<p>User Interface designers design the interface, while User Experience designers are concerned with the entirety of the user’s experience.</p>\n<p>In most cases, that experience extends beyond a single interface, encompassing many touchpoints, both online and off. Nowhere is this more evident than in a business-to-business experience.</p>\n<p>In this article, I want to explore some of the unique characteristics of a B2B sales experience and, hopefully, highlight how a UX designer would consider the entirety of the experience, not just the interface elements.</p>\n<p>Let’s begin by exploring what makes B2B sales experiences an interesting challenge for us as UX designers.</p>\nWhy B2B Is An Interesting UX Challenge\n<p>Although we must be wary of generalizing, in many cases, B2B experiences are more complicated than B2C.</p>\n<p>This complexity is born out of the nature of B2B. Transactions between businesses tend to be:</p>\n<ul>\n<li>Higher in value.</li>\n<li>Involve more stakeholders.</li>\n<li>Take longer.</li>\n<li>Involve more interactions between parties.</li>\n<li>More highly regulated.</li>\n<li>Often include more complex products and services.</li>\n</ul>\n<p>Take, for example, one of my enterprise clients. It is not uncommon for months to pass from them initially getting in touch about a project to me starting work.</p>\n<p>Over that time, they may have:</p>\n<ul>\n<li>read one of my articles or heard me speak,</li>\n<li>viewed my website,</li>\n<li>reached out on LinkedIn,</li>\n<li>exchanged countless emails,</li>\n<li>spoken over Zoom,</li>\n<li>read my proposal,</li>\n<li>signed a contract.</li>\n</ul>\n<p>Each of the above works together to shape the client’s experience, not to mention everything I do once work on their project begins.</p>\n<p>While a UI designer may work on some of the above touchpoints, a UX designer cares about all of them and how they work collectively together to shape the experience.</p>\n<p>With so many potential interactions in a B2B sales journey over an extended period, it is vital to have a clear picture of how they fit together. That is why <a href=\"https://www.smashingmagazine.com/2015/01/all-about-customer-journey-mapping/\">journey mapping</a> is so popular among UX designers.</p>\n<p><img src=\"https://files.smashing.media/articles/b2b-sales-understand-role-ux-designers-better/1-digital-experience-journey-customer-mapping.jpg\" /></p>\nMap The Customer Journey\n<p>Even if a client commissions me to address a part of a B2B experience, I still favor starting with journey mapping (if they haven’t done so already). Understanding where a particular touchpoint fits into the bigger picture is essential for success.</p>\n<p>For example, I work a lot on <a href=\"https://www.smashingmagazine.com/2020/04/landing-page-design/\">optimizing the conversion rate of landing pages</a>. Where users have come from is a significant factor in ensuring the success of that landing page. For example, traffic that comes from ads will have different expectations from those that come from organic search.</p>\n<p>I care equally about what the user will do next. Any landing page has to prepare the user for that experience. For example, if salespeople contact every lead and users are not expecting that call, this will lower their conversion rate on those calls.</p>\n<p>Understanding where in their journey a user also helps me to tailor appropriate messaging and <a href=\"https://www.smashingmagazine.com/2009/10/call-to-action-buttons-examples-and-best-practices/\">calls to action</a>. Get this wrong, and the experience falls apart. Mapping a journey is an excellent way of designing a <a href=\"https://boagworld.com/marketing/user-centric-sales-funnel/\">sales funnel</a> that gently nudges the user through the process without undermining the experience.</p>\nDecide On Calls To Action And Relevant Touchpoints\n<p>Have you ever visited a website that immediately displays an overlay when you arrive for the first time? Typically, they offer you a discount in return for signing up for their mailing list. The problem is that you haven’t seen their products yet, so you don’t know if you want the discount. This results in a poor conversion rate and a bad experience that alienates users.</p>\n<p><img src=\"https://files.smashing.media/articles/b2b-sales-understand-role-ux-designers-better/2-user-discount-products-hidden.png\" /></p>\n<p>If they displayed the overlay for returning visitors or showed it after they had time to look around the site, it would fit better into the journey. Doing so would increase conversion and leave the user feeling more positive about the experience.</p>\n<p>A journey map doesn’t just show where to place a call to action. It also helps you shape the journey itself. For example, a typical B2B sales journey might be:</p>\n<ol>\n<li>Discover an organizational need.</li>\n<li>Research potential suppliers who could fulfill that need.</li>\n<li>Shortlist suppliers.</li>\n<li>Pick a preferred supplier.</li>\n<li>Sign contracts.</li>\n<li>Start work.</li>\n</ol>\n<p>Once you understand that journey, you can start shaping the experience so that each stage is optimized, helping the user progress to the next stage. Knowing the stages in the funnel helps you identify the appropriate touchpoints, messaging, and calls to action.</p>\n<p>For example, I use posts like this one, <a href=\"https://www.smashingmagazine.com/2021/07/guide-attracting-clients-agency/\">speaking slots, and organic search to reach prospective clients who are just discovering they might need help</a>. This is not the moment for a hard sell but rather a chance to help them discover potential solutions to their need.</p>\n<p>Often, my call to action at this early stage is to encourage them to <a href=\"https://boagworld.com/subscribe/\">subscribe to my mailing list</a> to get more help. That allows me to nurture the relationship until they start looking for potential suppliers.</p>\n<p>This is because there can often be a long gap between first discovering a need and securing a budget to find a supplier. It would be easy for them to forget me, and that lead would be lost.</p>\n<p>This brings me to another crucial area that a UX designer needs to consider in the user journey: the gaps in the experience.</p>\nMind The Gap\n<p>The user experience is not just about the touchpoints (website, email, etc.), but also about the gaps between these interactions. Gaps can be caused by time passing, switching channels, changing devices, or moving between business silos. These are dangerous moments when customers can easily be “dropped,” their experience undermined, and a sale lost. That’s why companies such as Gong.io use <a href=\"https://www.gong.io/pipeline-management-software/\">sales pipeline software</a> and customer relationship management apps to ensure leads are not lost but instead nurtured over time.</p>\n<p><img src=\"https://files.smashing.media/articles/b2b-sales-understand-role-ux-designers-better/3-sales-pipeline-software-CRM.jpg\" /></p>\n<p>But you still see examples of customers falling between these gaps all the time. Every time you’re put on hold while being transferred to another department, you have fallen into a gap. Or when you switch from a mobile device to your laptop to complete filling in a form, only to discover that all of your data has been lost and you have to start again.</p>\n<p>A great UX designer will constantly be looking for these gaps to plug. For example, my banking app recently updated so that I no longer need to go through security to identify myself when I call them from the app. After all, I had already identified myself when I logged into the app, so why do I need to do so again on the call? That was a gap between systems that they had successfully plugged.</p>\n<p>But while we strive as UX designers to plug gaps and design effortless digital experiences, there is one area we often overlook: human interactions.</p>\nDon’t Forget The Human Factor\n<p>At this point, you could argue we are <a href=\"https://boagworld.com/usability/what-is-ux-design/\">straying into the realm of Customer Experience Design rather than User Experience</a>, but it is still worth mentioning.</p>\n<p><img src=\"https://files.smashing.media/articles/b2b-sales-understand-role-ux-designers-better/4-user-experience-design-customer-interface-UX.png\" /></p>\n<p>Throughout a customer journey (particularly in B2B), there will be interactions that are primarily between two people rather than a human and an interface. These interactions may use digital technology (such as webinars, Zoom meetings, emails, or chat) but are essentially one person speaking to another.</p>\n<p>The B2B sales journey beautifully demonstrates these issues, as it has many digital communications between people.</p>\n<p>As UX designers, we don’t have the luxury of ignoring these interactions, as they are crucial in shaping the user’s experience and the chance of a lead converting. For example, we have all had a frustrating experience with customer support teams who have emailed or messaged us a stock answer that fails to really address our question. Equally, we have encountered salespeople who have pushed too hard for a sale too early in our buying journey. And, of course, we have all read messages from organizations that have come across as impersonal, rude, or insensitive.</p>\n<p>Technology makes these interactions feel worse, as we often cannot see or hear the person we are communicating with. Therefore, it falls to those of us seeking to improve the user experience to do at least something to try and mitigate these problems. That might be as simple as suggesting their sales team downloads a <a href=\"https://www.gong.io/content/sales-coaching-template/\">sales coaching plan template</a> or something more ambitious, like running a workshop on how to communicate online better.</p>\n<p>At this point, you might think all of this is way outside of your job description. But is it really?</p>\nIs This Outside Your Job Description?\n<p>We come full circle to where I started this article by saying that the role of UX designer is often mistaken for simply a more senior UI designer. It is not, and in fact, to suggest so is insulting to those who choose to specialize in UI.</p>\n<p>If you have been hired as a UX designer and yet spend all of your time creating wireframes for websites, apps, and other interfaces, I would suggest your organization or clients are failing to utilize you to the full.</p>\n<p>I would encourage you to break out of the box into which they have put you and start to look at the entire end-to-end user experience. Only then will you be fulfilling the role for which you have been hired.</p>\n<p>It won’t happen overnight, and there will be some who would prefer to limit your role, but you cannot improve the user experience without considering the entirety of the journey.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"f300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"f1e405a9e89f9f6fbfac25d593ddd2e383b0300c56d247f8757ed8","category":"Tech"}