{"title":"Theranos founder Elizabeth Holmes on trial as jury selection begins","link":"https://arstechnica.com/?p=1790858","date":1630427565000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/09/GettyImages-1181871591-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/09/GettyImages-1181871591.jpg\">Enlarge</a> <span>/</span> Elizabeth Holmes, founder and former CEO of Theranos, arrives for motion hearing on Monday, November 4, 2019, at the US District Court House in San Jose, California.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/elizabeth-holmes-founder-and-former-ceo-of-theranos-arrives-news-photo/1181871591?adppopup=true\">Getty | Yichuan Cao</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Nearly a decade ago, Theranos touted a revolutionary diagnostic device that could run myriad medical tests without having to draw blood through a needle. Today, the startup’s founder, Elizabeth Holmes, goes to court, where she’s facing 12 criminal counts for statements she made to investors and consumers about her company’s technology.</p>\n<p>Holmes founded Theranos in 2003 after dropping out of Stanford University at the age of 19. Driven by her phobia of needles, Holmes wanted to create diagnostic tests that use blood from finger pricks rather than from needles. The idea caught on, attracting well-connected board members like Henry Kissinger and James Mattis, drawing over $400 million in investments from wealthy investors including Larry Ellison and Rupert Murdoch, and securing lucrative partnerships with Walgreens and Safeway. At its peak, Theranos was worth over $9 billion.</p>\n<p>But Theranos’ myth started unwinding in 2015 when a <a href=\"https://www.wsj.com/articles/theranos-has-struggled-with-blood-tests-1444881901\">Wall Street Journal investigation</a> revealed that the company had been performing most of its tests on traditional blood diagnostic machines rather than its own “Einstein” device. The company’s own employees doubted the machine’s accuracy.</p></div><p><a href=\"https://arstechnica.com/?p=1790858#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1790858&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f1f3ea8297778d88221ab5c884ce45add029ad1d7e8ad9575994af6aa1c429b0","category":"Tech"}