{"title":"Save 17% on Kitchen Classic Herb plants","link":"https://www.bikeradar.com/bikeradar-daily-deals/save-17-on-kitchen-classic-herb-plants/","date":1618574138000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/All-article-header-image-classics-herb-pack-1f97a18.jpg?quality=90&amp;resize=620,413\" />                                            <p>Fresh herbs are a must-have for any kitchen, making this carefully selected assortment of eight plants, from PlantSavers a chef’s best friend! You can grow them on your windowsill, in the garden or on your patio – wherever you have space – then freshly pick them to enhance any dish instantly. What’s more, with this exclusive <a href=\"https://plantsavers.co.uk/collections/pantry/products/kitchen-classics-herb-pack?utm_source=immediate&amp;utm_medium=promo&amp;utm_campaign=herbpack\" target=\"_blank\">deal</a>, you can get them for just £24.99, instead of the usual £29.99.</p>\n<p><a href=\"https://plantsavers.co.uk/collections/pantry/products/kitchen-classics-herb-pack?utm_source=immediate&amp;utm_medium=promo&amp;utm_campaign=herbpack\" target=\"_blank\">Save 17% now</a></p>\n<section>\n    <div>\n        <p><em><strong>Note: </strong></em><i>We negotiate hard to bring you great offers and the best prices in our online deals. We receive a commission from the retailer for each completed purchase and this income helps us to continue to be able to offer you our high-quality content free of charge.</i></p>\n<p>\n\n    </p></div>\n    </section>\n\n<p></p><p>PlantSavers always selects the best seasonal herbs. You will receive a mix of eight herb plants including:</p>\n<p>– Rosemary: A vital ingredient for Mediterranean cooking</p>\n<p>– Parsley: This old favourite can be chopped to add freshness to any meal</p>\n<p>– Basil: The aroma is hard to beat, making it a fantastic addition to pizza and pasta</p>\n<p>– Oregano: A robust herb that features in various European cuisines</p>\n<p>– Coriander: Adds great flavour to various dishes, a common ingredient in Asian recipes</p>\n<p>– Mint: Add to drinks or for a refreshing feature in your cooking</p>\n<p>– Curry Plants: Tastes great and it will smell lovely in your kitchen</p>\n<p>– Chamomile: Make your own delightfully calming tea</p>\n<p>All herbs are grown in the UK and come in 9cm pots.</p>\n<p>Note: These photos may not match the exact plants, varieties, size and state of the plants you receive.</p>\n<p><a href=\"https://plantsavers.co.uk/collections/pantry/products/kitchen-classics-herb-pack?utm_source=immediate&amp;utm_medium=promo&amp;utm_campaign=herbpack\" target=\"_blank\">Save 17% now</a></p>\n<p><em>You can find all our current shopping deals<strong> <a href=\"https://www.bikeradar.com/bikeradar-daily-deals/\" target=\"_blank\">here</a></strong>. If you have any questions about the deal product or the related services, please contact the provider directly. If you have any questions about the online shopping deal itself, or if you would like to work with us as a partner, please email <a href=\"mailto:deals@bikeradar.com\" target=\"_blank\">deals@bikeradar.com</a></em></p>","author":"Steve Newell","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f1f73d82d17f5009d8b4888339be36e34b27d26b1904fadfe73905fc0a01b1d4","category":"Cycling"}