{"title":"WWDC last-minute rumors: iPadOS 15, iOS 15, watchOS apps, and more","link":"https://www.macworld.com/article/348100/wwdc-last-minute-rumors-ipados-15-ios-15-watchos-apps-and-more.html","date":1622976300000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>With the WWDC keynote just hours away, the rumors keep trickling in. Keep checking back for the latest we’ve heard right up <a href=\"https://www.macworld.com/article/342028/wwdc-2021-how-to-watch-ios-15-macos-12-macbook-pro-june-7.html\">until the keynote kicks off at 9am PT</a>.</p>\n\n\n\n<p><strong>Focus on apps:</strong> On Twitter, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/JoannaStern/status/1400845550958911495&amp;xcust=1-1-348100-0-0-0&amp;sref=https://www.macworld.com/feed\">Wall Street Journal reporter Joanna Stern</a> says there are “big updates coming to Safari, Health, Maps and iMessage.”</p>\n\n\n\n<figure><div>\n<blockquote><p>Of course, next week at WWDC the walls will get even higher. I hear there are big updates coming to Safari, Health, Maps and iMessage at WWDC next week.</p>— Joanna Stern (@JoannaStern) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/JoannaStern/status/1400845550958911495?ref_src=twsrc%5Etfw&amp;xcust=1-1-348100-0-0-0&amp;sref=https://www.macworld.com/feed\">June 4, 2021</a></blockquote>\n</div></figure>\n\n\n\n<p><strong>iPadOS 15:</strong> <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-06-05/apple-to-boost-ipad-features-privacy-tools-at-developer-event&amp;xcust=1-1-348100-0-0-0&amp;sref=https://www.macworld.com/feed\">Mark Gurman from Bloomberg</a> has a couple of tidbits about iPadOS 15. Like iOS 14, Apple will reportedly let users place widgets anywhere on the screen. He also reports that Apple is planning to revamp the home screen, likely bringing the App Library that was also introduced with iOS 14, to the large screen. Additionally, Gurman says Apple is also planning “an improved multitasking system to make it easier to operate multiple apps at the same time.”</p>\n\n\n\n<p><strong>Privacy: </strong>Gurman also reports that Apple will continue its privacy push with new settings to counter invasive apps. To go along with the App Tracking Transparency in iOS 14, Apple will reportedly “a control panel that provides in-depth detail on what data are being collected by each third-party app installed on a user’s device.” That sounds similar to Google’s Privacy Dashboard in Android 12.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/facebook-app-tracking.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>App Tracking Transparency is just the start of Apple’s new intense privacy push.</figcaption></figure><p>Facebook</p></div>\n\n\n\n<p><strong>Notifications:</strong> Bloomberg reports that Apple is eying big changes to how notifications are handled, including the ability to “set a status — such as whether you are driving, sleeping, working or don’t want to be disturbed” which will determine how alerts are delivered. iOS 15 will also reportedly feature a new design for banners that alert you to incoming notifications.</p>\n\n\n\n<p><strong>Messages:</strong> <a href=\"https://www.macworld.com/article/342667/ios-15-features-appearance-apps-privacy-always-on-lock-screen-security-wishlist-release-beta.html\">Bloomberg previously reported</a> that Apple is looking to expand Messages to be more of a WeChat-style social network, and Gurman reiterates that the Messages app in iOS 15 will “receive enhancements on the way toward (that) eventual goal.” He also says Apple is tweaking the way users can auto-reply to messages.</p>\n\n\n\n<p><strong>Lock screen: Also previously reported were</strong> changes coming to the iPhone and iPad lock screen, but now he says “some of those changes have been pushed back to a future release and won’t appear this year.”</p>\n\n\n\n<p><strong>Apple Watch apps:</strong> iOS developer <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/KhaosT/status/1401294687374233600&amp;xcust=1-1-348100-0-0-0&amp;sref=https://www.macworld.com/feed\">Khaos Tian on Twitter</a> spotted references to several new Apple Watch apps: Mind, Find My, Tips, and Contacts.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f1f863b46d812bd0fc833cb57ceff3b36da5981615486efdae96571454486575","category":"Apple"}