{"title":"Large cryptocurrency miners in US now have to report energy use to government","link":"https://arstechnica.com/?p=2001578","date":1707316209000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/crypto-800x531.jpg\" alt=\"crypto farm\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/crypto.jpg\">Enlarge</a> <span>/</span> A worker installs a row of new mining machines at the largest bitcoin mining facility in the US, located in Rockdale, Texas, on October 9, 2021. Experts say lax regulation and cheap electricity in the US are a draw for bitcoin miners, whose energy-gulping computers race to unlock units of the currency.  (credit: Mark Felix/AFP via Getty)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Biden administration is now requiring some cryptocurrency producers to report their energy use following rising concerns that the growing industry could pose a threat to the nation’s electricity grids and exacerbate climate change.</p>\n<p>The Energy Information Administration <a href=\"https://www.eia.gov/pressroom/releases/press550.php\">announced last week</a> that it would start collecting energy use data from more than 130 “identified commercial cryptocurrency miners” operating in the US. The survey, which started this week, aims to get a sense of how the industry’s energy demand is evolving and where in the country cryptocurrency operations are growing fastest.</p>\n<p>“As cryptocurrency mining has increased in the United States, concerns have grown about the energy-intensive nature of the business and its effects on the US electric power industry,” the EIA said in <a href=\"https://www.eia.gov/todayinenergy/detail.php?id=61364\">a new report</a>, following the announcement. “Concerns expressed to EIA include strains to the electricity grid during periods of peak demand, the potential for higher electricity prices, as well as effects on energy-related carbon dioxide emissions.”</p></div><p><a href=\"https://arstechnica.com/?p=2001578#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2001578&amp;comments=1\">Comments</a></p>","author":"Inside Climate News","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f1fdf105d6e703708e1a4b4b7546b9c3e32844df98c0ef41e4e7ee95ca80103e","category":"Tech"}