{"title":"How to change the window background color and image for macOS’s Terminal","link":"https://www.macworld.com/article/187338/termbkgnd.html","date":1625901300000,"content":"\n<div>\n<section><div></div></section><p>As you may or may not know, you can customize the background of a Terminal window in macOS. You can use either a color or an image, and you can also set a transparency level for the selected color or image. You access these settings in the <em>Terminal</em> &gt; <em>Preferences</em> screen; click the <em>Profiles</em> tab.</p>\n\n\n\n<p>On the left, you’ll find a column of shell profiles, each using different color combinations. You can select one of those, or you can customize a profile. Click on a profile, and then in the main section of the window, you find the profile’s settings. To change the background color, click the <em>Color &amp; Effects</em> button in the Background section. A color picker window will pop up, and you can select the color of your choice</p>\n\n\n\n<p>If you want to use an image, click the pop-up menu next to the Image setting. When clicked, a <em>Choose</em> button appears, and then when you click on that, the file dialog appears. Navigate to the image you want to use, select it, and click the <em>Open</em> button. When you open a new window, the image will be in the background.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/macos-terminal-profiles.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>You can change the window background color or use an image in the Profiles sectin of the Terminal preferences.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Here’s a trick: instead of selecting a particular image file, select a <em>folder</em> that contains a number of images and click Open. Now every time you open a new Terminal window (Command-N), Terminal will randomly display one of the selected images from the folder you specified. Whether you find this effect interesting, useful, or distracting probably depends on the types of images you choose to place in the chosen folder. </p>\n\n\n\n<p>But here’s one way to use this trick that might actually be useful—or at worst, not incredibly distracting. In your favorite image editor, create a new image with relatively tiny dimensions—say 20×20 pixels. Fill this image with a color you’d like to use as a Terminal background, and save it to a “Terminal Colors” folder (or whatever you’d care to call it) as a TIFF, PNG, or JPEG (other formats probably work fine, too; these are the three I tested). Now change the fill to another color you’d like to use for your background, and save it as a new name to the same folder. Repeat until you have a nice assortment of background colors saved to that folder.</p>\n\n\n\n<p>Switch to Terminal and repeat the steps to set an image as the window background. Select the Terminal Colors folder you made for your background images. Now, every time you open a new Terminal window, you’ll see one of your color swatches as the background—Terminal automatically scales your tiny image to fill the Terminal’s screen. And while solid colors might not be as interesting to look at as fancy background images, they’re much less distracting to the eye—and not nearly as boring as using the same color every time you open Terminal.</p>\n\n\n\n<h2>Use drag and drop to test colors</h2>\n\n\n\n<p>In macOS, you can try different colors for your Terminal window by dragging and dropping color swatches onto the window. To use drag-and-drop, you need to get a color picker on the screen. You can get one by clicking <em>Terminal</em> &gt; <em>Preferences</em> &gt; <em>Profiles</em>, and then click on any of the color boxes next to Color &amp; Effects, Text, Bold Text, Selection, Cursor, or any of the boxes under ANSI Colors. A color picker window will appear.</p>\n\n\n\n<p>To change the background color, drag a color swatch from the color picker and drop it on the window. Repeat as necessary with varying colors until you have one you like. </p>\n\n\n\n<p>However, any color that you drag and drop does not change the setting permanently. To set the color permanently, you have to go to the color picker for Background: Color &amp; Effects in the Profiles settings and select the color.</p>\n</div>","author":"Rob Griffiths","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f203dd0018d45955d585b91ad78826fb6d52443afb232c7067c8decdcb6b3098","category":"Apple"}