{"title":"How to set up hardware security keys with your Apple ID","link":"https://www.macworld.com/article/1666866/hardware-security-keys-apple-id.html","date":1680512400000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>An Apple ID can be the key that unlocks your cloud treasure–but if it’s in the wrong hands, it can allow an interloper to destroy memories and contacts, access your financial information through password resets, impersonate you to friends in scams, and even track you without your permission.</p>\n\n\n\n<p>Apple continues to look for additional ways to protect your online life and devices by “hardening” how you log into an Apple ID from your devices and through the iCloud.com and Apple ID websites, among other places. The latest improvement came in January 2023 and requires a minimum of iOS 16.3, iPadOS 16.3, and macOS 13.2 on your devices.</p>\n\n\n\n<p>This update allows you to use hardware security keys that plug in via USB or Lightning or connect via NFC as a “second factor”–something in addition to a password that proves you are the legitimate account holder.</p>\n\n\n\n<p>Designed around a broadly supported industry protocol called FIDO (after the name of the trade group that developed it), a security key has a chip inside that can generate a set of encryption keys for each site at which you enroll with the security key. They can’t be spoofed, intercepted, or duplicated. You need physical possession of a key to use it.</p>\n\n\n\n<p>Several companies offer these keys. The firm Yubico pioneered them and has the largest variety, including one that has USB-C and Lightning plugs on opposite ends. They cost <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.techradar.com/best/best-security-key&amp;xcust=1-1-1666866-1-0-0&amp;sref=https://www.macworld.com/feed\">about $20 to $60 each</a>. Apple requires two for Apple ID enrollment. Some companies give these away as a promotion to improve account security. You don’t need two from the same maker, either.</p>\n\n\n\n<h2>Why you should use a security key</h2>\n\n\n\n<p>The cost of two keys, the need to keep them safe, and the requirement of having one whenever you need to log into your Apple ID could be too much for many people. Apple’s existing code-based two-factor authentication (2FA) system might work well enough for you, and it only requires possession of a trusted device associated with your Apple ID account or a phone number that you’ve validated to be trusted to receive text messages or automated voice calls.</p>\n\n\n\n<p>However, hardware security keys are being used for more and more websites as a method of strong account protection, and if you start using them, you might find it more convenient than other methods of logging in. Among other benefits? You can use the same hardware key on multiple devices and platforms, so you aren’t tying the login to, say, the iCloud Keychain syncing system.</p>\n\n\n\n<p>If you’re interested in shifting to hardware encryption keys for Apple ID logins, first purchase two of the above and then read on.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/213366-FIPS-family-layout-r3.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Yubico family of FIDO keys\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/213366-FIPS-family-layout-r3.jpg?quality=50&amp;strip=all 1500w, https://b2c-contenthub.com/wp-content/uploads/2023/03/213366-FIPS-family-layout-r3.jpg?resize=300%2C86&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/213366-FIPS-family-layout-r3.jpg?resize=768%2C220&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/213366-FIPS-family-layout-r3.jpg?resize=1200%2C344&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"344\" /><figcaption>Yubico’s full line of FIDO keys includes lots of sizes and connectors.</figcaption></figure><p>Yubico</p></div>\n\n\n\n<p>An important note: Apple doesn’t make it crystal clear in their document <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT213154&amp;xcust=1-1-1666866-1-0-0&amp;sref=https://www.macworld.com/feed\">About Security Keys for Apple ID</a> that security keys replace the company sending you six-digit codes via trusted devices or trusted phone numbers. Apple notes, “A security key can act as the second piece of information, instead of the six-digit verification code that is normally used.” However, in testing, with security keys enabled, the code-based method cannot be used. Disabling security keys reverts to codes.</p>\n\n\n\n<h2>How it works behind the scenes: a pair of keys</h2>\n\n\n\n<p>The security keys use public-key cryptography, something you might have heard about before. All the complexity is hidden from you as a user–one of the intents of the FIDO Alliance. In public-key cryptography, whenever you need a new identity–such as a key used for proving your ownership of an account at a website–an operating system or other software randomly generates a strong secret and derives a public key and a private key from them, which are intertwined mathematically.</p>\n\n\n\n<p>The private key is kept strictly secret by your software or hardware. Typically, it never leaves your device and may not even be directly accessible by you, its owner. The public key, however, can be freely shared. Other parties who possess your public key can use it both to encrypt messages that only you can read, decrypting them with your private key; and to verify that a document or other message you send them is valid. Your device can cryptographically “sign” a message with the private key, and anyone with the public key can be assured that it was signed only by you.</p>\n\n\n\n<p>With a hardware security key and the FIDO protocols, you enrolled at a website by signing up via your account settings to use two-factor authentication with a hardware key. Your hardware key creates the unique secret for the site and transmits the public key to the site, which stores it with your account information.</p>\n\n\n\n<p>When logging in later, here’s what happens:</p>\n\n\n\n<ul><li>The site issues a challenge using the public key that it previously stored for you.</li><li>Your operating system communicates with the security key to have it generate a response, signing the challenge with the private key for that website. (If the public key the website provided doesn’t match, it indicates a possible phishing attempt, and the process fails.)</li><li>Your operating system sends back the signed challenge.</li><li>The website uses the stored public key to validate it’s you. If so, you’re logged in.</li></ul>\n\n\n\n<p>While this might all sound fussy, you aren’t involved in any of the particulars. Instead, to use a security key, you insert it when prompted into a USB Type-A, USB-C, or Lightning jack and press, touch, or tap it. (You can leave it inserted and trigger it whenever prompted by your device or a website.) With a touchless NFC security key, you bring it near a device that supports NFC. The security key then generates the appropriate information at the time of enrollment or when you log back in later.</p>\n\n\n\n<h2>Enroll your Apple ID with security keys</h2>\n\n\n\n<p>You can enroll in security key authentication for your Apple ID via either iOS 16.3/iPadOS 16.3 or later or macOS 13.2 or later. You can’t enroll at iCloud.com or the Apple ID website.</p>\n\n\n\n<p>Apple requires you to have at least two security keys in case one is lost. You will want to store them in different locations that you have access to.</p>\n\n\n\n<p>In any situation in the past in which you were prompted to enter a code for authentication, you will now need to have one of your security keys handy. Apple explicitly notes that’s always the case for all of the following tasks:</p>\n\n\n\n<ul><li>Add a new device.</li><li>Log in to an Apple website with your Apple ID.</li><li>Reset your Apple ID.</li><li>Unlock a locked Apple ID account.</li><li>Add or remove security keys (but not remove security key authentication completely).</li></ul>\n\n\n\n<p><strong>Warning!</strong> If you lose both keys–or they’re stolen, broken, or destroyed–you can still rely on trusted devices to regain account access or remove keys and enroll new ones. However, if you can’t use your security keys and lose access to all trusted devices, your Apple ID account will likely be unavailable forever.</p>\n\n\n\n<p>After enabling security keys, you must use an iPhone or iPad whenever you need to sign in to a new Watch, Apple TV, or HomePod (any model). You can’t use a Mac for that purpose.</p>\n\n\n\n<h2>How to set up a security key with your Apple ID (macOS)</h2>\n\n\n\n<p>Here’s how to set up security keys for your Apple ID in macOS:</p>\n\n\n\n<ol><li>Go to  &gt; <em>System Settings</em> &gt; <em>Account Name </em>&gt; <em>Password &amp; Security</em> and click <em>Add</em> to the right of the <em>Security Keys</em> label.</li><li>Apple presents an overview of how security keys affect your account. Click <em>Add Security Keys</em> to continue.</li><li>Apple warns you two keys are required; click <em>Continue</em>.</li><li>Even though the dialog says Apple ID and “Apple ID wants to make changes,” enter your macOS account’s password and click <em>Allow</em>.</li><li>To add each security key, you’re presenting with an Add the First Security Key or Second Security Key screen. Follow these steps for both passes:<ol><li>Click <em>Continue</em>.</li><li>When prompted to Add Security Keys, insert the key if it has a plug and then activate it: press a button, hold it a certain way, or tap it.</li><li>Name the key uniquely–perhaps write a number on it in indelible marker–and click <em>Continue</em>. By default, Apple fills in the key’s model name.</li></ol></li></ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/add-security-key-macos-bordered.png\" alt srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/add-security-key-macos-bordered.png?quality=50&amp;strip=all 935w, https://b2c-contenthub.com/wp-content/uploads/2023/03/add-security-key-macos-bordered.png?resize=300%2C152&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/add-security-key-macos-bordered.png?resize=768%2C389&amp;quality=50&amp;strip=all 768w\" width=\"935\" height=\"473\" /><figcaption>Click Add to start the process.</figcaption></figure></div>\n\n\n\n<ol><li>After enrolling both keys, Apple provides a list of devices currently signed into your iCloud account. You can select those to log out at this step, click <em>Stay Signed In to All</em>, or even click <em>Cancel</em> to end the process without enrollment.</li><li>At the acknowledgment screen, click <em>Done</em>.</li></ol>\n\n\n\n<p>Apple sends an email to your Apple ID-associated address to confirm enrollment (or alert you of that fact).</p>\n\n\n\n<h2>How to set up a security key with your Apple ID (iOS/iPadOS)</h2>\n\n\n\n<p>The process is nearly identical to using macOS. Two differences:</p>\n\n\n\n<ul><li>Start at <em>Settings</em> &gt; <em>Account Name</em> &gt; <em>Password &amp; Security</em> and tap <em>Add Security Keys</em>.</li><li>When you’re prompted to add a key in step 5-&gt;1 above, you can also bring an NFC-equipped security key near the top of your iPhone or iPad and it will be recognized and activated.</li></ul>\n\n\n\n<h2>How to remove security keys or disable them altogether</h2>\n\n\n\n<p>Apple doesn’t require a security key to be present to remove it or disable security key authentication. Go to <em>Settings</em> (iOS/iPadOS)/<em>System Settings</em> (macOS) &gt; <em>Account Name</em> &gt; <em>Password &amp; Security</em>. Tap <em>Security Keys</em> or click <em>Edit</em> next to the <em>Security Keys</em> label. (This is a security risk: someone with access to your iPhone or iPad passcode can disable hardware security key authentication and then use code-based two-factor verification <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.wsj.com/articles/apple-iphone-security-theft-passcode-data-privacya-basic-iphone-feature-helps-criminals-steal-your-digital-life-cbf14b1a&amp;xcust=1-1-1666866-1-0-0&amp;sref=https://www.macworld.com/feed\">as discussed in this <em>Wall Street Journal</em> article</a> about thefts and physical attacks.)</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/list-security-keys-maco-bordered.png\" alt srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/list-security-keys-maco-bordered.png?quality=50&amp;strip=all 944w, https://b2c-contenthub.com/wp-content/uploads/2023/03/list-security-keys-maco-bordered.png?resize=300%2C205&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/list-security-keys-maco-bordered.png?resize=768%2C524&amp;quality=50&amp;strip=all 768w\" width=\"944\" height=\"644\" /><figcaption>Apple lets you see your keys and when you enrolled them, and lets you act upon them. You can also remove security key protection.</figcaption></figure></div>\n\n\n\n<p>You can remove a single key only if you have three or more enrolled.</p>\n\n\n\n<p>In iOS/iPadOS:</p>\n\n\n\n<ul><li>Tap an entry, and you can rename it, or tap <em>Remove Key</em> and confirm to remove it. You’ll need a security key to finish.</li><li>Tap <em>Remove All Keys</em> and confirm by tapping <em>Remove</em> to disable authentication. Then enter your iPhone or iPad passcode.</li><li>Tap <em>Add Security Key</em> to enroll additional keys. Apple prompts you for one of your existing security keys to finish.</li></ul>\n\n\n\n<p>In macOS:</p>\n\n\n\n<ul><li>Click an entry’s name to change the name.</li><li>Select an entry and click the minus (-) icon to remove it and confirm its removal, then provide the security key.</li><li>Click <em>Remove All Keys</em> and enter your macOS account password.</li><li>Click the plus (+) icon to enroll additional keys. Apple prompts you for an already-enrolled security key to finish.</li></ul>\n\n\n\n<p>In both cases, code-based 2FA is now re-enabled.</p>\n\nApple, iCloud, Security</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f20476537e12fec0251d7f24184309d5b3427ca47d10fd0cdb7c8c78fa643b93","category":"Apple"}