{"title":"Healthy city evaluation based on factor analysis—Taking cities in the Guangxi Zhuang Autonomous Region as an example","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306344","date":1720792800000,"content":"<p>by Hui Huang, Shuxin Huang, Shaoyao He, Yong Lu, Shuguang Deng</p>\r\n\r\nAs urbanization speeds up, the concept of healthy cities is receiving more focus. This article compares Chongzuo and Nanning in Guangxi with Beijing to assess the development gaps in cities in Guangxi. An indicator system for healthy cities was designed from six dimensions—healthy economy, healthy population, healthy healthcare, healthy environment, healthy facilities, and healthy transportation—and 26 secondary indicators, which were selected from 2005 to 2022, and an improved factor analysis was used to synthesize a healthy city index (HCI). The number of factors was determined by combining characteristic roots and the variance contribution rate, and the HCI was weighted using the entropy-weighted Topsis method. A comprehensive evaluation of the urban health status of these cities was conducted. The results showed that extracting six common factors had the greatest effect, with a cumulative variance contribution rate of 93.83%. Chongzuo city scored higher in the field of healthcare. The healthy environment score of Nanning was relatively high, which may be related to continuous increases in green measures. In terms of the healthy economy dimension, Beijing was far ahead. However, in recent years, the healthy economy level in Chongzuo has increased, and the GDP growth rate has ranked among the highest in Guangxi. In addition, the growth rate of healthy facilities in Nanning was relatively fast and has been greater than that in Chongzuo in recent years, which indicates that the Nanning Municipal Government believes urban construction and municipal supporting facilities are highly important. In terms of healthy transportation, Chongzuo and Nanning scored higher than Beijing. This may be because the transportation in these two cities is convenient and the traffic density is more balanced than that in Beijing, thereby reducing traffic congestion. Chongzuo had the highest score for a healthy population, and a steadily growing population provides the city with stable human resources, which helps promote urban economic and social development. Finally, relevant policy recommendations were put forwards to enhance the health level of the cities.","author":"Hui Huang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f204ccf607130a55c8b474a5f8aec3efe24dd06a05e80dfcfc3e1f9495557904","category":"Interdisciplinary"}