{"title":"Transnationalism and Hegemonic Masculinity: Experiences of Gender-Based Violence among African Women Immigrants in Canada","link":"https://www.preprints.org/manuscript/202407.0844/v1","date":1720605317000,"content":"Gender-based violence (GBV) is an age-long issue plaguing societies all over the globe. Over the years, GBV perpetrated against women has been justified and legitimized by patriarchal and hegemonic masculine structures. This study explored the role of hegemonic masculinities and transnational cultural conflicts in creating a suitable environment for GBV against women to thrive amongst African immigrants in Canada, gathering perspectives of African immigrants and of the service providers working in immigrant-serving organizations. The paper adopts a qualita-tive approach and is hinged on the transnationalism framework. This framework argues that im-migrants maintain connections while transitioning to their countries of destinations. In such pro-cesses, immigrants carry with them their beliefs about cultural norms and hegemonic masculinity, of their country of origin. A total of 13 women immigrants and 20 service providers were pur-posively recruited to participate in the semi-structured interview. The interviews were recorded and transcribed verbatim. The data were analysed thematically and organized using the Nvivo version 12. Findings show that African immigrant women in Canada continue to disproportion-ately bear the burden of GBV due hegemonic masculinities. The construction of masculinity in immigrant population is heavily reliant on the communities of origin. As such, the prevailing sys-tems during and post migration such as – unstable residency status, fear of deportation, fear of social and family sanctions and stigmatization, economic dependence on their spouses, and fear of retaliation from their spouses creates an environment that supports toxic masculinity. The study recommends a comprehensive and culturally sensitive programs and services to support African immigrants affected by hegemonic masculinity and GBV.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f206c57b3a548cdef7c2e29c56a4caf81d4ea060ae2284a752d41478b1526171","category":"Interdisciplinary"}