{"title":"Apple Likely Filed for Headset-Related 'Deep Screen' Trademark in 2017","link":"https://www.macrumors.com/2023/05/16/apple-deep-screen-trademark-application/","date":1684252391000,"content":"The same \"Deep Dive LLC\" shell company that <a href=\"https://www.macrumors.com/2023/05/16/apple-registers-xros-headset-wordmark/\">filed for an \"xrOS\" trademark</a> in New Zealand last week also filed for a \"Deep Screen\" trademark in the U.S. and over two dozen other countries around the world in 2017 and 2018, according to online records. The additional filing was brought to our attention by <a href=\"https://twitter.com/Schappi/status/1658409251830927360\">Marcus Schappi</a>. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/apple-ar-concept-2-blue.jpg\" alt width=\"1280\" height=\"720\" /><div><em>Apple headset mockup by designer <a href=\"https://zelbo.nyc/\">Ian Zelbo</a></em></div>\r<br />\nApple is likely behind the \"Deep Screen\" trademark filing given <em>Bloomberg</em>'s Mark Gurman has reported that <a href=\"https://www.macrumors.com/2022/12/01/apple-headset-operating-system-xros/\">\"xrOS\" will be the name</a> of the operating system for Apple's long-rumored AR/VR headset, which the company is expected to unveil during WWDC next month. Apple has routinely used shell companies registered with the Delaware Corporation Trust Center to secretly apply for trademarks related to future products.\r<br />\n\r<br />\nIt's unclear if Apple still plans to use \"Deep Screen\" for its headset, as the U.S. Patent and Trademark Office <a href=\"https://tsdr.uspto.gov/#caseNumber=87666876&amp;caseType=SERIAL_NO&amp;searchType=statusSearch\">marked the application as abandoned</a> in July 2022 after the shell company failed to file a statement explaining how the trademark would be used within the required timeframe. The shell company had filed for and received a maximum of five six-month extensions on the deadline to submit the statement and never ended up doing so. The application is still registered or pending in some other countries, such as Canada and New Zealand.\r<br />\n\r<br />\nOn a speculative basis, the \"Deep Screen\" name could be Apple's branding for the screen inside its headset, with \"deep\" potentially referring to an immersive virtual reality and augmented reality experience. However, given the age of the trademark application and its abandoned status in the U.S., it's unclear if the name will still be used.\r<br />\n\r<br />\nLast year, Gurman reported that another shell company named \"Immersive Health Solutions LLC\" applied for <a href=\"https://www.macrumors.com/2022/08/29/apple-ar-vr-headset-trademark-reality-one/\">\"Reality Pro\" and \"Reality One\" trademarks</a> in over two dozen countries. Apple is likely behind these applications as well, and perhaps one of them will be the name of Apple's headset. WWDC begins with Apple's keynote <a href=\"https://www.macrumors.com/2023/03/29/apple-announces-wwdc-2023/\">on June 5</a>, so we're likely just under three weeks away from the headset being unveiled.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ar-vr/\">AR/VR Headset</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/16/apple-deep-screen-trademark-application/\">Apple Likely Filed for Headset-Related 'Deep Screen' Trademark in 2017</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-likely-filed-for-headset-related-deep-screen-trademark-in-2017.2389689/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f2144cc8241d7dd2d5fb13bd92a5713468fa598a40adc8184c0ad75862682509","category":"Apple"}