{"title":"Public perspectives on increased data sharing in health research in the context of the 2023 National Institutes of Health Data Sharing Policy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309161","date":1724853600000,"content":"<p>by Stephanie Niño de Rivera, Ruth Masterson Creber, Yihong Zhao, Sarah Eslami, Sabrina Mangal, Lydia S. Dugdale, Meghan Reading Turchioe</p>\r\n\r\nThe National Institutes of Health (NIH) is the largest public research funder in the world. In an effort to make publicly funded data more accessible, the NIH established a new Data Management and Sharing (DMS) Policy effective January 2023. Though the new policy was available for public comment, the patient perspective and the potential unintended consequences of the policy on patients’ willingness to participate in research have been underexplored. This study aimed to determine: (1) participant preferences about the types of data they are willing to share with external entities, and (2) participant perspectives regarding the updated 2023 NIH DMS policy. A cross-sectional, nationally representative online survey was conducted among 610 English-speaking US adults in March 2023 using Prolific. Overall, 50% of the sample identified as women, 13% as Black or African American, and 7% as Hispanic or Latino, with a mean age of 46 years. The majority of respondents (65%) agreed with the NIH policy, but racial differences were noted with a higher percentage (28%) of Black participants indicating a decrease in willingness to participate in research studies with the updated policy in place. Participants were more willing to share research data with healthcare providers, yet their preferences for data sharing varied depending on the type of data to be shared and the recipients. Participants were less willing to share sexual health and fertility data with health technology companies (41%) and public repositories (37%) compared to their healthcare providers (75%). The findings highlight the importance of adopting a transparent approach to data sharing that balances protecting patient autonomy with more open data sharing.","author":"Stephanie Niño de Rivera","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f219e9867f5fee06c3306edd246d6cd15b7af5fbb024328ea29a7224f630bc0d","category":"Interdisciplinary"}