{"title":"Effects of an essential oil blend rich in cinnamaldehyde and carvacrol on rumen biohydrogenation and fatty acid profile in the longissimus lumborum of growing lambs","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13782?af=R","date":1723030580000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Essential oils extracted from cinnamon bark and oregano are rich in cinnamaldehyde and carvacrol and show potential for promoting animal performance. However, their impact on rumen biohydrogenation and the fatty acid composition of meat has not been reported. The hypothesis of this study was that a blend of essential oils rich in cinnamaldehyde and carvacrol would inhibit rumen biohydrogenation and promote the accumulation of polyunsaturated fatty acids (PUFAs) in lamb meat. The present study evaluated the effect of a blend essential oil (EO) rich in cinnamaldehyde and carvacrol on the nutrient digestibility, rumen biohydrogenation, growth performance, and fatty acid profile of the <i>longissimus lumborum</i> of lambs.</p>\n<h2>RESULTS</h2>\n<p>Sixty male lambs with an average age of 84 ± 0.98 days and initial body mass of 25.4 ± 0.29 kg (mean ± standard deviation) were assigned randomly to four diets, and supplemented with 0 (EO0), 30 (EO30), 60 (EO60), and 120 (EO120) mg kg<sup>−1</sup> dry matter of EO for 60 days. Although dry matter and neutral detergent fiber digestibility all showed a linear decrease (<i>P</i> ≤ 0.02) with increasing quantities of EO, final body mass and average daily gain increased linearly (<i>P</i> = 0.04), and average daily weight gain (ADG)/dry matter intake (DMI) tended to increase linearly (<i>P</i> = 0.07). Increasing EO supplementation resulted in a linear decrease in total volatile fatty acid concentration, acetate molar percentage, and acetate-to-propionate ratio (<i>P</i> ≤ 0.03), with the EO120 treatment being lower than the other EO treatments (<i>P</i> ≤ 0.05). Seven lambs from the EO120 treatment and seven lambs from the EO0 treatment were randomly slaughtered. It was observed that the proportions of C18:2n6c and PUFA in <i>longissimus lumborum</i> were higher in the EO120 treatment than the EO0 treatment (<i>P</i> ≤ 0.05). The relative abundance of Firmicutes in the rumen was decreased by the EO120 treatment in comparison with the EO0 treatment (<i>P</i> ≤ 0.05). Furthermore, the predicted relative abundances of genes encoding for conjugated linoleic acid reductase tended to decrease with the EO120 treatment (<i>P</i> = 0.06).</p>\n<h2>CONCLUSIONS</h2>\n<p>We demonstrated that supplementation of the EO blend rich in cinnamaldehyde and carvacrol can enhance lamb growth performance and promote the deposition of desirable PUFAs in meat. © 2024 Society of Chemical Industry.</p>","author":"Zhiyuan Ma, \nYarong Meng, \nFei Li, \nEmilio Ungerfeld, \nJirong Lv, \nBaocang Liu, \nShirong Li, \nXinji Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"f21933ca7c0cca3207cb4f3b6dbb02d0aeddb1e17767f2f2d0904b9a574004e4","category":"Environment"}