{"title":"Association between seated trunk control and cortical sensorimotor white matter brain changes in patients with chronic low back pain","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309344","date":1724940000000,"content":"<p>by John R. Gilliam, Pradeep K. Sahu, Jennifer M. C. Vendemia, Sheri P. Silfies</p>\r\n\r\nTrunk control involves integration of sensorimotor information in the brain. Individuals with chronic low back pain (cLBP) have impaired trunk control and show differences in brain structure and function in sensorimotor areas compared with healthy controls (HC). However, the relationship between brain structure and trunk control in this group is not well understood. This cross-sectional study aimed to compare seated trunk control and sensorimotor white matter (WM) structure in people with cLBP and HC and explore relationships between WM properties and trunk control in each group. Thirty-two people with cLBP and 35 HC were tested sitting on an unstable chair to isolate trunk control; performance was measured using the 95% confidence ellipse area (CEA<sub>95</sub>) of center-of-pressure tracing. A WM network between cortical sensorimotor regions of interest was derived using probabilistic tractography. WM microstructure and anatomical connectivity between cortical sensorimotor regions were assessed. A mixed-model ANOVA showed that people with cLBP had worse trunk control than HC (F = 12.96; p &lt; .001; ηp<sup>2</sup> = .091). There were no differences in WM microstructure or anatomical connectivity between groups (p = 0.564 to 0.940). In the cLBP group, WM microstructure was moderately correlated (|r| = .456 to .565; p ≤ .009) with trunk control. Additionally, the cLBP group demonstrated stronger relationships between anatomical connectivity and trunk control (|r| = .377 to .618 p &lt; .034) compared to the HC group. Unique to the cLBP group, WM connectivity between right somatosensory and left motor areas highlights the importance of interhemispheric information exchange for trunk control. Parietal areas associated with attention and spatial reference frames were also relevant to trunk control. These findings suggest that people with cLBP adopt a more cortically driven sensorimotor integration strategy for trunk control. Future research should replicate these findings and identify interventions to effectively modulate this strategy.","author":"John R. Gilliam","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f2222a198823c4f976426377747353a2f5f7c5b665cbd75bea610a201daa1d66","category":"Interdisciplinary"}