{"title":"กูเกิลพบบั๊กในซีพียูอินเทล ทำเครื่องแครชได้ทั้งเครื่องแม้รันใน VM กระทบ  Core รุ่นที่ 10 ขึ้นไป","link":"https://www.blognone.com/node/136750","date":1700021934000,"content":"<div><div><div><p>Tavis Ormandy จาก Project Zero ของกูเกิลรายงานถึงช่องโหว่ Reptar (CVE-2023-23583) ที่อาศัย bit ที่ไม่ได้ใช้งานของคำสั่ง MOVSB ที่ใช้ย้ายข้อมูลเข้าไปยัง register เมื่อรันคำสั่งที่ผิดพลาดแบบนี้อย่างจงใจจะทำให้ซีพียูหลุดไปสู่สถานะที่ไม่ได้กำหนดการทำงานไว้ ส่งผลให้เครื่องแครชไปได้ทั้งเครื่อง แม้จะรันโค้ดอยู่ใน virtual machine ที่ถูกจำกัดสิทธิ์ไว้ก็ตาม</p>\n<p>บั๊กนี้เกิดจากฟีเจอร์ Fast Short Repeat Move (FSRM) ที่เป็นฟีเจอร์สำหรับย้ายสตริงด้วยความเร็วสูง ในซีพียูที่เปิดฟีเจอร์นี้ไว้และสั่งคำสั่ง MOVSB โดยใส่ค่า prefix ของ register ให้ผิดพลาดอย่างจงใจ ซีพียูจะหลุดเข้าไปอยู่ใน state  ที่ผิดพลาดและ halt หยุดการทำงานไปเลย โดย FSRM นั้นเพิ่มเข้ามาตั้งแต่ซีพียู Ice Lake ขึ้นมา</p>\n<p>ผลกระทบเบื้องต้นของ Repter คือการที่ลูกค้าคลาวด์สามารถทำเครื่องให้แครชได้ กระทบลูกค้ารายอื่นๆ ไปด้วย และมีความเป็นไปได้ว่าจะสามารถยกระดับสิทธิ์ของโค้ดที่รันอยู่เพื่อควบคุมเครื่องทั้งเครื่องได้</p>\n<p>Ormandy พบบั๊กนี้จากการทำ Oracle Serialization ที่อาศัยการเขียนโปรแกรมสุ่มๆ แล้วแปลงโค้ดโดยแทรกคำสั่ง fence ที่บังคับให้ซีพียูรันคำสั่งตามลำดับ จากเดิมที่ซีพียูอาจจะสลับคำสั่งไปมาเพื่อเร่งความเร็ว จากนั้นดูผลสุดท้ายว่าซีพียูอยู่ในสถานะเดียวกันหรือไม่ หากต่างกันก็แสดงว่ามีความผิดปกติบางอย่าง</p>\n<p>ตอนนี้อินเทลออกแพตช์ให้ซีพียูทั้งหมดที่ได้รับผลกระทบแล้ว ผู้ใช้ทั่วไปน่าจะได้รับอัปเดตเฟิร์มแวร์จากผู้ผลิตระบบปฏิบัติการเร็วๆ นี้</p>\n<p>ที่มา - <a href=\"https://cloud.google.com/blog/products/identity-security/google-researchers-discover-reptar-a-new-cpu-vulnerability/\">Google Cloud Blog</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e61735c0ef2cf3344a5e3a7fb4e66b0d.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/intel\">Intel</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/cpu\">CPU</a></div><div><a href=\"/topics/security\">Security</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f22716394f479017e0c78a1f9af740c13d982ff54eb472b4cc59b6078f8415ab","category":"Thai"}