{"title":"Low handgrip strength with asymmetry is associated with elevated all-cause mortality risk in older Chinese adults with abdominal obesity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306982","date":1723557600000,"content":"<p>by Ling Wei, Binyou Wang, Yilin Wang</p>\r\nBackground and objectives <p>Low handgrip strength (HGS) and abdominal obesity (AO) have been reported to be linked to an increased all-cause mortality risk in older adults. However, the combined impact of AO with low HGS and/or HGS asymmetry on mortality risk remains unclear. Therefore, this study aimed to investigate the synergistic effects of AO and abnormal HGS on mortality risk among Chinese older adults.</p> Methods <p>Baseline data of the China Health and Retirement Longitudinal Study in 2011, along with mortality outcomes obtained in 2018 were used for the analysis. Low HGS was identified as HGS &lt;18 kg in women or &lt;28 kg in men, while HGS asymmetry is defined as an HGS of either hand &gt; 10% stronger than the other. AO was characterized by a waist circumference ≥90 cm in men and ≥85 cm in women. Logistic regression analysis was used to evaluate the relationship between AO, abnormal HGS and mortality risk.</p> Results <p>A total of 5186 subjects aged 60 years or older were enrolled, 50.6% of whom were male. The proportions of participants with only AO, only low HGS, only HGS asymmetry, low HGS with asymmetry, both AO and low HGS, both AO and asymmetric HGS, and AO with both low HGS and asymmetry were 20.0%, 6.1%, 16.6%, 8.3%, 3.2%, 13.4%, and 3.9%, respectively. Over the course of a 7-year follow-up interval, 970 of these individuals died, with 13.4%, 12.4%, 13.6%, 15.5%, 4.1%, 10.1% and 6.9% of deaths in the above groups, respectively. The adjusted logistic regression analysis model confirmed that only low HGS (OR = 1.897, 95%CI: 1.386–2.596, <i>p</i>&lt;0.001), low HGS with asymmetry (OR = 1.680, 95%CI: 1.265–2.231, <i>p</i>&lt;0.001), and AO combined with both low HGS and asymmetry (OR = 2.029, 95%CI: 1.381–2.981, <i>p</i>&lt;0.001) were associated with a higher risk of mortality.</p> Conclusions <p>Low HGS, with or without asymmetry, is associated with increased mortality risk in older Chinese adults without AO, and the combination of low HGS and HGS asymmetry further elevates mortality risk in those with AO.</p>","author":"Ling Wei","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f22c327d2af196b8b32a201c47ae312efc9109f55dfb19ff997595cf4d39c6fc","category":"Interdisciplinary"}