{"title":"An Explainer: Garmin’s New Wearables LTE Strategy","link":"https://www.dcrainmaker.com/2021/06/garmin-lte-explainer.html","date":1622818800000,"content":"<p><span>﻿</span></p>\n<p>Garmin’s new Forerunner 945 LTE isn’t your typical LTE watch. It doesn’t allow you to make or receive calls over LTE. You can’t stream music over LTE. In fact, you can’t even make or receive text messages over LTE. And that’s just the way Garmin wants it – at least for now.</p>\n<p>Instead, the watch’s LTE functions are purely 100% sport and safety focused. They allow you to contact an emergency response coordination center if you’ve gotten hurt out solo on a trail. They let your friends and family follow your progress training or racing in real-time, automatically, every time you press start. And they allow your family members to send you quick audio messages mid-race, streamed to your headphones. Be it taunts or cheers.</p>\n<p>This change in direction is the realization that a company not named Apple or Samsung simply can’t leverage the telecom carrier over-lording to have a fully seamless experience for end users. At least this year, and likely not anytime soon. But, in losing one battle, they’ve done what they’ve done best over the last 3-5 years: Given up trying to be everything to everyone, and instead focused mainly on the sporty person. As a result – sales and revenue have never been higher.</p>\n<p>But how did Garmin get here? Well, that story is nearly a decade in the making.</p>\n<p>Also – if you want to see exactly what happens when you trigger an emergency response (without causing the ruckus yourself), simply hit the Play button above.</p>\n<h3><span>Garmin’s Cellular History:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5194.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5194_thumb.jpg\" /></a></p>\n<p>Garmin is not new to cellular connectivity – even if you didn’t realize it. And sometimes, it felt like Garmin probably didn’t realize it either. Their first fitness-focused fitness device was the <a href=\"https://www.dcrainmaker.com/2011/06/experimenting-with-using-garmin-gtu-10.html\">little GTU10 – Garmin Tracking Unit 10</a>, launched more than a decade ago. Frankly – it’s still probably the best sports-focused cellular GPS device any company has ever made. This small pod about the size of a pack of gum could track you for days at a time. It had a variable cellular transmission rate for how often it transmitted your GPS location, and even geofencing triggers. It could easily be stuffed anywhere from a jersey pocket to a saddlebag. A backpack to permanently wired inside a car. It was waterproof and had minimal fuss.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2011/06/experimenting-with-using-the-garmin-gtu-10-tracker-during-ironman-boise-70-3-thumb.jpg\" /></p>\n<p>As Garmin always does, the hardware wore different clothes in Garmin’s various production portfolio verticals. They pitched it to trucking companies for fleet management, as well as to pet owners as a way to keep track of Fido. After all, it was easily small enough to fit on a dog’s collar (and they even had a little case for exactly that).</p>\n<p>The challenge though was that it was region limited. There was basically a US version, and a European version. Garmin took care of the carrier relationship for you, and in fact the first year of service was free. After that it was $50/year for coverage. Pretty reasonable, by either today’s standards or back then. You didn’t have to worry about talking to your cellular carrier, as like an Amazon Kindle, that just happened magically behind the scenes.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2011/06/experimenting-with-using-the-garmin-gtu-10-tracker-during-ironman-boise-70-3-3.jpg\" /></p>\n<p>Unfortunately, Garmin killed off the device in 2016 – about 5 years after it launched. The company never greatly expanded network carrier access to it, thus, sales were always limited to the handful of countries Garmin supported it in. This would ultimately be the theme of Garmin’s cellular forays, and in fact, a theme that will continue through today’s announcements too.</p>\n<p>But when one product dies, another is born. The same year that Garmin killed off the GTU10, they acquired <a href=\"https://www.dcrainmaker.com/2017/01/launches-products-explorer.html\">DeLorme and their satellite locator</a> and messaging network, bypassing cellular altogether. But file that mental nugget away for a second, we’ll come back to that in a moment.</p>\n<p>Next, in 2018 <a href=\"https://www.dcrainmaker.com/2019/01/first-look-garmin-vivoactive-3-music-cellular-lte-for-verizon.html\">Garmin launched the Vivoactive 3 Music LTE</a>. This would be Garmin’s first go at attempting a cellular watch. And frankly, it was a hot mess. The project launched nearly a year and a half after the original Vivoactive 3 launched, which, wasn’t exactly when it intended to launch. But complexities associated with a number of areas kept pushing the launch back.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2019/01/DSC_4839_thumb.jpg\" /></p>\n<p>But the company was fighting fires on multiple fronts trying to get the Vivoactive 3 LTE more widely adopted. On one hand, they had to find a carrier partner to actually sell the watch. Sure, in theory, one would find a carrier partner in every country. In practice, even for a company of Garmin’s size that would be a nightmare beyond a handful of key partners. Ultimately, they ended up launching on Verizon only – likely through an incubator program that Verizon had at the time for IoT cellular devices.</p>\n<p>While Verizon had plenty of network quality gates that Garmin had to pass, the reality is that Verizon mostly didn’t care about these programs. Either from a marketing standpoint or a success perspective. It cost Verizon virtually nothing, it offered the appearance of having a diverse set of products in Verizon stores, and it kept the bigger companies on their toes. But ultimately, Verizon didn’t really care whether or not Garmin succeeded here. To them, it was just a random flash in the pan.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2019/01/DSC_4833_thumb.jpg\" /></p>\n<p>But Verizon’s nonchalance about the product was the least of the product’s challenges. The Vivoactive 3 LTE was this weird bastardization of technology. Part Vivoactive 3 Music, but with core features like WiFi actually removed. So if you wanted to download music you had to do it over LTE instead of WiFi. But…you couldn’t *stream* the music over LTE (or anything). And due to Apple limitations, for iOS users you’d either have two different phone numbers (one for your watch, and one for your phone), or your texts would constantly be out of sync if you tried to mirror one number.</p>\n<p>And while the watch was a hot mess, it did start to pave the road for how Garmin thinks about cellular connectivity. Garmin’s marketing for the Vivoactive 3 LTE shifted more and more over the last few years towards their safety and tracking features, rather than the underlying always-connected texting-type features. And for the handful of people that bought one, the primary benefit they’ve seen is simply for live tracking to send to friends and family – not text messaging while sitting at a café.</p>\n<p>I asked Garmin whether or not the Vivoactive 3 LTE’s purpose in life was more as a way to develop the technology than reach a sale, Garmin’s Forerunner product manager, Joe Heikes met me halfway on that question, saying:</p>\n<blockquote><p>“<i>Garmin never builds a product that we do not believe can stand entirely on its own, so it is not the case that Vivoactive 3 Music LTE was about building technology.  That being said, it is certainly true that it contributed in some ways to setting the stage for Forerunner 945 LTE.“</i></p></blockquote>\n<p>But even that was only just one piece of a required puzzle. Remember back though to a few years prior when Garmin bought DeLorme and their satellite connectivity technologies? On the surface, that wouldn’t seem to have anything to do with cellular wearables. But in fact, there were two elements from that acquisition. The first, being the platform for subscription management. Joe noted that was key to much of what we see here, saying:</p>\n<blockquote><p>“There were critical developments that enabled this for us, such as our purchase of DeLorme who already had a subscription management system and relationship with the Garmin IERCC, formerly known as GEOS, for emergency communications. We hope this creates a cleaner picture for the end customer who does not have to think about his/her current phone carrier.”</p></blockquote>\n<p>We saw Garmin leverage this (pre-GEOS acquisition) in the more widely accessible <a href=\"https://www.dcrainmaker.com/2018/05/garmin-inreach-mini-satellite-tracker-in-depth-review.html\">Garmin inReach Mini</a>, which is a small satellite communicator that doesn’t require cellular network. They then expanded integration of that device into virtually every bike computer and higher-end watch, so your Garmin watch can leverage satellite communicator technologies, <a href=\"https://www.dcrainmaker.com/2019/10/weekend-tidbits-hammerhead-adds-radar-support-elite-releases-upgrado-app-garmin-adds-edge-connection-to-inreach.html/comment-page-2#garmin-edge-inreach-integration\">even out of cellular range</a>.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2019/10/DSC_8336_thumb.jpg\" /></p>\n<p>Part of that equation though is the command center that handles those inbound emergency response calls/messages. This is a <a href=\"https://www.bloomberg.com/news/articles/2019-11-07/this-small-team-of-dispatchers-is-saving-lives-via-satellite\">manned facility where</a> real humans respond to people that have crashed planes, been in sinking boats, and hikers with injuries in the mountains. As a general life rule, you really want to avoid ever contacting this place. But, when you have to – their role is to save your bacon by coordinating with whichever rescue services are nearest to you, no matter where you are in the world. And Garmin has drip-drip-dripped a <a href=\"https://www.garmin.com/en-US/blog/tag/inreach/\">steady stream of these</a> <a href=\"https://www.garmin.com/en-US/blog/saved-by-garmin/5000th-inreach-sos/\">harrowing rescues</a> <a href=\"https://www.garmin.com/en-US/blog/outdoor/4000th-inreach-sos-incident/\">on their corporate</a> PR blog.</p>\n<p>However, behind the scenes, it was always a highly coordinated effort with a company called GEOS, who operated their International Emergency Response Coordination Center (IERCC). It’s another place you’ll want to put on your life rule list of entities you don’t want to chat with. They were the ones that technically handled the coordination between you stuck on the side of a mountain and getting the correct rescue teams to your location – be it in North Dakota, Nantucket, or Nepal. They did this from their primary operations center in Montgomery, Texas.</p>\n<p>As is often the case when something gets too important to Garmin, they bought it. Back this past January 2021, Garmin acquired GEOS and their technology. At the time GEOS boasted that their platform had saved 12,000 lives in 198 countries, of which 5,000 SOS incidents were from Garmin products/customers.</p>\n<p>And thus, Garmin had everything they needed to dramatically shift the direction of their cellular state of play.</p>\n<h3><span>Shift in Direction:</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5139_thumb-1.jpg\" /></p>\n<p>The key to ensuring a cohesive LTE watch experience for the masses is ultimately Apple allowing it to happen. While Android has the larger global market share of smartphones, it isn’t actually the majority platform for the target market of this device (and most sports tech products) – which skews more heavily in favor of iPhones. And at present, Apple locks down access to aspects like text messaging and calling, meaning only Apple Watch can integrate seamlessly with iOS. On Android it’s more open to vendors like Garmin, but as the Vivoactive 3 LTE proved, it’s an experience that still includes significant complexity and carrier relationships.</p>\n<p>Instead, for the Forerunner 945 LTE, Garmin has ignored the carriers entirely. Or at least, from your perspective. Behind the scenes, Garmin works with carriers in each country that provides data rates in bulk. But from your perspective you don’t care too much about that as it doesn’t show up on your cellular plan. Instead, you pay Garmin $6/month, and they take care of it all. Just as it was back on the original Garmin GTU10 a decade ago.</p>\n<p>And instead of focusing on text messaging and phone calls with friends, Garmin is focusing on sports features that leverage LTE, all of which are tracking and safety driven. These core features are grouped into Safety features and Spectator features. In total, here are the cellular features on the Garmin FR945LTE:</p>\n<p>– Sync completed workouts and related data via LTE (including 24×7 data, workouts, courses, and so on)<br />\n– LiveTrack via LTE<br />\n– LiveTrack Spectator Text Messages via LTE<br />\n– LiveTrack Spectator Audio Messages via LTE (to your headphones)<br />\n– Emergency assistance via Assistance Plus and the Garmin emergency response center – via LTE<br />\n– Emergency assistance via your predefined contacts (via LTE)<br />\n– Crash detection triggers via LTE, to the emergency response center<br />\n– Safety alerts (aka stalker alerts) trigger via LTE, to the emergency response center</p>\n<p>Meanwhile, here’s a list of things it won’t do via internal LTE:</p>\n<p>– It won’t sync your music/Spotify/etc via LTE (still requires WiFi)<br />\n– It won’t receive your text messages or missed phone calls (unless your phone is connected nearby)<br />\n– It won’t make phone calls for you</p>\n<p>Now, all of this does require a relationship with specific carriers, typically on a per country basis. Right now, that’s about 12 countries on the list. For those that had waited for Garmin to establish Garmin Pay contactless payments for your local bank, you’re probably wondering will this be the same level of forever as then?</p>\n<p>Garmin says no, it’ll be<em> “more straightforward than that”, saying that </em>“one thing that significantly simplifies this, which is both a blessing and a curse, is that the number of carriers in the world with compatible Cat M1 networks is not that great”. In that case, they’re referencing the <a href=\"https://www.soracom.io/iot-definitions/what-is-cat-m1/#:~:text=Category%20M1%20(Cat%20M1)%20is,data%20at%20a%20long%20range.&amp;text=This%20cellular%20technology%20benefits%20IoT%20applications%20for%20numerous%20reasons.\">category M1 network</a>, which is an LTE network designed for low-power devices like watches or sensors. Garmin’s wearable LTE features require a Category M1 network to function.</p>\n<p>Of course, even when it’s in your country, there’s then limitations on travel. You can’t take a US/Canada/New Zealand watch to Europe, and have it work there on LTE, because there are different LTE flavors (bands) in different countries. Apple has the exact same scenario – an American Apple Watch (cellular), won’t talk to European cellular networks.</p>\n<p>Now, I was curious what specifically the limiter is, since phones obviously roam just fine across networks. Was it battery power, size, certification, etc…? Garmin’s Joe Heikes explained:</p>\n<blockquote><p><em>“Frankly the biggest problem is physical.  As you know, there are already a bunch of antennas in a little tiny space in these watches.  Cramming LTE antennas in there as well was yet another engineering challenge.  Because of the way the LTE bands are in different places in the world the LTE antenna cannot be very efficiently tuned to all those bands.  However, we were able to divide them into only two major blocks of frequencies that allowed us to keep the SKU [model] proliferation down to just 2 major frequency flavors.”</em></p></blockquote>\n<p>And, while Garmin’s hardware engineering and manufacturing capabilities are generally regarded as some of the best in the wearable world, it’s probably a pretty good indicator that if Apple hasn’t figured out how to consolidate multiple LTE antenna into that form factor, then Garmin is unlikely to beat them to it.  But of course, like anything in technology – time advances forward.</p>\n<p>So what about aspects like music streaming or phone calls over LTE? Well, each of those are areas that Garmin hasn’t fully developed yet. Take music – Garmin could sync your music over LTE, they did it for the Vivoactive 3 LTE (and you paid Verizon for that privilege). But that’s different than music streaming live, Garmin’s entire current music architecture (with Spotify, Amazon Music, and so on), is all about offline caching, not about streaming. Thus, that would have to change (potentially contractually too).</p>\n<p>It’s similar for taking phone calls. Garmin doesn’t do that at all today. And even if they did, they’d be back to the same spot as before with iOS devices.</p>\n<p>Instead, I think we’ll likely see Garmin double-down on the spectator side, and the rest of the watch features. For example, right now you can’t easily just text your predefined contacts that you’re going to be late (it’ll kill your current workout if you do). So yes, you can do it, thus, the plumbing is there, but if you do – there’s side effects that are undesirable.</p>\n<p>But in the grand scheme of development stuff, that’s ‘merely’ firmware on the watch – not dealing with cellular carriers.</p>\n<h3><span>Going Forward:</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/06/P1022440_thumb.jpg\" /></p>\n<p>So where does Garmin go from here? Well, I suspect everywhere. In the same way that optical HR is in every watch, and contactless payments in almost every device too – I don’t see a scenario where eventually LTE isn’t in almost every Garmin watch and bike computer. We know the ‘upsell cost’ Garmin assigns to this is only $50, which means their bill of materials cost is low enough that they can do this. Plus, they make back money on the subscription (at $70/year).</p>\n<p>And Garmin’s Joe Heikes seems to agree with my line of thinking. While making it clear that he was speaking for himself personally in this case, and not on behalf of Garmin, he said that “I hope we can get to the point where we can more fully ‘democratize’ LTE technology in running watches“, going on to reference <a href=\"https://www.dcrainmaker.com/2021/06/garmin-forerunner-55-depth-review.html\">Garmin’s least expensive Forerunner watches</a>, saying that “in my imagination as the product manager, I would love to someday see a Forerunner x5 with an LTE option for safety and tracking features.”</p>\n<p>Thus, it’s probably only a matter of time. And if we know anything about the way Garmin quickly rolls out technology from one product to the next product model or line, it won’t take long.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"f22d736984b0d6c0b0db6934d5e2f173d26274e864e9b6d6e48069ee744e49ec","category":"Cycling"}