{"title":"Oven-drying and decontamination effects on crude protein concentration and in vitro crude protein digestibility of yellow mealworm (Tenebrio molitor) (Coleoptera: Tenebrionidae)","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae078/7730304?rss=1","date":1723161600000,"content":"<span><div>Abstract</div>The study aims to assess the impact of oven-drying and decontamination on crude protein concentration and in vitro crude protein digestibility of yellow mealworms. Two kilograms of 12-wk-old mealworm larvae were subjected to freezing prior to the drying process. Approximately 1.5 kg of mealworm larvae were divided into 3 groups and exposed to oven-drying at temperatures of 50 °C for 36 h, 60 °C, and 70 °C for 24 h each. At intervals of 2 h, sets of 3 replicates were withdrawn to record water loss. Consistent weight stabilization was observed at 36 h for 50 °C (T50), 18 h for 60 °C (T60), and 14 h for 70 °C (T70). The remaining 0.5 kg of mealworm larvae was divided and dried under treatments T50, T60, and T70. Each treatment was then split into 2 portions, with one portion subjected to 90 °C for 15 min (denoted as T50-90, T60-90, T70-90) to eliminate microbial contamination. The 6 treatments were then used to determine concentrations of dry matter, crude ash, crude protein, pre-caecal protein digestibility, and dry matter residues after neutral detergent fiber, acid detergent fiber, and acid detergent lignin treatments. No interaction was observed between drying and decontamination treatments (<span>P</span> &gt; 0.17). Pre-caecal crude protein digestibility increased with decreasing temperature (T50: 58% crude protein; T60: 51% crude protein; T70: 50% crude protein). Therefore, lower temperatures for longer times preserve crude protein digestibility. These findings are crucial for understanding how drying temperature and time impact protein bioavailability.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"f22dcc37969271bed721e7977823f1e3b0b788ee25486e7b11a8b9f95b0e9092","category":"Environment"}