{"title":"Co-Authorship Network Analysis in Gastroesophageal Reflux Disease Research: Evaluating Collaboration and Structural Changes from 2000 to 2023","link":"https://www.preprints.org/manuscript/202409.0408/v1","date":1725505534000,"content":"Aim: This study aims to analyze the evolution of co-author networks in Gastroesophageal Reflux Disease (GERD) research from 2000 to 2023, using data from the Web of Science (WoS) Core Collection. The objective is to provide a structural overview of researcher collaborations in this specialized field, highlighting key contributors and the impact of international cooperation. Method: I conducted a co-author network analysis on 19,463 GERD -related articles indexed in the WoS Core Collection between 2000 and 2023. Using Python (Version 3.10.5) within the PyCharm development environment (Software Version 2022.1.3), I assessed macro-level indicators including network density, clustering coefficient, number of components, and average distance. Micro-level indicators such as degree centrality, closeness centrality, and betweenness centrality were also evaluated to understand the roles of individual researchers in the network.Result: The GERD co-authorship network exhibited a sparse structure with low network density, indicating limited realized collaborations compared to potential connections. The clustering coefficient was consistently high across the analyzed periods, suggesting that researchers frequently formed tight-knit groups. The network was fragmented into numerous components, with significant disconnection between groups. Degree centrality highlighted key researchers such as Dent, J., and Shaheen, N.J., who had extensive collaborative reach. In contrast, closeness and betweenness centrality identified strategic intermediaries like Bredenoord, A.J. and Kahrilas, P.J., who facilitated connections across otherwise isolated segments of the network.Conclusion: The co-authorship network analysis revealed a persistently fragmented landscape in GERD research, with considerable room for enhancing collaboration among researchers. Identifying key contributors and understanding their roles within the network can guide future efforts to foster more integrated and comprehensive research collaborations. This study underscores the importance of strategic networking and partnership development in advancing GERD research and optimizing the field's collaborative potential.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f23849040feb8885d6df37fabb642576e79d6a98bd10c533028a2cc6f4d55a90","category":"Interdisciplinary"}