{"title":"Preserving large blocks of primary forest is critical to conserve forest‐dependent bird species in the Amazon","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14624?af=R","date":1711529640000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/a956dc39-5f87-4f65-9ff7-453b1030a44d/jpe14624-toc-0001-m.png\" alt=\"Preserving large blocks of primary forest is critical to conserve forest-dependent bird species in the Amazon\" />\n<p>Wildlife-friendly habitats in and around cattle pastures are of limited value for bird conservation, particularly for forest-dependent species that cannot persist in farmland. It is therefore essential to preserve large blocks of primary forest in order to conserve these sensitive species.</p>\n<br />\n<h2>Abstract</h2>\n<p><b>Research Highlight</b>: Birch, B. D. J., Mills, S. C., Socolar, J. B., Martínez-Revelo, D. E., Haugaasen, T., &amp; Edwards, D. P. (2024). Land sparing outperforms land sharing for Amazonian bird communities regardless of surrounding landscape context. <i>Journal of Applied Ecology</i>, <a target=\"_blank\" href=\"https://doi.org/10.1111/1365-2664.14596\">https://doi.org/10.1111/1365-2664.14596</a>.</p>\n<p>Tropical forests are globally threatened by agricultural activities, including cattle farming. The <i>land sharing</i> versus <i>land sparing</i> debate has often been used as a means of addressing the trade-off between agricultural production and biodiversity conservation, without finding a consensus within the scientific community. Moving forward, recent studies suggest combining both land allocation strategies, where wildlife-friendly habitats within farmlands could allow movements of species within the agricultural matrix and connect natural habitats such as forest blocks, though this has rarely been demonstrated with empirical studies. In their study, Birch et al. tested how wildlife-friendly habitats within and around cattle pastures could rescue the negative effects of converting forest to farmland on Amazon bird communities. To do so, they modelled bird species occupancies and simulated different <i>land sharing</i> versus <i>land sparing</i> scenarios with varying amount of landscape-scale wildlife-friendly habitat and levels of production. They found that the <i>land sparing</i> strategy outperformed <i>land sharing</i> in all scenarios, with limited benefits of landscape-scale wildlife-friendly habitat. This result was mostly driven by forest-dependent species that cannot persist in farmlands. As these species are highly sensitive, preserving large blocks of primary forest is critical for their conservation.</p>","author":"Gabriel Marcacci","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"f23ddc567e9c3ee80cddfc42aaec0e4fdfeb3fa3c509b410ab4b125a18410cfd","category":"Environment"}