{"title":"Going to WWDC? Meet Up With Other Developers Through Flighty's Tracking Tool","link":"https://www.macrumors.com/2023/05/30/flighty-wwdc-2023-tracker/","date":1685485064000,"content":"Apple's Worldwide Developers Conference is kicking off next Monday, and starting later this week, developers who have been invited to attend in person will be catching flights to get to Cupertino, California.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/flighty-wwdc-2023.jpg\" alt width=\"2918\" height=\"1641\" />\r<br />\nDeveloper Ryan Jones today announced the launch of a useful flight tracking tool for those who are attending, which is available through the Flighty flight tracking app. WWDC attendees can add their flights to the Flighty <a href=\"https://www.macrumors.com/roundup/wwdc/\">WWDC 2023</a> website to see other developers who will be flying in from the same airports and who may be on the same flights.\r<br />\n\r<br />\nDates are not shared, nor are flight numbers and airlines, but developers can add their names to see who else is coming to and from their local airports. The site also provides a look at interesting aggregate data, such as the number of countries developers are flying from, which airports, the distance traveled, and more.\r<br />\n\r<br />\nA map view shows all of the incoming flights at a glance, and clicking into a location displays the developers coming from that area. The tool is free to use, and available <a href=\"https://flighty.app/wwdc23/\">through the Flighty website</a>.\r<br />\n\r<br />\nFlighty is a robust flight tracking app that offers up all of the flight information that you need ahead of a trip. It provides quick notifications of any changes, alerts you to possible delays based on late inbound planes, and provides at-a-glance information on departure/arrival times, gate numbers, baggage claim locations, and more.\r<br />\n\r<br />\nFlighty is free to download, but unlocking all features requires a Pro subscription. [<a href=\"https://apps.apple.com/us/app/flighty-live-flight-tracker/id1358823008\">Direct Link</a>]<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/wwdc/\">WWDC 2023</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/30/flighty-wwdc-2023-tracker/\">Going to WWDC? Meet Up With Other Developers Through Flighty's Tracking Tool</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/going-to-wwdc-meet-up-with-other-developers-through-flightys-tracking-tool.2390934/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f2428938449e5cd9dcff365ff513e6c528f39b0d7a86dacc1615bde7255515f0","category":"Apple"}