{"title":"Introducing shared VPC support for Amazon FSx for NetApp ONTAP","link":"https://aws.amazon.com/blogs/aws/introducing-shared-vpc-support-for-amazon-fsx-for-netapp-ontap/","date":1701053739000,"content":"<p>You can now create Multi-AZ FSx for ONTAP file systems in VPCs that have been shared with you by other accounts in the same AWS Organization. This highly requested feature enables a clean separation of duties between network administrators and storage administrators, and makes it possible to create storage that’s durable, highly available, and accessible from multiple VPCs.</p> \n<p><span><strong>Shared VPC support</strong></span><br /> Before today’s launch, you had the ability to create Single-AZ FSx for ONTAP file systems in subnets that were shared with you by another AWS account, as well as both Single – and Multi-AZ file systems in subnets that you own.</p> \n<p>With today’s launch you can now do the same for file systems in multiple Availability Zones. Multi-AZ FSx for ONTAP file systems offer even higher availability than Single-AZ file systems, and are a great way to address and support large-scale enterprise storage needs. This new support for shared VPCs gives enterprises, many of which make use of multiple VPCs for technical and organizational reasons, to use FSx for ONTAP in Multi-AZ deployments, while allowing network administrators and storage administrators to work independently.</p> \n<p>This is easy to set up, but you do need to make sure that there are no IP address conflicts between subnets that are not shared between VPCs. I don’t have an AWS Organization set up, so I will hand-wave through part of this process. As a network administrator (the owner account), I use the <a href=\"https://aws.amazon.com/ram/\">AWS Resource Access Manager (RAM)</a> to share the appropriate subnets of my VPC with the desired participant accounts in my Organization:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/08/mx_share_vpc_subs_1.png\" width=\"901\" height=\"557\" /></p> \n<p>Then I (or the administrators for those accounts) accept the resource shares.</p> \n<p>Next, I use the new FSx for ONTAP <strong>Settings</strong> to enable route table updates from participant accounts, and click <strong>Submit</strong> (this gives the FSx ONTAP service permission to modify route table entries in shared subnets on behalf of participant accounts):</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/08/mx_real_settings_1.png\" width=\"900\" height=\"392\" /></p> \n<p>At this point, the storage administrators for the participant accounts can create Multi-AZ FSx for ONTAP file systems in the subnets that have been shared with them by the owner accounts.</p> \n<p>There is no additional charge for this feature and it is available in all AWS Regions where FSx for ONTAP is supported.</p> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"f2460fb33b1062ebb846c28ed16af5c58429961561c65bd40ed28e4d3179d054","category":"Tech"}