{"title":"What does GRX 12-speed mean for the future of Shimano’s mechanical road groupsets?","link":"https://www.bikeradar.com/features/opinion/future-of-shimano-mechanical-groupsets/","date":1686325527000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/12/Dolan-ADX-Titanium-105-Di2-04-5a854cd.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/12/Dolan-ADX-Titanium-105-Di2-04-5a854cd.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/Dolan-ADX-Titanium-105-Di2-04-5a854cd.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/Dolan-ADX-Titanium-105-Di2-04-5a854cd.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/Dolan-ADX-Titanium-105-Di2-04-5a854cd.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/Dolan-ADX-Titanium-105-Di2-04-5a854cd.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/Dolan-ADX-Titanium-105-Di2-04-5a854cd.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/Dolan-ADX-Titanium-105-Di2-04-5a854cd.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Dolan ADX Titanium 105 Di2 road bike\" title=\"Dolan ADX Titanium 105 Di2 - 04\" />                                            <p>We spotted a new Shimano GRX mechanical 12-speed gravel groupset at Unbound 2023 on the Pivot Vault of Shimano-sponsored rider Taylor Lideen.</p>\n<p>While we only saw a mechanical groupset in a <a href=\"https://www.bikeradar.com/advice/buyers-guides/1x-drivetrains/\">1x drivetrain</a> arrangement, that was enough for us to hazard a guess as to the direction Shimano may be heading in.</p>\n<p>The <a href=\"https://www.bikeradar.com/news/shimano-grx-r820/\">new Shimano GRX groupset</a> on Lideen’s bike featured a larger 10-45t <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-mountain/shimano-xtr-m9100-review/\">XTR M9100</a> cassette running on a MicroSpline <a href=\"https://www.bikeradar.com/advice/buyers-guides/freehubs/\">freehub</a>, updated brake calipers with separate bleed ports as per Shimano’s latest road calipers, and a redesigned <a href=\"https://www.bikeradar.com/advice/buyers-guides/a-complete-guide-to-rear-derailleurs/\">rear derailleur</a> that looks strikingly similar to its <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-deore-m6100-groupset-review/\">Deore M6100</a> effort.</p>\n<p>Shimano remains tight-lipped, and there are still plenty of things we don’t know at this stage, such as if the Japanese brand will continue to support 2x drivetrains or if there will be an <a href=\"https://www.bikeradar.com/advice/buyers-guides/electronic-groupsets/\">electronic groupset</a> version. We suspect that’s a yes on both fronts, but for now, it remains to be confirmed.</p>\n<p>However, with a new, mechanical drop-bar groupset now out in the wild, let’s ponder what the 12-speed GRX might mean for the future of Shimano’s <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">road bike groupsets</a>.</p>\n<h2>Shimano still believes in mechanical</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Colnago V4Rs Dura-Ace Di2\" title=\"Colnago V4Rs Dura-Ace Di2 - 09\" /></div><div><figcaption><span><i></i> Mechanical is no more on either Dura-Ace or Ultegra.</span></figcaption><span> <i>David Caudrey / Our Media</i></span></div>\n<p>Shimano seems to have all but abandoned mechanical shifting on its latest top-tier groupsets, with <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-di2-r9200-review/\">Dura-Ace R9200</a>, <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-ultegra-r8170-di2-review/\">Ultegra R8100</a> and <a href=\"https://www.bikeradar.com/news/shimano-105-di2-r7150/\">105 R7100</a> all electronic-only.</p>\n<p>Might the <a href=\"https://www.bikeradar.com/news/shimano-grx-r820/\">sighting of a 12-speed GRX groupset</a> hint at a new mechanical groupset for the road? We have good reason to suspect a 12-speed mechanical version of Shimano 105 is on its way, after <a href=\"https://www.bikeradar.com/news/shimano-105-12-speed-mechanical/\">manufacturer KHS leaked bikes with an unreleased groupset on its website</a>.</p>\n<p>SRAM, meanwhile, has waved goodbye to mechanical shifting on most of its groupsets, and Campagnolo also looks to be following suit with the release of its <a href=\"https://www.bikeradar.com/news/campagnolo-super-record-wireless-groupset/\">Super Record Wireless</a> groupset.</p>\n<p>Shimano’s existing 105 mechanical groupset remains something of an outlier, with the old 11-speed drivetrain still in the range, whereas the new 105 Di2 electronic groupset has jumped up to 12-speed.</p>\n<p>With a new, cable-actuated GRX groupset spotted at Unbound, Shimano clearly still has some belief in advancing its mechanical offering.</p>\n<p>Could Shimano soon fill the 12-speed mechanical gap road riders are looking for? We sure hope so.</p>\n<h2>Off-road inspiration?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano Dura-Ace rear derailleur on BMC Teammachine\" title=\"Shimano Dura-Ace rear derailleur on BMC Teammachine\" /></div><div><figcaption><span><i></i> Will Shimano stick with direct-mount for the road?</span></figcaption><span> <i>Russell Burton / Our Media </i></span></div>\n<p>Shimano’s new GRX groupset seems to draw some inspiration from the Deore M6100 mountain bike drivetrain, notably with the rear derailleur design.</p>\n<p>Shimano introduced its direct-mount standard in 2012, which sees the rear derailleur bolt straight onto a specifically-designed <a href=\"https://www.bikeradar.com/advice/workshop/derailleur-hangers/\">derailleur hanger</a>, rather than via a B-link. The design was ported over to the road on <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-r9100-review/\">Dura-Ace R9100</a> and can be found on the current generation of GRX.</p>\n<p>However, the standard quietly disappeared on Shimano’s 12-speed mountain bike groupsets, including Deore M6100, and doesn’t feature on the <a href=\"https://www.bikeradar.com/features/shimano-cues-u8000/\">new Cues rear derailleurs</a> either.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX 12-speed gravel groupset rear derailleur\" title=\"Shimano GRX 12-speed gravel groupset rear derailleur\" /></div><div><figcaption><span><i></i> The new GRX 12-speed derailleur wave goodbye to the direct-mount design.</span></figcaption><span> <i>Ben Delaney / Our Media</i></span></div>\n<p>The new GRX 12-speed rear derailleur also appears to do away with it, so will Shimano abandon the standard on a new mechanical groupset, too? It’s probably unlikely this time around but never say never for a next-generation Dura-Ace Di2 groupset.</p>\n<p>Elsewhere on the derailleur, with the new GRX mechanical getting a revised clutch design, we also wonder whether Shimano could introduce a clutched rear derailleur for a 105-level road groupset.</p>\n<p>Although its road rear derailleurs use Shadow technology, which sees the derailleur assume a lower profile, tucked in towards the wheel, at present they don’t feature a clutch mechanism.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX 12-speed gravel groupset rear derailleur\" title=\"Shimano GRX 12-speed gravel groupset rear derailleur\" /></div><div><figcaption><span><i></i> The clutch lever looks to be larger on the new GRX rear derailleur.</span></figcaption><span> <i>Ben Delaney / Our Media</i></span></div>\n<p>Clutched rear derailleurs essentially increase the resistance of the main pivot and prevent the chain from slapping on the inside face of the driveside chainstay.</p>\n<p>SRAM uses its Orbit fluid damper on its Red and Force AXS electronic rear derailleurs, whereas <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-rival-etap-axs-review/\">Rival eTap AXS</a> steps down to a spring clutch.</p>\n<p>Campagnolo doesn’t use a clutch on its Super Record Wireless rear derailleur or its mechanical groupsets.</p>\n<p>Before GRX, Shimano previously had an Ultegra RX rear derailleur with a clutch in its range.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Berria Belader Allroad LTD against a graffiti background\" title=\"BR_09979\" /></div><div><figcaption><span><i></i> SRAM’s road rear derailleurs have sported clutches for some time.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>Of course, with road bike groupsets, the chain doesn’t tend to slap as freely compared to riding off-road, while having a clutch can mean increased resistance in the shift feel, and potentially increased drivetrain friction.</p>\n<p>However, SRAM’s proven it can be done and it will be interesting to see if Shimano follows suit.</p>\n<p>That said, this is a long shot as Shimano’s current 12-speed electronic road derailleurs don’t feature a clutch, and we’d expect any new mechanical road rear derailleur to follow the same path. For Shimano, a rear derailleur clutch is likely to remain an off-road-only feature.</p>\n<h2>Shifter design</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Colnago V4Rs Dura-Ace Di2\" title=\"Colnago V4Rs Dura-Ace Di2 - 06\" /></div><div><figcaption><span><i></i> Shimano’s latest road shifters have moved to a shrouded design.</span></figcaption><span> <i>David Caudrey / Our Media</i></span></div>\n<p>Shimano’s 12-speed road groupsets use a revised shifter design, with the shifter bodies now curving inwards slightly and utilising a shroud-like cover over the top of the lever blades.</p>\n<p>We can’t see why Shimano would want to deviate from this design on a hypothetical mechanical system, so we’d expect this to carry over.</p>\n<p>That said, the 12-speed mechanical GRX on Lideen’s <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/pivot-vault-review-2/\">Pivot Vault </a>used an almost identical shifter design to the previous generation, so it’s possible we could see something similar to the existing 105 mechanical for a new road groupset, too.</p>\n<h2>A wider range</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX 12-speed gravel groupset XTR cassette\" title=\"Shimano GRX 12-speed gravel groupset cassette\" /></div><div><figcaption><span><i></i> The new GRX on show at Unbound used an XTR M9100 10-45t cassette.</span></figcaption><span> <i>Ben Delaney / Our Media</i></span></div>\n<p>With 105 Di2 R7150 being compatible with an 11-36t <a href=\"https://www.bikeradar.com/advice/workshop/bike-cassettes/\">cassette</a>, it’s clear Shimano sees a benefit in offering riders more range and easier climbing gears. It’s a trend we’ve seen across all of the latest groupsets.</p>\n<p>The GRX 12-speed groupset we saw at <a href=\"https://www.bikeradar.com/events/unbound/\">Unbound 2023</a> was fitted with a 10-45t XTR M9100 mountain bike cassette. Shimano is clearly increasing the capacity of its 1x GRX setup, with current GRX groupsets topping out at a 42t cassette sprocket, and offering wider compatibility for mullet gearing.</p>\n<p>We’d expect a new mechanical road groupset to follow the same trend for wider gearing, even if it’s not to the same extent as a gravel drivetrain.</p>\n<p>Shimano currently offers two derailleur options for its existing 105 mechanical groupset: a short-cage version with a 30t maximum sprocket, and a medium-cage version with a 34t maximum sprocket.</p>\n<p>We’d expect Shimano to simplify any future mechanical road groupset with a single rear derailleur option, with capacity – at least – for a 36t cassette.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX drivetrain\" title=\"Giant Revolt Advanced Pro 0 - 13\" /></div><div><figcaption><span><i></i> It’s a long shot but might Shimano introduce a road-specific sub-compact crankset, similar to GRX?</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>While we’re at it, might we also see Shimano introduce its first <a href=\"https://www.bikeradar.com/road/super-compact-chainsets-the-next-big-thing-for-road-cyclists/\">super-compact</a> 2x road <a href=\"https://www.bikeradar.com/advice/buyers-guides/cranksets/\">crankset</a> soon? This would provide riders with a smaller crankset than the <a href=\"https://www.bikeradar.com/features/what-is-a-compact-crank/\">50-34t compact</a> normally offered by Shimano.</p>\n<p>These already exist in GRX form, with 46/30t and 48/31t options, but it would make sense to have a similar option for a new mid-range road groupset, too.</p>\n<p>Both SRAM and Campagnolo already offer an equivalent for their groupsets.</p>\n<p>Outside of its 1x XPLR range, SRAM offers its Force and Rival components in a Wide 43/30t chainring (what SRAM considers its equivalent to a 48/32t) option. There is also a matching 10-36t cassette and a rear derailleur with a greater capacity.</p>\n<p>The top-of-the-line Red doesn’t have its own Wide chainrings or front derailleur but the brand offers a rear derailleur with a 36t capacity.</p>\n<p>Campagnolo also offers a 48/32t chainring combination on its Chorus mechanical groupsets.</p>\n<p>Meanwhile, Shimano has steadfastly stuck with its traditional 53/39t, 52/36t and 50/34t chainring options on the road. Is it time for that to change?</p>\n<h2>What about 1x?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Factor Ostro Gravel against a graffiti background\" title=\"DSC00300\" /></div><div><figcaption><span><i></i> SRAM’s offered its groupsets in both 1x and 2x flavours for some time now.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>1x drivetrains for the road are back in the conversation again.</p>\n<p>Team Jumbo-Visma rider Primož Roglič <a href=\"https://www.bikeradar.com/features/pro-bike/roglic-1x-bike/\">notably used a 10-44t SRAM Red XPLR eTap AXS cassette on stage 19 of the Giro d’Italia</a>, while his team-mate, Jonas Vingegaard, then went on to use a <a href=\"https://www.gettyimages.co.uk/detail/news-photo/jonas-vingegaard-of-denmark-and-team-jumbo-visma-competes-news-photo/1496934173?adppopup=true\">1x setup to win stage five of the Criterium du Dauphine</a>. Back at Paris-Roubaix, <a href=\"https://www.bikeradar.com/features/pro-bike/2023-paris-roubaix-tech-trends/\">we saw lots of SRAM-sponsored riders on 1x</a>.</p>\n<p>SRAM offers its road bike groupsets in both 1x and 2x permutations. Might Shimano follow suit with a new mechanical offering?</p>\n<p>Shimano has always been more conservative with jumping on trend bandwagons, but it could be time for the brand to offer a single-ring setup for the road.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano Cues U8000\" title=\"Shimano Cues U8000\" /></div><div><figcaption><span><i></i> Does Cues hold the answer?</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>A 105 mechanical 12-speed groupset could be an opportunity to introduce a dedicated 1x option, given Ultegra and Dura-Ace have always been regarded as more traditional racing groupsets. A 1x option for 105 might help it fill a gap as an all-round groupset, particularly if Shimano widens the gear range.</p>\n<p>Ultimately, however, we’d guess Shimano is more likely to introduce a 1x option for an updated Tiagra-level groupset (<a href=\"https://www.bikeradar.com/news/shimano-cues/\">Tiagra is going to be phased out and swallowed into the Cues ecosystem</a>).</p>\n<p>Despite the recent resurgence in racing, 1x drivetrains can be a good option for beginners as there are fewer functions to get used to and you don’t have to worry about shifting a front derailleur.</p>\n<h2>Could Shimano switch to a 10t starting cog on the road?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano GRX 12-speed gravel groupset – XTR cassette\" title=\"Shimano GRX 12-speed gravel groupset – XTR cassette\" /></div><div><figcaption><span><i></i> Shimano looks to be heading down the 10t route on gravel.</span></figcaption><span> <i>Ben Delaney / Our Media</i></span></div>\n<p>Shimano’s 12-speed GRX uses an XTR M9100 cassette with a 10-45t spread and the MicroSpline freehub standard, <a href=\"https://www.bikeradar.com/features/shimano-decided-to-create-a-freehub-standard/\">first introduced on the brand’s mountain bike groupsets</a>.</p>\n<p>At present, Shimano is the only manufacturer of the Big Three to stick with an 11t starting cog on all of its road bike groupsets.</p>\n<p>SRAM introduced the 10t starting cog to the road <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-12-speed-red-etap-axs-hrd-review/\">when it released its Red eTap AXS groupset in February 2019</a> and Campagnolo’s new Super Record Wireless groupset also uses a 10t cassette.</p>\n<p>Along with a revised cable-pull ratio, starting with a 10t cog and sharing cassette spacing would be another step in allowing greater compatibility between road, gravel and mountain bikes.</p>\n<p>You wouldn’t have to worry about readjusting the rear derailleur’s B-gap adjustment if you were changing between cassettes.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano Micro Spline\" title=\"Shimano Micro Spline\" /></div><div><figcaption><span><i></i> Micro Spline was first introduced on XTR M9100.</span></figcaption><span> <i>Josh Patterson / Immediate Media</i></span></div>\n<p>However, Shimano didn’t introduce MicroSpline to the road with the release of Dura-Ace R9200 and Ultegra R8100. Instead, the brand introduced a new freehub design with a revised spline arrangement that’s backward-compatible with its existing HG standard. The smallest sprocket compatible with these freehubs is 11t.</p>\n<p>Wouldn’t life be simpler if Shimano had one freehub standard it used across its range, rather than three?</p>\n<p>Don’t get your hopes up, though. With some debate over the increased drivetrain friction of a 10t starting sprocket, Shimano is likely to remain steadfastly committed to 11t on any road groupset, at least until Dura-Ace gets its next update.</p>\n<p>The move to a 10t sprocket makes sense for GRX, to offer (theoretical) mullet compatibility with Shimano’s MTB derailleurs and cassettes, and increased range for 1x setups, but we reckon that’s where it will be left.</p>\n<h2>Keep things affordable</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano 105 R7000 looks great and is sure to perform well too\" title=\"shimano105-1542722687434-tmi3wcs9j1zj-1000-100-32cfbd0\" /></div><div><figcaption><span><i></i> A new mechanical groupset needs to be competitively priced.</span></figcaption><span> <i>Laura Dow / LauraDow.com</i></span></div>\n<p>One common complaint with the new 105 Di2 is that it’s much more expensive than the 11-speed mechanical 105 R7000 / R7020.</p>\n<p>Although you can often find deals, Shimano 105 Di2 has a suggested retail price of £1,730 / $1,890 / €1,869, more than double the £799 / €994.49 / $696 / AU$1,179 of Shimano 105 R7020.</p>\n<p>It’s also more expensive than SRAM’s equivalent third-tier Rival eTap AXS. In its 2x variant, Rival retails for £1,268 or £1,470 with a power meter.</p>\n<p>The relative expense of 105 Di2 leaves a big hole in Shimano’s range for a fully up-to-date, 12-speed mechanical groupset, that riders and bike brands – eager to spec mid-range bikes – <a href=\"https://www.bikeradar.com/features/opinion/future-of-mechanical-groupsets/\">want to be filled</a>. For a big business like Shimano, it’s a no-brainer.</p>\n<h2>Will a new mechanical groupset simply be a 12-speed copy of 105 R7000?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Shimano 105 R7000 drivetrain\" title=\"20200622_SB_5DSR_MG_1782\" /></div><div><figcaption><span><i></i> In reality, Shimano is unlikely to stray too far away from a winning recipe.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Shimano has a proven track record of rolling out new road bike technologies on its halo Dura-Ace groupset before trickling that tech down to the lower groups.</p>\n<p>Here, with no new mechanical Dura-Ace or Ultegra groupset – and that is unlikely to change – Shimano would be taking a different approach by debuting its latest mechanical offering on a mid-range drivetrain.</p>\n<p>Although we’ve covered all sorts of likely (and unlikely) possibilities, might a new mechanical groupset simply be a 12-speed carbon copy of its already popular 11-speed <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-105-r7000-r7020-groupset-review/\">105 R7000 groupset</a>?</p>\n<p>Shimano would only need to give the shifters and rear derailleur the 12-speed treatment, with perhaps minor tweaks, and pair them with a corresponding chain, cassette and crankset.</p>\n<p>Time will tell, but we’ll wait with some interest to see what the future holds for any new mechanical road groupset from Shimano.</p>\n<p> </p>","author":"Oscar Huckle","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f249afa24717d419118dd1a36e6b24b3fab5717ee8d7d13103c7d1eeb839518d","category":"Cycling"}