{"title":"อัพเดตข่าว Threads: มีมากกว่า 95 ล้านโพสต์, เป้าหมายผู้ใช้งาน 1 พันล้าน, จะหาทางลบบัญชีแยกกับ IG","link":"https://www.blognone.com/node/134715","date":1688692318000,"content":"<div><div><div><p>Threads ยังคงมีประเด็นใหม่เพิ่มเติมอีก รวบรวมมาไว้ที่เดียวในข่าวนี้ครับ (<a href=\"https://www.blognone.com/node/134711\">ข่าวเก่า</a>)</p>\n<p>เรื่องแรกเป็นสิ่งที่หลายคนคาดเดาไว้ว่าเมื่อ Threads เปิดใช้งานไประยะหนึ่ง จะต้องอัดโฆษณามาเต็มแน่ ๆ ประเด็นนี้ซีอีโอ Mark Zuckerberg ได้<a href=\"https://www.threads.net/t/CuW5-eWL34x/\">ตอบผ่าน Threads</a> ว่า แนวทางของ Threads เหมือนกับทุกผลิตภัณฑ์ของ Meta นั่นคือทำให้ดีก่อน จนเมื่อมีผู้ใช้งานถึง 1 พันล้านคน จึงค่อยคิดเรื่องการต่อยอดหาเงินจากจุดนั้น</p>\n<p>ที่น่าสนใจคือตัวเลข 1 พันล้าน ที่เป็นเป้าหมาย ถือเป็นความท้าทายมาก เพราะ Twitter มีจำนวนผู้ใช้งานตามตัวเลขที่<a href=\"https://www.blognone.com/node/128234\">รายงานครั้งสุดท้าย</a>ในปี 2022 คือ 229 ล้านบัญชี</p>\n<p>เรื่องถัดมา แม้ Thread มีผู้สมัครใช้งาน 30 ล้านบัญชี แต่จำนวนคนที่โพสต์มีเท่าไหร่? The Verge อ้างข้อมูลภายในที่ทราบ ตัวเลขจำนวนโพสต์ล่าสุดอยู่ที่ 95 ล้านโพสต์ และเป็นจำนวนไลค์ 190 ล้านไลค์</p>\n<p>ประเด็นการลบบัญชี Threads จากข่าวก่อนหน้านี้ ที่ไม่สามารถทำแยกกันได้ ต้องลบบัญชี Instagram ด้วย ทำให้ผู้ใช้งานไม่เห็นด้วย เรื่องนี้ Adam Mosseri ซีอีโอ Instagram <a href=\"https://www.threads.net/t/CuXRXDdNOtH/\">ชี้แจง</a>ว่า ในตอนนี้ที่ทำได้คือระงับบัญชี (deactivate) ซึ่งจะซ่อนทั้งโปรไฟล์และโพสต์ทั้งหมด หรืออาจตั้งบัญชีเป็นแบบส่วนตัว (private) แล้วลบทีละโพสต์ สาเหตุเพราะ Threads สร้างจากฐานร่วมกับระบบบัญชี Instagram แต่ทีมจะหาแนวทางให้สามารถลบบัญชีแยกได้ในอนาคต</p>\n<p>ที่มา: <a href=\"https://www.theverge.com/2023/7/6/23786108/threads-internal-activity-data-exclusive-instagram-meta\">The Verge</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f9e2247bdf0fd954dfd5fb60d53b9db1.png\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/threads\">Threads</a></div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/social-network\">Social Network</a></div><div><a href=\"/topics/instagram\">Instagram</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f24d9a6faefe0d294190fc2c8231a119612910b91b0d98736db8af39f2a0cb6e","category":"Thai"}