{"title":"The mediating role of perceived social support between work-family conflict and presenteeism among ICU nurses working shift work in Chinese public hospitals: A cross-sectional investigation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308673","date":1723557600000,"content":"<p>by Jijun Wu, Yuxin Li, Qin Lin, Yuting Fan, Jiquan Zhang, Zhenfan Liu, Xiaoli Liu, Ping Dai, Xian Rong, Xiaoli Zhong</p>\r\nObjective <p>Relative to explicit absenteeism, nurses’ presenteeism has a more lasting impact and is more harmful and costly. This study aimed to explore the relationship between work-family conflict, perceived social support, and presenteeism and whether perceived social support mediates the relationship between work-family conflict and presenteeism among ICU nurses working on shifts in Chinese public hospitals.</p> Materials and methods <p>A cross-sectional research design was conducted from January to April 2023 in Sichuan Province, China. A total of 609 valid questionnaires were collected. The questionnaires contained information on demographic characteristics, the Work-Family Conflict (WFC) scale, the Perceived Social Support Scale (PSSS), and Stanford Presenteeism Scale-6 (SPS-6). Multiple stratified regression was used to explore the mediating role of perceived social support between work-family conflict and presenteeism. The mediating effect of perceived social support in work-family conflict and presenteeism was tested by Model 4 in the PROCESS 4.1 macro program in SPSS.</p> Results <p>A total of 609 nurses were included in this study, and the mean presenteeism score for ICU nurses working on shifts was 16.01 ± 4.293 (Mean ± SD), with high presenteeism accounting for 58.46%. After controlling for sociodemographic characteristic variables, work-family conflict was positively associated with presenteeism, explaining 7.7% of the variance. High perceived social support was related to low presenteeism, explaining 11.5% of the variance. Perceived social support mediated the association between work-family conflict and presenteeism among ICU nurses working on shifts.</p> Conclusions <p>Chinese shift-work ICU nurses’ high presenteeism scores deserve managers’ attention. Work-family conflict is a significant predictor of nurses’ presenteeism. Perceived social support is essential in improving nurses’ work-family conflict and mediates the relationship between work-family conflict and presenteeism. Improving social support can reduce the impact of work-family conflict on presenteeism among nurses working shifts.</p>","author":"Jijun Wu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f25471ea90061704cf6d17282c8f2010de50c72c0a8ef1992e29c2d1953fe447","category":"Interdisciplinary"}