{"title":"Some Sort of Rhythm: a Bicycle Touring Story From the BC Epic Route – Pat Valade","link":"https://theradavist.com/2021/09/some-sort-of-rhythm-a-story-from-the-bc-epic-route/?utm_source=rss&utm_medium=rss&utm_campaign=some-sort-of-rhythm-a-story-from-the-bc-epic-route","date":1631275257000,"content":"<p>“Oh, shit is that a skunk? I’m pretty sure that’s a skunk”. This sentence can always cause a moment of trepidation on any trip, multiplied in this case by the tough day of pedaling we just had. When my partner Alycia uttered those words, we were already a few hours past the time we both would have preferred to stop for the night, and dinner was a distant memory.  Alycia’s DSLR had recently hit the eject-from-bike button and taken an un-dignified crash through the dirt and rocks.<span></span></p>\n<p>To top it off, the campsite I was encouraging – some might call it pushing – us to aim for, was about 20km farther than I had thought it was. As we descend down a dark section of singletrack, both too stubborn to pull our lights out. “I’m pretty sure the campsite is just over there,” I say over and over and over. A small, quick creature, keeps scurrying ahead of us on the path but never diverting into the forest. We had no choice but to keep following, fingers crossed that we wouldn’t get too close. Keep in mind, it is extremely hard to cross your fingers while using brake-levers.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/epicvacayfullres3-8-of-43.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/09/epicvacayfullres3-41-of-43.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Luckily this story doesn’t end in a skunk-spray-soaked night of camping on the banks of the Columbia River, but it really could have. We were a few days into an 8-day trip we had planned across a good chunk of British Columbia. The <a href=\"https://www.bcepic1000.com/route-map\" target=\"_blank\">BC Epic Route</a> traverses British Columbia from Merritt to Fernie over 1000km of varied terrain. It generally follows the Trans Canada Trail along decommissioned rail-grade, and a bit of pavement and single track peppered into the mix. I often find it’s always easy to remember moments on trips that seem a bit stressful, or desperate. The heat, the mechanicals, or the angry drivers.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/epicvacay-80-of-115.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/09/epicvacay-1-of-115.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Now, reminiscing on this trip, there are these small moments that stick in my brain, like the hook of a song or a beat you tap absent-mindedly. Of course, I remember the preparation, the packing of bags, getting bikes prepped, the long drives to start, and the worry of forgetting some key item.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/epicvacay-84-of-115.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>More importantly, I remember the feeling of bathing in a small creek at the end of our first day. Both laughing as we stood in the water, washing off the fine dust and cooling our sun-soaked skin. I remember eating salad out of a bag, hiding from the mid-day heat in the shade of a small grocery store, a simple act of rehabilitation. I remember the uncertainty we both felt, as a large herd of cows blocked our only way, slowly passing by, they were equally confused to see us. I remember sharing warm beers, and salt and vinegar chips as we jumped into the most perfect swimming hole, an unplanned stop.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/epicvacay-62-of-115.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I remember washing the black dirt off our legs and feet in a gas station parking lot, not sure where we would camp that night. Then waking up to perfect light, and cups of coffee. I remember riding uphill, next to a busy highway, in the pouring rain, feeling water pool in my shoes, and the small of my back. I remember how Alycia never complained once about being wet, but just looked forward to our next coffee stop, and the next and the next.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/epicvacayfullres3-19-of-43.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>If you’re lucky, you reach some sort of a meditative pace on a multi-day ride and allow yourself many breaks, small moments and memories. The nice thing about memory is that you might not remember things exactly as they were. So, maybe you don’t remember that knee pain, the sunburn, fixing flats, or that pesky saddle sore.</p>\n<p></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"f25519f3482e3d371a56aa9d4338131fcacb2107aa422eae8960506776641448","category":"Cycling"}