{"title":"The iPhone 15 could finally topple Samsung–but will anyone even care?","link":"https://www.macworld.com/article/2054094/apple-beat-samsung-units-shipped-iphone-15.html","date":1693909800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The iPhone’s market share has long been on the rise in the United States, but could it finally be poised to beat its biggest hardware nemesis?</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2023/09/04/apple-could-overtake-samsung/&amp;xcust=1-1-2054094-1-0-0&amp;sref=https://www.macworld.com/feed\">“Apple could overtake Samsung to become global smartphone leader – TrendForce”</a></p>\n\n\n\n<p>Wow! Fantastic! Amazing!</p>\n\n\n\n<p>Is it, though? The real reason Apple might top Samsung is that the global market for smartphones ain’t that great right now and the one-time “Apple killer” is feelin’ it.</p>\n\n\n\n<blockquote>\n<p>Amid global economic headwinds and fierce competition, coupled with a waning halo effect from its flagship phone releases earlier in the year, Samsung’s Q2 performance lagged behind the same period last year.</p>\n</blockquote>\n\n\n\n<p>Whoa, whoa, whoa. Samsung has foldables. You know foldables. They’re this decade’s phablets. (Really missed an opportunity to call them “pholdables”.) And a lack of foldables is absolutely <em>killing</em> Apple. The Macalope has read this repeatedly. So, clearly–</p>\n\n\n\n<blockquote>\n<p>Although Samsung is set to roll out new foldable models in Q3, the impact on its overall growth is expected to be marginal given the relatively low sales volume compared to its Galaxy S series.</p>\n</blockquote>\n\n\n\n<p>Huh. Well, <em>that’s</em> weird. It’s almost as if foldable phones aren’t really a big deal yet. Despite what you might have heard from other analysts screaming that <a href=\"https://www.macworld.com/article/2014012/foldable-iphone-android-sales-doomed.html\">foldables are huge right now and Apple’s behind,</a> etc. etc.</p>\n\n\n\n<p>This further points out the fallacy made by those who spent years railing about Apple’s low market share. Market share doesn’t get you very much when the market is contracting. As always, however, Apple still beats its rivals at the more important metric which is profit share.</p>\n\n\n\n<p>The article above cites TrendForce, an analytical firm the Macalope had never heard of before, for this prediction. The fact the Macalope hasn’t heard of them doesn’t necessarily mean anything, there are sadly a lot of great things he hadn’t heard of before. As an example, did you know that <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.nbcboston.com/news/local/lays-releases-new-lobster-roll-flavored-potato-chips/1966498/&amp;xcust=1-1-2054094-1-0-0&amp;sref=https://www.macworld.com/feed\">Lays made a limited edition lobster roll-flavored potato chip</a>? How is the Macalope only now just finding out about this? What is he not paying you people for?</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Macalope\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all 1500w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /></figure><p>IDG</p></div>\n\n\n\n<p>But often a company will put out an outlandish statement in order to generate attention. In this case, while this outcome is still pretty iffy, it really does seem possible. Still, it’s important to remember that these projections are more art than science.</p>\n\n\n\n<p>Hmm. That doesn’t seem strong enough. How about, more Montessori daycare art than science? You know, one of those “We like to let the children experiment” places. That’s a little better.</p>\n\n\n\n<p>Let us remember the Macalope’s favorite market share projection of all time.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://bgr.com/general/windows-phone-will-beat-android-in-2013-analyst-explains/&amp;xcust=1-1-2054094-1-0-0&amp;sref=https://www.macworld.com/feed\">“Windows Phone will beat Android in 2013, analyst explains”</a></p>\n\n\n\n<p>Just… mwah. Chef’s kiss. No notes. Absolute perfection. Smack dab in the middle of the intersection between Attention Seeking St. and Wish Fulfillment Ave. Like a musk ox just strode into the intersection and laid down under the traffic light. Car horns blaring, people shouting… completely oblivious.</p>\n\n\n\n<p>Even if Apple comes out on top in market share, there are some signs that it won’t have the best quarter, either, due to supply chain constraints. Still, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2023/08/28/iphone-15-pro-max-shipments/&amp;xcust=1-1-2054094-1-0-0&amp;sref=https://www.macworld.com/feed\">Ming-Chi Kuo expects</a> the company to sell 80 million iPhone 15s and…</p>\n\n\n\n<blockquote>\n<p>The analyst also believes Apple could top Samsung in units shipped in 2023.</p>\n</blockquote>\n\n\n\n<p><em>Further</em>…</p>\n\n\n\n<blockquote>\n<p>Kuo expects the iPhone to beat Samsung in 2024 as well.</p>\n</blockquote>\n\n\n\n<p>Ultimately, whether Apple beats Samsung doesn’t matter that much. Apple will still be successful either way and Samsung, too. It’s often just fun to keep track of predictions and see them age like lobster rolls in the sun.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f25f8e2ed386c245159f320e4964e4c874465ed83a0b08ed0825417900ca3c6d","category":"Apple"}