{"title":"wcm.03.2024.315.325","link":"https://www.watconman.org/wcm-03-2024-315-325/","date":1715848028000,"content":"<div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>ASSESSMENT AND MAPPING OF FLASH FLOOD HAZARD AND RISK AT WADI YUTUM BASIN IN JORDAN: INTEGRATING HYDROLOGICAL AND HYDRAULIC MODELING TECHNIQUES</strong></h3>\n<p><span><em>Journal: Water Conservation and Management (WCM)</em></span><br />\n<span><em><span>Author: Khaldoun Shatanawi, Radwan Al-Weshah, Rakad Ta’any, Alsharifa Hind Mohammad, Ghada Kassab, Maha Halalsheh</span></em></span><br />\n<span><em>Print ISSN : 2523-5664</em></span><br />\n<span><em>Online ISSN : 2523-5672</em></span></p>\n<p><span><em><span>This is an open access article distributed under the Creative Commons Attribution License CC BY 4.0, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited</span></em></span></p>\n<p><span><em>Doi: <a href=\"http://doi.org/10.26480/wcm.03.2024.315.325\">10.26480/wcm.03.2024.315.325</a></em></span></p>\n<h3>Abstract</h3>\n<div><img loading=\"lazy\" src=\"https://www.watconman.org/wp-content/uploads/2022/06/wcm-cover-tm.jpg\" width=\"212\" height=\"300\" />Natural hazards and disasters threaten human life, damage properties and affect human-populated environments. Flood hazard assessment procedure was carried out using hazard criteria concepts through GIS, hydrological and hydraulic modeling coupling techniques utilizing HEC-HMS for the hydrological modeling and HEC-RAS for the hydraulic modeling. The objective of this study is to use geo-based hydrologic and hydraulic models to develop flood hazard maps of wadi Yutum floodplain areas in southern Jordan, focusing on the Amman- Aqaba Desert Highway along wadi Yutum for different design storm return periods. A GIS-based model to estimate the flood flow at the gauging stations of Wadi Yutum basin, which is the basin that drains into the city of Aqaba, was developed. Most of the developments in Aqaba are located on alluvial wadi fans, which are, unavoidably, subject to the risk of flooding. Initially, Intensity Duration Frequency (IDF) curves were generated to assess the rainfall-runoff situation in the basin. Based on the analysis and modeling, flood hazard maps for 25, 50, and 100-years return periods were generated with peak flows of 1523 m3/s, 1813 m3/s, and 2111 m3/s, respectively. These flood hazard maps aim to identify hazard locations within the flood plains of the target area. A risk map that categorizes three risk classes (high, medium and low) was generated by coupling the flood hazard map with a socio-economic map. High and medium risk zones identify hazard risk to the current facilities, road and trail users. The most affected element is the Amman- Aqaba Desert highway; the main entrance to Aqaba city, with an average daily traffic volume of 20,182 vehicles. Given that the vehicle occupancy rate on the highway is 1.6 person per vehicle, more than 32,000 persons could be affected on a given day depending on the time and the severity of the storm. Flood hazard, vulnerability, and risk mapping are essential tools for informed decision-making, helping to minimize the impacts of flooding and enhance the resilience of communities in the face of this natural hazard.</div>\n<p> </p>\n<h3>Keywords</h3>\n<p><span>Flash floods in Jordan; Hazard mapping; Risk mapping; Flood risk mitigation; HEC-RAS; HECH-HMS.</span></p>\n<h3><strong>1. INTRODUCTION</strong></h3>\n<div>\n<p>Natural hazards and disasters threaten human life, damage properties and affect human-populated environments (Prama et al., 2020). Floods are considered dangerous natural hazards causing disasters and distressing development (Bathrellos et al., 2016). Floods are well known for causing human casualties and damaging infrastructure and properties, as well as having a negative impact on human-populated environments (UNISDR, 2009). Worldwide, it has been reported that 44% of disasters are associated with floods, causing 31% of the world’s economic losses (WMO, 2021). In hyper arid regions like Aqaba area in Jordan where average rainfall is less than 30 mm/year but occur as intense storms in short duration producing flash floods. According to the American Meteorology Society (AMS) a flash flood is defined as: “a flood that rises and falls quite rapidly with little or no advance warning, usually as a result of intense rainfall over a relatively small area”. Flash floods are characterized by short duration and rapid flows with high flood on small areal extent, resulting in potential risk to humans and properties (Al-Qudah, 2011). Generally, flash floods in a region are generated by heavy rainfall in upstream areas and effusing downstream with colossal intensity and energy (Habte et al., 2017). Floods in arid areas are dangerous because runoff flows down the channel as a flood wave, driving downstream the channel bed, which is either dry or has a small initial flow with rare barriers to decline the discharge velocity. When the flow wave reaches a populated area, it suddenly hits the area with energy, carrying sediment and debris as it flows across the developed area. Therefore, flash flood hazard analysis and mapping identify the areas vulnerable to flooding in a basin based on the physical characteristics of the basin and the probability of occurrence of extreme rainfall events. It is one of the most critical components of early warning systems used for flood hazard mitigation and prevention of potential future flooding situations (Bhatt et al., 2014). Flood hazard mapping delivers easy-to-read visual results (charts or maps), allowing decision makers to determine risk areas and prioritize mitigation actions for the hotspots (Forkuo, 2010; Wang et al., 2011; Ajin et al., 2013; Argaz et al., 2019). Therefore, it is important to employ natural hazard maps in sustainable urban development and land use planning with actual concerns for the security of the environment and human life (Bathrellos and Skilodimou, 2019).</p>\n<p>The flood hazard assessment procedure used hazard criteria concepts through hydrological and hydraulic modeling coupling techniques utilizing HEC-HMS for hydrological modeling and HEC-RAS for hydraulic modeling. A geospatial integrated approach using rainfall-runoff modeling provides a good understanding of the basin hydrology and flood hazard assessment (Farhan and Anaba, 2016; Abdelkarim et al., 2019).</p>\n<p>The city of Aqaba is located in the southwestern part of the country, on the north shore of the Gulf of Aqaba. It is the country’s only seaport on the Red Sea and is strategically important. The area of Aqaba is considered a severely arid zone or hybrid arid region with an aridity index of less than 0.05. The average annual precipitation over Aqaba is less than 30 mm. However, the rainfall events that occur over Aqaba are high intensity storms which lead to flash flood events frequently. The most intense rainfall events are a result of convective thunderstorms usually occurring during the transitional seasons of fall (September–November) or spring (March–May) (Farhan and Anaba, 2016). Rainfall events resulting from short duration convective storms are usually less than 30 minutes in duration with intensity exceeding 40-60 mm/hour. The Aqaba Special Economic Zone Authority (ASEZA) was established in 2001 to transform Aqaba into a Red Sea business hub and tourist destination. Many of ASEZA developments are constraucted on the alluvial fans of the wadis that drain towards the sea. The Aqaba Cit and its surroundind areas have been subjected to flash floods several times. It has been noted that the frequency of flash floods has increased recently due to climate change, which has caused severe damage to the infrastructure, properties, roads, and brought hardship for the residents of Aqaba. This puts the developments in an inescapable disastrous condition when flooding occurs (Farhan and Anaba, 2016).</p>\n<p>Aqaba city and its surroundings are often in danger of flooding and warning are issued each time a storm is expected. During the last few decades, Aqaba city has suffered from flash floods of different magnitudes, on average, every two years (Murphy, 2010; Farhan and Anaba, 2014). In February 2006, Aqaba witnessed a large flood where two people were killed while property damage to the airport and wastewater treatment plant was approximately 8.5 million US dollars. The flood of 2012 caused the death of two people (local newspapers) and in 2013 and 2016 a flood caused severe damage in the city. In October of 2018, a major flash flood hit Petra region, which is adjacent to Aqaba area, forcing authorities to evacuate more than 4,000 tourists from the ancient city of Petra (The Guardian, 2018). Historically, southern Jordan has witnessed large floods that occur frequently. As late as 1940, a “terrific rain- and hail-storm” damaged half of modern Aqaba. On January 7, 1944, and on May 12, 1950 major floods occurred in the southern of Jordan. In March 1966, a large flood struck the town of Ma’an in southern Jordan resulting in the death of 200 people and over 250 injuery (Al-Qudah, 2011). More than 50% of the town’s buildings were destroyed and over 3,000 people were homeless (Al-Qudah, 2011; Farhan and Ayed, 2017). In 1963, Petra witnessed a destructive flood of a peak magnitude of 250 m3/s that killed 27 French tourists and five people of locals (Al-Qudah, 2011; Al-Weshah and El-Khoury, 1999).</p>\n<p><strong>1.1 Description of Study Area</strong></p>\n<p>Wadi Yutum basin is located in the southern desert of Jordan between coordinates 34˚ 59’ and 35˚ 55’ East and 29˚ 13’ and 30˚ 00’ North of the WGS 1984 geographic coordinate system as shown in Figure 1. The basin covers an area of about 4,422 km2 and is predominantly undeveloped with elevation range of 0 m a.m.s.l. at the Gulf of Aqaba outlet to 1,720 m a.m.s.l at Umm Ad Dami Mountain. The basin is crossed northeast to southwest by the Amman – Aqaba Desert highway where the highway enters the basin at Ras En Naqab at elevation 1548 m a.m.s.l and runs for 38 km before it meets wadi Yutum then runs along the wadi for a distance of 35 km before entering into the city of Aqaba. The general shape of Wadi Yutum Basin is a trapezoidal shape with a longer axis-oriented E-W direction while the general slope of the area is also from east to west. Several smaller wadis drain within the basin area as shown in Figure 1. Wadi Titin, Wadi Umran, and Upper Yutum wadi; all merge into the main Wadi Yutum. The direction these wadis drain is from north and northeast to southwest and west, and finally discharge into alluvial fans at the northern coast of Aqaba.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"664\" height=\"540\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-1.jpg 664w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-1-300x244.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 1: </strong>Wadi Yutum basin delineation and drainage system</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The basin of Wadi Yutum is mainly an open desert with limited farming activities. The soil types are coarse sand, medium sand, sandy loam, fine sand, and sandy loam with the texture of loam, sandy loam, loamy sand and sand (Franceschini et al., 2019). Most of the basin’s soils in the study area are bare soils and bare rock. According to the SCS hydrologic soil group classifications, the catchment soils are mainly group B and C. Vegetation consists mainly of shrubby growth; and confined to the alluvium deposits and sandy soils. For this study, 38 sub-basins, as shown in Figure 2, were identified with a total area of 4,422 km2.</p>\n<p>Table 1. shows the physical characteristics of Wadi Yutum sub-basins, including area, stream length, slope, time of concentration. The SCS-Curve numbers were derived from the SCS tables for Arid and Semi-Arid regions based on soil type and land use maps.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"660\" height=\"487\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-2.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-2.jpg 660w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-2-300x221.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 2: </strong>Wadi Yutum Sub-basins.</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"703\" height=\"587\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-3.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-3.jpg 703w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-3-300x250.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The average annual precipitation across the region differs, ranging from 28.5 mm in Aqaba to approximately 145 mm in the highlands, as indicated in Table 2. Since most parts of the area are flat, precipitation water infiltrates into the barren rocks that mainly consist of sandstones and weathered rocks during intense rainfall events, the excess rainfall that does not infiltrate in the soil flows as surface water forming floods. Potential evaporation changes across the area, going from 3,400 mm/year in the western parts to 3,800 mm/year in the eastern and southern parts.</p>\n<p>There are seven precipitation gauges in Wadi Yutum basin, three of these gauges measure the daily precipitation while four of the gauges are totalizators giving annual totals. The spatial distribution of the precipitation gauges in the basin is well enough to give a good representation of the precipitation distribution over the basin. However the records of totalizer gauges are not adequate for runoff estimation. Therefore, correlation analysis of the precipitation records was used to estimate the daily precipitation at some of the totalizer gauges and consequently the runoff in Wadi Yutum basin. Precipitation data, which the Ministry of Water and Irrigation monitors, were collected for the period (1980 – 2020). The long-term mean monthly and annual precipitation of these precipitation gauges are shown in Table 2. The highest monthly precipitation values are recorded at Ras En Naqab precipitation gauge and the minimum monthly values at Aqaba gauge.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"1024\" height=\"227\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-4-1024x227.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-4-1024x227.jpg 1024w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-4-300x67.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-4-768x171.jpg 768w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-4.jpg 1058w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The intensity-duration-frequency curves, normally need continuous rainfall recording to know the short duration rainfall required to construct (IDF) curves. Although different statistical methods could be applied in the computation and preparation of these curves; Gumbel’s distribution of the annual maximum series is commonly used in this regard (Menabde et al., 1999; Bougadis and Adamowski, 2006; Ghanmi et al., 2016; Jefrin et al., 2018; Kareem et al., 2022). A correlation between rainfall data and the intensity and duration of rain using Gumbel’s method is suitable for southern Jordan (Hadadin, 2005). This study aimed to investigate intense rainfall’s frequency distribution and temporal variability by analyzing diary pluviograph data from rainfall stations in the Wadi Yutum Basin. Data concerning the annual sequence of maximum daily rainfall from precipitation gauges within the basin were employed. The Gumbel statistical distribution approach was utilized to derive rainfall depth and intensity for standard return periods of 2, 5, 10, 25, 50, and 100 years. Statistical arithmetic means, and standard deviations were utilized in developing Intensity-Duration-Frequency (IDF) curves. Further, the spatial distribution of rainfall across the Wadi Yutum Basin was estimated using the Thiessen polygon method. The Thiessen polygon weighted average method is applied to estimate the areal rainfall for each considered rainfall storm during the period of records (Chow et al., 1988). According to the time distribution of the design storm, the United State Soil Conservation Service (SCS) proposed four types of cumulative curves (Chow et al., 1988). The SCS Type II cumulative curve is usually used in arid areas to construct the temporal distribution of the design rainfall depth (Elfeki et al., 2014). The area of Wadi Yutum is classified as arid with storm events characterized by short duration and high intensity; therefore, storm distribution (hyetograph) Type II was selected as the distribution of rain during the storm. The design storm used for the hydrological analysis will be a 24-hour storm event which is considered as the maximum storm duration that could occur in the area. The selection of such a duration yields a more conservative design and is supported by the approach of selecting the design storm duration to be equal or more than the time of concentration (Ponce, 1989; Amatya, Cupak and Walega, 2015; Bezak et al., 2017).</p>\n<p>The objective of this study is to use geo-based hydrologic and hydraulic models to develop flood hazard maps of wadi Yutum floodplain areas in southern Jordan, focusing on the Amman- Aqaba Desert Highway along wadi Yutum for different design storm return periods. This highway is considered one of the most vital highways in Jordan (Farhan and Anaba, 2016). These maps are practical tools for flood mitigation, urban planning, and governmental interventions (Bathrellos et al., 2016). Considering the elevated occurrence of high-intensity storms in the Aqaba area, which are paralleled with the climate change, the development of flood risk management approaches is essential to reduce the potential harm flooding that can incur on the population and property in Aqaba (Hamdi et al., 2009; Al-Qinna et al., 2011; Shatanawi et al., 2021). A flood hazard map presents a significant correlation between the flood hazard zones and the spatial distribution of flood phenomena (Skilodimou et al., 2021).</p>\n<h3><strong>2. MATERIALS AND METHODS</strong></h3>\n<p><strong>2.1 Flood Hydrograph Analysis</strong></p>\n<p>The rainfall-runoff analysis and modeling is a powerful tool to predict the direct runoff hydrograph based on the catchment physiographical characteristics and rainfall storm characteristics. Catchment characteristics can be presented in terms of SCS curve number (CN) which represent the direct runoff potential of the catchment from a design storm. The design storm for the 100-year flood is also derived from the available daily rainfall data (Al-Weshah and El-Khoury, 1999).</p>\n<p>The most direct approach to determine the flood magnitudes associated with probabilities of occurrences is through statistical frequency analysis of historical recorded flood events. To determine these flood magnitudes accurate and consistent flow data is required, additionally a sufficient number of flow measurements should be available to be utilized in the frequency analysis to extract flood magnitudes associated with probabilities of occurrences. Wadi Yutum basin contains only one flow gauging station located at the upstream end of Aqaba city. The flow data available at this station is limited and is insufficient to determine flood magnitudes for extreme flood events that are typically used to assess flood hazards. Due to the unavailability of sufficient discharge data, indirect methods for deriving flood discharge amounts were used. This was achieved by applying a hydrological model to estimate peak discharge in the basin to determine the flood magnitude at the entrance to the city.</p>\n<p>Two categories of input data are needed for the hydrological model: rainfall and the basin’s physical characteristics. The first category is the design storm rainfall, where the rainfall depth, spatial distribution and temporal distribution are separate inputs that should be evaluated statistically. Historical maximum daily records are considered to determine the rainfall depths. In contrast, rainfall station areal distribution in and around the basin and correlations between the records are considered for the spatial distribution and rainfall durations and patterns for the temporal distributions. The watershed characteristics based on area, slope, stream length, time of concentration, soil type, and land use are presented earlier.</p>\n<p>The second category of input data needed for the hydrological model is the basin physical characteristics, which were obtained using remote sensing and GIS based models. A total of 38 sub-basins, were identified with a total area of 4,422 km2. The sub-basins characteristics such as area, slopes, stream length, maximum and minimum elevations were obtained and the time of concentration was computed for each sub-basin to be incorporated in the hydrological model. The time of concentration was computed using empirical formulas, as the most common method used to estimate the time of concentration in an ungauged basin is using empirical formulas (Nagy et al., 2016).</p>\n<p>Hydrological analysis using HEC-HMS model was conducted for the study area to estimate the peak flow at the gauging station downstream of Wadi Yutum basin, volume of runoff, and time to peak for the 25, 50, and 100 years return periods using the generated IDF curves. The NRCS method was chosen as Loss Method, SCS Unit Hydrograph as the transform method and Muskingum as routing method (HEC, 2022). The mainstream was analyzed using geometric data from GIS; HEC-HMS estimated the peak flow for the 25-, 50- and 100-year return periods.</p>\n<p><strong>2.2 Hydraulic Analysis</strong></p>\n<p>Several methods are used to delineate and map flood-prone areas. The methods used vary in complicity and detail depending on the required accuracy level, the types of floodplain management measures to be used, land values, political considerations and other factors (Wright, 2007). The U.S. Federal Emergency Management Agency (FEMA) considers one of the most accurate and widely used methods to employ engineering principles to calculate flood levels for given flood flow rates. These methods provide the basis for delineating flood-prone areas for differing flood magnitudes associated with probabilities of occurrences (return periods). To achieve that, site-specific data, such as rainfall records, historical information,rainfall temporal distributions, soil types, land cover and historic runoff data are required.</p>\n<p>HEC-RAS is designed to execute one-dimensional and two-dimensional hydraulic calculations for a network of natural or constructed channels. The velocity and depth of flow, among other parameters were evaluated using HEC-RAS and HEC-geoRAS extension in GIS. From the results of the hydrological and hydraulic models, hazard maps were generated for the 25-, 50- and 100-year return periods. The identification of the classes of “high,” “medium” and “low” risk is based on recommendations from a study (U.S. Bureau of Reclamation, 1988) that related the dangers posed by flooding according to the ability of an average adult to deal with flood water of varying depths and velocities safely. The criteria used to identify the class of risk is shown in Figure 3. These criteria generated risk maps for the 25-, 50- and 100-year return periods. The 2-Dimensional HEC-RAS model for the Wadi Yutum is given in Figure 4 with rivers, reaches and cross sections.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"709\" height=\"379\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-5.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-5.jpg 709w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-5-300x160.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 3: </strong>Classification criteria as a function of water depth and velocity (Bureau of Reclamation, 1988).</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"952\" height=\"440\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-6.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-6.jpg 952w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-6-300x139.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-6-768x355.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 4: </strong>Example of reach cross section based on DEM from HEC-RAS MAPPER</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p><strong>2.3 Flood Risk Management</strong></p>\n<p>Flood hazard, vulnerability, and risk mapping are integral components of flood risk management. These maps are critical for understanding and mitigating the impact of floods on communities and the environment. Flood hazard, vulnerability, and risk mapping are essential tools for informed decision-making, helping to minimize the impacts of flooding and enhance the resilience of communities in the face of this natural hazard (Abdelkarim and Gaber, 2023; Worldbank, 2022).</p>\n<p>Flood hazard mapping identifies areas prone to flooding and the likelihood of different flood scenarios occurring. It typically includes maps showingflood zones, floodplain boundaries, and flood depths based on various return periods (e.g., 10-year, 50-year, and 100-year floods). Flood hazard mapping relies on historical flood data, runoff discharge data, rainfall records, and hydrological modeling. Geographic Information Systems (GIS) and remote sensing technologies are often used to visualize and analyze this data.</p>\n<p>Flood hazard maps help communities, emergency responders, and planners understand the flood risk in a particular area. They inform land use planning, zoning regulations, and infrastructure development to minimize exposure to flood hazards.</p>\n<p>Vulnerability mapping assesses the susceptibility of people, property, and infrastructure to the impacts of flooding. This includes building materials, population density, infrastructure quality, and social and economic factors influencing a community’s ability to withstand and recover from a flood. Vulnerability mapping incorporates socioeconomic data, building types, construction quality, emergency response capacity, and other relevant information. This data is often collected through surveys, census data, and field assessments. It helps identify the areas and populations at most significant risk during a flood event. It assists in targeting mitigation efforts, evacuation planning, and resource allocation to enhance community resilience.</p>\n<p>Flood risk mapping combines information from flood hazard and vulnerability assessments to determine the potential consequences of flooding in a specific area. It quantifies the probability of flooding, potential damages, and impacts on human life, environment, and economy (Mudashiru et al., 2021). Flood risk mapping integrates flood hazard and vulnerability data with information on asset values, insurance coverage, and emergency response capabilities. Risk assessments often use probabilistic modeling to estimate the financial and social consequences of flooding. Flood risk mapping is crucial for decision-making, prioritizing mitigation efforts, and establishing policies for managing flood risk. It informs risk reduction strategies, investment decisions, and emergency management planning.</p>\n<p><strong>2.4 Flood Risk Mitigation Measures</strong></p>\n<p>Flood mitigation measures are crucial to reduce flood risk and minimize the impact of flooding on communities, infrastructure, and the environment. A combination of structural and non-structural measures should be implemented to mitigate flood risk. Here are some key flood mitigation strategies :</p>\n<p>Identify and map flood-prone areas to restrict or regulate land use and development in high-risk zones. Enforce building codes and zoning regulations to discourage construction in flood-prone areas. Promote the use of elevated foundations and flood-resistant building materials in at-risk areas.</p>\n<p>Small check dams such as retention and detention basins can reduce flood risk through:</p>\n<ul>\n<li>Water Storage: Small check dams are built to capture and store rainwater during periods of heavy precipitation. This stored water can be used for various purposes, including irrigation, groundwater recharge, and as buffering against future dry spells.</li>\n<li>Flood Control: Check dams capture and hold rainwater, protecting the immediate downstream areas from flash floods. The gradual release of stored water reduces the peak flow of floodwaters, preventing sudden inundation.</li>\n<li>Recharge of Aquifers: When strategically located, check dams can enhance groundwater recharge. This ensures a more stable water supply and helps maintain streamflow during dry periods.</li>\n<li>Soil Erosion Control: Check dams act as sediment traps, trapping eroded soil and preventing it from being transported downstream. This is particularly important in arid regions where topsoil is vulnerable to erosion.</li>\n<li>Community Resilience: The water stored in check dams can be used for agricultural purposes, providing a source of income and food security for local communities. This resilience can help communities withstand the effects of both floods and droughts.</li>\n</ul>\n<p>By combining structural and non-structural measures, Aqaba communities can reduce the risks associated with flooding, enhance local water availability, and improve the region’s overall resilience to the challenges posed by its climate. Proper planning, community involvement, and sustainable management of these measures are essential for their long-term success.</p>\n<p><strong>2.5 Afforestation and Ecosystem-Based Approaches</strong></p>\n<p>Afforestation can reduce flood risk in many ways like (Al-Weshah and El-Khoury, 1999):</p>\n<ul>\n<li>Soil Stabilization: Planting trees and native vegetation helps stabilize the soil, making it less vulnerable to erosion during heavy rainfall events. The roots of trees bind the soil particles together, preventing the soil from being washed away by floodwater.</li>\n<li>Reduced Runoff: Vegetation acts as a natural sponge, absorbing rainwater and reducing the amount of surface runoff. This minimizes the volume of water entering water bodies, which is crucial for mitigating flash floods.</li>\n<li>Shade and Cooling: Trees provide shade and cooling effects, reducing the rate of evaporation and the overall moisture content in the atmosphere. This can help regulate the local climate, reducing the likelihood of intense rainfall events that lead to floods.</li>\n<li>Enhanced Infiltration: Tree and plant roots create channels in the soil, facilitating water infiltration. This allows rainwater to percolate into the ground, replenishing aquifers and reducing the immediate surface runoff.</li>\n<li>Biodiversity and Ecosystem Services: Afforestation also enhances biodiversity and provides various ecosystem services, such as carbon sequestration, wildlife habitat, and improved air quality.</li>\n</ul>\n<p><strong>2.6 Climate Resilience Planning</strong></p>\n<p>Incorporate climate change projections into flood risk assessments and mitigation strategies. Ensure that infrastructure and policies are adaptable to changing climatic conditions.</p>\n<p><strong>2.7 Flood Forecasting and Warning Systems</strong></p>\n<p>Develop advanced flood forecasting systems that use weather data, river gauges, and modeling to predict flood events. Establish robust communication channels to disseminate timely warnings to the public and emergency responders.</p>\n<h3><strong>3. RESULTS AND DISCUSSION</strong></h3>\n<p>The rainfall records of the stations at Wadi Yutum basin show that the annual rainfall decreases as you move from the north and northeast to south and southeast across the whole basin. The mean annual rainfall varies by a factor of more than three over the basin and the coefficient of variation ranges from 0.52 to 0.84, where lower values indicate less variation of rainfall over the years. Table 3 shows a summary of the annual statistics for the significant rainfall stations at Wadi Yutum basin and the areal distribution of rainfall over Wadi Yutum Basin which was carried out using the Thiessen polygon method.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"981\" height=\"255\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-7.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-7.jpg 981w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-7-300x78.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-7-768x200.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Additionally, the long-term mean monthly and annual precipitation for the whole basin during the period (1980-2021) was analyzed; the water year 2014/2015 was found to represent a wet year, the water year 2010/2011 represented an average year, and the water year 1995/1996 represented a dry year.</p>\n<p>Precipitation gauges provide the magnitude of the isolated rains and their durations which can be used to determine the intensities and frequencies of the various rains. MWI or other sources have already developed the IDF for some gauges. If IDF is unavailable, frequency analysis methods are used to estimate the frequency distribution and intensity temporal variability of intense rainfall for these rainfall stations available at Wadi Yutum Basin from their maximum daily rainfall records. Gumbel statistic distribution was applied to obtain the IDF curves for the expected return periods of 25, 50, and 100 years. The IDF representing Ras En Naqab precipitation gauge is presented in Table 4.</p>\n<p>Localized storms in the basin cause significant flooding and are primarily generated from the Ras En Naqab area. The main problem with flood assessment at Wadi Yutum basin is the need of accurate discharge data, especially in the region exposed to frequent flash flooding. The lack of sufficient discharge and hydrological data has led the planners and decision makers to underestimate the geomorphic hazards such as flash floods, scour damage and erosion. The analysis conducted for Wadi Yutum basin was achieved by using HEC-HMS to estimate the flood hydrograph at the gauging stations of Wadi Yutum basin. The analysis was based on the 25, 50 and 100-year flood from the 24-hour storm event with a temporal storm distribution of SCS-Type II. Figure 5 shows the resulting flood hydrograph with peak discharge and runoff volume using the HEC-HMS model for three return periods in Table 5.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"978\" height=\"249\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-8.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-8.jpg 978w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-8-300x76.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-8-768x196.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"979\" height=\"141\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-9.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-9.jpg 979w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-9-300x43.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-9-768x111.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Using the hydraulics models of HEC-RAS and HEC-geoRAS, profile plots are determined for the main stream defined at the gauging station (HEC, 2022). Figure 6 shows these profiles for the 25, 50, and 100-year returns. Wadi Yutum reach characteristics were determined for each return period and for 30 river stations along the Wadi length flowing close to the main highway. Table 6 shows these characteristics at the last station.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"649\" height=\"472\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-10.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-10.jpg 649w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-10-300x218.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 5: </strong>Hydrographs resulting from the 6-hour storm for the 25-, 50- and 100-year return period</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"497\" height=\"403\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-19.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-19.jpg 497w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-19-300x243.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"885\" height=\"340\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-12.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-12.jpg 885w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-12-300x115.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-12-768x295.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 6: </strong>Rreach profile for the a) 25-year return period, b) 50-year return period, c) 100-year return period</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"980\" height=\"163\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-13.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-13.jpg 980w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-13-300x50.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-13-768x128.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>From the results of the hydrological and hydraulic models, hazard maps were generated for the 25-, 50- and 100-year return periods (Figure 9). The maps could be used to identify hazard locations within the stream of Wadi Yutum, where the gauging station near the entrance of Aqaba was identified. Using the results of the hazard map and by identifying the socio-economic map, a risk map was generated, and presented (Figure 8) for the 25-, 50- and 100-year return periods and different reaches.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"559\" height=\"375\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-20.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-20.jpg 559w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-20-300x201.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"930\" height=\"339\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-21.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-21.jpg 930w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-21-300x109.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-21-768x280.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 7: </strong>Flash flood hazard map for a) 25-year return period, b) 50-year return period, c) 100-year return period</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"515\" height=\"396\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-22.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-22.jpg 515w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-22-300x231.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img loading=\"lazy\" width=\"883\" height=\"346\" src=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-23.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-23.jpg 883w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-23-300x118.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/05/3wcm2024-315-325-23-768x301.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 8: </strong>Flash flood risk map for a) 25-year return period, b) 50-year return period, c) 100-year return period</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Flash floods are natural events that can have damaging effects on people and the environment. In the present work, GIS techniques were employed to estimate the flood hazard zones in the drainage area of Wadi Yutum basin. Aqaba city and its surrounding has been prone to flash flood events for several years. Even though the main entrance into the city, Amman-Aqaba Desert highway, lies within the basin floodplain, no suitable mitigation measures have been successfully implemented to date. Flood water is generated in the high land area to the low-lying area. In many cases, floods occur with no warning and cause loss of human life and infrastructure damage. Therefore, as floods have potential risks to public safety, properties, and infrastructure; it is important to identify flood hazards and to develop management plans and remedial measures for flood mitigation to reduce or prevent the damages caused by floods. The results indicated that the highway is subject to flooding during flash floods of different magnitudes. The analysis used in this study provided flood magnitudes of different probabilities of occurrence. The flood values obtained were utilized to generate hazard and risk maps for the area. Results indicated that the highway and other utilities close to the main wadi are at risk and are subject to flooding events at storms of 25-year return period.</p>\n<p>The identification of the classes of “high,” “medium” and “low” risk is based on recommendations from a study (U.S. Bureau of Reclamation, 1988) that related the dangers posed by flooding according to deal with flood water of varying depths and velocities safely. High and medium-risk zones are dangerous for the current facilities, road and trail users. The most affected element is the Amman-Aqaba Desert highway, the main entrance of Aqaba city.</p>\n<p>Flooding of floodplains can seriously disrupt the transportation system which can cause significant risks to moving vehicles (Shah et al., 2019). The average daily traffic volume on the Amman-Aqaba Desert Highway at the entrance to Aqaba is 20,182 vehicles (TIS, 2019). Given that the vehicle occupancy rate on the highway is 1.6 people per vehicle, more than 32,000 persons might be involved on a given day, depending on the storm’s time and severity. The railroad and other electrical and microwave installations would also be involved and could be a hazard. Therefore, restoring criteria should be assumed, and the best mitigation measures should be taken. It is important to note that no significant development exists within the risk zone. Low and no-risk zones are safe for any future development. Nevertheless, the land topography could be a barrier to such actions.</p>\n<p>Protection measures and improvements should be implemented at the highway and railway embankments as they are susceptible to erosion and scour caused by floods. Details on protection measures require further investigation and modeling. Some measures that could be implemented include but are not limited to detention dams built at selected locations in the upstream, hydraulically improving the capacity of the mainstream by reducing the channel roughness or other measures. Other options could work after further investigating the velocity of flow and embankment material at the vulnerable locations.</p>\n<h3><strong>5. CONCLUSIONS</strong></h3>\n<p>In contemporary years, the evolution of Wadi Yutum, the most extensive of the alluvial fans within the Aqaba area, has dramatically developed. Several industrial and urbanization developments have been assembled, and more are scheduled. A flash flood threat and risk map for Wadi Yutum has been designed to defend Aqaba from the dangers of potential future storms. This is part of the task force mustered to study and suggest flood mitigation actions that could be executed at the regional level. In this study, a GIS-based model was built to estimate the flood flow at the gauging stations of Wadi Yutum basin which lies at the main entrance into Aqaba City, close to the Amman-Aqaba highway. A geospatial integrated approach using GIS, remote sensing, hydro-morphological analysis, and rainfall-runoff modeling was used better to understand the basin hydrology and flood hazard assessment. IDF curves were developed for future planning as it could provide worst case scenario storm information (design storm) for designing hydraulic interventions to minimize the effect of floods. The flood hazard assessment procedure was carried out using GIS, and hydrological modeling using HEC-HMS and Hydraulic modeling using HEC-RAS. The flood hazard map for 25, 50, and 100 years return periods were generated with peak flows of 1523 m3/s, 1813 m3/s, and 2111 m3/s, respectively. Flood risk maps were generated to assist decision makers to better understand and plane against future potentials hazard conditions which could impose a risk on infrastructure and people as results showed more than 32,000 people are using the highway on daily bases. The analysis results in this study indicated that severe flood magnitude could be predicted, and hydraulic modeling along with land use maps and socio-economic aspects, hazards, and risk maps could be developed. Also, using the dry, normal, and wet years could provide a description of the water condition at the basin. However, such information cannot be used to estimate flash flood events in the area, as such events could occur even during dry seasons. The methods used for estimating the runoff during the year conditions provide an overall estimate of the runoff in comparison with the expected average values.</p>\n<h3><strong>ACKNOWLEDGEMENT</strong></h3>\n<p>The authors would like to thank United Nations Educational, Scientific and Cultural Organization (UNESCO) for funding parts of this research.</p>\n<h3><strong>REFERENCES</strong></h3>\n<ul>\n<li>Abdelkarim, A., Gaber, A., 2023. Flood risk mapping and mangement in urban areas: Integrating geomatics and hydrodynamic modeling – A case study of Al Bidi City, Saudi Arabia. Inf. Sci. Lett., 12(9): Pp. 2411-2443.</li>\n<li>Abdelkarim, A., Gaber, A., Youssef, A., Pradhan, B., 2019. Flood hazard assessment of the urban area of Tabuk City, Kingdom of Saudi Arabia by integrating spatial-based hydrologic and hydrodynamic modeling. Sens., 19(5): Pp. 1-23.</li>\n<li>Ajin, R., Krishnamurthy, R., Jayaprakash, M., Vinod, P., 2013. Flood hazard assessment of Vamanapuram River basin, Kerala, India: an approach using remote sensing &amp; GIS techniques. Adv. Appl. Sci. Res., 4(3): Pp. 263-274.</li>\n<li>Al-Qinna, M., Hammouri, N., Obeidat, M., Ahmad, F., 2011. Drought analysis in Jordan under current and future climates. Clim. Change, 106: Pp. 421-440.</li>\n<li>Al-Qudah, K., 2011. Floods as water resource and as a hazard in arid regions: a case study in southern Jordan. Jordan J. Civ. Eng., 5(1): Pp. 148-161.</li>\n<li>Al-Weshah, R., El-Khoury, F., 1999. Flood analysis and mitigation for Petra area in Jordan. J. Water Resour. Plann. Manage., 125(3): Pp. 170-177.</li>\n<li>Amatya, D., Cupak, A., Walega, A., 2015. Influence of time of concentration on variation of runoff from a small urbanized watershed. Geomatics, Landmanagement and Landscape, 2:Pp. 7-19.</li>\n<li>Argaz, A., Ouahman, B., Darkaoui, A., Bikhtar, H., Ayouch, E., Lazaar, R., 2019. Flood hazard mapping using remote sensing and GIS Tools: a case study of Souss watershed. J. Mater. Environ. Sci., 10(2): Pp. 170-181.</li>\n<li>Bathrellos, G., Skilodimou, H., 2019. Land Use Planning for Natural Hazards. Land, 8(9): Pp. 1-4.</li>\n<li>Bathrellos, G., Karymbalis, E., Skilodimou, H., Gaki-Papanastassiou, K., Baltas, E., 2016. Urban flood hazard assessment in the basin of Athens Metropolitan city, Greece. Environ. Earth Sci., 75(4): Pp. 1-14.</li>\n<li>Bezak, N., Šraj , M., Mikoš, M., 2017. Design rainfall in engineering applications with focus on the design discharge. In T. Hromadka II, and P. Rao (Eds.), Engineering and mathematical topics in rainfall. London: IntechOpen.</li>\n<li>Bhatt, G., Sinha, K., Deka, P., Kumar, A., 2014. Flood hazard and risk assessment in Chamoli District, Uttarakhand using satellite remote sensing and GIS techniques. Int. J. Innovative Res. Sci. Eng. Technol., 3(8): Pp. 15348-15356.</li>\n<li>Bougadis, J., Adamowski, K., 2006. Scaling model of a rainfall intensity–duration–frequency relationship. Hydrol. Processes, 20(17): Pp. 3747–3757.</li>\n<li>Chow, V., Maidment, D., Mays, L., 1988. Applied Hydrology. New York: McGraw-Hills.</li>\n<li>Elfeki, A., Ewea, H., Al-Amri, N., 2014. Development of storm hyetographs for flood forecasting in the Kingdom of Saudi Arabia. Arabian J. Geosci, 7: Pp. 4387–4398.</li>\n<li>Farhan, Y., Anaba, O., 2016. Flash flood risk estimation of wadi Yutum (southern Jordan) watershed using GIS based morphometric analysis and remote sensing techniques. Open J. Mod. Hydrol., 6(2): Pp. 79-100.</li>\n<li>Farhan, Y., Anbar, A., 2014. Fragile landscape: impact and consequences of May 2014 flash-flood disaster in the Aqaba area, southern Jordan. Res. J. Environ. Earth Sci., 6(9): Pp. 451-465.</li>\n<li>Farhan, Y.; Ayed, A., 2017. Assessment of flash-flood hazard in arid watersheds of Jordan. J. Geogr. Inf. Syst., 9: 717-751.</li>\n<li>Forkuo, E., 2010. Flood hazard mapping using aster image data with GIS. Int. J. Geomatics Geosci, 1(4): Pp. 932-950.</li>\n<li>Franceschini, G.; De Leo, E.; Muchoney, D., 2019. Land Cover Atlas. Rome: FAO.</li>\n<li>Ghanmi, H., Bargaoui, Z., Mallet, C., 2016. Estimation of intensity-duration-frequency relationships according to the property of scale invariance and regionalization analysis in a Mediterranean coastal area. J. Hydrol., 541: Pp. 38-49.</li>\n<li>Habte, A., Teka, D., Teka, K., 2017. Integration of Remote Sensing and Hydraulic Models to Identify Flood Prone Areas in Woybo River Catchment, South Western Ethiopia. J. Geogr. Nat. Disasters, 7(1): Pp. 1-13.</li>\n<li>Hadadin, N., 2005. Rainfall intensity-duration-frequency relationship in the Mujib basin in Jordan. J. Appl. Sci., 5(10): Pp. 1777-1784.</li>\n<li>Hamdi, M., Abu Allaban, M., Al Shayeb, A., Jaber, M., Momani, N., 2009. Climate change in Jordan: a comprehensive examination approach. Am. J. Environ. Sci., 5(1): Pp. 58-68.</li>\n<li>HEC., 2022. Hydrologic Modeling System HEC-HMS, Version 4.10 User’s Manual. U. S. Army Corps of Engineers, Institute for Water Resources, Hydrologic Engineering Center.</li>\n<li>Jefrin, N., Bolong, N., Sentian, J., Abustan, I., Mohammad, T., Ayog, J., 2018. Comparison of GEV and gumble’s distribution for development of intensity duration frequency curve for flood prone area in Sabah.<br />\nMalays. J. Geosci., 2(1): Pp. 42-44.</li>\n<li>Kareem, D., Amen, A., Mustafa, A., Yüce, M., Szydłowski, M., 2022. Comparative analysis of developed rainfall intensity-duration-frequency curves for Erbil with other Iraqi urban areas. Water, 14(3): Pp. 1-17.</li>\n<li>Menabde, M., Seed, A., Pegram, G., 1999. A simple scaling model for extreme rainfall. Water Resour. Res., 35(1): Pp. 335–339.</li>\n<li>Mudashiru, R., Sabtu, N., Abustan, I., Balogun, W., 2021. Flood hazard mapping methods: a review. J. Hydrol., 603, Part A.</li>\n<li>Murphy, B., 2010. Hydrologic analysis for a hyper-arid region in the Middle East. In J. Potter; D. Frevert (Eds.), Proceedings of Watershed Management 2010: Innovations in watershed management under land use and climate change, Pp. 1238-1247. 23-27 August, Madison.</li>\n<li>Nagy, E., Torma, P., Bene, K., 2016. Comparison method for computing the time of concentration in a medium-sized Hungarian catchment. Slovak J. Civ. Eng., 24(4): Pp. 8-14.</li>\n<li>Ponce, V., 1989. Engineering Hydrology, Principles and Practices. Upper Saddle River, New Jersey: Prentice Hall.</li>\n<li>Prama, M., Omran, A., Schröder, D., Abouelmagd, A., 2020. Vulnerability assessment of fash foods in Wadi Dahab Basin, Egypt. Environ. Earth Sci., 79(114): Pp. 1-17.</li>\n<li>Shah, S., Mustaffa, Z., Matínez-Gomariz, E., Yusof, K., Al-Qadami, E., 2019. Hazard risks pertaining to partially submerged non-stationary vehicle on low-lying roadways under subcritical flows. Results in Engineering, 3: Pp. 1-7.</li>\n<li>Shatanawi, K., Mohammad, A., Odeh, T., Arafeh, M., Halalsheh, M., Ghada, K., 2021. Analysis of historical precipitation in semi-arid areas – case study of Amman Zarqa basin. J. Ecol. Eng., 23(8): Pp. 101-111.</li>\n</ul>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<table>\n<tbody>\n<tr>\n<td><strong>Pages</strong></td>\n<td>315-325</td>\n</tr>\n<tr>\n<td><strong>Year</strong></td>\n<td>2024</td>\n</tr>\n<tr>\n<td><strong>Issue</strong></td>\n<td>3</td>\n</tr>\n<tr>\n<td><strong>Volume</strong></td>\n<td>8</td>\n</tr>\n</tbody>\n</table>\n\r\n\t\t</div>\r\n\t</div>\r\n<div><h2>Download</h2><div></div></div></div></div></div></div><div><div><div><div><div><a href=\"https://www.watconman.org/download/8428\" target=\" _blank\"><i></i>PDF Files</a></div></div></div></div><div><div><div><div><a href=\"https://www.watconman.org/xml/3wcm2024/3wcm2024-315-325.xml\" target=\" _blank\"><i></i>XML Files</a></div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t\r\n\t\t</div>\r\n\t</div>\r\n</div></div></div></div>","author":"AqilZ","siteTitle":"Water Conservation and Management (WCM)","siteHash":"4b40cdd0834294d8593f52ee7e7261a0ac8d56f637281fa24c6ad595afc9ba11","entryHash":"f268372c7aa0e7849b3da8bfb07a714854912a4d3c22b5bc9f1d9a9574dd9c1a","category":"Environment"}