{"title":"Report: Apple Received Over 2,500 US Patents in 2023","link":"https://www.macrumors.com/2024/01/09/report-apple-received-over-2500-patents-in-2023/","date":1704799122000,"content":"Apple was granted 2,536 patents in the United States last year, surpassed by only six other companies, IFI Claims reports.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/Apple-Logo-16x9-US-Flag-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nIn its <a href=\"https://www.ificlaims.com/rankings-top-50-2023.htm\">rankings of the top 50 U.S. patent assignees in 2023</a>, IFI Claims Patent Services shows that Apple was granted 251 more patents by the U.S. Patent and Trademark Office in 2023 compared to the previous year, an 11% increase. This moved the company one place up the annual patent rankings.\r<br />\n\r<br />\nApple's number of granted patents was surpassed by Samsung Electronics, Qualcomm, TSMC, IBM, Canon, and Samsung Display. Samsung Electronics again dwarfed the other top companies, with 6,165 patents granted. Apple outranked companies including LG, Micron, Intel, Huawei, Toyota, Google, Microsoft, BOE, and Amazon. Out of IFI's \"Magnificent Seven\" technology companies, encompassing Google, Amazon, Apple, Meta, Microsoft, Nvidia, and Tesla, Apple was the clear leader for new patents in 2023.\r<br />\n\r<br />\n<a href=\"https://www.ificlaims.com/rankings-global-assets-2023.htm\">IFI Claims' 2023 Global 250 rankings</a> reveal the world's largest patent holders by looking at all of the patents currently held by companies. In these rankings, Apple takes 51st place with 21,407 active patents. Panasonic is currently the world leader for active patents, with 94,341 in total, edging out Samsung who has 92,593 patents. \r<br />\n\r<br />\n<a href=\"https://www.macrumors.com/guide/patent/\">Apple's patent filings</a> often reveal interesting insights into the company's specific areas of research and development, but they are not representative of its immediate plans. Recent interesting Apple filings include designs for <a href=\"https://www.macrumors.com/2021/11/18/apple-researching-all-glass-designs/\">all-glass iPhones and Apple Watches</a>, a <a href=\"https://www.macrumors.com/2023/10/10/future-macbook-removable-key-patent/\">removable MacBook key that works as a mouse</a>, <a href=\"https://www.macrumors.com/2022/01/27/apple-could-add-user-authentication-to-airpods/\">user authentication technology for AirPods</a>, a <a href=\"https://www.macrumors.com/2021/08/17/apple-develops-apple-watch-hydration-sensor/\">hydration sensor for the Apple Watch</a>, use of the <a href=\"https://www.macrumors.com/2021/03/30/apple-patent-cheese-grater-iphone/\">Mac Pro's \"cheese grater\" like design on other Apple devices</a>, <a href=\"https://www.macrumors.com/2021/07/13/iphone-periscope-camera-patent-granted/\">periscope camera systems</a>, and <a href=\"https://www.macrumors.com/2021/03/25/deployable-feet-to-enhance-macbook-cooling/\">deployable MacBook Pro feet</a> to aid cooling.<div>Tag: <a href=\"https://www.macrumors.com/guide/patent/\">Patent</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/09/report-apple-received-over-2500-patents-in-2023/\">Report: Apple Received Over 2,500 US Patents in 2023</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/report-apple-received-over-2-500-us-patents-in-2023.2415848/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f269a97ddd279dc092a979e39f890b7713699a45f30807b4974f2584d6c35f63","category":"Apple"}