{"title":"Prosecution gets Elizabeth Holmes to admit she was in control of Theranos","link":"https://arstechnica.com/?p=1817262","date":1638383629000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1236914484-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/GettyImages-1236914484.jpg\">Enlarge</a> <span>/</span> Elizabeth Holmes, founder of Theranos Inc., arrives at federal court in San Jose, California, on Tuesday, Nov. 30, 2021.  (credit: David Paul Morris/Bloomberg)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>At this point in her criminal trial, Theranos founder Elizabeth Holmes' best chance for acquittal is for the jury to believe that she was a puppet being controlled by her boyfriend, company president Ramesh “Sunny” Balwani. Yesterday, the prosecution attempted to pick apart that defense.</p>\n<p>In Holmes' first several days on the stand, jurors <a href=\"https://arstechnica.com/tech-policy/2021/11/holmes-recounts-sexual-emotional-abuse-by-theranos-exec-balwani/\">heard about Balwani’s abusive behavior</a>. He forced Holmes to have sex with him, prescribed her meals and schedule, and told her that she needed to “kill” herself to be reborn as an entrepreneur, Holmes testified. Balwani has denied the claims of abuse. When recounting various episodes, Holmes broke into tears several times. Based on her testimony and her contemporaneous notes submitted as evidence, it certainly sounds like it was a toxic relationship.</p>\n<p>The question for the jury, though, is whether that influenced Holmes’ actions. Was she in control of Theranos? Did her relationship with Balwani make her oblivious to a fraudulent scheme? To be convicted of wire fraud, which Holmes has been charged with, a person’s participation must be both willful and knowing. Yesterday, the prosecution set out to make it clear that Holmes was both in control and aware that what she was doing was wrong.</p></div><p><a href=\"https://arstechnica.com/?p=1817262#p3\">Read 27 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1817262&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f2718956b1e87a7030ff7fad9ae9b62ee6289ef3a2f71da4c0461d30c0e75a4e","category":"Tech"}