{"title":"New indices for the diagnosis of fish welfare and their application to the grass carp (Ctenopharyngodon idella) reared in earthen ponds","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16105?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>Animal welfare is an issue of increasing importance in global aquaculture. However, the incorporation of this issue into routine aquaculture operations is a challenge. A possible path to change this is the recognition, identification and addressing of the ecological, physiological, nutritional, behavioural and psychological needs of fish. The present study uses grass carp (<i>Ctenopharyngodon idella</i>), the world's most widely produced fish species, and earth ponds, the world's most widely used production system in fish farming worldwide, as the basis for developing indices to assess and monitor the welfare of farmed fish. The proposed indices were structured based on specific welfare indicators, reference values, individual weights and associated scores to address the Animal Welfare Five Freedoms and a Life Worth living concepts. Two types of indices were proposed: (1) partial welfare indices (PWI<sub>\n   <i>x</i>\n</sub>), specific to each of the four observed/analysed freedoms; (2) general welfare index (GWI), which simultaneously summarizes the addressees' freedoms in a single variable. Both indices range from 0 (critical welfare impairment) to 1.0 (minimal risk of welfare impairment). The study was based on a comprehensive systematic review of the literature using the PRISMA method. The proposed indices were based on 10 environmental indicators, nine indicators for health, five for nutrition and four for behaviour. The PWI<sub>\n   <i>x</i>\n</sub> can be used to determine how each category of indicators contributes to the GWI, which defines the level of fish farm welfare at a given point in time and which needs are affected or met during a production cycle.</p>","author":"Ana Silvia Pedrazzani, \nCamila Prestes dos Santos Tavares, \nMurilo Quintiliano, \nNathieli Cozer, \nAntonio Ostrensky","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"f27913ae823dfd36e7899a0d0eaaac3e287ee12df86625a5d5247ad4ad1a2e45","category":"Environment"}