{"title":"PSXIII-10 Impacts of inoculation with Pediococcus pentosaceus in combination with chitinase on bale core temperature, nutrient composition, microbial ecology, and ruminal digestion of high moisture alfalfa hay","link":"https://academic.oup.com/jas/article/102/Supplement_3/610/7757750?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Baling alfalfa hay at greater than optimal moisture (18% to 25%) can shorten wilting time and reduce field losses due to precipitation and leaf separation, but plant cellular respiration and the growth of spoilage microorganisms can reduce the nutritional value of baled hay. The objective of this study was to evaluate the effects of the application of <span>Pediococcus pentosaceus</span> NCIMB 12674 (PP) with various sources and concentrations of chitinase on conservation and nutritive value of alfalfa high-moisture hay (HMH). <span>P. pentosaceus</span> (10<sup>12</sup> colony forming unit/tonne) combined with 1.5 (PP+LC), 7.5 (PP+MC) or 15.0 (PP+HC) g of chitinase/tonne fresh weight of 1<sup>st</sup> cut alfalfa (Exp. 1) or PP with chitinase from three different suppliers (PP+Fe, PP+Pe and PP+Si) were applied to 2<sup>nd</sup> cut alfalfa (Exp. 2) in 2016. In 2017, PP was applied alone or in combination with chitinase at 1.5 (PP+LC) or 7.5 (PP+MC) g/tonne of 1<sup>st</sup> cut (Exp. 3) and 2<sup>nd</sup> cut (Exp. 4) alfalfa. In all experiments, deionized water and propionic acid (PA) were applied as neutral (CON) and positive control (CON+), respectively. Bale temperatures were measured at 4-h intervals over the initial 60-d storage. Core hay samples were collected on d 30, 60, 90, and 120 of storage for chemical and microbial evaluation. Samples collected after 120-d storage were used to measure in situ dry matter and neutral detergent fiber (NDF) digestibility. Ambient-adjusted bale temperature was positively correlated (r<sup>2</sup> = 0.44) to the moisture content of HMH at baling. The maximum temperature (T<sub>max</sub>) during 60-d storage was positively related (r<sup>2</sup> = 0.66) to total microbial populations (bacteria + mold + yeast) with mold being the largest factor. The NH<sub>3</sub>-N concentration of the HMH increased with the total microbial population (r<sup>2</sup> = 0.80) with mean bacterial numbers during d 30 to 120 being the main contributing (r<sup>2</sup> = 0.83) factor. Treatments had no effect on total bacteria or lactic acid bacteria counts, while PP+MC had decreased yeast counts than CON after 60-d in Exp. 4 (<span>P</span> = 0.01) and after 120-d in Exp 3 (<span>P</span> &lt; 0.001). Mold populations for bales treated with PP+HC at d 60 and PP+LC, PP+MC, and PP+HC at d 90 in Exp. 1, PP+MC at d 120 in Exp. 3 and CON+ at d 30 in Exp. 4 were all less (<span>P</span> &lt; 0.05) than CON. The NDF digestibility after 72-h ruminal incubation was greater (<span>P</span> &lt; 0.01) for PP+LC, PP+MC, and PP+HC than CON+ in Exp.1 and for PP+LC than CON in Exp 3 (<span>P</span> &lt; 0.001). Combination of <span>P. pentosaceus</span> and chitinase have potential as additives to reduce microbial spoilage and to increase NDF digestibility of HMH.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f29285cbbca6b906e81e73eb6d5a1d214e44e8eb9d154b4ef4fd098e6c226c78","category":"Environment"}