{"title":"Exploring the spatiotemporal patterns of county-scale PM2.5 drivers in Shandong Province from 2000 to 2020","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310190","date":1727964000000,"content":"<p>by Dongchao Wang, Xichun Li, Xinrong Duan, Huimin Yang, Baolei Zhang</p>\r\n\r\nIn the rapid development of air pollution over the past two decades in Shandong Province, it has played a detrimental role, causing severe damage to regional ecological security and public health. There has been little research at the county scale to explore the spatiotemporal causes and heterogeneity of PM2.5 pollution. This study utilizes a Geographically and Temporally Weighted Regression Model (GTWR) to environmentally model meteorological elements and socioeconomic conditions in Shandong Province from 2000 to 2020, aiming to identify the key driving factors of PM2.5 concentration changes across 136 counties. The results show that PM2.5 pollution in Shandong Province peaked in 2013, followed by a rapid decline in pollution levels. Geographically, counties in the western plains of Shandong generally exhibit higher pollution levels, while most counties in the central hills of Shandong and the Jiaodong Peninsula are in low pollution areas. Strong winds positively influence air quality in the southeast of Shandong; high temperatures can ameliorate air pollution in areas outside the southeast, whereas air pressure exhibits the opposite effect. Precipitation shows a significant negative correlation in the Laizhou Bay and central Shandong regions, while relative humidity primarily exerts a negative effect in coastal areas. The impact of fractional vegetation cover is relatively mild, with positive effects observed in southern Shandong and negative effects in other regions. Population density shows a significant positive correlation in the western plains of Shandong. Economic factors exhibit predominantly positive relationships, particularly in the northwest and the Jiaodong Peninsula. Electricity consumption in southern Shandong correlates positively, while industrial factors show positive effects province-wide. PM2.5 pollution in Shandong Province demonstrates significant spatiotemporal heterogeneity, aligning with governmental expectations for the effectiveness of air pollution control measures. The conclusions of this study can be utilized to assess the efficiency of air pollution abatement at the county level and provide quantitative data support for the revision of regional emission reduction policies.","author":"Dongchao Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f292d5e5ff65ccdeb7e0caa0ec32addbd206176450c5c20cb6a2f986477e29b5","category":"Interdisciplinary"}