{"title":"Psychoactive and other ceremonial plants from a 2,000-year-old Maya ritual deposit at Yaxnohcah, Mexico","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301497","date":1714140000000,"content":"<p>by David L. Lentz, Trinity L. Hamilton, Stephanie A. Meyers, Nicholas P. Dunning, Kathryn Reese-Taylor, Armando Anaya Hernández, Debra S. Walker, Eric J. Tepe, Atasta Flores Esquivel, Alison A. Weiss</p>\r\n\r\nFor millennia, healing and psychoactive plants have been part of the medicinal and ceremonial fabric of elaborate rituals and everyday religious practices throughout Mesoamerica. Despite the essential nature of these ritual practices to the societal framework of past cultures, a clear understanding of the ceremonial life of the ancient Maya remains stubbornly elusive. Here we record the discovery of a special ritual deposit, likely wrapped in a bundle, located beneath the end field of a Late Preclassic ballcourt in the Helena complex of the Maya city of Yaxnohcah. This discovery was made possible by the application of environmental DNA technology. Plants identified through this analytical process included <i>Ipomoea corymbosa</i> (<i>xtabentun</i> in Mayan), <i>Capsicum</i> sp. (chili pepper or <i>ic</i> in Mayan), <i>Hampea trilobata</i> (<i>jool</i>), and <i>Oxandra lanceolata</i> (<i>chilcahuite</i>). All four plants have recognized medicinal properties. Two of the plants, jool and chilcahuite, are involved in artifact manufacture that have ceremonial connections while chili peppers and xtabentun have been associated with divination rituals. Xtabentun (known to the Aztecs as <i>ololiuhqui</i>) produces highly efficacious hallucinogenic compounds and is reported here from Maya archaeological contexts for the first time.","author":"David L. Lentz","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f294d08336803477db1e84b99fe08c63472db1db0588b4d8d5afb1526f24d74b","category":"Interdisciplinary"}