{"title":"Apple’s fancy FaceTime features might be too late to matter","link":"https://www.macworld.com/article/348388/facetime-learns-lessons-from-the-pandemic-but-is-it-too-late.html","date":1623236400000,"content":"\n<div>\n<section><div></div></section><p>Last year, in the grips of a sudden and shocking global pandemic, Apple continued rolling. New product announcements kept dropping. A new set of operating-system releases were announced, went into beta, and shipped. The transition to Apple silicon started.</p>\n\n\n\n<p>Everyone at Apple deserves a lot of credit for keeping the machine chugging along during 2020, but the company was helped out by the its policy of working well in advance, laying the groundwork for products and features over a long stretch of time. </p>\n\n\n\n<p>Unfortunately, that approach also has a downside: it reduces the company’s nimbleness. Last spring it was clear that masks were going to be a major feature of public life for a while, but there was no way the next iPhone could be adapted to add Touch ID to its home button in time. Apple did manage to invent a mask workaround for Apple Watch users—but even that quick fix didn’t arrive on iPhones until an iOS update in May 2021.</p>\n\n\n\n<p>Apple takes its time, for better or for worse. This week at its Worldwide Developer Conference, Apple finally unveiled a bunch of features that appear to be based on hard lessons learned during the last year-plus of pandemic life. It’s great to see Apple reacting to changes in the world, but given that nothing showed off this week will ship until this fall, is the timing all wrong?</p>\n\n\n\n<h2>FaceTime in a Zoom world</h2>\n\n\n\n<p>In the last year, many of us have spent an inordinate amount of time in videoconferences. Zoom has become a household word, both noun and verb. And yet for all of Apple’s prominence in the tech world, its FaceTime technology was not a part of the conversation in 2020. I speak from personal experience: My entire extended family uses Apple devices, and yet when my in-laws decided to inaugurate a fortnightly family video chat, we used Zoom. I never even considered Group FaceTime.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/group-facetime-ipados-14-ios-14.jpg?quality=50&amp;strip=all\" /><figcaption><p>Group FaceTime had an opportunity to be popular during the pandemic. It did not seize the opportunity.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>At least in part, this is Apple’s fault for failing to execute well on Group FaceTime in its early days. It was so buggy during beta testing that it was <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macstories.net/news/group-facetime-pulled-from-initial-ios-12-release/&amp;xcust=1-1-348388-0-0-0&amp;sref=https://www.macworld.com/feed\">pulled from the initial iOS 12 release</a>. Apple decided to add whimsy to the interface by avoiding the standard grid view favored by literally every other videoconferencing app, and instead placed Group FaceTime participants in floating bubbles that would bob around the screen, scaling up in size when the person inside the bubble was talking. A lot of people found it disconcerting and distracting.</p>\n\n\n\n<p>And then there’s the fact that FaceTime was actually pretty successful at providing one-to-one video calls. I use FaceTime for family calls multiple times a week, and love it. But I suspect that FaceTime has become so established as a one-to-one medium that establishing Group FaceTime as a thing was always going to be challenging.</p>\n\n\n\n<p>For whatever reason, the pandemic arrived, the need for apps to let us see each other in group settings remotely became intense, and FaceTime faceplanted. I’m sure there was a lot of facepalming within Apple over the whole thing. But the good news is, it seems to have provided the impetus for a serious and promising overhaul of FaceTime.</p>\n\n\n\n<h2>Learning the lessons of Zoom</h2>\n\n\n\n<p>While Apple said that the goal of its FaceTime changes (due this fall in iOS 15, iPadOS 15, and macOS Monterey) is to “make FaceTime feel more natural, comfortable, and lifelike,” let’s be honest: it’s also about making FaceTime more competitive with Zoom, WebEx, and the rest of the videoconferencing gang.</p>\n\n\n\n<p>First up: Introducing a proper grid view. Those floating bubbles were quirky and fun, but more than a year of Zoom conferences suggests that we’ve gotten quite used to seeing everyone’s faces in their little boxes. (The less said about Zoom’s odd <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blog.zoom.us/introducing-zoom-immersive-view/&amp;xcust=1-1-348388-0-0-0&amp;sref=https://www.macworld.com/feed\">immersive view</a>, the better.)</p>\n\n\n\n<p>Next: Recognizing that our own rooms aren’t necessarily glamorous or interesting and might even be downright embarrassing, other videoconferencing systems have offered the ability to blur out the background or even replace it with another image. While Apple hasn’t (yet?) embraced the idea of replacing your bookshelf with a picture of the deck of a pirate ship, it has offered its own spin on the problem: portrait mode. Which is really just fuzzing out the background by another name, but that’s fine. It’s a good feature.</p>\n\n\n\n<p>By adding support for links, Apple’s also taking its first steps outside its own ecosystem. People on non-Apple devices will be able to click on a FaceTime link and join a FaceTime conversation in a web browser. This takes FaceTime out of the realm of an Apple-only product and makes it at least a <em>little</em> broader. (You still can’t <em>start</em> a conversation from a non-Apple device.)</p>\n\n\n\n<p>But links isn’t just a cross-platform feature, it’s also about convenience. Links are easy to send around. I’ve created Zoom links for several of my recurring meetings, including that family chat we do every other week. Everyone knows where to go. I can put Zoom links into my calendars and know exactly what link to click on when it’s time to join a meeting. Tying FaceTime sessions to URLs is going to benefit everyone, not just people on non-Apple devices.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/macos-monterey-sharetime.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Share Play (available on macOS Monterey, iOS 15, and iPadOS 15) is a great why for a group to bond.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>And then there’s SharePlay, which is a reaction to last year’s trend toward <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/21307583/watch-videos-movies-online-friends-streaming-netflix-hulu-amazon-scener-extensions&amp;xcust=1-1-348388-0-0-0&amp;sref=https://www.macworld.com/feed\">video watch-party apps and plugins</a>, many of which excluded Apple devices because they required Chrome extensions. Talk about a major change: the new SharePlay API canonizes the idea that different people might want to consume media together, while apart. And because it’s a real feature and not a collection of hacks, it looks to be impressive: controls over playback are shared, so participants can pause, play, and even scrub to new sections of video.</p>\n\n\n\n<h2>Is it all too late?</h2>\n\n\n\n<p>Given that Apple’s method is to chug along rather than being able to turn on the dime, the debut of all these new features is actually an impressive accomplishment. The problem is that by this fall, the global need to use videoconferencing software may have receded. (It’s important to note that while many Americans are feeling pretty good about COVID at the moment, the pandemic is raging in other parts of the world. Who can tell what fall will bring?)</p>\n\n\n\n<p>So is all of this too late? I’m not going to defy <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Betteridge%27s_law_of_headlines&amp;xcust=1-1-348388-0-0-0&amp;sref=https://www.macworld.com/feed\">Betteridge’s Law</a> (named after former MacUser editor Ian Betteridge, by the way). I think the answer is probably “no.” While Apple has likely missed the high point of global need for videoconferencing apps, I suspect that 2020 has permanently altered how people use the internet to interact. Even if the pandemic completely abates, we’ve all become more comfortable with telecommuting, remote working, and (perhaps most importantly) using technology to make us feel more connected to friends, family, and colleagues.</p>\n\n\n\n<p>I don’t think I’m ready to predict that FaceTime is going to storm out of the gates this fall and begin to threaten Zoom and other big players in videoconferencing. But I will say this: With the savvy upgrades Apple announced this week, FaceTime has a much better chance of being a part of the zeitgeist, pandemic or no pandemic.</p>\n</div>","author":"Jason Snell","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f2a4f12bd90cf566a048a90386dfa7db6c4a88cbc691cdd94fca0c430f35db17","category":"Apple"}