{"title":"Effects of <i>KRAS</i>, <i>STK11</i>, <i>KEAP1</i>, and <i>TP53</i> mutations on the clinical outcomes of immune checkpoint inhibitors among patients with lung adenocarcinoma","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307580","date":1721656800000,"content":"<p>by Yao Liang, Osamu Maeda, Chiaki Kondo, Kazuki Nishida, Yuichi Ando</p>\r\nBackground <p>This study aimed to identify the associations between individual <i>KRAS</i>, <i>STK11</i>, <i>KEAP1</i>, or <i>TP53</i> mutations, as well as the comutation status of these genes, and the tumor mutation burden (TMB) with clinical outcomes of lung adenocarcinoma patients treated with immune checkpoint inhibitors (ICIs).</p> Methods <p>We collected data from patients with lung adenocarcinoma treated with ICIs from the Center for Cancer Genomics and Advanced Therapeutics (C-CAT) database between June 2019 and August 2023. The main endpoints were the treatment response and overall survival (OS).</p> Results <p>Among 343 patients with lung adenocarcinoma, 61 (18%), 69 (20%), 41 (12%), and 222 (65%) patients had <i>KRAS</i>, <i>STK11</i>, <i>KEAP1</i>, and <i>TP53</i> mutations, respectively. An overall objective response was observed in 94 of 338 patients (28%), including 2 (1%) who achieved a complete response and 92 (27%) who achieved a partial response. Patients with <i>STK11</i>, <i>KEAP1</i>, or <i>TP53</i> mutations had a significantly greater TMB (P&lt;0.001). According to the univariate analysis, the treatment response was significantly correlated with <i>TP53</i> mutation in both the general (P = 0.041) and <i>KRAS</i> wild-type (P = 0.009) populations. <i>KEAP1</i> and <i>TP53</i> mutations were associated with worse OS among assessable patients (hazard ratio (HR) = 2.027, P = 0.002; HR = 1.673, P = 0.007, respectively) and among patients without <i>KRAS</i> mutations (HR = 1.897, P = 0.012; HR = 1.908, P = 0.004, respectively). According to the multivariate analysis, <i>KEAP1</i> (HR = 1.890, P = 0.008) and <i>TP53</i> (HR = 1.735, P = 0.011) mutations were found to be independent factors for OS.</p> Conclusions <p><i>STK11</i>, <i>KEAP1</i>, and <i>TP53</i> mutations are significantly associated with a high TMB. <i>TP53</i> mutation could affect the treatment response to some degree, and both <i>KEAP1</i> and <i>TP53</i> mutations resulted in inferior OS in the general patient population and in those with <i>KRAS-</i>wild-type lung adenocarcinoma, indicating that <i>KEAP1</i> and <i>TP53</i> mutations might act as prognostic factors for ICI treatment in lung adenocarcinoma patients.</p>","author":"Yao Liang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f2acb8f85021a6a736d0f2a54420747678bba4cd5356bf796f13467506ee3957","category":"Interdisciplinary"}