{"title":"Acura’s redesigned MDX SUV returns to the brand’s roots","link":"https://arstechnica.com/?p=1747973","date":1615237888000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/2022-MDX-A-Spec-10-980x735.jpg\" alt=\"\"></div>\n        <p>\n          Acura just redesigned its bestseller, the MDX SUV.                       [credit:\n                        <a href=\"https://www.acura.com/\">Acura</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Now must be an interesting time—<a href=\"https://en.wikipedia.org/wiki/Interesting_Times\">in the Pratchettian sense</a>—to be a car maker. All you want to do is sell vehicles, but there are economic downturns and the occasional pandemic to factor in. Around the world, climate change policies are heavily favoring electric-powered machines, at least in Europe and China, and a Californian upstart has embarrassed all the usual players in the process. And on top of that, all your customers are bored with the cars they used to buy—everything has to be a crossover or SUV, preferably with Wi-Fi.</p>\n<p>In Acura's case, the company has had to deal with all of the above while going through something like a midlife crisis. After decades competing for sales with Lexus and Infiniti, Honda's North American spinoff decided to engage in some soul-searching to see whether that's really where its effort should be spent. And Acura decided that instead of focusing on luxury, it needed to return to its roots as a performance brand.</p>\n<p>In the past, the Japanese luxury brands were seen as a rung below their German competitors, particularly in terms of driving dynamics, mostly due to the preponderance of front-wheel-drive platforms. But if Acura's plan was to dislodge BMW as the driver's choice, the MDX is the SUV to do it. Particularly the version it sent us for 48 hours—a $57,100 2022 MDX A-Spec. A-Spec, in addition to being something to do with <a href=\"https://arstechnica.com/tag/gran-turismo/\"><em>Gran Turismo</em></a>, is also Acura-code for \"this is the one that handles really well,\" a bit like those BMWs you see with M Sport badges.<!--adbreak--></p></div><p><a href=\"https://arstechnica.com/?p=1747973#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1747973&comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f2b1add44ba33e08ca868ae548932bf8511ed03ab87b872e84ef6f435070ad69","category":"Tech"}