{"title":"Alaska and United Airlines Report Loose Parts in Boeing 737 Max 9 Door Panels","link":"https://www.pbs.org/newshour/nation/alaska-and-untied-airlines-report-loose-parts-in-boeing-max-9-door-panels","date":1704830477000,"content":"\n<p>PBS News Hour:</p>\n\n<blockquote>\n  <p>Federal investigators say a door panel slid up before flying off \nan Alaska Airlines jetliner last week, and they are looking at \nwhether four bolts that were supposed to help hold the panel in \nplace might have been missing when the plane took off. The \ncomments Monday from the National Transportation Safety Board came \nshortly after Alaska and United Airlines reported separately that \nthey found loose parts in the panels — or door plugs — of some \nother Boeing 737 Max 9 jets. </p>\n\n<p>“Since we began preliminary inspections on Saturday, we have found \ninstances that appear to relate to installation issues in the door \nplug — for example, bolts that needed additional tightening,” \nChicago-based United said. </p>\n\n<p>Alaska said that as it began examining its Max 9s, “Initial \nreports from our technicians indicate some loose hardware was \nvisible on some aircraft.” </p>\n</blockquote>\n\n<p>This tidbit seems nutty to me:</p>\n\n<blockquote>\n  <p>The jet involved in Friday’s blowout is brand-new, having been put \nin service in November. After a cabin-pressurization system \nwarning light came on during three flights, the airline stopped \nflying it over the Pacific to Hawaii. Some aviation experts \nquestioned why Alaska continued using the plane on overland routes \nuntil it figured out what was causing the pressurization warnings. </p>\n\n<p>Homendy said Monday, however, that NTSB has seen no evidence to \nlink the warnings with the blowout of the door plug. </p>\n</blockquote>\n\n<p>There may be no evidence yet, but what are the odds that a door plug that blew off a brand-new jet mid-flight — in a fleet of planes they’ve now discovered have loose bolts holding those doors in place — wasn’t to blame for the cabin-pressurization warnings?</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/09/alaska-united-boeing-loose-parts\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"f2b73f0929d85d26c663dbc34a55b96736e031a807709606734fc02e4862100d","category":"Tech"}