{"title":"Yes, Apple will ‘fake’ zoomed photos on the iPhone 15 too–but how far will it go?","link":"https://www.macworld.com/article/1662062/iphone-15-periscope-zoom-galaxy-s23-fake-moon.html","date":1679049000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>You might have seen headlines this week about the Samsung Galaxy S23 Ultra taking so-called “fake” moon pictures. Ever since the S20 Ultra, Samsung has had a feature called Space Zoom that marries its 10X optical zoom with massive digital zoom to reach a combined 100X zoom. In marketing shots, Samsung has shown its phone taking near-crystal clear pictures of the moon, and users have done the same on a clear night.</p>\n\n\n\n<p>But <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/Android/comments/11nzrb0/samsung_space_zoom_moon_shots_are_fake_and_here/&amp;xcust=1-1-1662062-1-0-0&amp;sref=https://www.macworld.com/feed\">a Redditor has proven</a> that Samsung’s incredible Space Zoom is using a bit of trickery. It turns out that when taking pictures of the moon, Samsung’s AI-based Scene Optimizer does a whole lot of heavy lifting to make it look like the moon was photographed with a high-resolution telescope rather than a smartphone. So when someone takes a shot of the moon—in the sky or on a computer screen as in the Reddit post—Samsung’s computational engine takes over and clears up the craters and contours that the camera had missed.</p>\n\n\n\n<p>In <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/Android/comments/11r7dwk/last_update_on_the_samsung_moon_controversy_and/&amp;xcust=1-1-1662062-1-0-0&amp;sref=https://www.macworld.com/feed\">a follow-up post</a>, they prove beyond much doubt that Samsung is indeed adding “moon” imagery to photos to make the shot clearer. As they explain, “The computer vision module/AI recognizes the moon, you take the picture, and at this point, a neural network trained on countless moon images fills in the details that were not available optically.” That’s a bit more “fake” than Samsung lets on, but it’s still very much to be expected.</p>\n\n\n\n<p>Even without the investigative work, It should be fairly obvious that the S23 can’t naturally take clear shots of the moon. While Samsung says Space Zoomed shots using the S23 Ultra are “capable of capturing images from an incredible 330 feet away,” the moon is nearly 234,000 miles away or approximately 1,261,392,000 feet away. It’s also a quarter the size of the earth. Smartphones have no problem taking clear photos of skyscrapers that are more than 330 feet away, after all.</p>\n\n\n\n<p>Of course, the moon’s distance doesn’t tell the whole story. The moon is essentially a light source set against a dark background, so the camera needs a bit of help to capture a clear image. Here’s how <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.samsungmobilepress.com/feature-stories/how-samsung-galaxy-cameras-combine-super-resolution-technologies-with-ai-technology-to-produce-high-quality-images-of-the-moon/&amp;xcust=1-1-1662062-1-0-0&amp;sref=https://www.macworld.com/feed\">Samsung explains it</a>: “When you’re taking a photo of the moon, your Galaxy device’s camera system will harness this deep learning-based AI technology, as well as multi-frame processing in order to further enhance details. Read on to learn more about the multiple steps, processes, and technologies that go into delivering high-quality images of the moon.”</p>\n\n\n\n<p>It’s not all that different from features like <a href=\"https://www.macworld.com/article/672315/how-to-use-iphone-portrait-mode.html\">Portrait Mode</a>, Portrait Lighting, <a href=\"https://www.macworld.com/article/677539/ios-15-lets-you-turn-off-iphone-cameras-night-mode.html\">Night Mode</a>, <a href=\"https://www.macworld.com/article/1523080/google-one-magic-eraser-photos-iphone.html\">Magic Eraser</a>, or Face Unblur. It’s all using computational awareness to add, adjust, and edit things that aren’t there. In the case of the moon, it’s easy for Samsung’s AI to make it seem like the phone is taking incredible pictures because Samsung’s AI knows what the moon looks like. It’s the same reason why the sky sometimes looks too blue or the grass too green. The photo engine is applying what it knows to what it sees to mimic a higher-end camera and compensate for normal smartphone shortcomings.</p>\n\n\n\n<p>The difference here is that, while it’s common for photo-taking algorithms to segment an image into parts and apply different adjustments and exposure controls to them, Samsung is also using a limited form of AI image generation on the moon blend in details that were never in the camera data to begin with–but you wouldn’t know it, because the moon’s details always look the same when viewed from Earth.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/samsung-moon-photo-explanation.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Samsung moon photos explanation\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/samsung-moon-photo-explanation.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2023/03/samsung-moon-photo-explanation.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/samsung-moon-photo-explanation.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/samsung-moon-photo-explanation.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/03/samsung-moon-photo-explanation.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/03/samsung-moon-photo-explanation.jpg?resize=2048%2C1365&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/03/samsung-moon-photo-explanation.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/03/samsung-moon-photo-explanation.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption><p>Samsung says the S23 Ultra’s camera uses Scene Optimizer’s “deep-learning-based AI detail enhancement engine to effectively eliminate remaining noise and enhance the image details even further.”</p>\n</figcaption></figure><p>Samsung</p></div>\n\n\n\n<h2>What will Apple do?</h2>\n\n\n\n<p>Apple is heavily rumored to add a periscope zoom lens to the <a href=\"https://www.macworld.com/article/1487037/iphone-15-ultra-design-display-camera-specs-price.html\">iPhone 15 Ultra</a> for the first time this year, and this controversy will no doubt weigh into how it trains its AI. But you can be assured that the computational engine will do a fair amount of heavy lifting behind the scenes as it does now. </p>\n\n\n\n<p>That’s what makes smartphone cameras so great. Unlike point-and-shoot cameras, our smartphones have powerful brains that can help us take better photos and help bad photos look better. It can make nighttime photos seem like they were taken with good lighting and simulate the bokeh effect of a camera with an ultra-fast aperture.</p>\n\n\n\n<p>And it’s what will let Apple get incredible results from 20X or 30X zoom from a 6X optical camera. Since Apple has thus far steered clear of astrophotography, I doubt it will go as far as sampling higher-resolution moon photos to help the iPhone 15 take clearer shots, but you can be sure that its Photonic Engine will be hard at work cleaning up edges, preserving details, and boosting the capabilities of the telephoto camera. And based on what we get in the iPhone 14 Pro, the results will surely be spectacular.</p>\n\n\n\n<p>Whether it’s Samsung or Apple, computational photography has enabled some of the biggest breakthroughs over the past several years and we’ve only just scratched the surface of what it can do. None of it is actually real. And if it was, we’d all be a lot less impressed with the photos we take with our smartphones.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f2ba32281a6e1de6c9c29c59626c7afb124306c40d50771215340e47b85a31f0","category":"Apple"}