{"title":"Spatial and life history variation in a trait-based species vulnerability and impact model","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305950","date":1718978400000,"content":"<p>by Aharon G. Fleury, Casey C. O’Hara, Nathalie Butt, Jaime Restrepo, Benjamin S. Halpern, Carissa J. Klein, Caitlin D. Kuempel, Kaitlyn M. Gaynor, Lily K. Bentley, Anthony J. Richardson, Daniel C. Dunn</p>\r\n\r\nAnthropogenic pressures threaten biodiversity, necessitating conservation actions founded on robust ecological models. However, prevailing models inadequately capture the spatiotemporal variation in environmental pressures faced by species with high mobility or complex life histories, as data are often aggregated across species’ life histories or spatial distributions. We highlight the limitations of static models for dynamic species and incorporate life history variation and spatial distributions for species and stressors into a trait-based vulnerability and impact model. We use green sea turtles in the Greater Caribbean Region to demonstrate how vulnerability and anthropogenic impact for a dynamic species change across four life stages. By incorporating life stages into a trait-based vulnerability model, we observed life stage-specific vulnerabilities that were otherwise unnoticed when using an aggregated trait value set. Early life stages were more vulnerable to some stressors, such as inorganic pollution or marine heat waves, and less vulnerable to others, such as bycatch. Incorporating spatial distributions of stressors and life stages revealed impacts differ for each life stage across spatial areas, emphasizing the importance of stage-specific conservation measures. Our approach showcases the importance of incorporating dynamic processes into ecological models and will enable better and more targeted conservation actions for species with complex life histories and high mobility.","author":"Aharon G. Fleury","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f2bdf7bef89fe1a352b1407fa1ce860ae6d73926ca19efcf03a7415d77267210","category":"Interdisciplinary"}