{"title":"Apple should stop taking itself–and the iPhone–so seriously","link":"https://www.macworld.com/article/539612/apple-iphone-pro-camera-cinematic-mode-photographic-styles-fun.html","date":1632909600000,"content":"<div>\n<section><div></div></section><p>Sometimes Apple takes itself too seriously. Calling an iPhone “Pro” and <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/apple-events/september-2021/&amp;subid1=1-1-539612-1-0-0\">carting out</a> <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://youtu.be/dDKbwvSvg0w&amp;xcust=1-1-539612-1-0-0&amp;sref=https://www.macworld.com/feed\">Hollywood</a> <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.youtube.com/watch?v=c3CZX-lnAIc&amp;xcust=1-1-539612-1-0-0&amp;sref=https://www.macworld.com/feed\">directors</a> and cinematographers to advertise iPhone features… it’s a bit much.</p>\n\n\n\n<p>Yes, the iPhone 13 is a serious slab of technology, with iPhone 13 Pro models priced at $1,000 and higher. iPhone models support ProRes video capture, ProRAW still images, and uses advanced sensor-shift image stabilization to keep images crisp. Pro models are wrapped in surgical-grade stainless steel. If you had to operate on someone, you’d operate on them with an iPhone 13 Pro.</p>\n\n\n\n<p>But most people who buy the iPhone 13 Pro aren’t buying it because they’re professional… anything. They’re buying it because it’s the Best iPhone, because it’s got three cameras and shiny edges, and because they want a fancy new phone. And deep down, Apple knows this. Because it uses all of its high-tech knowledge, all of its prowess and combining software and hardware, to make “pro” features that aren’t really designed for pros—they’re designed to make the rest of us have fun.</p>\n\n\n\n<h2>Exhibit A: Cinematic mode</h2>\n\n\n\n<p>A banner new feature on the iPhone 13—Pro and non-pro models alike, thank you very much—is Cinematic mode. It’s essentially the video version of Portrait mode, and like Portrait mode, Cinematic mode is not a professional feature, but it’s a lot of fun. Both features use depth information to selectively blur portions of their field of view, not via any physical means, but via software. The goal is to create a dramatic stylized effect.</p>\n\n\n\n<p>Like Portrait mode, Cinematic mode is a brilliant application of technology that’s… not quite perfect. If you look carefully, you can often see portions of an image that are blurry when they shouldn’t be, or clear when they should be blurry. It’s the kind of thing that professional eyes can spot a mile away. Cinematic mode also doesn’t support the professional high-resolution video formats the iPhone 13 can otherwise shoot. It’s limited to 1080 video at 30 frames per second.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/99E9EC6E-174A-4B28-B8F2-51C2F07B191B.jpeg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The iPhone 13’s Cinematic mode</p>\n</figcaption></figure><p>Jason Snell</p></div>\n\n\n\n<p>And you know what? It doesn’t matter, because the goal of Cinematic mode isn’t perfection, it’s fun. And this feature is, make no mistake about it, amazingly fun. I was on a hike on a nearby trail and shot some video of my dog walking, as she does with us every weekend. What I got was a dog’s-eye-view video with her face always in focus, the needles of the redwoods artfully blurred behind her, and all of it astoundingly stable considering that I was holding a phone in one hand and quickly walking backward.</p>\n\n\n\n<p>Sure, the video isn’t perfect. I can patch up some of the flaws by editing the video in the Photos app and changing the focus point to be a little more accurate, but the truth is, most people won’t even do that. It’s fun as it is, ready to be shared with friends and family who will marvel at how it is indescribably… <em>cinematic</em>.</p>\n\n\n\n\n\n<h2>Exhibit B: Photographic Styles</h2>\n\n\n\n<p>Similarly, consider Photographic Styles, another new iPhone 13 feature. It doesn’t work with the ProRAW formats that most serious photographers will want to use. Instead, it’s a feature that allows any iPhone user to modify a couple of presets and change the look of every single photo they take with their phone.</p>\n\n\n\n<p>Photographic Styles is, essentially, a very simple preference system for Apple’s advanced photography pipeline. It’s the first time Apple has given regular users even a little bit of control over the system that provides a lot of Apple’s secret sauce when it comes to iPhone photography, snapping multiple images and combining them in order to extend dynamic range, or improve details, or simply get a better shot.</p>\n\n\n\n<p>But in the end, what makes Photographic Styles great is that it makes shooting photos with your iPhone more fun because you’ll be happier with the result. If you’re like me, you want your pictures to be warmer, with more contrast, and I’ve dialed my Photographic Styles to do just that. Apple’s magic is still happening behind the scenes, but it’s now trying to generate an image that I’ll find pleasing. It wants to make me happy. That’s fun!</p>\n\n\n\n<h2>Fun is underrated</h2>\n\n\n\n<p>Yes, sometimes when it comes to promoting its products, Apple takes itself a little too seriously. I get that it’s rightfully proud of all the hard work that goes into making its products what they are. The company shouldn’t be afraid to crow about just how awesome its technological advances are.</p>\n\n\n\n<p>As for the application of those advances, though… it’s okay to admit that a feature is fun. Cinematic mode doesn’t need <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://youtu.be/c3CZX-lnAIc&amp;xcust=1-1-539612-1-0-0&amp;sref=https://www.macworld.com/feed\">Kathryn Bigelow’s endorsement</a>—it needs videos of kids and dogs. There’s no shame in making a feature that’s optimized for fun, not for professional use. The pros aren’t going to use Cinematic mode and Photographic Styles much, if at all.</p>\n\n\n\n<p>As for the rest of us? We’re going to eat that stuff up. Because it’s fun. And fun is underrated. Even, sometimes, by Apple.</p>\n</div>","author":"Jason Snell","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f2cc115c5da85832a6b82709ca212e764bcb0ef4f792a092557e92cb25d4d3d6","category":"Apple"}