{"title":"Soil Salinity Inversion Based on a Stacking Integrated Learning Algorithm","link":"https://www.preprints.org/manuscript/202408.1937/v1","date":1724752138000,"content":"Abstract: Soil salinization is an essential risk factor for agricultural development as well as for food security, and how to obtain regional soil salinity information more reliably remains a priority problem to be solved. To improve the accuracy of the inversions for soil salinity, a new inversion model for soil salinity based on stacking integrated algorithm for learning was submitted for this work which took the prediction results of several basic models as new features and then trained a secondary model to fuse the prediction results of basic models. We compared and analyzed it against four machine learning regression models, namely, random forest (RF), back propagation neural network, support vector regression, and convolutional neural network. Findings indicated the stacking integrated learning regression model fitted better and had good stability, on the test set, the stacking integrated learning regression model showed a relative increase of 8.16% in R2, a relative decrease of 13.95% in RMSE, and a relative increase of 6.47% in RPD when compared to the RF model, which was the single most effective machine learning regression model, and the stacking model was able to achieve soil salinity inversion more accurately. The soil salinity in the oasis areas of the Manas River Basin tended to decrease from north to south in 2016 to 2020 from a spatial point of view, and it was reduced in April from a temporal point of view. The percentage of pixels with a high soil salinity content of 2.75–2.8 g/kg in the study area had decreased by 19.64% in April 2020 compared to April 2016. The innovatively constructed stacking integrated learning regression model improved the accuracy of soil salinity estimation on the basis of the superior results obtained in the training of the single optimal machine learning regression model. As a consequence, this model can provide technological backup for a fast monitoring and inversion of soil salinity as well as prevention and containment of salinization.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f2cce5a9bd1b16a36ec34f32a21d6ee42185bab502febd15d64c48f042cc8f2f","category":"Interdisciplinary"}