{"title":"Time series prediction of insect pests in tea gardens","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13393?af=R","date":1709812431000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Tea-garden pest control is crucial to ensure tea quality. In this context, the time-series prediction of insect pests in tea gardens is very important. Deep-learning-based time-series prediction techniques are advancing rapidly but research into their use in tea-garden pest prediction is limited. The current study investigates the time-series prediction of whitefly populations in the Tea Expo Garden, Jurong City, Jiangsu Province, China, employing three deep-learning algorithms, namely Informer, the Long Short-Term Memory (LSTM) network, and LSTM-Attention.</p>\n<h2>RESULTS</h2>\n<p>The comparative analysis of the three deep-learning algorithms revealed optimal results for LSTM-Attention, with an average root mean square error (<i>RMSE</i>) of 2.84 and average mean absolute error (MAE) of 2.52 for 7 days’ prediction length, respectively. For a prediction length of 3 days, LSTM achieved the best performance, with an average RMSE of 2.60 and an average MAE of 2.24.</p>\n<h2>CONCLUSION</h2>\n<p>These findings suggest that different prediction lengths influence model performance in tea garden pest time series prediction. Deep learning could be applied satisfactorily to predict time series of insect pests in tea gardens based on LSTM-Attention. Thus, this study provides a theoretical basis for the research on the time series of pest and disease infestations in tea plants. © 2024 Society of Chemical Industry.</p>","author":"Xuanyu Chen, \nMd. Mehedi Hassan, \nJinghao Yu, \nAfang Zhu, \nZhang Han, \nPeihuan He, \nQuansheng Chen, \nHuanhuan Li, \nQin Ouyang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"f2dbae369e583c6b8a61e66a9137f1b128620721c2f2126592fc7bf591e6583f","category":"Environment"}