{"title":"Endura’s Simon Richardson dies in a bike accident","link":"https://cyclingtips.com/2021/04/enduras-simon-richardson-dies-in-a-bike-accident/","date":1617801578000,"content":"<p>Simon Richardson, sales manager for Endura, died on Sunday following a bike accident. Simon was riding in Henley, in the U.K. when the accident occurred, details of the incident have not been released to the public. He was 58. </p>\n\n\n\n<p>Jim McFarlane and Pamela Barclay, founders of Endura, have released the following statement:</p>\n\n\n\n<p><em>Rest in Peace Simon Richardson, beloved and universally respected Endura UK &amp; Int. Sales Manager, following a bike accident in Henley on Easter Sunday.&nbsp;&nbsp;</em></p>\n\n\n\n<p><em>Our thoughts and prayers go out to his wife Camilla and his children Emily, Evan and Holly as we all come to terms with this colossal loss. Simon’s contribution is a profoundly important part of what built Endura into what it is today. His commitment and contribution helped shape the business and its culture and we would not have had the success that we have had without him.&nbsp;</em></p>\n\n\n\n<p><em>Thank you, Simon, for coming along for the ride for these last 11 years. It has been an enormous pleasure and privilege to have you as part of this eclectic family through Endura’s formative years. Your positive presence, impact and influence will live on here for a very long time to come. We miss you already</em>.</p>\n\n\n\n<p>Simon was an integral part of the CyclingTips community, an avid member of VeloClub, and particularly enjoyed the CyclingTips podcast as well as coverage of women&#8217;s racing.</p>\n\n\n\n<p>Our thoughts go out to Simon&#8217;s family and friends at this time. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/04/enduras-simon-richardson-dies-in-a-bike-accident/\">Endura&#8217;s Simon Richardson dies in a bike accident</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f2ddb88302edf31320b40ad81eceaa689cf4e16f976c66ff10f13ac66eee4963","category":"Cycling"}