{"title":"Edge AI Model Deployed for Real-time Detection of Atrial Fibrillation Risk during Sinus Rhythm","link":"https://www.preprints.org/manuscript/202403.1575/v1","date":1711441047000,"content":"Objectives: The study aimed to develop a deep learning-based edge AI model deployed on electrocardiograph (ECG) devices for real-time detection of atrial fibrillation (AF)-risk during sinus rhythm (SR) using standard 10-second 12-lead electrocardiograms (ECGs). Methods: A novel approach was used to convert standard 12-lead ECGs into binary images for model input, and a lightweight convolutional neural network (CNN)-based model was trained using data collected by the Japan Agency for Medical and Research Development (AMED) between 2019 and 2022. Patients over 40 years old with digital, SR ECGs were retrospectively enrolled and divided into AF and non-AF groups. Data labeling was supervised by cardiologists. The dataset was randomly allocated into training, validation, and internal testing datasets. External testing was conducted on data collected from other hospitals.　Results: The best-trained model achieved an AUC of 0.82 and 0.80, sensitivity of 79.5% and 72.3%, specificity of 77.8% and 77.7%, precision of 78.2% and 76.4%, and overall accuracy of 78.6% and 75.0% in the internal and external testing datasets, respectively. The deployed model and app package utilized 2.5MB and 40MB of the available ROM and RAM capacity on the edge ECG device, correspondingly. Processing time for AF-risk detection was approximately 2 seconds.　Conclusion: The model maintains comparable performance and improves its suitability for deployment on resource-constrained ECG devices, thereby expanding its potential impact to a wide range of healthcare settings. Its successful deployment enables real-time AF-risk detection during SR, allowing for timely intervention to prevent AF-related serious consequences like stroke and premature death.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f2e1db3a5c018bdebefa71ac942a7679f94360f270a5ad22cbc784e90f620e11","category":"Interdisciplinary"}