{"title":"Piloting a psychosocial intervention for perinatal depression, the Thinking Healthy Programme–Peer delivered (THPP), in a primary care setting in Lilongwe District, Malawi","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002128","date":1714572000000,"content":"<p>by Mwawi Ng’oma, Najia Atif, Samantha Meltzer-Brody, Ellen Chirwa, Robert C. Stewart</p>\r\n\r\nDespite the evidence for the effectiveness of psychosocial interventions for perinatal depression, their uptake is low in Low- and Middle-Income Countries. Reasons for this include the lack of contextually adapted interventions and mental health specialists to deliver them. This study aimed to test the acceptability and feasibility of a psychosocial intervention for perinatal depression, the <i>Thinking Healthy Programme–Peer Delivered</i>, adapted for use in rural Malawi. A multi-method evaluation of feasibility and acceptability of the intervention was conducted using a one-group pretest-posttest quasi-experimental design and an exploratory qualitative study. Pre-post intervention change in depression scores (paired t-test) and recruitment, retention and session adherence rates were calculated. Qualitative data were collected through 29 in-depth interviews (22 mothers and 7 peer volunteers) and 1 Focus Group Discussion (18 mothers). Thematic analysis approach was used to analyse qualitative data. Seven (7) out of 8 peer volunteers were successfully trained to deliver the intervention. A total of 31 pregnant women with Edinburgh Postnatal Depression Scale (EPDS) score ≥12 were offered intervention, of whom 24 were enrolled (recruitment rate 77.4%). Out of these 24 women, 22 completed the intervention (retention rate 91.6%). Mean difference between pre- and post-test EPDS scores one week after 8<sup>th</sup> session was 7.59 (95% CI 4.98 to 10.19), p&lt;0.001. Qualitative evaluation showed that the intervention was acceptable despite some challenges including stigma and issues around incentivization of peer volunteers. The Thinking Healthy Programme–Peer Delivered, adapted for use in Malawi, was feasible to deliver and acceptable to its target population. The intervention may be useful in management of perinatal depression in primary care settings in Malawi. However, definitive trials are needed to evaluate its effectiveness.","author":"Mwawi Ng’oma","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"f2e3d9cc4c4353890bc377132d36e655ab78a59b56c9d194fde148810e88d47a","category":"Environment"}