{"title":"4-Methyl-2,4-bis(4-hydroxyphenyl)pent-1-ene (MBP) exposure induces hepatotoxicity and nephrotoxicity – role of oxidative stress, mitochondrial dysfunction and pathways of cytotoxicity","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae173/7822187?rss=1","date":1728950400000,"content":"<span><div>Abstract</div><div>Objective</div>Bisphenol A (BPA) is a ubiquitous pollutant worldwide and 4-Methyl-2,4-bis(4-hydroxyphenyl)pent-1-ene (MBP) is considered a major active metabolite of BPA with a wide range of potent toxicological properties. However, its adverse outcome pathway (AOP) on the hepatic and renal system has not yet been explored.<div>Methods</div>Hence, the current study evaluated its effect on cell survival, oxidative stress, and apoptosis. In addition, the influence of signalling pathways on cytotoxicity and ROS generating enzymes (NOX2 and XO) on oxidative stress was explored by siRNA knockdown experiments. Further, its molecular interaction with SOD, CAT, and HSA (molecular docking and dynamics) was evaluated and validated with spectroscopy (fluorescence and FTIR) based methods.<div>Results</div>The outcome indicates that MBP exposure dose dependently increased the cytotoxic response, oxidative stress, and apoptosis in both hepatocytes and kidney cells. Further, MAPK signalling pathways and oxidative stress influenced the overall cytotoxic response in both cells. In addition, the stimulatory (NOX2 and XO) and inhibitory (SOD and CAT) effects of MBP were observed, along with a robust interaction with HSA.<div>Conclusions</div>The overall observation illustrates that MBP exposure adversely impacts hepatic and renal cells through oxidative stress and relevant molecular pathways which may connect the missing links during risk assessment of BPA.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"f2e8839e73c9b7c0844e7533e38d80e464cc90e4ad47b8e277af9bc1bd8c6dfb","category":"Environment"}