{"title":"Is the “Dragon Man” skull actually from a new hominin species?","link":"https://arstechnica.com/?p=1778075","date":1625407234000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Harbin-left-and-Dali-rt-skulls.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Harbin-left-and-Dali-rt-skulls.jpg\">Enlarge</a> <span>/</span> The Harbin skull (left) and the Dali skull (right). (credit: Ni et al. 2021)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The reported discovery of a new hominin species from China created a lot of buzz last week. Its discoverers—paleoanthropologists Xijun Ni, Qiang Ji, Chris Stringer, and their colleagues—say that a skull discovered near Harbin, in northeast China, has a combination of features that's so different from Neanderthals, Denisovans, and <em>Homo sapiens</em> that it must be a separate species. The researchers have named the find <em>Homo longi</em> after the river where the skull was unearthed. Based on statistical comparisons of the skull's measurements with skulls from other hominins, Ni and colleagues say that <em>Homo longi</em> is a sister species to Neanderthals, Denisovans, and us.</p>\n<p>But that's still very much open for debate among paleoanthropologists, and the debate raises questions about how (or whether) we should draw lines between hominin species.</p>\n<h2>Meet the Harbin skull</h2>\n<p>Based on uranium-series dating, the Harbin skull lay buried for at least 146,000 years, but it's in remarkably good shape. Fossil hominin skulls often end up crushed or warped by the weight of the earth above them after many millennia in the ground, but the Harbin skull isn't distorted at all. It's also intact, even though the only tooth still attached is a left molar. That's unusual in itself, because teeth usually are the most common hominin fossil finds.</p></div><p><a href=\"https://arstechnica.com/?p=1778075#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1778075&amp;comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f2ed85e6e7d444dd824e88fe7ea95a60d8ea200993aca0dee363205c920eeb95","category":"Tech"}