{"title":"Timescales of ecological processes, settling, and estuarine transport to create estuarine turbidity maxima: An application of the Peter-Parker Model","link":"https://www.preprints.org/manuscript/202406.1471/v1","date":1718962343000,"content":"The estuarine exchange flow increases longitudinal dispersion of passive tracers and traps sinking particles, potentially creating an estuarine turbidity maximum (ETM): a localized maximum of suspended particulate matter concentration in an estuary. The ETM can have many implications - dead zones due to increased turbidity or hypoxia from organic matter decomposition, naval navigation challenges, and other water quality problems. Using timescales, we investigate how the interaction between exchange flow and particle sinking leads to ETMs by modeling a sinking tracer in an idealized box model of the Total Exchange Flow (TEF) first developed by Parker MacCready. Results indicate that the balance of particle sinking and vertical mixing is critical to determining ETM size and location. We then focus on the role of ecology in ETM formation through the use of The Peter-Parker Model: a new biophysical model which combines the TEF box model with a Nutrient-Phytoplankton-Zooplankton-Detritus (NPZD) model, the likes of which were first developed by Peter J.S. Franks. Detritus sinking rates similarly influence detritus peak concentration and location (an ETM), but detritus ETMs occur in a different location than the sinking tracer due to the influence of the biological factors which create a time lag of about 1 day. Lastly, we characterize the flow of the models with a dimensionless parameter that compares timescales and summarizes the dynamics of the sinking tracer in ETM formation and can be used across systems.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f2eff47820fb610a339b116febc6e6107ddbfb45d4a7049f5dea004c7b5abcf6","category":"Interdisciplinary"}