{"title":"Facebook Is Working on a Twitter Competitor Codenamed ‘P92’ That Will Be Interoperable With Mastodon","link":"https://www.moneycontrol.com/news/business/startup/meta-mulls-a-twitter-competitor-codenamed-p92-that-will-be-interoperable-with-mastodon-10223961.html","date":1678481957000,"content":"\n<p>Deepsekhar Choudhury and Vikas Sn, reporting for Moneycontrol:</p>\n\n<blockquote>\n  <p>Meta, the parent firm of Facebook and Instagram, is hashing out a\nplan to build a standalone text-based content app that will\nsupport ActivityPub, the decentralised social networking protocol\npowering Twitter rival Mastodon and other federated apps, people\nfamiliar with the matter told Moneycontrol.</p>\n\n<p>The app will be Instagram-branded and will allow users to\nregister/login to the app through their Instagram credentials,\nthey said. Moneycontrol has seen a copy of an internal product\nbrief that elaborates on the functioning and various product\nfeatures of the app.</p>\n\n<p>To be sure, it’s not clear whether this app, codenamed P92, is\nstill at an idea-stage or the development has begun on the app. A\nsource close to the development said that it is still a\nwork-in-progress.</p>\n\n<p>Hours after Moneycontrol broke the story, Meta has confirmed the\ndevelopment in a statement: “We’re exploring a standalone\ndecentralized social network for sharing text updates. We believe\nthere’s an opportunity for a separate space where creators and\npublic figures can share timely updates about their interests” a\nMeta spokesperson said.</p>\n</blockquote>\n\n<p><a href=\"https://www.platformer.news/p/meta-is-building-a-decentralized\">Casey Newton at Platformer</a>:</p>\n\n<blockquote>\n  <p>Details about the project are scant. The product is still in its\nearliest stages, sources said, and there is no time frame for it\nbeing released. But legal and regulatory teams have already\nstarted to investigate potential privacy concerns around the app\nso they can be addressed before launch, we’re told.</p>\n\n<p>Adam Mosseri, who runs Instagram, is taking the lead on the\nproject, sources said.</p>\n</blockquote>\n\n<p>No sarcasm intended: I love this idea. Federate with Mastodon via ActivityPub and let people do it using their existing Instagram IDs. Keep it clean and simple and destroy what’s left of Twitter.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/10/facebook-n92\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"5dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"f302f9491d3af652cb61f1278a9adf2d1c9d63c41d8d20dc472e70","category":"Tech"}