{"title":"3D-Printing with Earthen Materials: A Settlement-Scale Design Experience","link":"https://www.preprints.org/manuscript/202408.0259/v2","date":1724653113000,"content":"This case study originates as a design experiment for a sustainable housing system built on-site. The context is Niamey, the capital of Niger. The study takes into account the environmental issues in the construction sector and aims to find a solution capable of meeting housing, environmental, and economic needs. In the field of earthen construction, the most important developments have been achieved in manufacturing methods. In particular, the use of an additive digital manufacturing system, such as large-scale 3D-printing, allows the construction of complex shapes derived from structural and thermal studies, maintaining a high degree of automation in the construction process, reducing construction times and labor costs. This paper investigates the possibility of responding to housing and environmental needs with a settlement system made almost entirely of printed earth, maintaining the highest possible degree of automation. Starting from a study on the state of the art of 3D-printing in architecture and printable earthen compounds, the design choices of similar cases are analyzed to understand the construction techniques, potentials, and limitations of the medium. Finally, a design proposal is developed based on the definition of a fully printable functional module, which, upon aggregation, determines the characteristics of the final settlement. This implies a radical change of approach compared to previous prototyping of 3D-printed earthen buildings, as the design of the single functional module is not an exercise that finds completion in itself, but is oriented to the scale of the settlement right from the definition of its basic geometric characteristics. In other words, the settlement is no longer the result of the serial aggregation of independent basic units, but arises spontaneously from the juxtaposition of functional modules designed to interact with each other and merge into a single residential complex. The settlement is therefore the large-scale replication of the alternation between full and empty spaces that characterizes the single functional module and, even more importantly, the replication can take multiple forms. In fact, the full and empty spaces of the functional module are planned to allow multiple combinations of aggregation. This introduces a certain degree of customization into the growth dynamics of the settlement, a factor that is entirely new compared to previous proposals by repeatable modules. No less important are the environmental implications, as designing for the scale of the settlement allows the low carbon footprint typical of earth-based construction to be extended from the single building to the entire settlement.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f3020de2304559d7daf60e2bf082e43aaf5b05dc0f9a8ffc70dfc6c00b956aa7","category":"Interdisciplinary"}