{"title":"Determination of process parameters and precipitation methods for potential large‐scale production of sugar beet leaf protein concentrate","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13210?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Sugar beet is one of the most produced industrial plants in the world, and during manufacturing it produces a large quantity of leaf waste. Because this waste is rich in protein, this study aimed to identify an efficient method for producing large-scale protein concentrate from sugar beet leaves.</p>\n<h2>RESULTS</h2>\n<p>Results showed that protein extraction from fresh leaves was more effective than from dried leaves. Maximum protein extraction was achieved at pH 9, compared with pH 7 or 8. Blanching as a pretreatment reduced protein yield during isoelectric precipitation, with a yield of 2.31% compared to 20.20% without blanching. Consequently, blanching was excluded from the extraction process. After extraction, isoelectric precipitation, heat coagulation, and isoelectric–ammonium sulfate precipitation were compared. Although the latter resulted in the highest protein yield, Fourier transform infrared analysis revealed that excessive salt was not removed during dialysis, making it unsuitable for scale-up due to its additional cost and complexity. Therefore, isoelectric precipitation was selected as the appropriate method for protein precipitation from sugar beet leaves. To increase yield, extractions were assisted by ultrasound or enzyme addition. Ultrasound-assisted extraction resulted in an increased protein yield from 20.20% to 28.60%, while Pectinex Ultra SP-L-assisted extraction was the most effective, increasing protein yield from 20.20% to 38.09%.</p>\n<h2>CONCLUSION</h2>\n<p>Proteins were extracted from fresh sugar beet leaves using optimum conditions (50 °C, 30 min, pH 9) and precipitated at isoelectric point, with enzymatic-assisted extraction yielding the maximum protein recovery. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Ayça Akyüz, \nİdil Tekin, \nZülal Aksoy, \nSeda Ersus","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"f30cd5629c9a9f6c82fa0c0d4f3611e409a371ca147db0ab2aa27fa9fe1ced3d","category":"Environment"}