{"title":"Suspended‐sediment response to wildfire and a major post‐fire flood on the Colorado Front Range","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4286?af=R","date":1714212904000,"content":"<h2>Abstract</h2>\n<p>Wildfires, and the sediment-rich floods that commonly follow, increasingly threaten riverine ecosystems and water infrastructure. Suspended sediment exported throughout fire–flood sequences poses particular risks due to rapid transit times and direct impacts on water quality. However, opportunities to measure suspended-sediment transport during and after post-fire floods, and therefore to illuminate what controls the magnitude and timing of suspended-sediment export from burned, flooded watersheds, are rare. A ~ 100-year flood that occurred one year into a three-year study monitoring suspended-sediment response to wildfire in the Colorado Front Range provides a unique opportunity to (1) quantify how suspended-sediment concentrations and loads change throughout a fire–flood sequence, and (2) infer what controls the timescale over which suspended-sediment dynamics recover toward pre-fire conditions. We find that suspended-sediment concentrations (SSCs) during summer storms declined monotonically to background conditions over 3 years. Snowmelt SSCs peaked in the second year before declining to background levels. Sediment load calculations reveal that the flood exported ~35 years' worth of suspended sediment and triggered ~1.5 years of elevated SSCs and sediment loads. SSCs and sediment loads indicate a fairly short post-fire recovery timescale of about 3 years. We suggest that the flood accelerated recovery by (1) exporting much of the available suspended sediment from this supply-limited landscape and (2) facilitating the export of remaining sediment by making it more accessible to subsequent flows. Our results indicate that large post-wildfire floods, though representing major geomorphic disturbances, may hasten post-fire suspended-sediment recovery to background conditions, at least in supply-limited regions.</p>","author":"Sandra E. Ryan, \nCharles M. Shobe, \nSara L. Rathburn, \nMark K. Dixon","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"f3109f6821225319fee0811e97021ae1eb5a3cc1c837b89bfa152ea7ce5362b2","category":"Environment"}