{"title":"The OASIS walking study—Older adults with cognitive impairment performing sit to stands and walking in transitional care programs: Protocol for a feasibility study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308268","date":1726495200000,"content":"<p>by Alexia Cumal, Tracey J. F. Colella, Martine T. Puts, Katherine S. McGilton</p>\r\n\r\nOlder adults with cognitive impairment often experience low mobility and functional decline in hospital, transfer to facility-based transitional care programs, and have poorer outcomes compared to those without cognitive impairment. This protocol paper describes a study which aims to determine the feasibility of, satisfaction with, and efficacy of a nurse-led mobility intervention (OASIS Walking Intervention) for older adults with cognitive impairment in facility-based transitional care programs in Ontario, Canada. A quasi-experimental one-group time series feasibility study will be conducted. A sample size of 26 participants will be recruited from two transitional care programs in Ontario, Canada. Participants will receive the OASIS Walking Intervention for up to 45 minutes per session, 5 sessions per week, for 6 weeks. The intervention consists of: 1) a patient-centered communication care plan; 2) sit to stand activity; and 3) a walking program. Feasibility will be determined by: a) recruitment rate; b) retention rate; and c) adherence. Efficacy of the intervention will be determined by the change over time in older adults’ lower extremity muscle strength, mobility, and functional status and by their discharge destination (home vs. nursing home). Satisfaction will be measured using the Client Satisfaction Questionnaire. Efficacy outcomes will be measured before the start of the intervention, after 3 weeks of the intervention, and immediately after 6-week intervention. Descriptive statistics will be used for measures of feasibility, satisfaction, and discharge destination. Repeated measures analysis of variance (RM-ANOVA) will be used to analyze efficacy. Ethics approval has been received for this study. Findings from the study will be used to refine the intervention for use in a definitive pilot trial. Results will be disseminated via peer-reviewed publications, international conferences, through group presentations at the study sites, and through the study site networks.\r\nTrial registration: The trial has been registered on Clinicaltrials.gov (NCT06150339).","author":"Alexia Cumal","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f3135db791b225bc1759729a84f3529746e18499045f9cc2037d6b34c45b23ee","category":"Interdisciplinary"}