{"title":"Research on Travel Route Planning Optimization based on Large Language Model","link":"https://www.preprints.org/manuscript/202407.1398/v1","date":1721202107000,"content":"In a trip planning service, travelers first set a starting point, a destination, and a sequential list of specific points of interest types (e.g., museums, restaurants, and parks). Based on this information, the service searches the spatial database to customize the best travel itinerary for the tourist. However, in previous studies, planners only considered the time factor when designing the optimal route, and failed to fully consider the quality of each point of interest. In this study, we specifically leveraged the capabilities of large language model to parse and respond to complex travel-related user queries. To apply large language model to route planning, we fine-tuned the model to understand geotagging and user travel preferences. We have introduced a novel graph search algorithm combined with large language model output, which optimizes the route search process to provide optimal travel recommendations by taking into account various factors such as distance length, budget constraints, and popularity of tourist attractions. In addition, we have integrated real-time traffic data and historical travel data to further improve the prediction accuracy and application usefulness of the model. In the experimental validation phase, we designed a series of benchmarks to compare the performance of the system with traditional algorithms and other machine learning-based route planning methods. Experimental results show that our model has a significant improvement compared with traditional methods in improving the speed and accuracy of path selection.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f3142e4280718a6b616700bced43e1b63793b1efad7370508e0bb56f5d756d46","category":"Interdisciplinary"}