{"title":"Sacklers say they won’t pay $4.5B settlement if judge rejects immunity deal","link":"https://arstechnica.com/?p=1788235","date":1629320187000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-sackler-immunity-protest-800x532.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-sackler-immunity-protest.jpg\">Enlarge</a> <span>/</span> Members of PAIN (Prescription Addiction Intervention Now), Truth Pharm, and other advocacy groups working in response to the overdose crisis protested the Sacklers' immunity deal outside US Bankruptcy Court in White Plains, New York on August 9, 2021.  (credit: <a href=\"https://www.gettyimages.com/search/photographer?family=editorial&amp;photographer=Erik+McGregor\">Getty Images | Erik McGregor</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The Sackler family is threatening to back out of a $4.5 billion opioid settlement if it is not granted broad immunity from lawsuits. The pending settlement between the Sacklers and 15 states includes an immunity provision, but other states oppose it, and a bankruptcy court judge is still considering whether to approve the deal.</p>\n<p>Forty-one-year-old David Sackler, a former Purdue Pharma board member and grandson of one of the company's founders, \"vowed in court on Tuesday that the family would walk away from a $4.5 billion pledge to help communities nationwide that have been devastated by the opioid epidemic, unless a judge grants it immunity from all current and future civil claims associated with the company,\" The New York Times <a href=\"https://www.nytimes.com/2021/08/17/health/sacklers-purdue-opioids-settlement.html\">wrote</a>.</p>\n<p>\"We need a release that's sufficient to get our goals accomplished,\" Sackler said in testimony via video at a hearing in US Bankruptcy Court for the Southern District of New York. \"If the release fails to do that, we will not support it.\" The family is <a href=\"https://oversight.house.gov/news/press-releases/committee-releases-documents-showing-sackler-family-wealth-totals-11-billion\">worth $11 billion</a>, a fortune boosted substantially by sales of OxyContin.</p></div><p><a href=\"https://arstechnica.com/?p=1788235#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1788235&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f324ff447e24cf7d5ef5dfeddac03a3f0e7e88a659a6d186d9b333046a70a397","category":"Tech"}