{"title":"Ecological Groups of Coleoptera (Insecta) as Indicators of Habitat Transformation on Drained and Rewetted Peatlands: A Baseline Study from A Carbon Supersite, Kaliningrad, Russia","link":"https://www.preprints.org/manuscript/202404.0300/v1","date":1712152971000,"content":"A total of 281 coleopteran species from 41 families were recorded from different sites of an abandoned cut-over peatland designated as the Carbon Measurement Supersite in Kaliningrad Oblast. This beetle assemblage is considered as a baseline (pre-impact) faunal assemblage for the further investigations during the ‘before-after’ (BA) or ‘before-after control-impact’ (BACI) study on a peatland that is planned to be rewetted. The spontaneously revegetated peatland has a less specialised beetle assemblage than at an intact raised bog. Tyrphobiontic species are completely absent from the peatland, while some tyrphophiles (5.3% of the total beetle fauna) are still found as remnants of the former raised bog communities. The predominant coenotic coleopteran group is tyrphoneutral generalists from various non-bog habitats (72.9%). The species composition is associated witho the structure vegetation of the disturbed peatland (fragmentary Sphagnum cover, lack of open habitats, and widespread birch coppice or tree stand), which does not correspond to that of a typical European raised bog. The sampled coleopteran assemblage is divided into several relative ecological groups, whose composition and peculiarities are discussed separately. Possible responses to the rewetting measurements in different coleopteran groups are predicted and briefly discussed. A complex assemblage of stenotopic peatland-specialised tyrphophiles (15 spp.) and the most abundant tyrphoneutral generalists (31 spp.) were assigned as indicators for the environmental monitoring of peatland development.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f3290b4d36fa1cfb70e6d0a737adfe0a261f8bb448dec6184e765cdb9f42bc9f","category":"Interdisciplinary"}