{"title":"Chest-X-ray Based Deep Learning Model for Anemia Detection Insights from a Large Hospital Cohort","link":"https://www.preprints.org/manuscript/202410.1219/v1","date":1728995568000,"content":"Background\nAnemia is a prevalent global health issue, affecting individuals across all age groups and leading to significant morbidity. Traditional methods for diagnosing anemia rely on laboratory assessments of hemoglobin concentration, which are invasive and costly. This study investigates the potential of a chest X-ray (CXR)-based deep learning model (DLM) to predict anemia, offering a non-invasive and efficient diagnostic alternative.\nPatients and methods\nWe conducted a retrospective cohort study using data from Tri-Service General Hospital, Taipei, Taiwan, collected between June 2016 and February 2022. A total of 305,793 patients aged 20 years and older who had at least one CXR were included. The dataset was divided into development, tuning, internal validation, and external validation sets. All data originated from Tri-Service General Hospital, except for the external validation set, which was obtained from the Jingjhou branch. A DLM based on a 50-layer SE-ResNeXt architecture was developed to predict anemia from CXR images. The model's performance was compared to predictions made using traditional clinical data to assess its predictive accuracy. \nResults\nThe DLM for predicting anemia showed strong performance, with an AUC of 0.845 in the internal validation set (sensitivity 68.5%, specificity 84.7%) and 0.852 in the external set (sensitivity 71.5%, specificity 83.2%). Subgroup analysis revealed better diagnostic accuracy with computed radiography, posteroanterior (PA) view, and in males aged 55 to 64, while younger females had lower accuracy. The DLM, especially when combined with patient data, outperformed other clinical models.\nConclusion\nOur study introduces a deep learning tool for detecting anemia from chest images, offering faster decision-making and interventions in clinical settings. With further refinement, this model aims to align more closely with real-time clinical conditions, enhancing its utility. Ultimately, it has the potential to improve patient care through quicker anemia detection and better clinical outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f32ab3ba29810023a98297ddb90050f491a4472cd1d1668b78e09f4989cb676c","category":"Interdisciplinary"}