{"title":"Hypothetical chloroplast reading frame 51 encodes a photosystem I assembly factor in cyanobacteria","link":"https://academic.oup.com/plcell/article/36/5/1844/7499161?rss=1","date":1703548800000,"content":"<span><div>Abstract</div>Hypothetical chloroplast open reading frames (<span>ycf</span>s) are putative genes in the plastid genomes of photosynthetic eukaryotes. Many <span>ycf</span>s are also conserved in the genomes of cyanobacteria, the presumptive ancestors of present-day chloroplasts. The functions of many <span>ycf</span>s are still unknown. Here, we generated knock-out mutants for <span>ycf51</span> (<span>sll1702</span>) in the cyanobacterium <span>Synechocystis</span> sp. PCC 6803. The mutants showed reduced photoautotrophic growth due to impaired electron transport between photosystem II (PSII) and PSI. This phenotype results from greatly reduced PSI content in the <span>ycf51</span> mutant. The <span>ycf51</span> disruption had little effect on the transcription of genes encoding photosynthetic complex components and the stabilization of the PSI complex. In vitro and in vivo analyses demonstrated that Ycf51 cooperates with PSI assembly factor Ycf3 to mediate PSI assembly. Furthermore, Ycf51 interacts with the PSI subunit PsaC. Together with its specific localization in the thylakoid membrane and the stromal exposure of its hydrophilic region, our data suggest that Ycf51 is involved in PSI complex assembly. Ycf51 is conserved in all sequenced cyanobacteria, including the earliest branching cyanobacteria of the <span>Gloeobacter</span> genus, and is also present in the plastid genomes of glaucophytes. However, Ycf51 has been lost from other photosynthetic eukaryotic lineages. Thus, Ycf51 is a PSI assembly factor that has been functionally replaced during the evolution of oxygenic photosynthetic eukaryotes.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"f32b7ef40921a7e46cd90a7cf379c8d229393451cab736aadc84a167a68e1bb4","category":"Environment"}