{"title":"Alpine Extremophytes in Evolutionary Turmoil: Complex Diversification Patterns and Demographic Responses of a Halophilic Grass in a Central Asian Biodiversity Hotspot","link":"https://academic.oup.com/sysbio/article/73/2/263/7492719?rss=1","date":1703289600000,"content":"<span><div>Abstract</div>Diversification and demographic responses are key processes shaping species evolutionary history. Yet we still lack a full understanding of ecological mechanisms that shape genetic diversity at different spatial scales upon rapid environmental changes. In this study, we examined genetic differentiation in an extremophilic grass <span>Puccinellia pamirica</span> and factors affecting its population dynamics among the occupied hypersaline alpine wetlands on the arid Pamir Plateau in Central Asia. Using genomic data, we found evidence of fine-scale population structure and gene flow among the localities established across the high-elevation plateau as well as fingerprints of historical demographic expansion. We showed that an increase in the effective population size could coincide with the Last Glacial Period, which was followed by the species demographic decline during the Holocene. Geographic distance plays a vital role in shaping the spatial genetic structure of <span>P. pamirica</span> alongside with isolation-by-environment and habitat fragmentation. Our results highlight a complex history of divergence and gene flow in this species-poor alpine region during the Late Quaternary. We demonstrate that regional climate specificity and a shortage of nonclimate data largely impede predictions of future range changes of the alpine extremophile using ecological niche modeling. This study emphasizes the importance of fine-scale environmental heterogeneity for population dynamics and species distribution shifts.</span>","author":"","siteTitle":"Systematic Biology Current Issue","siteHash":"ff28aeeb9b03783edee2039c6a58e13e932a0eb216cc2d8b21d5a99c6800e59a","entryHash":"f336db91949a85cf7208b4fe05bd7ab79cc70a5bad2dc66d042c729f6308fcc8","category":"Environment"}