{"title":"The Role of Tidal Mixing in Shaping Early Eocene Deep Ocean Circulation and Oxygenation","link":"https://onlinelibrary.wiley.com/doi/10.1029/2023PA004822?af=R","date":1720242906000,"content":"<h2>Abstract</h2>\n<p>Diapycnal mixing in the ocean interior is largely fueled by internal tides. Mixing schemes that represent the breaking of internal tides are now routinely included in ocean and earth system models applied to the modern and future. However, this is more rarely the case in climate simulations of deep-time intervals of the Earth, for which estimates of the energy dissipated by the tides are not always available. Here, we present and analyze two IPSL-CM5A2 earth system model simulations of the Early Eocene made under the framework of DeepMIP. One simulation includes mixing by locally dissipating internal tides, while the other does not. We show how the inclusion of tidal mixing alters the shape of the deep ocean circulation, and thereby of large-scale biogeochemical patterns, in particular oxygen distributions. In our simulations, the absence of tidal mixing leads to a relatively stagnant and poorly ventilated deep ocean in the North Atlantic, which promotes the development of a basin-scale pool of oxygen-deficient waters, at the limit of complete anoxia. The absence of large-scale anoxic records in the deep ocean after the Cretaceous anoxic events suggests that such an ocean state most likely did not occur at any time across the Paleogene. This highlights how crucial it is for climate models applied to the deep-time to integrate the spatial variability of tidally driven mixing as well as the potential of using biogeochemical models to exclude aberrant dynamical model states.</p>","author":"Jean‐Baptiste Ladant, \nJeanne Millot‐Weil, \nCasimir de Lavergne, \nJ. A. Mattias Green, \nSébastien Nguyen, \nYannick Donnadieu","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"f3503a56bf33ea5bf95aa9db0ff91f75a4c454db7bb958cd80d5baac72583687","category":"Environment"}