{"title":"Cardiorespiratory fitness and the association with galectin-1 in middle-aged individuals","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301412","date":1712325600000,"content":"<p>by Daniel Arvidsson, Vagner Ramon Rodrigues Silva, Örjan Ekblom, Elin Ekblom-Bak, Emanuel Fryk, Per-Anders Jansson, Mats Börjesson</p>\r\n\r\nGalectin-1 plays a functional role in human metabolism and the levels are altered in obesity and type 2 diabetes (T2D). This study investigates the association of cardiorespiratory fitness (CRF) with galectin-1 and the interconnection with body fatness. Cross-sectional data from the Swedish CArdioPulmonary bioImage Study (SCAPIS) pilot was analyzed, including a sample of 774 middle-aged individuals. A submaximal cycle ergometer test was used to estimate CRF as an indirect measure of the physical activity (PA) level. Serum-galectin-1 concentration was determined from venous blood collected after an overnight fast. Body mass index (BMI) was used as an indirect measure of body fatness. CRF was significantly associated with galectin-1, when controlled for age and sex (regression coefficient (regr coeff) = -0.29, p&lt;0.001). The strength of the association was attenuated when BMI was added to the regression model (regr coeff = -0.09, p = 0.07), while the association between BMI and galectin-1 remained strong (regr coeff = 0.40, p&lt;0.001). CRF was associated with BMI (regr coeff = -0.50, p&lt;0.001). The indirect association between CRF and galectin-1 through BMI (-0.50 x 0.40) contributed to 69% of total association (mediation analysis). In group comparisons, individuals with low CRF-high BMI had the highest mean galectin-1 level (25 ng/ml), while individuals with high CRF-low BMI had the lowest level (21 ng/ml). Intermediate levels of galectin-1 were found in the low CRF-low BMI and high CRF-high BMI groups (both 22 ng/ml). The galectin-1 level in the low CRF-high BMI group was significantly different from the other three groups (P&lt;0.001). In conclusion, galectin-1 is associated with CRF as an indirect measure of the PA level through interconnection with body fatness. The size of the association is of clinical relevance.","author":"Daniel Arvidsson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f3527d9446a6a30e89efec10aa7d497eccefa388bbcb61f9a21a55263ff7d78e","category":"Interdisciplinary"}