{"title":"Googlers say Bard AI is “worse than useless,” ethics concerns were ignored","link":"https://arstechnica.com/?p=1933284","date":1682026286000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/05/google-800x523.jpg\" alt=\"A large Google logo is displayed amidst foliage.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/05/google.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/search/photographer?family=editorial&amp;photographer=Sean+Gallup\">Sean Gallup | Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>From the outside, Google Bard looks like a rushed product to try to compete with ChatGPT, and some Google employees share those sentiments. A new report from <a href=\"https://www.bloomberg.com/news/features/2023-04-19/google-bard-ai-chatbot-raises-ethical-concerns-from-employees\">Bloomberg</a> interviews 18 current and former workers and comes away with a pile of damning commentary and concerns about AI ethics teams that were \"disempowered and demoralized\" so Google could get Bard out the door.</p>\n<p>According to the report, Google employees tested Bard pre-release and then were asked for their feedback, which was mostly ignored so Bard could launch quicker. Internal discussions viewed by Bloomberg called Bard “cringe-worthy” and “a pathological liar.” When asked how to land a plane, it gave incorrect instructions that would lead to a crash. One employee asked for scuba instructions and got an answer they said “would likely result in serious injury or death.” One employee wrapped up Bard's problems in a February post titled, “Bard is worse than useless: please do not launch.” Bard launched in March.</p>\n<p>You could probably say many of the same things about the AI competitor Google is chasing, OpenAI's ChatGPT. Both can give biased or false information and hallucinate incorrect answers. Google is <a href=\"https://arstechnica.com/information-technology/2023/04/clash-of-the-ai-titans-chatgpt-vs-bard-in-a-showdown-of-wits-and-wisdom/\">far behind ChatGPT</a>, and the company is<a href=\"https://arstechnica.com/information-technology/2023/01/fearing-chatgpt-google-enlists-founders-brin-and-page-in-ai-fight/\"> panicked</a> over ChatGPT's ability to answer questions people might otherwise type into Google Search. ChatGPT's creator, OpenAI, has been criticized for <a href=\"https://arstechnica.com/tech-policy/2023/03/ftc-should-investigate-openai-and-halt-gpt-4-releases-ai-research-group-says/\">having a lax approach</a> to AI safety and ethics. Now Google finds itself in a tough situation. If the company's only concern is placating the stock market and catching up to ChatGPT, it probably isn't going to be able to do that if it slows down to consider ethics issues.</p></div><p><a href=\"https://arstechnica.com/?p=1933284#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1933284&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f352d0f78fb5815b7c325148100698cf6b757baf61586a6ae462bf13dd771b8f","category":"Tech"}