{"title":"สิงคโปร์เผยระบบตรวจเว็บปลอมป้องกัน scam ส่งข้อมูลบล็อคเว็บไปแล้ว 16,000 แห่ง","link":"https://www.blognone.com/node/138522","date":1709518309000,"content":"<div><div><div><p>สิงคโปร์เป็น<a href=\"https://www.blognone.com/node/138266\">อีกประเทศที่เจอปัญหา scam หลอกลวงเงิน</a> แบบเดียวกับประเทศไทย ที่ผ่านมา รัฐบาลสิงคโปร์มีมาตรการหลายอย่างเพื่อป้องกันปัญหา เช่น <a href=\"https://www.blognone.com/node/138463\">ระบบล็อคเงินห้ามถอนออนไลน์</a>, <a href=\"https://www.blognone.com/node/138105\">ความร่วมมือกับกูเกิลบล็อคแอพใน Play Store</a>, <a href=\"https://www.blognone.com/node/132407\">ทำฐานข้อมูลชื่อผู้ส่ง SMS ทั้งประเทศ</a></p>\n<p>ตำรวจสิงคโปร์ (Singapore Police Force - SPF) เป็นอีกหน่วยงานที่มีบทบาทสูงในการต่อสู้ scam และ<a href=\"https://www.police.gov.sg/media-room/news/20220906_opening_of_anti-scam_command_office\">มีการตั้งหน่วย Anti-Scam Command (ASComm) มารับผิดชอบงานนี้โดยเฉพาะในปี 2022</a> โดย ASComm ทำงานร่วมกับหน่วยเทคโนโลยีของรัฐบาล (Government Technology Agency - GovTech) พัฒนาระบบตรวจจับ scam หลกหลายประเภท</p>\n<p>เครื่องมือตัวหนึ่งที่หน่วย GovTech พัฒนาขึ้นชื่อว่า PhishMonSG เอาไว้ตรวจสอบเว็บไซต์ปลอม ภายหลังมันถูกพัฒนาต่อยอดเป็นระบบใหม่ชื่อ Scam Analytics and Tactical Intervention System (SATIS) สามารถตรวจจับเว็บปลอมเป็นเว็บหน่วยงานรัฐ เว็บธนาคาร และเว็บที่โฮสต์มัลแวร์อื่นๆ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5d2c4568c2e398489e45e0206247c372.jpeg\" /></p>\n<p>การทำงานของ SATIS เริ่มจากการใช้ crawler ไล่หาเว็บไปเรื่อยๆ แบบเดียวกับ search engine จากนั้นนำมาวิเคราะห์ความเสี่ยงว่ามีโอกาสเป็นเว็บปลอมหรือไม่ แล้วหาวิธีปิดหรือบล็อคเว็บ เช่น การส่งข้อมูลให้กูเกิลนำเข้าฐานข้อมูล Google Safe Browsing ที่เว็บเบราว์เซอร์หลายๆ ตัวเรียกใช้งานเพื่อแจ้งเตือนเว็บปลอมแบบที่เราคุ้นเคยกัน</p>\n<p>GovTech รายงานว่าที่ผ่านมาได้บล็อคหรือแจ้งเตือนเว็บปลอมไปแล้ว 16,000 แห่ง</p>\n<p>อย่างไรก็ตาม ตำรวจสิงคโปร์ยังเตือนว่าเทคนิคการหลอกลวงนั้นเปลี่ยนไปเรื่อยๆ ตัวอย่างที่ชัดเจนคือ หลังจากสิงคโปร์ทำฐานข้อมูลผู้ส่ง SMS แห่งชาติสำเร็จ เหล่า scammer ก็เริ่มเปลี่ยนจากการส่งลิงก์ผ่าน SMS ไปเป็นลิงก์ผ่านแอพแชทอย่าง WhatsApp, Telegram รวมถึงช่องทางโซเชียลแบบ Facebook, Instagram แทน</p>\n<p>ตำรวจสิงคโปร์บอกว่าถึงแม้รูปแบบการหลอกลวงเปลี่ยนแปลงไปเรื่อยๆ แต่เป้าหมายใหญ่ๆ ยังมีแค่ 2 อย่างคือ หลอกเอาวิธีการล็อกอินบัญชีธนาคารของเหยื่อมาให้ได้ หรือ หลอกให้เหยื่อหลงเชื่อแล้วเป็นฝ่ายโอนเงินให้เอง</p>\n<p>ที่มา - <a href=\"https://www.channelnewsasia.com/singapore/scams-spf-govtech-technology-4144416\">CNA</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/singapore\">Singapore</a></div><div><a href=\"/topics/scam\">Scam</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f35a3447e73de2534f572668e75276a30be11b65085ad02ef7026163d622f4a8","category":"Thai"}