{"title":"Apple to launch Podcasts Subscriptions on June 15","link":"https://www.macworld.com/article/347675/apple-delays-podcasts-subscriptions-to-june.html","date":1623430093000,"content":"\n<div>\n<section><div></div></section><p>After delaying the release of Podcasts Subscriptions, which was supposed to launch in May, Apple has now reportedly told content creators that the service will launch on June 15.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/05/28/apple-delaying-podcasts-subscriptions-launch-until-june-promises-improvements-to-podcasts-app/amp/?__twitter_impression=true&amp;xcust=1-1-347675-0-0-0&amp;sref=https://www.macworld.com/feed\">an email obtained by 9to5Mac</a> back in late May, Apple told podcast creators that the service was pushed back to June “to ensure we are delivering the best experience for creators and listeners.” Apple didn’t give a firm date for the launch at the time but said it would “communicate further updates on availability, and best practices to help you prepare your subscriptions and channels.” Now <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/2021/6/9/22526186/apple-podcasts-in-app-subscription-launch&amp;xcust=1-1-347675-0-0-0&amp;sref=https://www.macworld.com/feed\">a new email seen by The Verge</a> says the service will launch on June 15.</p>\n\n\n\n<p>Podcasts Subscriptions is <a href=\"https://www.macworld.com/article/343771/apple-introduces-podcasts-subscriptions-new-features-in-podcasts-app.html\">a new service announced at Apple’s Spring Loaded Event</a>. Unlike its other services, Apple isn’t charging a monthly fee for Podcast Subscriptions, but rather letting content creators set their own pricing and terms, and taking its customary 15-30% cut like any other in-app purchase. Listeners will be able to subscribe to the podcasts they choose through the app.</p>\n\n\n\n<p>Apple also said it would be tweaking the app further. iOS 14.6 brought some interface changes based on listener feedback, and Apple said it will “introduce additional enhancements to Library in the coming weeks.” Those changes could arrive <a href=\"https://www.macworld.com/article/346989/ios-14-7-features-release-date-beta-how-to-install.html\">as part of iOS 14.7</a>, which is currently in beta testing.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f367f217ad6d897b2333e21bf4abfa7f80ad3e5e7745ce27f324d49aa73fc8f9","category":"Apple"}