{"title":"Save up to 49% on Wild Highlands coffee!","link":"https://www.bikeradar.com/bikeradar-daily-deals/save-up-to-49-on-wild-highlands-coffee/","date":1619781733000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/All-article-header-image-4c38d6b.png?quality=90&amp;resize=620,413\" />                                            <p>There’s nothing better than a good cup of coffee to start your day, and with this exclusive <strong><a href=\"https://www.wild-highlands.com/immediate-media-deal/\" target=\"_blank\">deal</a>,</strong> your mornings will be in for a real treat, as you can save up to 49% on Wild Highlands’ wonderful coffee. You can either get one bag for £9 (RRP £12.95 – that’s a 31% discount), two bags for £15 (RRP £25.90 – a 42% discount), or three bags for £20 (RRP £38.85 – a 49% discount), plus £3.50 delivery. What’s more, you’ll also have the option to join Club Wild, Wild Highlands’ coffee subscription service, and get 25% off for the initial six months – this offer isn’t available anywhere else!</p>\n<p><a href=\"https://www.wild-highlands.com/immediate-media-deal/\" target=\"_blank\"><em><strong>Save up to 49% now</strong></em></a></p>\n<p><strong>Note:</strong><br /><span>❚ </span><em>Every one of our online deals has an advantage. We negotiate hard to bring you great offers and the best prices. We receive a commission from the retailer for each completed purchase. This income helps us to continue to be able to offer you our high-quality content free of charge. This deal is exclusive to Immediate Media Co.</em></p>\n<p>Established in 2018, Wild Highlands is a small family-run business based in Loch Lomond and the Trossachs National Park. With a love of the outdoors, bees and coffee, maintaining a personal connection with people is also at the heart of the brand’s ethos, and it strives to provide the feel of a local farmers’ market shopping experience – no matter where its customers are located.</p>\n<p>As part of this offer, you have the choice of three unique blends of coffee that have been small batch roasted in Scotland:</p>\n<ul><li><strong>Hunting Blend</strong>: A delicious blend of quality Arabica and Robusta beans, roasted to a dark chocolate colour. This blend is slowly roasted to achieve a coffee that is dark, rich and highly fragrant with a strong, intense flavour that is perfect served as a latte. Utterly delicious. Strength: Strong</li>\n<li><strong>Ancient Blend</strong>: A lusciously smooth blended coffee with an intense chocolatey flavour. This wonderful coffee has bags of character, style and panache. Perfect enjoyed any time of the day, or night. Enjoy anytime. Strength: Smooth</li>\n<li><strong>Modern Single Origin</strong>: Packed full of flavour – ideal for those who like their coffee a bit milder than usual, but full of taste. A single origin 100% Arabica, the Modern Single Origin has a distinctive lemony and butterscotch finish with medium acidity. A true modern classic. Strength: Mild</li>\n</ul><p>The coffee is freshly packed into Wild Highlands-branded 500g side gusset bags with one-way valves and is provided in three different formats: <strong>whole beans</strong>, for home grinding or bean-to-cup machines; <strong>coarse ground</strong>, perfect for cafetières; and <strong>fine grind</strong>, which is best for espresso machines and stovetops.</p>\n<p>Any mix of blends and formats can be selected with this offer.</p>\n<p><a href=\"https://www.wild-highlands.com/immediate-media-deal/\" target=\"_blank\"><em><strong>Save up to 49% now</strong></em></a></p>\n<p><em>You can find all our current shopping deals<strong> <a href=\"https://www.bikeradar.com/bikeradar-daily-deals/\" target=\"_blank\">here</a></strong>. If you have any questions about the deal product or the related services, please contact the provider directly. If you have any questions about the online shopping deal itself, or if you would like to work with us as a partner, please email <a href=\"mailto:deals@bikeradar.com\" target=\"_blank\">deals@bikeradar.com</a></em></p>","author":"Gavin Day","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f369b512b7c2e5b613995f1f5ea117c14f593f37ca21d32f51fb5ce4436123e1","category":"Cycling"}