{"title":"นักวิจัยพบช่องโหว่รันโค้ดใน cdnjs แต่ Cloudflare แก้ปัญหาได้ก่อนได้รับรายงาน","link":"https://www.blognone.com/node/124006","date":1627821897000,"content":"<div><div><div><p>ช่วงเดือนมิถุนายนที่ผ่านมา <a href=\"https://blog.ryotak.me/post/cdnjs-remote-code-execution-en/\">RyotaK นักวิจัยความปลอดภัยทดสอบช่องโหว่ของโครงการ cdnjs</a> บริการโฮสต์ไลบรารีจาวาสคริปต์โดย Cloudflare แม้จะพบช่องโหว่แต่ระบบตรวจสอบของ Cloudflare ก็ปิดช่องโหว่ได้ในเวลาอันรวดเร็วโดยไม่ต้องรอรายงาน</p>\n<p>RyotaK อาศัยการสร้างแพ็กเกจมุ่งร้าย ที่วางไฟล์ในแพ็กเกจโดยอาศัยช่องโหว่การสร้าง symbolic link ไปยังไฟล์ในระบบ ทำให้เมื่อ cdnjs นำแพ็กเกจมาใช้งานก็ทำให้แฮกเกอร์ที่สร้างแพ็กเกจมุ่งร้ายสามารถอ่านข้อมุลในเซิร์ฟเวอร์ของ cdnjs ได้ โดย RyotaK สามารถอ่านค่า GITHUB_REPO_API_KEY  และ WORKERS_KV_API_TOKEN  ออกมาได้</p>\n<p>ทาง Cloudflare ออกมารายงานว่า หลังจากช่องโหว่ของ cdnjs ถูกเจาะ ระบบแจ้งเตือนของ GitHub ก็เตือนมายัง Cloudflare ทันทีว่ามีเหตุกุญแจ API รั่วไหล และทาง Cloudflare ก็ยกเลิกกุญแจและหยุดบริการอัพเดตแพ็กเกจภายในชั่วโมงเดียว และแก้ไขช่องโหว่ภายใน 24 ชั่วโมง และหลังจากได้รายงานจาก RyotaK ก็ตรวจสอบว่าไม่มีการโจมตีอื่นนอกจากตัวนักวิจัยเอง</p>\n<p>แม้จะแก้ไขช่องโหว่ได้รวดเร็วแต่ทีมงานก็ตระหนักว่าบางครั้งแฮกเกอร์อาจพยายามหาช่องโหว่อื่นๆ ของระบบอีก จึงเพิ่ม AppArmor เข้ามาควบคุมการรันอัพเดตแพ็กเกจ เพื่อให้แน่ใจว่าสคริปต์จะรันในสิทธิ์ที่จำเป็นเท่านั้น และหลังจากก็ออกแบบกระบวนการอัพเดตใหม่ไปรันในคอนเทนเนอร์แทนที่เพื่อให้แน่ใจว่าแต่ละแพ็ดเกจจะเห็นแต่ข้อมูลที่เกี่ยวกับตัวเองเท่านั้น</p>\n<p>ที่มา - <a href=\"https://blog.cloudflare.com/cloudflares-handling-of-an-rce-vulnerability-in-cdnjs/\">Cloudflare</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/0f13858c07ded27288fb9847db7f77bd.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/cloudflare\">Cloudflare</a></div><div><a href=\"/topics/security\">Security</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f36c58782f2bacf4580b887920860bac1b0eda3b3c85e088e03d6e4a0f27c832","category":"Thai"}