{"title":"Jony Ive's 'LoveFrom' Design Firm Launches Official Website","link":"https://www.macrumors.com/2021/10/12/jony-ive-lovefrom-launches-website/","date":1634028677000,"content":"LoveFrom, the design firm co-founded in 2019 by Apple's former design chief Jony Ive and fellow designer Marc Newson, this week unveiled its official website, <a href=\"https://www.lovefrom.com\">LoveFrom.com</a>. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/LoveFrom-hero.jpg\" />\r\n<br />\r\nThe site reveals for the first time LoveFrom's visual identity, which was designed by Ive and other members of the \"creative collective,\" including English art director Peter Saville, and Chris Wilson and Antonio Cavedoni, both former members of Apple's design team.\r\n<br />\r\n\r\n<br />\r\nIn typical Ive fashion, the site is highly minimalist in nature, containing no images, links, or contact details – just a brief text described in an accompanying press release as \"a concise and finely crafted definition of the LoveFrom collective and its work.\"\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/lovefromwebsite.jpg\" /><blockquote>LoveFrom is a creative collective. We are designers, architects, musicians, filmmakers, writers, engineers, and artists. You may know us from our past work. We are obsessed with traditions of creating and making. Fanatically devoted to excellence. Insatiably curious. We collaborate with leaders and founders. We work on projects for joy. We develop our own ideas. Love &amp; fury.</blockquote>The wordmark and text are set in a new typeface called LoveFrom Serif, which is inspired by John Baskerville's letterforms and based on studies of his original punches and matrices. \"Each character has been lovingly redrawn, refined and meticulously crafted over the past two years,\" according to the launch press release.\r\n<br />\r\n\r\n<br />\r\nUpon arriving at the site, a text cursor blinks and the LoveFrom name appears to be typed out. The wordmark includes a lively comma, which Saville describes as \"initiating a dialogue and shared conversation.\"\r\n<br />\r\n\r\n<br />\r\nThe site launch is the most public move yet by the collective, which has kept a low profile and only been mentioned in creative partnership announcements by clients such as <a href=\"https://www.macrumors.com/2020/10/21/jony-ive-lovefrom-airbnb-partnership/\">Airbnb</a> and <a href=\"https://www.macrumors.com/2021/09/27/ferrari-jony-ive-lovefrom-partnership/\">Ferrari</a>. \r\n<br />\r\n\r\n<br />\r\nIve <a href=\"https://www.macrumors.com/2019/06/27/jony-ive-leaving-apple/\">left Apple</a> to begin LoveFrom in June 2019. At the time, the tech giant said it would remain one of Ive's primary clients, but which Apple products he has helped to design since then, if any, is unknown. Apple said Ive was <a href=\"https://www.macrumors.com/2021/06/03/jony-ive-lovefrom-recruits-former-apple-designers/\">involved in the design of the colorful 24-inch iMac</a> released in April, but it's not clear if that work occurred after Ive left the company.\r\n<br />\r\n\r\n<br />\r\nIt remains unclear how many employees work for LoveFrom, but Ive <a href=\"https://www.macrumors.com/2021/06/03/jony-ive-lovefrom-recruits-former-apple-designers/\">recruited</a> at least four of his former Apple colleagues to work with him at the firm, including Wan Si, Chris Wilson, Patch Kessler, and Jeff Tiller. <div>Tags: <a href=\"https://www.macrumors.com/guide/jony-ive/\">Jony Ive</a>, <a href=\"https://www.macrumors.com/guide/lovefrom/\">LoveFrom</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/12/jony-ive-lovefrom-launches-website/\">Jony Ive's 'LoveFrom' Design Firm Launches Official Website</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/jony-ives-lovefrom-design-firm-launches-official-website.2316547/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=4iKLg88k4Yo:PGNu8hBYet8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=4iKLg88k4Yo:PGNu8hBYet8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/4iKLg88k4Yo\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f38066231b0eee5f0425d05b1ec69a97f5153af3f3e04b8bfff231b4a135c30d","category":"Apple"}