{"title":"Combination effect of optical defocus and low dose atropine in myopia control: Study protocol for a randomized clinical trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306050","date":1719410400000,"content":"<p>by Rachel Ka Man Chun, Ying Hon, Tsz Kin Law, Kryshell Yu Qi Wong, Chi Ho To, Kendrick C. Shih, Christopher Kai Shun Leung, Dennis Yan Yin Tse</p>\r\nBackground <p>Myopia, characterized by excessive axial elongation of the eyeball, increases risks of having sight-threatening diseases and impose a financial burden to healthcare system. Although myopic control interventions showed their effectiveness in slowing progression, the efficacy varies between individuals and does not completely halt progression. The study aims to investigate the efficacy of combining 0.01% atropine administered twice daily with optical defocus for myopia control in schoolchildren.</p> Methods and design <p>This is a prospective, parallel-group, single-blinded, randomized, active-control trial (ClinicalTrials.gov identifier: NCT06358755). Myopic schoolchildren with no previous myopic control interventions aged between 7 to 12 years will be recruited. They will be randomly allocated into two groups (n = 56 per group) after baseline measurement. Both groups will receive 0.01% atropine twice per day for 18 months (one drop in the morning and the other drop at night before bedtime). Defocus incorporated multiple segments (DIMS) spectacle lenses will be prescribed in atropine plus optical defocus (ATD) treatment group while single vision spectacle lenses will be given in atropine only (AT) group. Cycloplegic refraction and axial lengths will be monitored every 6 months over 18-month study period. The primary outcomes are changes in cycloplegic refraction and axial lengths relative to the baseline over the study period.</p> Discussion <p>The result will examine the combination effect of low dose atropine and myopic defocus on myopia control in a randomized controlled study. The findings will also explore the potential benefits of applying 0.01% atropine twice per day on myopic control and its potential side effects.</p>","author":"Rachel Ka Man Chun","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f3872c78513bc4c1cf2e5152ccc97b2409b8d61cf139df48cff87b06b8c2cfe7","category":"Interdisciplinary"}