{"title":"iOS 15: 10 great hidden features you’ll rush to use when it arrives","link":"https://www.macworld.com/article/353362/ios-15-hidden-features-tips-tricks.html","date":1629885600000,"content":"<div>\n<section><div></div></section><p>Every year, a new version of iOS. And every year, some <a href=\"https://www.macworld.com/article/350966/ios-15-super-guide-features-tips-tricks-updates-safari-facetime-focus-notification-summary.html\">big new features</a> can totally change the way you use your iPhone. But each new iOS release also comes with a bunch of tiny changes; little hidden features and tweaks that you won’t even notice if you don’t know where to look.</p>\n\n\n\n<p>Sometimes, it’s those little changes that make <em>all the difference</em>.  Once discovered, you’ll wonder how you got along without them! Here are ten of our favorite little, hidden, you-might-have-missed-them features of iOS 15.</p>\n\n\n\n<hr /><p><em>[<a href=\"https://www.macworld.com/article/350966/ios-15-super-guide-features-tips-tricks-updates-safari-facetime-focus-notification-summary.html\">For more tips, tricks, news, features, and updates, check out our iOS 15 superguide.</a>]</em></p>\n\n\n\n<hr /><h2>Translate anywhere</h2>\n\n\n\n<p>With iOS 15, you can translate text just about anywhere. In almost any app where you can select text!</p>\n\n\n\n<p>Just tap and hold on a block of text to show the text selection window and drag the start and end points—just as you would if you were going to copy/paste. You’ll notice the little popup menu has a new <em>Translate</em> option (in some apps you might have to hit the right arrow to see more options).</p>\n\n\n\n<p>You’ll get a warning that the text is going to be sent to Apple to process the translation. Tap <em>Continue</em> and a pop-up card will show the translated text and give you options to copy the translation, change languages, and so on.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/ios15-translate-anywhere.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>Want to do the translation without sending data to Apple? Open Settings, then <em>Translate</em> and enable <em>On-Device Mode</em>. You’ll have to also open up the <em>Downloaded Languages</em> menu and download the languages for which you want to enable offline translation.</p>\n\n\n\n<h2>Keep an eye on app activity</h2>\n\n\n\n<p>Apple is always expanding privacy features, and with iOS 15 you have a powerful new tool to find out which apps are accessing your phone’s features and data.</p>\n\n\n\n<p>Open Settings, then tap <em>Privacy</em>, and scroll to the bottom to <em>Record App Activity</em>. You’ll have to enable this at the top of the screen.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/App-privacy-report-apple-2.png?w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<p>This will record a 7-day summary of exactly when and how often all your apps access things like your microphone or microphone, or which web domains they visit. Just come back to this screen a week later for a full report.</p>\n\n\n\n<p>You can even tap <em>Save App Activity</em> to export a JSON file of all the data if you’re into that kind of thing.</p>\n\n\n\n<h2>Get real-time precipitation alerts</h2>\n\n\n\n<p>The Weather app and widget get some nice improvements in iOS 15, but the one we’re really excited about is next-time precipitation notifications.</p>\n\n\n\n<p>This was one of the marquee features of Dark Sky, an app and service <a href=\"https://www.macworld.com/article/234014/apple-acquires-dark-sky-weather-app.html\">Apple acquired in 2020</a>.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/ios15-weather-notifications.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>To enable this, open the Weather app and tap the icon for the list of locations in the lower right. Then tap the “more” button (three dots) in the upper right, and select Notifications. You’ll be able to toggle notifications for your current location and each saved location, independently.</p>\n\n\n\n<p>With this enabled, you’ll get a notification whenever rain or snow is going to start or stop within the next hour.</p>\n\n\n\n<h2>Share with Siri</h2>\n\n\n\n<p>Sometimes it’s a pain to share that cool thing you found online. You have to copy URLs or images, switch to Messages, hold down to paste, hope it works…</p>\n\n\n\n<p>With iOS 15, you can finally just ask Siri. Simply say “Hey Siri, share this with [name]” (or something similar like “send this to [name]” and Siri will share the content on the screen to that person using Messages.</p>\n\n\n\n<p>Items like images, web pages, Apple Music or Podcasts, Apple News stories, and Maps locations will share the actual content (or a link to it). For content Siri can’t share, it will warn you that it can only send a screenshot—but Siri will still automatically take that screenshot and drop it in a Message to that person.</p>\n\n\n\n<p>It’s all very frictionless. Just ask Siri to share something, and Siri will prepare the item in a flash and ask “ready to send it?” Say yes, and you’re done. No finding and opening share menus, no copy/paste, no flipping back and forth to the Messages app.</p>\n\n\n\n<h2>Choose text size for each app</h2>\n\n\n\n<p>You’ve been able to change the system-wide text size for ages, but iOS 15 adds the ability to change the text size on a per-app basis.</p>\n\n\n\n<p>First, enable the feature in Control Center. Open Settings, then tap <em>Control Center</em> and scroll down to add the <em>Text Size</em> control.</p>\n\n\n\n<p>Then when you’re in an app, open Control Center (swipe down from the top-right corner) and select the Text Size control. A big slider lets you change text size, while a toggle at the bottom of the screen lets you choose between All Apps or just the app you’re currently using.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/ios15-text-size-per-app.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<h2>Set Recovery and Legacy Contacts</h2>\n\n\n\n<p>Your Apple ID and iCloud account get more important every year. It’s full of purchases, services, cloud data, photos…if you lost access, a lot of that stuff would be gone forever.</p>\n\n\n\n<p>Apple has two welcome new features in iOS 15. Account Recovery Contacts are people you trust that Apple can contact to help you reset your passcode if you ever lose it. They can’t actually access your data, but if you initiate a password reset but are locked out of your own devices, the reset code can be sent to that contact.</p>\n\n\n\n<p>To enable it, open Settings then tap on your Apple ID at the top. Then choose <em>Password &amp; Security</em>, then <em>Account Recovery</em>. You’ll see an option to <em>Add Recovery Contact</em>.</p>\n\n\n\n<p>What about accessing all your content should you pass away? In the event of your untimely demise, a Digital Legacy Contact is a person who can request access to your data after you die. They’ll get access to Messages, Photos, Notes, Contacts, Calendar events, App purchases, and your device backup, but not your iCloud Keychain or licensed media purchases.</p>\n\n\n\n<p>It’s probably a good idea to set up both of these things with trusted family members shortly after you update to iOS 15.</p>\n\n\n\n<h2>Scan Text (almost) anywhere</h2>\n\n\n\n<p>Apple’s new Live Text feature lets you select text in images from the Camera or Photos app, which can be really handy.</p>\n\n\n\n<p>Even better, you can use this technology to input text almost anywhere!</p>\n\n\n\n<p>In any text entry field, in almost any app, just tap to bring up the text selection pop-up (just as you would when doing a copy/paste). If no text is selected, you’ll see an option to <em>Scan Text</em> with a small icon of square brackets with lines inside. If there are multiple options, you might see the icon alone.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/scan-text01.jpeg?quality=50&amp;strip=all\" /></figure><p>IDG</p></div>\n\n\n\n<p>Select that, and the keyboard will be replaced by a camera view. Point it at a block of text on almost anything, and you’ll see brackets around the text with a big blue <em>Insert</em> button. You might see instructions like “slow down” if you’re moving the camera too quickly.</p>\n\n\n\n<h2>Track your iPhone without power</h2>\n\n\n\n<p>Find My iPhone is a great way to keep track of a potentially lost device. But if someone <em>stole</em> your iPhone, all they have to do is power it down to disable tracking. Find My may show your device’s last location (if you enabled that in Settings), but that’s not much help.</p>\n\n\n\n<p>With iOS 15, an iPhone that has been turned off will actually enter an ultra-low power state that keeps the Bluetooth beacon active, effectively turning your iPhone into an <a href=\"https://www.macworld.com/article/346345/apple-airtag-review.html\">AirTag</a>.</p>\n\n\n\n<p>You’ll see a little “iPhone findable after power off” notice under the Slide to Power Off interface, too.</p>\n\n\n\n<h2>Keep Night Mode off</h2>\n\n\n\n<p>For the most part, Night Mode in the Camera app on modern iPhones is a great thing. It can absolutely transform photos taken in very low light.</p>\n\n\n\n<p>If the Camera app detects a dark scene, Night Mode is enabled automatically, but sometimes you <em>want</em> that dramatic dark effect, and it’s annoying to disable Night Mode to get it. You have to tap the Night Mode indicator and then slide the timer down to zero seconds.</p>\n\n\n\n<p>If you wait a while before taking another photo, it will re-engage automatically.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/ios15-night-mode.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>With iOS 15, you can head to Settings &gt; <em>Camera</em> &gt; <em>Preserve Settings</em> to find an option to preserve your Night Mode settings (among other things). With this enabled, Night Mode will remember when it has been turned off and won’t re-enable itself. If you want to take a Night Mode shot, you can manually tap the Night Mode indicator to enable it yourself.</p>\n\n\n\n<h2>Adjust video playback speed</h2>\n\n\n\n<p>Apps like YouTube have had variable speed playback for some time now, but the default iPhone video player has not. In iOS 15, the default player (used for many web videos and by lots of apps) has playback speed controls.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/ios15-playback-speed-2.png?w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>When playing back a video, tap the overflow menu in the lower right (the three dots) and you’ll be able to select from up to five different playback speeds.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f38ae93b3b7fd92a2ff4339f0c8a8ac1c683dc282b59345ea30443b15f22dbcc","category":"Apple"}