{"title":"Android 12 gets a source code release—but not a Pixel release","link":"https://arstechnica.com/?p=1800497","date":1633370386000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/android-12-rainbow-800x365.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/android-12-rainbow.jpg\">Enlarge</a> <span>/</span> With Android 12 Beta 2, Google's color-changing UI is live, so we took a trip through the rainbow.  (credit: Ron Amadeo)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Here's a strange development. Plenty of people thought today would be the official release of Android 12, which would make the nearly eight-month beta process one of the longest ever for Google's latest operating system. Today, Google <em>is</em> <a href=\"https://android-developers.googleblog.com/2021/10/android-12-is-live-in-aosp.html\">releasing Android 12</a>, sort of—but only in source code form. There aren't any day-one updates for any device, even the Pixel phones.</p>\n<p>Android is developed in secret (though nothing is really secret when you have an eight-month beta process) and then released as open source code once it's done. Usually, this also includes a release to Pixel phones—one of the big benefits of owning one. Today, with the source code release, Google's blog post says that Pixel devices will get the update \"in the next few weeks.\"</p>\n<p>Place your bets in the comments for why we're getting this unprecedented release schedule of no day-one phone releases. Is Android 12 not done? It seems pretty done based on the latest beta release from last month. It's also done enough to release the source code, so that doesn't seem like it. Is Google holding back the Android 12 release so the OS can debut on the Pixel 6? Marketing getting involved is currently the best guess we have for this strange release.</p></div><p><a href=\"https://arstechnica.com/?p=1800497#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1800497&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f39be606c96407b18af63c9cf7e30803b2709f1055d846cdc7a17c9576bda117","category":"Tech"}