{"title":"ไอบีเอ็ม จับมือพาร์ตเนอร์กว่า 20 รายจัดสัมมนาออนไลน์ IBM Solutions Summit 2021 powered by IBM Partners","link":"https://www.blognone.com/node/124365","date":1629860400000,"content":"<div><div><div><p>Blognone ขอเรียนเชิญ CEOs, Owners/founders, COOs, CIOs, CTO, IT directors, Line of Business leaders, Senior IT professionals, IT Manager, Cloud Engineer, Data Center Engineer, ผู้ดูแลระบบ IT และผู้ที่สนใจทุกท่าน เข้าร่วม IBM Virtual Event ในงาน “IBM Solutions Summit 2021 powered by IBM Partners” เพื่อเรียนรู้แนวโน้มเทคโนโลยีหลัก ไฮบริดคลาวด์ เอไอ และซีเคียวริตี้ ที่สามารถขับเคลื่อนด้วยระบบอัตโนมัติตอบโจทย์ องค์กรในโลกยุคดิจิทัลที่ต้องตอบสนองลูกค้าด้วยความรวดเร็ว รู้ใจและปลอดภัยสูง ในวันศุกร์ที่ 10 กันยายน 2021 เวลา 08.30 – 13.00 น.</p>\n<p><a href=\"https://www.thpartnersolutionssummit.com/?utm_source=ibmbp6&amp;utm_medium=organic&amp;utm_campaign=ibm\"><img src=\"https://www.blognone.com/sites/default/files/externals/ae7ef5c9166dc324d907cf09d4a09b51.jpg\" /></a></p>\n<p>ชี้ 3 แนวโน้มเทคโนโลยีหลัก ไฮบริดคลาวด์ เอไอ และซีเคียวริตี้ ที่สามารถขับเคลื่อนด้วยระบบอัตโนมัติตอบโจทย์องค์กรในโลกยุคดิจิทัลที่ต้องตอบสนองลูกค้าด้วยความรวดเร็ว รู้ใจและปลอดภัยสูง</p>\n<p>ไอบีเอ็ม ประเทศไทย จับมือพาร์ตเนอร์มากกว่า 20 ราย จัดสัมมนาและนิทรรศการออนไลน์ IBM Solutions Summit 2021 powered by IBM Partners ในวันที่ 10 กันยายน 2564 เวลา 8.00 น – 13.00 น โดยในปีนี้จัดในธีม Re-imagine Innovation with Technology การเปลี่ยนภาพลักษณ์นวัตกรรมด้วยเทคโนโลยี 3 เสาหลัก คือ ไฮบริดคลาวด์ เอไอ และซีเคียวริตี้ ที่มาพร้อมกับนวัตกรรมใหม่ในการขับเคลื่อนด้วยระบบอัตโนมัติในการดำเนินการขั้นตอนต่างๆ โดยมีไฮไลท์ประสบการณ์จริงจากลูกค้าผู้ใช้งาน ในการนำนวัตกรรมเทคโนโลยีตอบรับกับการทรานส์ฟอร์มธุรกิจสู่ยุคนิวนอร์มอล</p>\n<p>นอกจากหัวข้อดังกล่าวแล้ว ผู้เข้าร่วมจะได้รับชมการบรรยายและสาธิตการใช้งานเทคโนโลยีออนไลน์จากพาร์ตเนอร์กว่า 20 ราย เช่น 4Plus Consulting, Amind Group, C-Level, Computer Union, Datapro Computer Systems, G-Able, Ingram Micro, Metro Connect, Metro Systems Corporation, MFEC, NEOPLUS, NTT Solutions, Portalnet, Stream I.T. Consulting, Systems Dot Com, Triple Dot Consulting และ Zenith Comp เป็นต้น</p>\n<p><a href=\"https://www.thpartnersolutionssummit.com/?utm_source=ibmbp6&amp;utm_medium=organic&amp;utm_campaign=ibm\"><img src=\"https://www.blognone.com/sites/default/files/externals/68ac6905ebe92cb99b86e5ee3c4d4fa5.jpg\" /></a></p>\n<p>ภายในงานมีแบ่งการนำเสนอเทคโนโลยีเป็น 3 ส่วนหลัก ประกอบด้วย</p>\n<ol>\n<li><strong>เทคโนโลยีส่วนแรก Cost Optimization &amp; IT Modernization</strong> เป็นโซลูชันเทคโนโลยีในการบริหารต้นทุน จัดการวางแผนทางการเงินอย่างมีประสิทธิภาพ พร้อมการปรับระบบไอทีให้ทันสมัย เพื่อตอบสนองความต้องการของลูกค้าและตลาดที่เปลี่ยนแปลงไป</li>\n</ol>\n<p>ในส่วนแรก เริ่มต้นจากหัวข้อ <strong>A New Approach to Financial Performance Management: Plan and Analyze Anytime, Anywhere</strong> ด้วยโซลูชัน IBM Planning Analytics with Watson โซลูชันวางแผนและวิเคราะห์งบประมาณการเงินช่วยให้ผู้บริหาร วางแผนงบประมาณได้อย่างมีประสิทธิภาพและรวดเร็ว ไม่ว่าจะทำงานจากที่ใดตอบรับการทำงานยุคนิวนอร์มอล เข้าถึงข้อมูลได้แบบเรียลไทม์ เห็นผลลัพธ์และงบการเงินได้ทันที</p>\n<p>หัวข้อ <strong>Accelerate Digital Transformation by IBM Cloud Paks – Superior Performance with IBM POWER10</strong> นำเสนอโซลูชัน IBM Cloud Paks ครบวงจรในการบริหารระบบโครงสร้างพื้นฐานไอทีแบบไฮบริดคลาวด์ พร้อมเอไอช่วยให้ผู้จัดการระบบบริหารจัดการเซิร์ฟเวอร์ เช่น IBM POWER 10 ร่วมกับระบบคลาวด์ได้อย่างมีประสิทธิภาพ</p>\n<p>หัวข้อ <strong>Automated Hybrid Cloud with Ansible Automation Platform</strong> นำเสนอโซลูชัน Ansible Automation Platform เครื่องมือในการบริหารจัดการทรัพยากรระบบไฮบริดคลาวด์แบบไม่ใช้เอเจนท์ ตรวจสอบอุปกรณ์ต่างๆ จัดการโมดูลของระบบ รองรับ IBM Power Systems, IBM Z และแพลตฟอร์มอื่นๆ</p>\n<p>หัวข้อ <strong>IBM Storage Foundation for Hybrid Cloud Platform</strong> โซลูชันที่ช่วยจัดการกับความท้าทายด้านสตอเรจบนโครงสร้างพื้นฐานแบบไฮบริดคลาวด์ได้อย่างรวดเร็วและง่ายดาย ด้วยการ 1) Move: จัดการย้ายข้อมูลระหว่างคลาวด์ 2) Access: เข้าถึงและปรับใช้ที่เก็บข้อมูลถาวรสำหรับคอนเทนเนอร์ด้วย IBM FlashSystems และ Storage Suite และ 3) Protect: สำรองข้อมูลได้อย่างยืดหยุ่นด้วย Spectrum Protect Plus และปกป้องข้อมูลสำคัญ ด้วยโซลูชัน SafeGuarded Copy</p>\n<p>หัวข้อ <strong>IT Operation Modernization by AIOps</strong> นำเสนอโซลูชัน AIOps เป็นโซลูชันที่นำ Automation และ AI/ML เข้ามาประยุกต์ใช้ในแง่ของ IT Operation หรือ เพื่อวิเคราะห์ แก้ไขปัญหา และการบริหารจัดการ IT Operation ในปัจจุบันซึ่งมีความหลากหลายมากขึ้น ให้สามารถดำเนินการได้อย่างรวดเร็ว แม่นยำ</p>\n<p>ปิดท้ายช่วงท้ายของเซสชั่น ด้วยหัวข้อ <strong>Transform Your Business with AI – Industries Use Case</strong> เทคโนโลยีเอไอ กับการทรานส์ฟอร์มธุรกิจจากสถานการณ์ปัจจุบัน ทำให้องค์กรเกิดความท้าทายในการดำเนินธุรกิจ ที่ส่งผลมาจากความต้องการของลูกค้า และวิถีการดำเนินงานที่เปลี่ยนแปลงไป รวมถึงโครงสร้างของข้อมูล Structure และ Un-structure data ที่เกิดขึ้นมหาศาล การนำเอไอ จึงเข้ามามีส่วนในการเสริมศักยภาพทางธุรกิจให้อยู่รอดในอนาคต</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/639c9eee303024635066d3f2b9b41ac1.jpg\" /></p>\n<ol>\n<li><strong>ส่วนที่สอง Leverage New Ways of Working</strong> คือ การเตรียมความพร้อมระบบไอทีรองรับการเปลี่ยนแปลงวิธีการทำงานแนวใหม่ เพื่อรักษาประสิทธิภาพการทำงาน และเพิ่มการทำงานร่วมกันของพนักงาน ไม่ว่าจะทำงานจากที่ไหนก็ตาม</li>\n</ol>\n<p>เริ่มหัวข้อแรก คือ <strong>AI-Powered Automation and Data with IBM Cloud Paks for Data and Business Automation</strong> ด้วยการประยุกต์ใช้เทคโนโลยี IBM Cloud Paks เพื่อการบริหารจัดการข้อมูลและขับเคลื่อนระบบธุรกิจได้อย่างอัตโนมัติ พร้อมการขับเคลื่อนองค์กรด้วยข้อมูลเชิงลึก รวมถึงการส่งเสริมให้พนักงานมุ่งเน้นไปยังสิ่งที่สำคัญ โดยมีเครื่องมืออัตโนมัติที่ขับเคลื่อนให้สามารถทำงานรูปแบบใหม่ๆ ได้หลากหลายขึ้น</p>\n<p>หัวข้อ <strong>Customer Experience Management Platform</strong> จัดการข้อมูลลูกค้าครบวงจร ตั้งแต่การรวบรวมข้อมูลพฤติกรรมของลูกค้า, Loyalty &amp; Personalized Campaign ทำงานบนแพลตฟอร์มดาต้า และปัญญาประดิษฐ์บนเทคโนโลยี IBM Cloud Pak for Data ผ่านเทคโนโลยีการวิเคราะห์ข้อมูลของไอบีเอ็ม ที่ให้มุมมองแบบ Single View และเรียลไทม์</p>\n<p>หัวข้อ <strong>New Normal with Stream Digital Solutions: e-Tax Invoice &amp; Robotics Process Automation</strong> ช่วยฝ่ายบัญชีในการออกใบกำกับภาษีในรูปแบบอิเล็กทรอนิกส์ (e-Tax Invoice) ลดการสัมผัสเอกสาร ลดค่าใช้จ่ายในระยะยาว และที่สำคัญเป็นการจัดทำระบบตามระเบียบข้อกำหนดของกรมสรรพากร และโซลูชัน RPA ที่นำระบบหุ่นยนต์อัตโนมัติ เข้ามาช่วยในการทำงานซ้ำๆ ทำให้โอกาสเกิดข้อผิดพลาดน้อย เพิ่มปริมาณผลงานในเวลาที่รวดเร็ว</p>\n<p>หัวข้อ <strong>Prescriptive Maintenance Your Enterprise Assets with Artificial Intelligence</strong> เพิ่มความโดดเด่นให้ธุรกิจของคุณด้วยกรณีศึกษาจริงจากองค์กรชั้นนำในอุตสาหกรรม ค้นหาว่าลูกค้าเปลี่ยนข้อมูล IoT และเอไอให้เป็นข้อได้เปรียบในการแข่งขันสร้างรายได้และปรับปรุงการดำเนินงานของคุณด้วย IBM Maximo Application Suite ได้อย่างไร</p>\n<p>หัวข้อ <strong>Simplify Your Data Architecture &amp; Management</strong> หลายองค์กรในประเทศไทยต้องเผชิญกับปัญหาที่ทำให้ไม่สามารถผลักดันโปรเจค Big Data ให้ประสบความสำเร็จได้ ไม่ว่าจะเป็น ปัญหาความยุ่งยากในการรวบรวมข้อมูลมหาศาลจากหลายแหล่ง ความซับซ้อนของการจัดการและบริหารโครงสร้างพื้นฐานข้อมูลแล้ว G-Able Solution &amp; Service พร้อมด้วยผลิตภัณฑ์จากไอบีเอ็มจะสามารถเข้ามาช่วยจัดการปัญหานี้</p>\n<p>และหัวข้อสุดท้ายของเซสชั่น <strong>ระบบอัตโนมัติทางธุรกิจ (Business Automation)</strong> แบบครบวงจร: IBM Cloud Pak for Automation โซลูชันแบบครบวงจรสำหรับองค์กรที่ต้องการระบบอัตโนมัติทางธุรกิจ ช่วยแปลงกระบวนการดำเนินธุรกิจให้เป็นดิจิทัล และเพิ่มประสิทธิภาพการทำงานด้วยแรงงานดิจิทัลที่ช่วยให้ธุรกิจสามารถดำเนินไปได้อย่างรวดเร็ว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/639c9eee303024635066d3f2b9b41ac1.jpg\" /></p>\n<ol>\n<li>สำหรับ <strong>ส่วนที่ 3: Manage Security and Business Resiliency</strong> การจัดการความปลอดภัยของระบบไอทีและบริหารความต่อเนื่องของธุรกิจ รองรับเหตุไม่คาดคิดในสภาพแวดล้อมที่ผันผวน</li>\n</ol>\n<p>เริ่มต้นด้วยหัวข้อแรก <strong>Data Management for The New Journey of Working Culture with IBM</strong> เทคโนโลยี Container และ Kubernetes ช่วยรองรับ Cloud Native Application ได้อย่างมีประสิทธิภาพและทำ DevOps ได้อย่างคล่องตัวแล้ว ยังถือเป็นเทคโนโลยีที่จะช่วยปูทางไปสู่ภาพของ Hybrid Cloud และ Multi-Cloud ได้อย่างง่ายและยืดหยุ่นอีกด้วย</p>\n<p>หัวข้อ <strong>EDA Enterprise Database Appliance: Performance Secure Simplify</strong> ด้วยความสามารถและความเสถียรของ IBM Power จึงพัฒนาเครื่อง IBM Power ให้เป็น Enterprise Database Appliance โดยใช้กลไกการทำงานของ DB2 Enterprise ซึ่งเป็นระบบฐานข้อมูลพร้อมใช้ ที่มีประสิทธิภาพ ปลอดภัย ใช้งานง่าย ช่วยลดต้นทุน พร้อมมี API ที่มีความยืดหยุ่น</p>\n<p>หัวข้อ <strong>Modernize and Simplify Your Cloud Backup Solution</strong> เทคโนโลยีเพื่อการจัดเก็บข้อมูลแบบ Unstructured Data ที่มีปริมาณมหาศาล ให้ข้อมูลมีความปลอดภัย และพร้อมใช้งาน เข้าถึงข้อมูลได้โดยง่าย สามารถรองรับการรวบรวมสะสมข้อมูลสำหรับงานเอไอได้อย่างรวดเร็วยิ่งขึ้นง่ายๆ ด้วย Product ICOS (Cloud Object Storage)</p>\n<p>หัวข้อ <strong>Smoothing Your Road to Security Success</strong> ข้อมูลในองค์กรอาจจะไม่ปลอดภัย หากขาดความตระหนักและความเข้าใจที่ถูกต้องของพนักงาน โดยเน้นไปที่การนำนโยบายความปลอดภัย การปฏิบัติและเทคโนโลยีมาใช้ เพื่อป้องกันสถานการณ์ผิดปกติที่อาจทำให้ข้อมูลลับตกอยู่ในความเสี่ยง อีกทั้งยังตอบสนองความต้องการของลูกค้าด้วย</p>\n<p>หัวข้อ <strong>คิดอย่างเทพในการนำ Blockchain มาใช้ในธุรกิจยุคใหม่</strong> โซลูชัน IBM Blockchain for Business เน้นการกระจายข้อมูลอย่างเป็นระบบ ทำให้ผู้ที่ต้องการใช้ข้อมูลแต่ละฝ่ายสามารถเข้าถึงข้อมูลตามรูปแบบที่กำหนดข้อตกลงในบทบาทของแบบเรียลไทม์ลดความซ้ำซ้อนของข้อมูลและกระบวนการทำงาน เพิ่มความโปร่งใสให้กับข้อมูล แต่ไม่ลดทอนเรื่อง security และ privacy</p>\n<p><a href=\"https://www.thpartnersolutionssummit.com/?utm_source=ibmbp6&amp;utm_medium=organic&amp;utm_campaign=ibm\"><img src=\"https://www.blognone.com/sites/default/files/externals/c677ce22a3f6de4b930ba828a1c41813.jpg\" /></a></p>\n<p>ผู้ที่สนใจสามารถเข้าเยี่ยมชมเว็บไซต์เพื่อเข้าร่วมกิจกรรมในงานได้โดยไม่มีค่าใช้จ่ายทันทีที่ <a href=\"https://www.thpartnersolutionssummit.com/?utm_source=ibmbp6&amp;utm_medium=organic&amp;utm_campaign=ibm\">https://www.thpartnersolutionssummit.com/</a> โดยทีมงานขอความกรุณากรอกข้อมูลชื่อบริษัทด้วยชื่อเต็มของหน่วยงานหรือองค์กร เพื่อไม่ให้เกิดความสับสนในการจัดการกับข้อมูลการลงทะเบียน <a href=\"https://www.thpartnersolutionssummit.com/?utm_source=ibmbp6&amp;utm_medium=organic&amp;utm_campaign=ibm\">#ibmthsummit</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ibm\">IBM</a></div><div><a href=\"/topics/enterprise\">Enterprise</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f3a3dfc0868477410b84628c15bfb63ac8ed9e10abf1b25df6086fa60e4c9906","category":"Thai"}