{"title":"A Global Comparison of Stream Diatom Beta Diversity on Islands Versus Continents Across Scales","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13916?af=R","date":1727238603000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>To evaluate the patterns of stream diatom beta diversity in islands versus continents across scales, to relate community similarities with spatial and environmental distances and to investigate the role of island characteristics in shaping insular diatom beta diversity.</p>\n<h2>Location</h2>\n<p>Africa, America, Europe and the Pacific.</p>\n<h2>Time Period</h2>\n<p>Present.</p>\n<h2>Major Taxa Studied</h2>\n<p>Stream diatoms.</p>\n<h2>Methods</h2>\n<p>We compared diatom beta diversity between islands and continents at large scales (within biogeographic regions) in two study regions (America and Europe) and at small scales (within islands/equivalent areas in continents) in three regions (Africa, America and Europe) partitioning beta diversity into turnover and nestedness components. We used a partial Mantel test and distance–decay curves to assess how diatom beta diversity on islands and continents is affected by spatial and environmental distances. Finally, using island data from all four regions, we evaluated the relationship between island beta diversity and island latitude, area, age and isolation using linear models.</p>\n<h2>Results</h2>\n<p>At large scales, mean dissimilarities were higher on islands than in continents in Europe but lower in America. At smaller scales, the differences varied mostly depending on island isolation. Beta diversity was mainly caused by species turnover. Partial Mantel test and distance–decay curves revealed that spatial and environmental distances shaped diatom beta diversity at large, but not at small scales. Moreover, diatom beta diversity on islands was affected by island latitude, age and isolation, but not by island area.</p>\n<h2>Main Conclusions</h2>\n<p>Diatom beta diversity on islands versus continents and its responses to spatial and environmental factors are scale and region dependent. Incomplete colonisation, evolutionary processes and environmental filtering likely contribute to insular beta diversity, which further varies with island latitude, age and isolation. This study sheds new light on beta diversity of microorganisms on islands and suggests that beta diversity should be explicitly considered in island biogeographical research.</p>","author":"Ramiro Martín‐Devasa, \nAurélien Jamoneau, \nSophia I. Passy, \nJuliette Tison‐Rosebery, \nSaúl Blanco, \nAlex Borrini, \nSébastien Boutry, \nWilliam R. Budnick, \nMarco Cantonati, \nAdelaide Clode Valente, \nCristina Delgado, \nGerald Dörflinger, \nVítor Gonçalves, \nJenny Jyrkänkallio‐Mikkola, \nBryan Kennedy, \nJulien Marquié, \nHelena Marques, \nAthina Papatheodoulou, \nVirpi Pajunen, \nJavier Pérez‐Burillo, \nPedro Miguel Raposeiro, \nCatarina Ritter, \nAntónio Serafim, \nAnette Teittinen, \nBart Van de Vijver, \nJianjun Wang, \nJanne Soininen","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"f3adf76c786a92e5116079b60f6fc63d043c13130773d32bb4dc9d6349561f87","category":"Environment"}