{"title":"The Global Biogeochemical Cycle of Rhenium","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024GB008254?af=R","date":1728030512000,"content":"<h2>Abstract</h2>\n<p>This paper is the first comprehensive synthesis of what is currently known about the different natural and anthropogenic fluxes of rhenium (Re) on Earth's surface. We highlight the significant role of anthropogenic mobilization of Re, which is an important consideration in utilizing Re in the context of a biogeochemical tracer or proxy. The largest natural flux of Re derives from chemical weathering and riverine transport to the ocean (dissolved = 62 × 10<sup>6</sup> g yr<sup>−1</sup> and particulate = 5 × 10<sup>6</sup> g yr<sup>−1</sup>). This review reports a new global average [Re] of 16 ± 2 pmol L<sup>−1</sup>, or 10 ± 1 pmol L<sup>−1</sup> for the inferred pre-anthropogenic concentration without human impact, for rivers draining to the ocean. Human activity via mining (including secondary mobilization), coal combustion, and petroleum combustion mobilize approximately 560 × 10<sup>6</sup> g yr<sup>−1</sup> Re, which is more than any natural flux of Re. There are several poorly constrained fluxes of Re that merit further research, including: submarine groundwater discharge, precipitation (terrestrial and oceanic), magma degassing, and hydrothermal activity. The mechanisms and the main host phases responsible for releasing (sources) or sequestrating (sinks) these fluxes remain poorly understood. This study also highlights the use of dissolved [Re] concentrations as a tracer of oxidation of petrogenic organic carbon, and stable Re isotopes as proxies for changes in global redox conditions.</p>","author":"L. Ghazi, \nK. E. Grant, \nA. Chappaz, \nM. Danish, \nB. Peucker‐Ehrenbrink, \nJ. C. Pett‐Ridge","siteTitle":"Wiley: Global Biogeochemical Cycles: Table of Contents","siteHash":"a2d4e750daa5e386ca7dda0c54cc50454a723cbd123b964bfed1d56a4712b632","entryHash":"f3b87f854e3d4c3b35fedd9343aa20da97803a56c2aeca5b2cdc8c0b5803d3d6","category":"Environment"}