{"title":"Increased Prolylcarboxypeptidase Expression Can Serve as Biomarker of Senescence in Culture","link":"https://www.preprints.org/manuscript/202403.1780/v1","date":1711632252000,"content":"Prolylcarboxypeptidase (PRCP, PCP, Lysosomal Pro-X-carboxypeptidase, Angiotensinase C) controls angiotensin - and kinin- induced cell signaling. Elevation of PRCP appear to be activated in chronic inflammatory diseases (cardiovascular disease (CVD), diabetes) in proportion to severity. Vascular endothelial cell senescence and mitochondrial dysfunction have consistently been shown in models of CVD in aging. The cellular senescence, a driver of age-related dysfunction, can differentially alter the expression of lysosomal enzymes due to lysosomal membrane permeability. There is a lack of data demostrating the effect of age-related dysfunction on the expression and function of PRCP. To explore the changes in PRCP, PRCP-dependent prekallikrein (PK) pathway was charcterized in early – and late-passage human pulmonary artery endothelial cells (HPAECs). Detailed kinetic analysis of cells treated with high molecular weight kininogen (HK), a precursor of bradykinin (BK), and PK revealed a mechansim by which senescent HPAECs activate the generation of kallikrein upon the assembly of the HK-PK complex on HPAECs in parallel with an upregulation of PRCP and endothelial nitric oxide (NO) synthase (eNOS) and NO formation. The NO production and expression of both PRCP and eNOS increased in early-passage HPAECs while decreased in late-passage HPAECs. Low activity of PRCP in late passage HPAECs was associated with rapid decreased telomerase reverse transcriptase mRNA levels. We also found that, with an increase in the passage number of HPAECs, reduced PRCP altered respiration rate. These results indicated that aging dysregulates PRCP protein expression, and further studies will shed light into the complexity of PRCP-dependent signling pathway in aging.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f3cd7ee61e39d76a6eb323dc2aa5e0041bdb39ac5e02f1113fdfea8b739e477e","category":"Interdisciplinary"}