{"title":"‘He’s the fastest in the world’ - Tim Merlier is at the top of his game, but can he reap the rewards at Soudal–Quick-Step?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/he-s-the-fastest-in-the-world-tim-merlier-is-at-the-top-of-his-game-but-can-he-reap-the-rewards-at-soudal-quick-step","date":1708358538000,"content":"\n      <p><span>Tim Merlier is not your usual bunch sprinter. A latecomer to road racing, the Belgian rider’s first love was his cyclo-cross bike, and he still spends his winter months squeezing in races on the mud whenever he can. Unlike some of the heavier fast men he regularly beats in gallops to the line, Merlier can get over shorter climbs with more relative ease; he can also ride the cobbles and target the Classics, with his teammates even tipping him as a favourite for <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a> this year. It’s a unique combination for a rider who is one of the fastest sprinters in the world, but for Merlier, it just keeps working.</span></p>\n<div></div>\n<div></div>\n<p><span>In the opening stage of the<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uae-tour-everything-you-need-to-know\"> UAE Tour,</a> the former Belgian champion proved this once again. Deep among the sand dunes in the desert of Abu Dhabi, he ducked and dived through chaos and crashes to take victory by well over a bike length against a stacked field of the finest sprinters in the world. Merlier’s speed was unmatched despite him losing his Soudal–Quick-Step lead out train and being forced to find his own way through the wheels to the finish line. Maybe it’s the ‘cross skills, or maybe it’s his confidence, or maybe it’s just raw talent, but Merlier is someone who knows how to win bike races.</span></p>\n<p><span>“He’s one of the easiest sprinters to work with. I’ve known him since childhood so I know how to be with him. He never says a lot, he just says, you know what to do,” Merlier’s teammate and close friend, Bert van </span>Lerberghe<span>, told <em>Rouleur</em> after the opening stage in the UAE. “We knew we had a strong team at this race and we knew he’s one of the fastest, if not the fastest in the world, I think. When he has the gap, he’s very hard to beat. It’s easy to work with him because even before the sprints he can do some efforts and never gets killed.”</span></p>\n<p><span>Performances like Merlier's today would usually cement his position as any team’s lead sprinter in the biggest bike races in the world. If he can beat a field like that at the UAE Tour with such casual dominance, there is every chance he can do it at races like the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> in a few months’ time. The problem for Merlier lies in his Soudal–Quick-Step’s greatest asset, their prized possession: Remco Evenepoel.</span></p>\n<p><span>Merlier has not been given the chance to start in the Tour de France since 2021 with Alpecin-Deceuninck, when he won stage three of the race after a lead out from his fellow sprinter on the team, Jasper Philipsen. Merlier eventually abandoned that year on stage eight, citing fatigue and “being really on the limit” as his reasons for quitting the race. </span>There has not been another Tour win for the 31-year-old since that career-changing day in Pontivy.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-202web2597696_1024x1024.jpg?v=1708356916\" />This is through no fault of his own, however. First, it was Philipsen being chosen over him to race the Tour when he was at Alpecin-Deceuninck, then, when he moved to Quick-Step, it was the Belgian team backing Fabio Jakobsen to win instead of Merlier. When Jakobsen left Patrick Lefevere's team at the end of last season, it seemed like the path was finally clear for Merlier to have another shot at Tour victory. That was until Soudal–Quick-Step announced that they would be taking a general classification team to the Tour de France with the aim of fully backing world champion Remco Evenepoel for to go for the yellow jersey.</p>\n<p><span>Speaking a few days before his win at the UAE Tour, Merlier, despite being optimistic about his season, outlined his disappointment at his team’s decision.</span></p>\n<p><span>“I’m definitely not going to go,” he said. “Of course I’m a bit [disappointed] but in my mind I needed to directly change to have other plans and motivation. It’s normal [that Soudal–Quick-Step is changing into a GC team]. They want Remco to go for the classification, they will do everything they can to bring him into the top three spots on the podium, or even better.”</span></p>\n<p><span>Merlier’s happiness at Soudal–Quick-Step is, in part, helped by the fact that this is a team which the Belgian rider has idolised growing up. The self-named ‘Wolfpack’ has a heritage in the one-day races, once utterly dominating the opening part of the season. When you add in the fact that Merlier says his goals this year are to win Monuments and Classics, ahead of Grand Tour stages, his contentment with the Belgian squad makes a little more sense.</span></p>\n<p><span>“When I was a young rider I watched television and I saw Quick-Step, it’s also a company not far from where I live and the service course is there. When you grow up you see that the team is so big – first your dream is to become a pro, then afterwards your dream is to ride for Quick-Step. Also my best friend Bart is here, and I’m lucky he also can do a good lead out,” Merlier explained.</span></p>\n<p><span>When it comes to winning in the Classics, Merlier dreams of victory in those races wearing the Soudal–Quick-Step jersey,</span></p>\n<p><span>“The <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a> might always be a bit too hard for me, But the other races like Gent-Wevelgem, I’m still dreaming about. Like a lot of other riders, I’m also dreaming of Roubaix. I believe it can be possible but a lot of riders also believe in this. If you don’t believe in yourself, then you are already in the wrong mindset,” Merlier said.</span></p>\n<p><span>The question that still remains, however, is how long will Merlier be satisfied with focusing on the one-day races, if he knows he can excel in the bunch finishes of stage races?<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-2022636374_1024x1024.jpg?v=1708357003\" /></span></p>\n<p>If there is any other current sprinter that the Belgian rider is comparable with, it’s Jasper Philipsen – another fast man who can handle climbs and also has the talent and versatility to perform well in the Classics, finishing second at Paris-Roubaix last season. Philipsen utterly dominated the Tour last year, winning four sprint stages, proving that a rider with similar characteristics to Merlier can excel in the modern sprinting landscape which requires riders who can make it through aggressive stages and still pack a punch at the finish. After the UAE Tour win, Merlier remained adamant that his performances this season so far wouldn’t change the mind of Quick-Step’s bosses when it comes to the Tour, however.</p>\n<p><span>“I don’t think this will change anything. I’ll do my own thing and try to have some nice victories, a lot of victories. It isn’t always possible but I can be happy with my third victory already in 2024,” he said. A few days before, he’d reiterated his stance of being satisfied with the Belgian squad: “I'm happy with the team. I still have a contract for next year, but if you ask me the question now, at this moment, if I want to re-sign with the team again, I’d say yes.”</span></p>\n<p><span>And at this moment, we can only take Merlier’s word it that Soudal–Quick-Step, his dream team from Belgium, is home – and home is where the heart is. However, as the likes of Philipsen, Cavendish and Jakobsen compete for Tour de France stage wins this summer, and these are riders that Merlier has repeatedly shown he can beat, could things change? The seasons in cycling move fast, and no sprinter can be sure he’ll hold on to his form for the years to come, so if Merlier is at his prime now, it would make sense for him to utilise that in every way he can. With Tour stage wins comes fame, sponsorship deals and an overall rise in a rider's value.</span></p>\n<p><span>Merlier competing in the Tour de France would also be a positive for the sport as a whole. We expect to see a showdown between the world’s fastest sprinters in that race, and Merlier’s absence in the line-up will surely be felt, especially if he continues to win races as he has done so far in 2024. It’s an embarrassment of riches for Soudal–Quick-Step, but taking Merlier’s word for it, the Belgian team seem to be doing a respectable job of keeping both their sprinter and general classification contender happy. For now…</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f3d24c3beaa17771726d04ecb85ab73b92aa01b32bb06aa8012ba4f771a600ed","category":"Cycling"}