{"title":"Resource partitioning in a novel herbivore assemblage in South America","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14069?af=R","date":1709106011000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/f0987946-6849-4fbb-8e4c-e0bf567fbda4/jane14069-toc-0001-m.png\" alt=\"Resource partitioning in a novel herbivore assemblage in South America\" />\n<p>DNA metabarcoding was used to reveal differences in herbivory strategy among large herbivores at an Argentinian rewilding site. Based on diet composition, we find little evidence for resource competition between species. Instead, recently reintroduced native species and historically introduced non-natives are likely expanding the range of herbivory dynamics in the ecosystem.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nHuman-induced species declines and extinctions have led to the downsizing of large-herbivore assemblages, with implications for many ecosystem processes. Active reintroduction of extirpated large herbivores or their functional equivalents may help to reverse this trend and restore diverse ecosystems and their processes. However, it is unclear whether resource competition between native and non-native herbivores could threaten restoration initiatives, or to what extent (re)introduced species may influence local vegetation dynamics.\n\nTo answer these questions, we investigated the diets of a novel South American herbivore assemblage that includes resident native species, reintroduced native species and introduced non-native species. We examined plant composition, diet breadth and the overlap between species to describe the local herbivory profile and the potential for resource competition.\n\nUsing DNA metabarcoding on faecal samples (<i>n</i> = 465), we analysed the diets of the herbivore assemblage in the Rincón del Socorro rewilding area of Iberá National Park, Argentina. We compared the species richness of faecal samples, the occurrence of plant families/growth forms and the compositional similarity of samples (inter- and intraspecifically).\n\nOur results indicate species-level taxonomic partitioning of plant resources by herbivores in this system. Differences in sample richness, composition and diet breadth reflected a diverse range of herbivory strategies, from grazers (capybara) to mixed feeders/browsers (brocket deer, lowland tapir). Differences in diet compositional similarity (Jaccard) revealed strong taxonomic resource partitioning. The two herbivores with the most similar diets (Pampas deer and brocket deer) still differed by more than 80%. Furthermore, all but one species (axis deer) had more similar diet composition intraspecifically than compared to the others.\n\nOverall, we found little evidence for resource competition between herbivore species. Instead, recently reintroduced native species and historically introduced non-natives are likely expanding the range of herbivory dynamics in the ecosystem. Further research will be needed to determine the full ecological impacts of these (re)introduced herbivores. In conclusion, we show clear differences in diet breadth and composition among native, reintroduced and non-native herbivore species that may be key to promoting resource partitioning, species coexistence and the restoration of ecological function.\n</p>\n<h2>Resumen</h2>\n<p>\n\nLa disminución y extinción de especies ocasionada por el hombre ha llevado a la reducción de tamaño de las comunidades de grandes herbívoros, con implicaciones para muchos procesos ecosistémicos. La reintroducción activa de grandes herbívoros extirpados, o sus equivalentes funcionales, puede ayudar a revertir esta tendencia y restaurar diversos ecosistemas y sus procesos. Sin embargo, no está claro si la competencia por recursos entre herbívoros nativos y no nativos podría amenazar las iniciativas de restauración, o en qué medida las especies (re)introducidas pueden influir la dinámica de la vegetación local.\n\nPara responder a estas preguntas, investigamos las dietas de una comunidad de herbívoros sudamericanos que incluye especies nativas, especies nativas reintroducidas y especies no nativas introducidas. Examinamos la composición de plantas, la amplitud de la dieta y la superposición entre especies para describir el perfil herbívoro local y el potencial de competencia por los recursos.\n\nUtilizando metabarcoding de ADN en muestras fecales (<i>n</i> = 465), analizamos las dietas de la comunidad de herbívoros en el sitio de rewilding Rincón del Socorro dentro del Parque Nacional Iberá, Argentina. Comparamos la riqueza de especies en las muestras fecales, la ocurrencia de familias de plantas/formas de crecimiento y la similitud en la composición de las muestras (interespecíficamente e intraespecíficamente).\n\nNuestros resultados indican la partición taxonómica a nivel de especie de los recursos vegetales por parte de los herbívoros en este sistema. Las diferencias en la riqueza de las muestras, la composición y la amplitud de las dietas reflejaron una amplia gama de estrategias de herbivoría, desde pastoreadores (capibara) hasta herbívoros mixtos/ramoneadores (corzuela, tapir amazónico). Las diferencias en la similitud de la composición de la dieta (Jaccard) revelaron una fuerte partición taxonómica de los recursos. Los dos herbívoros con las dietas más similares (venado de las pampas y corzuela), aún así diferían en más del 80%. Además, todas las especies menos una (ciervo axis) tenían una composición dietética más similar intraespecíficamente que en comparación con las demás.\n\nEn general, encontramos poca evidencia de competencia por recursos entre las especies de herbívoros. En cambio, las especies nativas reintroducidas recientemente y las no nativas introducidas históricamente probablemente estén ampliando el rango de dinámica de herbivoría en el ecosistema. Se necesitarán más investigaciones para determinar todos los impactos ecológicos de estos herbívoros (re)introducidos. En conclusión, mostramos diferencias claras en la amplitud y composición de la dieta entre especies de herbívoros nativas, reintroducidas y no nativas que pueden ser clave para promover la partición de recursos, la coexistencia de especies y la restauración de las funciones ecológicas.\n</p>","author":"Julia C. Mata, \nCharles W. Davison, \nTobias Guldberg Frøslev, \nRobert Buitenwerf, \nJens‐Christian Svenning","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"f3eb1d4ede1cef0332f5536f9d9b608ed4570845da980eb32334d333b3c9c46b","category":"Environment"}