{"title":"Limited waterpower contributed to rise of steam power in British “Cottonopolis”","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae251/7713928?rss=1","date":1721088000000,"content":"<span><div>Abstract</div>The Industrial Revolution precipitated a pivotal shift from waterpower to coal-fueled steam power in British textile mills. Although it is now widely accepted that steam was chosen to power factories despite the availability of sufficient waterpower resources across most of Britain, the location and suitability of that waterpower during the early 19th century remain underexplored. Here, we employ quantitative fluvial geomorphology alongside historical climate data, factory records, and a catalog of over 26,000 mill sites to reveal that waterpower was abundant for most of early 19th century Britain, except in the central hub of British cotton production: Greater Manchester in the Mersey Basin. Our findings show that surging factory mechanization and overcrowding on key waterways in the Mersey Basin compounded waterpower scarcity arising from a drier 19th century climate. Widespread adoption of coal-fueled steam engines in certain key industrial centers of Britain was a strategy aimed at ameliorating some of the reduced reliability of waterpower. The fact that steam engines were frequently used in water-powered factories in many industrial regions until the third quarter of the 19th century to recirculate water to provide that power, or as a power supplement when waterpower availability was restricted, adds further weight to our argument. Rapid adoption of coal-powered steam engines reshaped the social and structural landscape of industrial work, firmly established Britain's prominence as an industrial powerhouse, and had lasting global industrial and environmental impacts.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"f3efe3fb056777a77ece0364f5b670da935595440b9b398f66602861688a59b6","category":"Interdisciplinary"}