{"title":"HMGR and CHS gene cloning, characterizations and tissue-specific expressions in <i>Polygala tenuifolia</i> Willd","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300895","date":1711375200000,"content":"<p>by Yang Liu, Xiaofang Ma, Fuying Mao, Jinmiao Qiu, Jingyi Bi, Xiaowei Li, Xian Gu, Yuguang Zheng, Yunsheng Zhao</p>\r\n\r\nTriterpenoid saponins and flavonoids have several pharmacological activities against <i>P</i>. <i>tenuifolia</i>. The 3-hydroxy-3-methylglutaryl-CoA reductase (HMGR) and chalcone synthase (CHS) are the rate-limiting enzymes of triterpenoid saponin and flavonoid biosynthesis, respectively. In this study, HMGR and CHS genes were cloned from <i>P</i>. <i>tenuifolia</i>, and their bioinformatics analyses and tissue-specific expression were investigated. The results showed that the HMGR and CHS genes were successfully cloned, separately named the PtHMGR gene (NCBI accession: MK424118) and PtCHS gene (NCBI accession: MK424117). The PtHMGR gene is 2323 bp long, has an open reading frame (ORF) of 1782 bp, and encods 593 amino acids. The PtCHS gene is 1633 bp long with an ORF of 1170 bp, encoding 389 amino acids. PtHMGR and PtCHS were both hydrophobic, not signal peptides or secreted proteins, containing 10 conserved motifs. PtHMGR and PtCHS separately showed high homology with HMGR and CHS proteins from other species, and their secondary structures mainly included α-helix and random curl. The tertiary structure of PtHMGR was highly similarity to that the template 7ULI in RCSB PDB with 92.0% coverage rate. The HMG-CoA-binding domain of PtHMGR is located at 173–572 amino acid residues, including five bound sites. The tertiary structure of PtCHS showed high consistency with the template 1I86 in RCSB PDB with 100% coverage rate, contained malonyl CoA and 4-coumaroyl-CoA linkers. The expression of PtHMGR and PtCHS is tissue-specific. PtHMGR transcripts were mainly accumulated in roots, followed by leaves, and least in stems, and were significantly positively correlated with the contents of total saponin and tenuifolin. PtCHS was highly expressed in the stems, followed by the leaves, with low expression in the roots. PtCHS transcripts showed a significant positive correlation with total flavonoids content, however, they were significantly negatively correlated with the content of polygalaxanthone III (a type of flavonoids). This study provided insight for further revealing the roles of PtHMGR and PtCHS.","author":"Yang Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f3f88e65e4a9f6452006539b32977fef3adad3d3f4a57d2308fd8ab7aedecda2","category":"Interdisciplinary"}