{"title":"An Alabama lawmaker just wants NASA to fly SLS, doesn’t care about payloads","link":"https://arstechnica.com/?p=1780719","date":1626467341000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/NHQ201910180011_large-800x478.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/NHQ201910180011_large.jpg\">Enlarge</a> <span>/</span> Rep. Robert Aderholt, R-Ala., is seen at NASA headquarters in 2019. (credit: NASA)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The US House Appropriations Committee passed a budget bill for NASA on Thursday, and it's generally good for the space agency. The legislation provides $25.04 billion, and it funds most of NASA's top spaceflight priorities, including the Artemis Moon program.</p>\n<p>Notably, the bill appropriates $1.345 billion for a Human Landing System as part of the Artemis Program. And although some House members grumbled during hearings this week about <a href=\"https://arstechnica.com/science/2021/04/nasa-selects-spacex-as-its-sole-provider-for-a-lunar-lander/\">NASA's decision in April</a> to select SpaceX as the sole provider of the first demonstration landing, the legislation does not block NASA from moving forward with the contract.</p>\n\n<p>As part of its plan to return humans to the Moon, NASA has sought to balance its reliance on traditional space contractors such as Boeing and Lockheed Martin—generally favored by members of Congress due to their largesse in political donations and willingness to spread jobs across numerous districts—and new space companies such as SpaceX that deliver more bang for the buck while not playing as well with elected officials.</p></div><p><a href=\"https://arstechnica.com/?p=1780719#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780719&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f40198bdadfce411d55c6b53f0a07333f5d2058f886b180a79a3e1fddbe135a1","category":"Tech"}