{"title":"All-new Vittoria Syerra is the first official downcountry mountain bike tyre","link":"https://www.bikeradar.com/news/vittoria-syerra-tyre/","date":1633690824000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/10/Vittoria-Syerra-DWN-CNTRY-Graphene-downcountry-mountain-bike-tyre-1-fa1ed5d.jpg?quality=45&amp;resize=620,413\" />                                            <p>Vittoria’s new Syerra mountain bike tyre has a downcountry-specific design. Its tread pattern, casing, and compound are tailored to meet the more rigorous requirements of the now well-established <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-downcountry-mountain-bikes/\" target=\"_blank\">downcountry</a> discipline.</p>\n<p>By blending the lightweight speed needed for cross country and a more aggressive, grippier tread pattern and compound, along with a tougher casing for trail riding, Vittoria hopes they’ve created a no-compromise performer.</p>\n<p>Retailing for £59.95 / $77.99 / €60.95, the 29in-only tyre is available in a single 2.4in wide option and will be available to buy late November 2021.</p>\n<h2>Vittoria Syerra downcountry mountain bike tyre details</h2>\n<p>The Syerra has a host of technology borrowed from the brand’s other rubber, including the 4C Graphene compound, a 60TPI (threads per inch) casing, and Anti-Pinch Flat Insert (APF), topped off with an aggressive, widely spaced tread pattern.</p>\n<h3>Vittoria Syerra 4C Graphene rubber compound</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Graphene – according to Vittoria – is a wonder material that can improve the tyre’s performance in all directions from more grip to lower rolling resistance.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>Graphene is used in Vittoria’s tyre range – including the <a href=\"https://www.bikeradar.com/reviews/components/tyres/mountain-bike-tyres/vittoria-mazza-2-4-x-29-graphene-2-0-4c-tyre-review/\">Vittoria Mazza</a> I reviewed last year – to create, the brand hopes, a silver bullet of performance.</p>\n<p>Graphene is carbon-based material that’s a single atom thick. It is one of the strongest materials known to man with great heat and electricity conduction properties and can be used in a host of applications.</p>\n<p>In the case of Vittoria’s tyres, it is blended with the rubber compound and is claimed to improve and extend the tyre’s capabilities in all directions of performance. For example, thanks to graphene, Vittoria says their tyres will not only be grippier, but also roll faster, and have better chemical and mechanical traction.</p>\n<p>The tyre has four compounds of rubber; the shoulder knobs are made from grippier trail-focused rubber, while the central blocks are constructed from faster-rolling cross country compounds.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> It has a round profile, and has been built about 30mm internal-width rims.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>Within the knobs are two compound types – the internal compound is stiffer to provide stability to the blocks while the outer compound is softer and tackier, giving the tyre its mechanical and chemical grip.</p>\n<p>Vittoria did state the graphene additive is only present in one of the top – softer – compounds of the tyre.</p>\n<h3>Vittoria Syerra tyre tread pattern</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The central blocks feature steps instead of ramps. Vittoria says this is to improve grip and rolling efficiency.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>Vittoria told me the Syerra’s tread pattern has been tailored to the needs of downcountry riding thanks to an aggressive tread profile, widely-spaced knobs, and siping designed to control the deformation of the blocks.</p>\n<p>The centre blocks have a stepped, not ramped, shape, and are directional to improve rolling efficiency. Each of the blocks features siping, and despite being angular in design, are low in profile. The siping and angular nature of the blocks improves grip because the tyre has more edges to bite into the terrain, according to Vittoria.</p>\n<p>The shoulder knobs are larger and widely spaced. This, Vittoria said, will create more cornering grip.</p>\n<p>Blending these two types of tread pattern is one of the steps Vittoria has taken to make the tyre downcountry specific.</p>\n<h3>Vittoria Syerra tyre casing</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Vittoria ‘hotpatch’ is a new approach to tyre graphic design for the brand.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>The single-ply 60TPI casing the Syerra uses is thicker than a standard 120TPI casing traditionally in cross-country applications. Vittoria claims that because the tyre’s casing is thicker than that usually used on XC rubber – because it has fewer threads per inch, the material is thicker – this makes the carcass more supple and lighter for its corresponding strength.</p>\n<p>How supple the carcass is also affects rolling performance. If the carcass is supple it is able to able to absorb bumps in the trail, helping improve rolling speed. Vittoria said they’ve designed the Syerra’s carcass to be supple so that rolling speeds on rough ground are improved.</p>\n<p>The sidewall is fitted with an APF insert. This is a “high-tech rubber material” that helps reduce the chances of a pinch flat – where the tyre’s sidewall is compressed against the rim, causing a puncture – and also helps reduce lateral deflection, improving stability.</p>\n<p>Finally, it has an aramid foldable bead that’s claimed to help keep the tyre seated properly.</p>\n<p>Vittoria recommends using their Air-Liner inserts to improve performance, and they also state that tyre pressures should be fairly low for the Syerra, recommending around 17psi for the front, and 20psi in the rear for average riders.</p>\n<p>Vittoria claims the 29×2.4in Syerra weighs 850g. Unfortunately, I was unable to weigh a set myself to verify this.</p>\n<h2>Who is the Vittoria Syerra downcountry tyre designed for?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The side knobs are more aggressive than the centre ones, providing cornering grip.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>Vittoria told us the Syerra is designed for cross-country riders who like to push the limits, riding gnarlier terrain at higher speeds. It’s also suitable for riders who want to do a bit of everything; from cross country and trail, to trail centre loops.</p>\n<p>These types of riders embody the spirit of downcountry – a term first coined by Mike Levy at PinkBike – and if that sounds like you, Vittoria told us the Syerra should be suitable.</p>\n<h2>Vittoria Syerra downcountry mountain bike tyre models, price, and availability</h2>\n<p>The Syerra is available in a single 29in diameter and 2.4in width. It has a single tread pattern suitable for both front and rear applications. It will retail for £59.95 / $77.99 / €60.95 and will be available to buy from late November 2021.</p>\n<h2>Vittoria Syerra downcountry mountain bike tyre initial ride impressions</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Large clear branding is a deliberate choice by Vittoria.</span></figcaption><span> <i>Alex Evans</i></span></div>\n<p>I was lucky enough to ride the Syerra at the <a href=\"https://www.bikeradar.com/features/routes-and-rides/britains-best-blue-trail/\" target=\"_blank\">Glentress trail centre</a> in Scotland’s Tweed Valley. The tyres were fitted to <a href=\"https://www.bikeradar.com/news/2022-scott-spark-rc-spark-900/\" target=\"_blank\">Scott’s 2021 Spark RC Team Issue AXS</a> bike I briefly tested earlier this year.</p>\n<p>While I managed to ride my home trails I am very familiar with, I didn’t have access to any other tyres to make back-to-back comparisons with, and I only spent an hour riding the tyres.</p>\n<p>Initial testing revealed the Syerra to be incredibly fast-rolling on hardpack trail centre terrain, with plenty of grip on dry-to-damp surfaced ground. As I leaned over in turns, I could feel and hear the knobs biting as they chewed at the terrain.</p>\n<p>Lean angles before the tyre broke traction were high, especially on the trail centre surface. They provided slightly less traction on the infrequently encountered (on this ride) larger, slicker rocks and damp roots, with some slipping.</p>\n<p>Carcass strength was good, but helped massively by the pre-installed inserts. Although at the pressures recommended by Vittoria – 17psi front, 20psi rear – I found there was plenty of squirm when pushed hard in turns. Impressively, however, the bead didn’t unseat and no air was lost.</p>\n<p>I would personally liked to have run more air in the tyre, and would have done so given more time to test.</p>\n<p>My colleagues <a href=\"https://www.bikeradar.com/author/robinweaver/\" target=\"_blank\">Robin Weaver</a> and <a href=\"https://www.bikeradar.com/author/tommarvin/\" target=\"_blank\">Tom Marvin</a> are getting a set of Syerras to test over the coming months, so watch this space for more a detailed review on more varied terrain.</p>\n<p> </p>","author":"Alex Evans","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f4089a5065fcdf7a08023433454583785f45764f9ee766bb2d15569ba2d03471","category":"Cycling"}