{"title":"Sodium Chloride Tolerance during Germination and Seedling Stages of Tomato (Solanum lycopersicum L.) Lines Native to Mexico","link":"https://www.preprints.org/manuscript/202312.0538/v2","date":1713853045000,"content":"Tomato is considered moderately sensitive to salinity, which detracts from the quality and yield of its fruit; therefore, wild populations have been used as a genetic resource. The aim of this research was to identify lines derived from wild tomato populations with tolerance to salinity during the germination and seedling stages. During germination, 52 wild lines and 2 commercial hybrids (Imperial®, Reserva®) were subjected to 150 mM and 0 mM NaCl and evaluated. The test was carried out for 20 days in a germination chamber with constant darkness, temperature of 25±2 °C and relative humidity of 80±4%. At the seedling stage, 22 wild tomato lines with the best performance in the germination test and 2 commercial hybrids (Imperial®, Topanga®) were evaluated for 12 days in a floating raft system. Concentrations of 175 mM and 0 mM NaCl were used. During germination, the saline condition decreased germination percentage (65.2%), speed of germination (88.2%), steam length (72.5%), root length (46.56%), normal plants number (59.5%), stem dry matter (68.78%), root dry matter (61.99%), and total dry matter (67.1%). At the seedling stage, this condition decreased (P&lt;0.05) the aerial part dry matter (46.37%), leaf area (59.35%), root length (42.43%), final plant height (40.24%), and growth rate (71.42%). Seventeen tolerant genotypes were identified at one of both developmental stages, while one genotype showed tolerance at both stages. These results indicate that there are different response mechanisms in each developmental stage. Native tomatoes play an important role in the identification of tolerant genotypes since they can be used as genetic resources for obtaining commercial genotypes with salt tolerance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f40eb5d2b6f2a99496041d154462b423ada4c128e73e9e234119d59f475e3ba7","category":"Interdisciplinary"}