{"title":"WhatsApp Users Can Now Save Disappearing Messages If the Sender Consents","link":"https://www.macrumors.com/2023/04/21/save-disappearing-messages-whatsapp/","date":1682069590000,"content":"WhatsApp has announced a new option for disappearing messages conversations that lets recipients keep individual messages if the sender approves the request. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/whatsapp-save-disappearing-message.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\n\"Keep in Chat\" enables users to long press a disappearing message and ask to keep it, which sends a notification to the sender: \"Someone kept your message so they can refer back to it.\" The sender can then either allow the save to go ahead or veto the request. \r<br />\n\r<br />\nFrom WhatsApp's <a href=\"https://blog.whatsapp.com\">blog post</a>:\r<br />\n<blockquote>Today we're introducing \"Keep in Chat,\" so you can hang on to texts you need for later, with a special superpower for the sender. We believe if you've sent the message, it's your choice whether others in the chat can keep it for later.</blockquote>WhatsApp says that if a user decides their message can't be kept by others, their decision is final – no one else can keep it and the message will be deleted when the timer expires. \r<br />\n<ul><li><a href=\"https://www.macrumors.com/how-to/enable-disappearing-messages-whatsapp/\">How to Enable Disappearing Messages in WhatsApp</a></li></ul>\r<br />\nIf a recipient asks to save a disappearing message and the sender allows it, the message gets a bookmark icon to indicate that it can be found in the user's kept messages folder, which is organized by chat.\r<br />\n\r<br />\nWhatsApp says the feature is rolling out globally in the next few weeks.<div>Tag: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/21/save-disappearing-messages-whatsapp/\">WhatsApp Users Can Now Save Disappearing Messages If the Sender Consents</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/whatsapp-users-can-now-save-disappearing-messages-if-the-sender-consents.2387393/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f4112da7e9a9785dcfc6df378801a142d3324138fe18f08eb487f991b13a9fa7","category":"Apple"}