{"title":"Canva เปิดตัว Magic Studio ชุดเครื่องมือสร้างสรรค์และจัดการคอนเทนต์ด้วยพลัง AI","link":"https://www.blognone.com/node/136073","date":1696429937000,"content":"<div><div><div><p>Canva ฉลองครบรอบ 10 ปี เปิดตัว <strong>Magic Studio</strong> ชุดเครื่องมือสร้างสรรค์งานที่ใช้พลัง AI มาช่วยสำหรับงานทุกรูปแบบจบภายในเครื่องมือเดียว ที่ Canva บอกว่าไม่ต้องสลับย้ายไปมาสำหรับแต่ละงาน</p>\n<p>ฟีเจอร์ที่มีใน Magic Studio ไม่ได้มีแค่งานสร้างสรรค์ แต่ยังรวมถึงทุกขั้นตอนในการสร้างคอนเทนต์ ช่วยปรับปรุงและลดเวิร์กโฟลว์ให้กับผู้ใช้งาน ตัวอย่างเช่นฟีเจอร์ Magic Switch เครื่องมือแปลงคอนเทนต์ให้เหมาะกับฟอร์แมตที่แตกต่างกัน เช่น แปลงเนื้อหาขนาดยาว ให้เป็นเอกสารสรุป หรือ บล็อกสำหรับโพสต์ หรือในฟอร์แมตอื่น เช่น โพสต์สตอรี่ลง Instagram ก็รองรับเช่นกัน</p>\n<p>ตัวอย่างฟีเจอร์สำหรับงานแต่งภาพ เช่น Magic Grab ที่แยกวัตถุในภาพสำหรับแก้ไขปรับตำแหน่ง, Magic Expand แต่งภาพที่ขยายพื้นที่ออกมา, Magic Edit เพิ่ม แก้ไขภาพ ด้วย prompt สั้น ๆ นอกจากนี้ยังมีฟีเจอร์สำหรับสร้างรูปภาพจากข้อความ (Text to Image) ใน Magic Media ที่สามารถสร้างสรรค์งานออกมาได้ถึงระดับวิดีโอขนาดสั้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/d0f20826e984ae3d1e0fed303083f3fd.png\" /></p>\n<p>ฟีเจอร์พื้นฐานใน Magic Studio ยังมีอีกมาก เช่น งานแก้ไขคอนเทนต์ข้อความ, สร้างภาพเคลื่อนไหวในเอกสารนำเสนอ ผู้ใช้งานยังสามารถเพิ่มเครื่องมือ AI จากผู้พัฒนารายอื่นผ่าน Canva app marketplace ได้อีกด้วย</p>\n<p>Magic Studio เปิดให้ใช้งานสำหรับผู้ใช้ Canva ทุกคนตั้งแต่วันนี้ โดยบางฟีเจอร์จะจำกัดเฉพาะผู้ใช้งาน Canva Pro ขึ้นไป</p>\n<p>ที่มา: <a href=\"https://www.canva.com/newsroom/news/magic-studio/\">Canva</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/canva\">Canva</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/llm\">LLM</a></div><div><a href=\"/topics/image-editing\">Image Editing</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f4200f6fa670d6d2e52e00430fc6df4c867a19ce86b76d8f8391d68bfc98bc9c","category":"Thai"}