{"title":"Alternate bearing in ‘Hass’ avocado: fruit load-induced changes in bud auxin homeostasis are associated with flowering repression","link":"https://academic.oup.com/jxb/article/75/18/5717/7714465?rss=1","date":1721088000000,"content":"<span><div>Abstract</div>In ‘Hass’ avocado (<span>Persea americana</span>), fruit presence reduces next season flowering. Recent fruit tree studies proposed that heavy fruit load (HFL) generates an auxin (indole-3-acetic acid, IAA) signal in the buds that represses flowering. However, the nature of this signal remains unknown. Here, we investigated the effect of avocado HFL on bud IAA accumulation and flowering transition. We found that IAA–aspartate and IAA–glutamate conjugate levels were significantly higher in buds from fully loaded (‘on’) than low-loaded (‘off’) trees, hinting that free IAA levels were higher in the former. Expression analysis showed that coinciding with flowering reduction, HFL induced the floral repressor <span>PaTFL1</span>, and suggested that accumulation of IAA in buds as imposed by HFL was associated with its conjugation to aspartate and glutamate and resulted both from <span>de novo</span> IAA synthesis and from reduced IAA export. Accordingly, experiments involving radiolabelled [<sup>14</sup>C]IAA demonstrated that HFL reduced shoot basipetal IAA transport. Finally, we confirmed the negative effects of IAA on flowering, showing that IAA and polar auxin transport blocker (2,3,5-triiodobenzoic acid) treatments delayed ‘off’ trees’ inflorescence development, reducing their inflorescence axis and inducing <span>PaTFL1</span> expression. Together, our data indicate that avocado HFL generates IAA signalling in buds that induces <span>PaTFL1</span>, leading to repression of inflorescence development.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"f422c99fa9e6c52b14ce44d0bbe44ba7855a637f9cd278c6b43f549cf1420b56","category":"Environment"}