{"title":"เผื่อใครมองไม่ออก เทียบความต่าง iPhone 12 vs iPhone 13","link":"https://www.blognone.com/node/124789","date":1631769874000,"content":"<div><div><div><p>จากงาน Apple Event เปิดตัว iPhone 13 ที่ดูเผินๆ เหมือนไม่ค่อยมีอะไรแตกต่างจาก iPhone 12 อย่างเห็นได้ชัดนัก เพราะแอปเปิลยังคงดีไซน์เดิมไว้ แต่ถ้ามาเพ่งดูดีๆ จะเห็นว่าหน้าตาภายนอกมีการปรับเปลี่ยนอยู่บ้าง ที่ชัดที่สุดคือ รอยบากที่เป็นเอกลักษณ์บนหน้าจอ เล็กกว่า iPhone 12 ราวๆ 20% ตัวขอบจอบางลง (นิดเดียวจริงๆ)</p>\n<p>พลิกมาด้านหลังกล้อง มีการเปลี่ยนเลย์เอาท์เสนส์กล้องใหม่ โดย iPhone 13 ทั้งรุ่นธรรมดาและ mini ตัวเลนส์กล้องวางในแนวทแยงมุม ต่างจาก iPhone 12 ที่วางเป็นแนวตั้ง ส่วนเลย์เอาท์กล้อง iPhone 13 Pro และ Pro Max ยังคงยึดเลย์เอาท์เดิม</p>\n<p>มาดูฝั่งสีกันบ้าง iPhone 13 (เฉพาะตัว iPhone 13 Pro และ Pro Max) เพิ่มสีฟ้าเฉดใหม่ Sierra Blue เป็นสีฟ้าโทนหวาน พาสเทล ซึ่งสีนั้นเป็นอีกปัจจัยที่ดึงดูดให้คนซื้อ iPhone มาใช้กัน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a1c1d5ce069359f9e98aff460eeb7b16.jpg\" /></p>\n<p>สิ่งที่อัพเกรดขึ้นจาก iPhone 12 คือสเปกและความสามารถใหม่ๆ ที่เด่นๆ คือ</p>\n<ul>\n<li>เทคโนโลยี ProMotion ปรับความถี่การไถหน้าจอให้อัตโนมัติ สามารถปรับความถี่ได้ตั้งแต่ 10Hz ไปจนถึง 120Hz</li>\n<li>ชิปใหม่ A15 Bionic ที่โครงสร้างหลักของชิปยังเหมือนเดิมกับของ A14 Bionic แต่เพิ่มเติมเฉพาะ iPhone 13 Pro จะได้จีพียู 5 คอร์ที่ถือเป็นรุ่นท็อปของ A15 แต่ iPhone 13 และ mini ยังคงเป็น GPU 4-Core</li>\n<li>ตัวกล้องรองรับการถ่ายวิดีโอแบบ Cinematic Mode ทำหน้าชัดหลังเบลอได้ ถ่ายวิดีโอแบบ ProRes ได้ด้วย เหมาะสำหรับคนที่อยากใช้ iPhone ถ่ายหนัง</li>\n<li>ความอึดของแบตเตอรีในซีรีส์ 13 โดยรวมอึดกว่าซีรีส์ 12</li>\n<li>ความจุเริ่มต้นที่ 128GB ไปเลย และดันความจุสูงสุดได้ถึง 1TB สำหรับรุ่น  iPhone 13 Pro และ Pro Max  ต่างจาก iPhone 12 ที่เริ่มความจุที่ 64 GB</li>\n<li>ส่วนราคา <a href=\"https://www.blognone.com/node/124753\">พบว่า iPhone 13 ราคาไทย รุ่นปกติ ความจุเดิม ราคาถูกลง แต่รุ่น Pro แพงขึ้นทุกความจุ</a></li>\n</ul>\n<p>สามารถกดดูรูปเทียบความแตกต่างได้จากอัลบั้ม Facebook ด้านล่าง</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/iphone-13\">iPhone 13</a></div><div><a href=\"/topics/iphone-12\">iPhone 12</a></div><div><a href=\"/topics/apple\">Apple</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f42fa23596c43b979c11124c01ec8079a733cf0bc78fe00bd9641471f8c2d6e7","category":"Thai"}