{"title":"Preview: Simac Ladies Tour","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/preview-simac-ladies-tour","date":1629734200000,"content":"\n      <p>The third stage race of the 2021 Women’s WorldTour, the Simac Ladies Tour, kicks off tomorrow (24th August) in Holland. The five-day race is the longest WWT stage race so far this year but will feel relatively short to those who raced the 10-day 2.Pro Giro Rosa in July.</p>\n<div></div>\n<p><span>The list of past winners of the Simac Ladies Tour reads like a who’s who of the legends of women’s cycling, with </span><span>Leontien van Moorsel, Kristin Armstrong, Evelyn Stevens, and Annemiek van Vleuten all having claimed the overall title in the past. Marianne Vos has won four editions of the race while the most recent winner, in 2019, was Christine Majerus. </span></p>\n<p><span>One of the oldest women’s stage races on the calendar, the Simac Ladies Tour went by the name Holland Ladies Tour from when it was first held in 1998, before changing names due to sponsorship. It eventually became the Boels Rentals Ladies Tour before changing to its new title for 2021.</span></p>\n<p><span>The race survived a period of contraction that saw many of the longest women’s stage races fold. Before the early 2000s, the women’s peloton contested multiple races spanning 10 days or more, including the 17-day</span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/true-grit-ore-ida\"><span> Ore Ida Women’s Challenge which ran from 1984 until 2002</span></a><span>. Now, the Simac Ladies Tour is just one of just five stage races on the Women’s WorldTour calendar in 2021, all of which are raced over six stages or less. </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-womens-calendar-2021-the-rouleur-racing-guide\">Related: Women's WorldTour Calendar 2021 – The Rouleur Racing Guide</a></strong></em></p>\n<h3><strong>2021 Simac Ladies Tour stages</strong></h3>\n\n<p><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1172924089_1024x1024.jpg?v=1629731916\" />Christine Majerus, winner of 2019 Boels Rental Ladies Tour (Image credit: Luc Claessen/Getty/Stringer)</em></p>\n<p><strong>Prologue Tuesday August 24 Ede | 2.4 km </strong></p>\n<p>The race will begin with a 2.4km prologue around Ede which will suit powerful riders rather than all-out time triallists. This will be the opportunity for sprinters to put themselves into GC contention. </p>\n<p><strong>Stage 1: Wednesday August 25 Zwolle - Hardenberg | 134.4 km </strong></p>\n<p>Winds could dictate the day on this flat stage, so sprint teams will need to be wary of that possibility if they want the race to come down to a bunch kick. If a group manages to sneak away it could be heartbreak once again for the fast finishers and cause an early GC shake up. </p>\n<p><strong>Stage 2: Thursday August 26 Gennep (Individual Time Trial) | 17km</strong></p>\n<p>More suited to time-trial specialists than the shorter prologue, this stage could make all the difference to the general classification. At 17km, it is still relatively short for a time-trial, but still long enough to cause time gaps to open up and could prove decisive. </p>\n<p><strong>Stage 3: Friday August 27 Stage 4 Stramproy-Weert | 125.9 km</strong></p>\n<p>Another sprint stage in which wind could play a role. As before, the sprint teams will need to work as one to ensure the peloton stays together to the line and prevent gaps opening up if the wind does make an appearance. </p>\n<p><strong>Stage 4: Saturday August 28 Stage 5 Geleen-Sweikhuizen | 148.9 km </strong></p>\n<p>Stage four is a punchy circuit race that could see a breakaway take hold. If whoever is in the lead on GC at this stage isn’t wary then this could favour chance escapees as we saw in the Tour of Norway who could well run away with the jersey. </p>\n<p><strong>Stage 5: Sunday August 29 Stage 6 Arnhem 149.4km </strong></p>\n<p>The final stage of the race will feature 19 laps of a flat, technical circuit around Arnhem which will see some fast racing and another possible sprint finish to round off the tour.  </p>\n<h3><strong>Contenders</strong></h3>\n<p><span>The flat nature of the parcours means that the startlist is studded with some of the top sprinters and rouleurs in the peloton who will be looking to claim a prestigious WorldTour win. This year’s race also features two time trial stages; a 2.4km prologue and a 22.2km individual time trial meaning those who excel against the clock will have an advantage for the overall. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1326940886-_1_1024x1024.jpg?v=1629731361\" /><em>Marianne Vos wins stage of Giro d'Italia Donne (<span>Image: Getty)</span></em></span></p>\n<p><span>For many riders, this is their first race since the Olympic Games last month. Amongst those jumping back into the peloton after a short post-Tokyo break are <strong>Kasia Niewiadoma</strong> (Canyon//SRAM) , <strong>Marianne Vos</strong> (Jumbo-Visma), and <strong>Demi Vollering</strong> (SD Worx). It’s difficult to judge whether these riders will be targeting the overall or simply building their form back up for the World Championships, although as a climber it’s fair to say that Niewiadoma might be playing more of a team role at this race for the likes of Alice Barnes. </span></p>\n<p><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/opinion-marianne-vos-has-made-history-this-week-let-s-shout-about-it\">Related: Opinion – Marianne Vos made history last week, let's shout about it</a></strong></p>\n<p><span>The sprinters were denied their chances on stages one and two of the Tour of Norway earlier this month as Kristen Faulkner and Riejanne Markus took solo victories from breakaways. At this race sprint teams will be looking to make sure the bunch is all together at the line when it’s time for their sprinters to unleash their speed. The battle between <strong>Emma Norsgaard</strong> and <strong>Lorena Wiebes</strong> looks set to continue however the pair have new competition in the form of Tour of Norway stage winner <strong>Chloe Hosking</strong> who is back in the peloton and back on top. <strong>Alice Barnes</strong> of Canyon//SRAM also poses a threat from a bunch finish. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1334276895_1024x1024.jpg?v=1629300243\" /><em>Chloe Hosking wins stage 4 of Ladies Tour of Norway (Image: Getty)</em></span></p>\n<p><span>Other sprinters on the radar include<strong> Amalie Dideriksen</strong>, <strong>Kirsten Wild</strong>, and Dutch national champion <strong>Amy Pieters</strong> who have pivoted from track to road post-Tokyo and will be on flying form after the Games.</span></p>\n<p><span>Tokyo time-trial silver medallist <strong>Marlen Reusser</strong> will go into stage two’s TT as the undisputed favourite. Whoever posts the fastest time on that stage may well secure the overall if breakaways don’t force too many time gaps on the road stages. </span></p>\n<p><span>Elsewhere, look out for <strong>Marta Bastianelli</strong> who has proven to be on good form lately, taking a win and a second place in two 1.2 races in France earlier this month. On the Continental side, Ceratizit-WNT’s fast-finisher <strong>Maria Giulia Confalonieri</strong> and Valcar Travel and Service’s <strong>Elisa Balsamo</strong> will likely make their mark amongst the World Tour riders in bunch sprints.</span></p>\n<p><span>Other notable riders include DSM’s<strong> Megan Jastrab</strong> who will be making her debut with the team.</span></p>\n<p><em><span>The last 90 minutes of each stage will be shown on Eurosport/GCN+ daily from 13:00 CEST.</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f444b0bfe9a1aa2ace855342dcbf34b20f8449065a089999a5cac8b367ff46e4","category":"Cycling"}