{"title":"Disposable diaper consumption in sub-Saharan Africa: Estimating the risks of associated unsafe waste","link":"https://journals.plos.org/sustainabilitytransformation/article?id=10.1371/journal.pstr.0000106","date":1713276000000,"content":"<p>by Mair L. H. Thomas-Possee, Peter J. Shaw, Robert E. S. Bain, Allan G. Hill, Joseph Okotto-Okotto, Lorna G. Okotto, Mawuli Dzodzomenyo, Jim A. Wright</p>\r\n\r\nDisposable diaper use is widespread in many low- and middle-income countries whilst waste collection services are scarce. Despite the potential environmental and public health impacts of disposable diaper consumption by households lacking waste services, an international system for monitoring such consumption is lacking. This study therefore aims to develop and evaluate a method for estimating disposable diaper use based on secondary data, specifically nationally representative household expenditure surveys. Disposable diaper expenditure reported via household expenditure surveys for Nigeria (from 2018–19), Kenya (2015–16) and Ghana (2016–17) was used to estimate national disposable diaper consumption among households lacking waste collection services. To assess plausibility of reported expenditure, consumption-smoothing was examined, and Receiver Operating Curve analysis was used to infer mean toilet-training age. In Ghana, Kenya and Nigeria, households lacking appropriately managed waste services consumed an estimated 19 million, 210 million and 285 million disposable diapers per year (292 child/year, 433 child/year and 59 child/year among nappy-consuming households), respectively. Mean toilet-training ages were 24 to 30 months. Disposable diaper purchasing patterns showed evidence of consumption-smoothing among poorer households. Where commodity coding allows, household expenditure surveys can be used to construct internationally comparable indicators depicting disposable diaper consumption among households lacking waste services. Such indicators could be used to advocate for accelerated diaper product innovation, and target areas with high disposable diaper consumption but low waste service coverage.","author":"Mair L. H. Thomas-Possee","siteTitle":"PLOS Sustainability and Transformation","siteHash":"5acd099bb614e5ebff1e724af0cad6ab2b3ef1c50ce1616dc0b5d51f3d4a8e96","entryHash":"f446b6111baeb50fb6363fabe679686f5b84e3623770c8a979a606c58aa29c0c","category":"Environment"}