{"title":"Procurement process and shortages of essential medicines in public health facilities: A qualitative study from Nepal","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003128","date":1714658400000,"content":"<p>by Basant Adhikari, Kamal Ranabhat, Pratik Khanal, Manju Poudel, Sujan Babu Marahatta, Saval Khanal, Vibhu Paudyal, Sunil Shrestha</p>\r\n\r\nEnsuring access to essential medicines remains a formidable challenge in Nepal. The specific reasons for the shortage of essential medicines within Nepal have not been extensively investigated. This study addresses challenges associated with access to essential medicines, procurement process difficulties, and functionality of inventory management systems at different levels of public health facilities. Fifty-nine semi-structured in-depth interviews were conducted with health managers and service providers at provincial and local levels in six randomly selected districts of Bagmati province, Nepal. Interviews were audiotaped and transcribed verbatim, and the results were analyzed using the inductive approach and were later mapped within the four domains of “Procurement of essential medicines”. The major barriers for the effective management of essential medicines included delays in the procurement process, primarily locally, leading to frequent stock-out of essential drugs, particularly at the health post level. Additionally, challenges arise from storage problems, mainly due to insufficient storage space and the need to manage additional comorbidities related to COVID-19. Other identified challenges encompass the absence of training on logistics management information systems, a lack of information technology resources in primary health facilities, inadequate qualified human resources to operate the IT system, and insufficient power backup. Moreover, unrealistic demand estimation from the service points, inadequate transportation costs, and manual inventory management systems further contributed to the complex landscape of challenges. This study identified procurement delays as the primary cause of essential medicine shortages in Bagmati Province, Nepal. We recommend implementing comprehensive procurement guidelines, collaborative training, and dedicated budgets to address this issue. Improving the procurement and inventory management process in low-resource settings requires a well-trained workforce, suitable storage spaces, and enhanced coordinated administrative tiers within health facilities at different levels to ensure the year-round availability of essential medicines in these settings.","author":"Basant Adhikari","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"f448cb9a30a9fa646fbc9e787c539514486069b0b6b106045748116095135d79","category":"Environment"}