{"title":"Mozambican Coffea accessions from Ibo and Quirimba Islands: identification and geographical distribution","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae004/7601988?rss=1","date":1707177600000,"content":"<span><div>Abstract</div>Mozambique does not have a tradition of farming <span>Coffea arabica</span> or <span>Coffea canephora,</span> the two species that dominate the worldwide coffee market. However, native coffee plants have been growing spontaneously and in some cases cultivated in the Ibo and Quirimba islands in the north of the country and Inhambane province in the south. Historically there has been confusion over the precise taxonomic classification of these indigenous coffee plants, with different botanists identifying the species as <span>C. racemosa, C. zanguebariae</span> or various synonyms of both. The present research aims to clarify the subject and provide new information on these little-described coffee species which may prove valuable as new breeding material for future cultivars, something that is sorely needed to face the present and future challenges of coffee production. Leaf samples were collected from 40 accessions from Ibo Island, Quirimba Island and Inhambane province. The samples were sequenced by whole-genome technology and WGS reads were filtered to identify relevant SNP variants. Diversity among the samples was assessed by PCA, and a phylogenetic tree including several <span>Coffea</span> species was built using additional data available in public databases. Experimental data confirm the presence of <span>C. zanguebariae</span> as the only coffee species present in both Ibo and Quirimba Islands, while it appears that <span>C. racemosa</span> is exclusive to the southern Inhambane province. The present research provides the most detailed analysis so far on the genetic identity of the traditional Mozambican coffee crops. This is the prerequisite for undertaking further scientific studies on these almost unknown coffee species and for starting agronomic development programs for the economic revival of Ibo and Quirimba islands based on coffee cultivation. Furthermore, these species could provide much-needed genetic material for the breeding of new hybrids with the two main commercial coffee species.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"f44dc9a0871e7f714b9ad5e1fc73c2aadd42b038793a987f31439a980665c846","category":"Environment"}