{"title":"How to dress for cycling in the summer: a buyer’s guide to staying cool on the bike","link":"https://www.bikeradar.com/advice/buyers-guides/how-to-dress-for-summer-cycling/","date":1692097200000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/07/RussellBurton_20210519_2DX4435_edit_preview-7bae6c8.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/07/RussellBurton_20210519_2DX4435_edit_preview-7bae6c8.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/RussellBurton_20210519_2DX4435_edit_preview-7bae6c8.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/RussellBurton_20210519_2DX4435_edit_preview-7bae6c8.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/RussellBurton_20210519_2DX4435_edit_preview-7bae6c8.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/RussellBurton_20210519_2DX4435_edit_preview-7bae6c8.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/RussellBurton_20210519_2DX4435_edit_preview-7bae6c8.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2020/07/RussellBurton_20210519_2DX4435_edit_preview-7bae6c8.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Two male cyclists riding in the summer\" title=\"Two male cyclists riding in the summer\" />                                            <p>Cycling is different in the summer. The days are longer, mudguards have long been removed and, for the most part, it’s warmer. On occasion, it’s too warm and, equally, sometimes it’s downright changeable, too.</p>\n<p>In this guide to summer cycling kit, we’ll run through what you need to stay cool and comfortable when the heat hits, and what you need if the weather’s not playing ball.</p>\n<h2>Layers are still your friend</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"How to dress for summer cycling, Rapha gilet\" title=\"How to dress for summer cycling, Rapha gilet\" />\n\n</div><div><figcaption><span><i></i> A gilet is easy to stash in your jersey pocket, just in case.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>Summer cycling clothing should be adaptable, using thin layers that can be added or removed throughout the day as conditions dictate.</p>\n<p>Even in summer, mornings can be cool, especially if you’re at altitude. Equally, conditions can change quickly and it pays to be prepared for summer storms or chilly descents.</p>\n<p>The focus should be on lightweight materials to help wick sweat away from the body and prevent that sticky, clammy feeling. Technical materials used for summer clothing also encourage ventilation to keep you cool</p>\n<p>Layers are key in winter, of course, but in cold weather it’s all about retaining warmth, often with an element of wind or water protection.</p>\n<p>As with most things in cycling, there’s lots of choice when it comes to summer cycling kit. What’s right for you will likely be determined by factors including the weather you typically encounter, how far you’re planning to ride, how hard you’ll be pushing yourself (and how much you’re sweating, as a result) and, as ever, budget.</p>\n<p>Let’s get on to the kit. We’ll run through each item, highlighting what to look out for and how to choose the right piece for you.</p>\n<h3>Summer cycling jersey</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Male cyclist in purple top riding the Factor O2 VAM SRAM Red AXS road bike\" title=\"Factor O2 VAM SRAM Red AXS - 12\" />\n\n</div><div><figcaption><span><i></i> A short-sleeve jersey is a mainstay of a summer cycling wardrobe.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Lightweight, short-sleeve jerseys are the best option for summer cycling. Look out for jerseys with mesh panels for ventilation, which make use of the airflow generated by the rider, and can help keep you cool on the move – even on a still day.</p>\n<p>While a standard summer jersey will work well for most conditions, some brands offer featherweight jerseys designed specifically for the hottest, most humid conditions, made from super-light fabrics that up ventilation once again.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"How to dress for cycling in the summer, open Shimano jersey\" title=\"13-57-47_SNY0483\" />\n\n</div><div><figcaption><span><i></i> A full-length zip is a handy feature for climbs.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>In some climates, temperatures can fluctuate significantly within a day. Opting for a thin summer jersey and adding and removing layers as necessary will help you cope with any temperature changes.</p>\n<p>Instead of sticking to one jersey for the whole day, using layers can minimise sweating when it’s too hot and the chilling that may follow when you cool down again.</p>\n<p>You can layer up with a gilet, arm warmers or a lightweight jacket, as we’ll come on to, and all can be stashed in a jersey pocket.</p>\n<p>Almost all road cycling jerseys will have three rear pockets, and you should look for a zipped pocket to stash small valuables.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Nukeproof Blackline Women's Short Sleeve Jersey (Earth) mountain bike jersey and Blackline Women's Trail Pants worn by female mountain bike on a Marin Alpine Trail XR enduro mountain bike\" title=\"Nukeproof Blackline Women's Short Sleeve Jersey (Earth) mountain bike jersey-4\" />\n\n</div><div><figcaption><span><i></i> Mountain bike jerseys often use lightweight, wicking fabrics to help keep you cool.</span></figcaption><span> <i>Alex Evans / Our Media</i></span></div>\n<p>Mountain bike jerseys tend to look more like t-shirts than road cycling jerseys, with looser fits and no zips or pockets. This doesn’t mean they’ll get heavy from absorbing sweat or be uncomfortable in hot weather: they will often use high-wicking or perforated fabrics.</p>\n<p>Regardless of whether you’re cycling on or off-road, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-prevent-sunburn-when-youre-cycling/\">sunburn is an uncomfortable addition to a summer ride</a> – and not recommended.</p>\n<p>If your jersey is particularly lightweight, you may still be able to burn through the fabric. Some brands offer cycling-specific sun creams, which are designed to last longer without wearing off when sweating.</p>\n<p>So, apply a high SPF suncream and don’t forget to do the same if you’ll be starting the day fully covered and removing layers as it heats up.</p>\n<p>We’ve got separate guides to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-jerseys/\">best cycling jerseys</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-jerseys/\">best mountain bike jerseys</a> for more advice.</p>\n<h3>Summer baselayer</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"How to dress for cycling in the summer, baselayer\" title=\"14-06-47_SNY0568\" />\n\n</div><div><figcaption><span><i></i> A baselayer should be your starting point even on warm days.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>It may seem counterintuitive to add another layer when <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-in-hot-weather/\">cycling in the heat</a>, but bear with us.</p>\n<p>Unlike thermal winter baselayers, a summer <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-base-layers/\">baselayer</a> is designed to wick sweat away from your body. In theory, this keeps you drier and cooler, making hot days more comfortable.</p>\n<p>Many brands offer specific summer baselayers, with both merino and synthetic options available. Merino is a great option for cooler rides, and as a natural fabric has excellent wicking properties, but for really hot days we’d recommend a baselayer made from a lightweight, synthetic fabric that’s likely to be more affordable and quicker to dry.</p>\n<p>A mesh baselayer will be lighter still, while still helping to move sweat away from the body.</p>\n<p>Sleeveless baselayers remove extra bulk and weight around the armpit and work particularly well with close-fitting or aero jerseys, reducing the possibility of fabric bunching on the arms.</p>\n<h3>Cycling shorts</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Pinarello F7 Ultegra Di2\" title=\"Pinarello F7 Ultegra Di2 - 14\" />\n\n</div><div><figcaption><span><i></i> We’d always go for bib shorts over waist shorts for road cycling.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Cycling shorts are a staple of any summer riding outfit and you typically have two options: waist shorts or bib shorts, with straps around the shoulders to hold the shorts in place and provide a little extra support. For road and gravel riding, we generally prefer bib shorts, but there are still <a href=\"https://www.bikeradar.com/features/shorts-are-superior-to-bib-shorts/\">fans of waist shorts</a>.</p>\n<p>You can read our buyer’s guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-shorts/\">best cycling shorts</a> for men and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-womens-cycling-shorts/\">best women’s cycling shorts</a> for more advice but, when it comes to bib shorts designed for summer riding, lightweight fabrics are once again your friend.</p>\n<p>Look for shorts made from thinner fabric, and ideally with a perforated or semi-detached chamois pad to encourage airflow around the saddle.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Endura Women’s Singletrack Lite Shorts for mountain bikers\" title=\"Endura Singletrack Lite shorts 4\" />\n\n</div><div><figcaption><span><i></i> Summer mountain bike shots will often use lightweight fabrics and feature perforation.</span></figcaption><span> <i>Ian Linton / Our Media</i></span></div>\n<p>These tweaks can help minimise the build-up of moisture and allow for a more comfortable experience.</p>\n<p>If you’re planning a multi-day trip in the summer, it’s worth packing multiple pairs of bib shorts or washing your shorts between days. Your undercarriage is an important contact point with the bike – and taking care of your shorts can help prevent issues arising, such as <a href=\"https://www.bikeradar.com/advice/health/how-to-avoid-and-treat-saddle-sores/\">saddle sores</a> and <a href=\"https://www.bikeradar.com/advice/fitness-and-training/groin-pain-cycling/\">groin pain</a>.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-shorts/\">best mountain bike shorts for men</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-womens-mountain-bike-shorts/\">for women</a> are baggier than Lycra shorts, but they will often have lightweight fabrics and perforation to help with heat dissipation.</p>\n<h3>Gilet</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"How to dress for summer cycling, Rapha gilet\" title=\"How to dress for summer cycling, Rapha gilet\" />\n\n</div><div><figcaption><span><i></i> A packable gilet wards off light showers and chills.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>If conditions are looking changeable and you’re out for a long ride or taking on mountainous terrain, you’re likely to need another layer. A lightweight gilet is a summer essential and can be stashed in your back pocket for that extra bit of flexibility.</p>\n<p>A <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-gilets/\">cycling gilet</a> is sleeveless with a full-length zip, so provides protection for your core without the additional coverage of a jacket. You can also use the zip for ventilation if needed, and it allows you to put the gilet on and take it off while riding.</p>\n<p>Gilets are available for a wide range of conditions, from thermal vests for cold conditions to ultra-light gilets that are packable enough to fit comfortably in a jersey pocket, while still offering windproof protection.</p>\n<p>Even an ultra-light gilet will provide a little extra protection and warmth, making them perfect for long descents.</p>\n<p>If conditions are likely to be more varied, windproof and waterproof gilets are also available. These will take up a bit more space, but many will still squeeze into a jersey pocket and they’re certainly worth it for the extra weather protection.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Q36.5 Air Vest 69g Olive Green\" title=\"Q36.5 Air Vest 69g Olive Green\" />\n\n</div><div><figcaption><span><i></i> Some gilets will have mesh back panels to help with breathability.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>Some gilets are made from a couple of different fabrics to provide windproofing on the front and breathability on the rear.</p>\n<p>Most gilets don’t have pockets, but we always find the addition of pockets useful, offering additional storage and easy access to essentials if you’re wearing a gilet for the majority of your ride, so you don’t have to dig into jersey pockets beneath.</p>\n<p>Reflective detailing is another bonus if you’re likely to be riding in low-light conditions or at night.</p>\n<h3>Waterproof jacket</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Apex7 waterproof jacket\" title=\"apex7 jacket\" />\n\n</div><div><figcaption><span><i></i> Jackets with breathable shells are ideal for summer.</span></figcaption><span> <i>Tom Marvin / OurMedia</i></span></div>\n<p>Summer doesn’t always mean dry roads.</p>\n<p>A lightweight, waterproof jacket is an essential item for when the weather isn’t guaranteed, and here breathability really is key.</p>\n<p>There’s little advantage in layering up to protect yourself from moisture on the outside if it’s going to cause you to overheat and drench you in sweat on the inside.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"How to dress for cycling in the summer, waterproof jacket\" title=\"14-17-29_SNY0720\" />\n\n</div><div><figcaption><span><i></i> The ideal jacket blends breathability and impermeability.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>That can be a tough ask if conditions are mild, but a waterproof jacket made from a performance material such as GoreTex will give you the best chance and will be designed to offer that hallowed combination of waterproofing and breathability in one.</p>\n<p>The drawback with any technical jacket will likely be the price. More affordable products might offer you good waterproofing but at the cost of a sweaty experience – especially when it’s mild and wet.</p>\n<p>Take a look at our guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-jackets-for-cyclists/\">best waterproof cycling jackets</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-jackets-for-mountain-biking/\">best mountain bike jackets</a> for our top product picks.</p>\n<h3>Windproof jacket</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Oscar Huckle modeling Le Col Pro Wind Jacket\" title=\"BikeRadar_200423_kg0184\" />\n\n</div><div><figcaption><span><i></i> A windproof jacket will be more breathable than a waterproof jacket.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div></div>\n<div>As an alternative, a <a href=\"https://www.bikeradar.com/features/protect-yourself-against-the-wind-not-the-rain/\">windproof jacket</a> will protect you from the wind and a bit of rain. A lightweight, showerproof jacket will normally be more breathable than a fully fledged waterproof.</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>They’re ideal when it’s likely to be dry but you want a bit more protection than a gilet can offer, or if you’re expecting light showers that won’t require a waterproof jacket. Most windproof jackets are easy to stash in a rear pocket, too.</p>\n<h2>Summer cycling accessories</h2>\n<p>Beyond shorts, jerseys and outer layers, there are a number of cycling accessories that can make cycling in the summer a more pleasant affair.</p>\n<h3>Cycling cap</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"How to dress for summer cycling, Rapha cap\" title=\"How to dress for summer cycling, Rapha cap\" />\n\n</div><div><figcaption><span><i></i> Cycling caps can keep the sun out of your eyes and offer UV protection.</span></figcaption><span> <i>Felix Smith / Our Media</i></span></div>\n<p>A cycling cap that sits under your helmet can be a useful addition to a summer kit ensemble.</p>\n<p>The soft peak can help keep the sun out of your eyes, and they give good UV protection for those not blessed with a full head of hair.</p>\n<p>While a cap may add warmth, some people pre-soak their cycling caps to make the most of some evaporative cooling. A thinner, partially mesh summer cap is also a great option if you want to keep the sun off your head without overheating.</p>\n<h3>Arm and knee warmers</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Le Col Pro All Weather jersey and arm warmers being modelled against a grey background\" title=\"le-col-arm-warmer_O5A9071\" />\n\n</div><div><figcaption><span><i></i> Arm warmers provide extra warmth for cool, early starts.</span></figcaption><span> <i>Stan Portus / Our Media</i></span></div>\n<p>Arm warmers are useful for cool conditions or early starts, while lightweight arm screens can provide protection from the sun without adding too much warmth.</p>\n<p>Arm and knee warmers – or leg warmers if you’re really unfortunate with the weather – have a place on summer rides too, and can be useful when you’re starting early or finishing late.</p>\n<p>However, in really hot weather and prolonged sun, arm sleeves or screens can be a good alternative.</p>\n<p>These are made from thin material designed to protect your skin and reflect the sun – contributing to keeping you cool – rather than adding warmth, as is the goal of most arm warmers (as the name suggests…).</p>\n<h3>Mitts</h3>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-summer-cycling-gloves/\">Cycling gloves</a> are useful year-round, providing warmth in winter and, in the case of mitts (fingerless gloves), some cushioning in summer.</p>\n<p>Beyond giving your hands some protection, they’ll also improve your grip on sweaty days and can stop the backs of your hands from getting burnt.</p>\n<p>You’ll still need to remember to apply sunscreen to your fingers because the backs of your hands are constantly exposed to the sun while cycling.</p>\n<h3>Socks</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"How to dress for cycling in the summer, socks\" title=\"14-08-06_SNY0575\" />\n\n</div><div><figcaption><span><i></i> Summer cycling socks are much thinner than an everyday pair.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>Hot, sweaty feet can be an unpleasant side-effect of summer cycling.</p>\n<p>Synthetic summer <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-socks/\">cycling socks</a> are thinner than regular socks, with a mesh-like construction to encourage airflow and wicking. Lightweight Merino socks work well for multi-day rides because the natural antibacterial properties can prevent unwanted smells from building up.</p>\n<p>When choosing <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-cycling-shoes/\">cycling shoes</a>, it’s worth remembering that your feet will swell a little on long rides, and especially in the heat. Selecting something with enough width (<a href=\"https://www.bikeradar.com/features/wide-shoes-why-you-need-them-and-which-brand-makes-the-best/\">wide cycling shoes</a> are available) and considering whether the shoe has any vents to promote airflow is a good idea.</p>\n<h3>Sunglasses</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Panda Optics MultiSport sunglasses\" title=\"Panda Optics MultiSport sunglasses - 09\" />\n\n</div><div><figcaption><span><i></i> Cycling sunglasses are for all seasons, not only bright conditions.</span></figcaption><span> <i>Yogamaya von Bromley / Our Media</i></span></div>\n<p>Sunglasses are a cycling essential, whatever the weather, particularly for summer rides. Eyes can burn too and that can leave you feeling pretty sore.</p>\n<p>Crucially, however, sunglasses aren’t just for keeping the sun out of your eyes – they’ll also protect you from dust, flies and dirt kicked up from the road or trail.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-sunglasses-for-cycling/\">best cycling sunglasses</a> needn’t cost the Earth – what’s important is UV protection and a comfortable, secure fit.</p>\n<h3>Water bottles</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"How to dress for cycling in the summer, bottles\" title=\"14-00-34_SNY0520\" />\n\n</div><div><figcaption><span><i></i> Remember to drink regularly on warm rides.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>Finally, don’t forget your <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-water-bottles/\">water bottles</a> – not something you’ll wear, of course, but essential for any summer ride (and any long ride full-stop).</p>\n<p>If you’re new to cycling, it can be surprising just <a href=\"https://www.bikeradar.com/advice/nutrition/how-to-stay-hydrated-on-your-bike/\">how much you’ll need to drink</a> to stay hydrated on a summer ride – especially when you’re working hard.</p>\n<p>There’s little worse than running out of water mid-ride, so it’s worth considering fitting an extra bottle cage – most frames have bosses for at least two <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bottle-cages/\">bottle cages</a> – and bringing an extra bidon when the temperature rises.</p>","author":"Alice Thomson","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f4525bd8c4cfee702715d57e668897a96abd6630e7531743262bbc01c5c759d7","category":"Cycling"}