{"title":"Chondroitin Sulphate and Proteinoids in Neuron Models","link":"https://www.preprints.org/manuscript/202409.0959/v1","date":1726112132000,"content":"This study examines the relationship between chondroitin sulphate, proteinoids, and computational neuron models, with a specific emphasis on the Izhikevich neuron model. We investigate the effect of chondroitin sulphate-proteinoid complexes on the behaviour and dynamics of simulated neurons. Through the use of computational simulations, we provide evidence that these biomolecular components have the power to regulate the responsiveness of neurons, the patterns of their firing, and the ability of their synapses to change within the Izhikevich architecture. The findings suggest that the interactions between chondroitin sulphate and proteinoid cause notable alterations in the dynamics of membrane potential and the timing of spikes. We detect adjustments in the features of neuronal responses, such as shifts in the thresholds for firing, alterations in spike frequency adaptation, and changes to bursting patterns. The findings indicate that chondroitin sulphate and proteinoids may have a role in precisely adjusting neuronal information processing and network behaviour. This study offers new and valuable information about the complex connection between the many components of the extracellular matrix, protein-based structures, and the functioning of neurons. In addition, our analysis of the proteinoid-chondroitine system using game theory uncovers a significant Prisoner’s Dilemma scenario. The system’s inclination towards defection, due to the appeal of cheating and the significant penalty for cooperation, with a mean voltage of −9.19 mV, indicates that defective behaviors may prevail in the long-term dynamics of these neuronal interactions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f453cba209e3814312cb4fda8a0df4ba2ecf9b259e31e42496a08d30ad28e458","category":"Interdisciplinary"}