{"title":"Uptake of multi-level HIV interventions and HIV-related behaviours among young people in rural South Africa","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003258","date":1717164000000,"content":"<p>by Nondumiso Mthiyane, Maryam Shahmanesh, Andrew Copas, Natsayi Chimbindi, Jaco Dreyer, Thembelihle Zuma, Nuala McGrath, Kathy Baisley, Sian Floyd, Isolde Birdthistle, Lorraine Sherr, Janet Seeley, Guy Harling</p>\r\n\r\nCombination HIV prevention packages have reduced HIV incidence and improved HIV-related outcomes among young people. However, there is limited data on how package components interact to promote HIV-related prevention behaviours. We described the uptake of HIV prevention interventions supported by Determined, Resilient, Empowered, AIDS-free, Motivated and Safe (DREAMS) Partnership and assessed the association between uptake and HIV-related behaviours among young people in rural KwaZulu-Natal, South Africa. We analysed two cohorts followed from May 2017 to December 2019 to evaluate the impact of DREAMS, covering 13–29 year-old females, and 13–35 year-old males. DREAMS interventions were categorised as healthcare-based or social. We described the uptake of interventions and ran logistic regression models to investigate the association between intervention uptake and subsequent protective HIV-related outcomes including no condomless sex and voluntary medical male circumcision (VMMC). For each outcome, we adjusted for socio-demographics and sexual/pregnancy history and reported adjusted odds ratios (aOR) and 95% confidence intervals (CI). Among 5248 participants, uptake of healthcare interventions increased from 2018 to 2019 by 8.1% and 3.7% for males and females respectively; about half of participants reported receiving both healthcare and social interventions each year. The most utilised combinations of interventions included HIV testing and counselling, school-based HIV education and cash transfers. Participation in social interventions only compared to no intervention was associated with reduced condomless sex (aOR = 1.60, 95%CI: 1.03–2.47), while participation in healthcare interventions only was associated with increased condomless sex. The uptake of interventions did not significantly affect subsequent VMMC overall. Among adolescent boys, exposure to school-based HIV education, cash transfers and HIV testing and counselling was associated with increase in VMMC (aOR = 1.79, 95%CI: 1.04–3.07). Multi-level HIV prevention interventions were associated with an increase in protective HIV-related behaviours emphasizing the importance of accessible programs within both school and community settings for young people.","author":"Nondumiso Mthiyane","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"f455549c0508b12c380bafa98017973ea56e6de1c6abc03b420bffd46b7cd4bd","category":"Environment"}