{"title":"แบงก์ชาติ-ธนาคารกลางอินโดนีเซีย ทำ QR ชำระเงินข้ามกัน เตรียมเปิดโอนเงินข้ามประเทศด้วยเบอร์มือถือ","link":"https://www.blognone.com/node/124262","date":1629190155000,"content":"<div><div><div><p>ธนาคารแห่งประเทศไทย (ธปท.) และธนาคารกลางอินโดนีเซีย (Bank Indonesia: BI) ประกาศความร่วมมือเชื่อมโยงระบบชำระเงินระหว่างสองประเทศผ่านโครงสร้างพื้นฐานระบบการชำระเงินของแต่ละประเทศ ลูกค้าและร้านค้าของทั้งสองประเทศสามารถทำรายการชำระเงินและรับเงินระหว่างกันผ่าน QR Code ได้</p>\n<p>ในระยะแรก ลูกค้าในประเทศไทยสามารถใช้แอปพลิเคชันบนมือถือของธนาคารที่เข้าร่วมโครงการ สแกน QRIS (Quick Response Code Indonesian Standard) หรือ QR มาตรฐานของอินโดนีเซีย ชำระค่าสินค้าและบริการที่ร้านค้าในประเทศอินโดนีเซียได้ ธนาคารที่เข้าร่วมโครงการระยะแรกคือ ธนาคารกรุงเทพ ส่วนธนาคารกรุงศรีอยุธยาและธนาคารซีไอเอ็มบีไทย จะใช้บริการได้ในเดือนกันยายนนี้</p>\n<p>ด้านลูกค้าในประเทศอินโดนีเซียสามารถใช้แอปพลิเคชันบนมือถือของหน่วยงานที่เข้าร่วมโครงการสแกน Thai QR Code ชำระค่าสินค้าและบริการร้านค้าของธนาคารที่เข้าร่วมโครงการในประเทศไทยได้</p>\n<p>ธนาคารแห่งประเทศไทยระบุว่า ในระยะต่อไปช่วงไตรมาสแรกของปี 2565 จะเพิ่มจำนวนธนาคารและ non-bank ที่ให้บริการมากขึ้น รวมทั้งในอนาคตจะขยายบริการโอนเงินระหว่างประเทศแบบทันทีโดยใช้หมายเลขโทรศัพท์มือถือของผู้รับแทนเลขที่บัญชีด้วย</p>\n<p>จนถึงตอนนี้คนไทยสามารถทำการชำระเงินระหว่างประเทศด้วย QR Code ในอาเซียนแล้ว 5 ประเทศ ได้แก่ ลาว กัมพูชา สิงคโปร์ เวียดนาม และมาเลเซีย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/234742db348783f7a52aa8e2f9c9bc0b.png\" /></p>\n<p>ที่มา - <a href=\"https://www.bot.or.th/Thai/AboutBOT/Activities/Pages/JointPress_17082021.aspx\">ธนาคารแห่งประเทศไทย</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/bank-thailand\">Bank of Thailand</a></div><div><a href=\"/topics/indonesia\">Indonesia</a></div><div><a href=\"/topics/qr-code\">QR Code</a></div><div><a href=\"/topics/payment\">Payment</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f4571e0c08cab950f9549a8bea893e713fd4ae4ee018721c48afca7b4c1d31b6","category":"Thai"}