{"title":"USA Cycling addresses Arkansas anti-trans legislation in statement, plans Inclusion Summit","link":"https://cyclingtips.com/2021/04/usa-cycling-addresses-arkansas-anti-trans-legislation-in-statement-plans-inclusion-summit/","date":1617993416000,"content":"<p>Following the passage of anti-transgender legislation in Arkansas, which is set to host the Cyclocross World Championships next year in the town of Fayetteville, USA Cycling has expressed its opposition &#8220;to any and all discriminatory legislative efforts that aim to limit an athlete&#8217;s access to competition, specifically the recently passed anti-transgender legislation in Arkansas.&#8221;</p>\n\n\n\n<p>Last month, Arkansas passed SB-354, which prevents transgender girls and women from participating on school sports teams consistent with their gender identity. Hundreds of NCAA athletes have signed a letter to the NCAA Board of Governors requesting that no championships be held in states passing similar laws.</p>\n\n\n\n<p>Brook Watts, the race director for Cyclocross Worlds said that the bill was &#8220;discriminatory and hateful,&#8221; while asking fans to “take action in another way” in response to the bill besides boycotting. Rob Demartini, USA Cycling&#8217;s President and CEO, said in an interview with Singletracks.com that he was not sure a boycott in response to SB-354 would be &#8220;anything more than ceremonial,&#8221; although he has since said that he felt his comments were taken out of context while saying that they were &#8220;poorly worded&#8221; and do &#8220;not reflect the position of USA Cycling.&#8221;</p>\n\n\n\n<p>This month, Arkansas passed a law preventing transgender youth from receiving gender-affirming medical care. The governor of Arkansas, Asa Hutchinson, vetoed the bill, but the state legislature overrode that veto.</p>\n\n\n\n<p>On Thursday evening, USA Cycling said in a statement that it is &#8220;is unequivocally opposed to any legislative efforts that aim to limit an athlete’s access to competition.&#8221; The organization also said that its &#8220;immediate and initial active engagement plan includes the forming of a coalition of like-minded influential advocates and industry partners,&#8221; noting that &#8220;Specialized Bicycles, Canyon Bicycles, Allied Cycle Works, and Experience Fayetteville have agreed to participate to bring about faster change for the LGBTQIA+ community&#8221; at an Inclusion Summit in Fayetteville.</p>\n\n\n\n<p>The statement also addressed the subject of boycotting events.</p>\n\n\n\n<p>&#8220;We respect the rights of athletes and members of our community who wish to boycott events that take place in those states where this legislation is being threatened or enacted,&#8221; USA Cycling said. &#8220;We also believe the most effective means to counter these policies are active engagement alongside local groups working to affirm the rights of the entire LGBTQIA+ community by promoting and advancing the discussion and taking a stand against discrimination in any form. We will also seek to place future USA Cycling National Championships in cities, counties, and states that welcome all our members.&#8221;</p>\n\n\n\n<p>You can read the full statement <a href=\"https://usacycling.org/article/official-statement-and-takes-action-on-discriminatory-anti-transgender-legislation\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/04/usa-cycling-addresses-arkansas-anti-trans-legislation-in-statement-plans-inclusion-summit/\">USA Cycling addresses Arkansas anti-trans legislation in statement, plans Inclusion Summit</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f45906e8fb0229324cbc0e0293657f01f471580febc3a9947ad67a76d3166512","category":"Cycling"}