{"title":"Migratory life cycle of Anguilla anguilla: a mirror symmetry with A. japonica","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15966?af=R","date":1729669446000,"content":"<h2>Abstract</h2>\n<p>The European and Japanese eel populations have declined significantly in recent decades. To effectively manage and conserve them, gaining a better understanding of their migratory life cycles is important. Previous research on the spawning ecology and larval dispersal of European and Japanese eels has led to many significant discoveries and advancements for their migratory life cycles. However, different scholars hold varying views on their migratory life cycles, especially concerning the European eel, therefore this article aims to provide a comprehensive review of research from multiple disciplines concerning the spawning ecology and larval dispersal of European and Japanese eels and to propose migratory life cycles of these two species. The migratory life cycle of the European eel is as follows: European silver eels undertake a year-long spawning migration from September to January to reach the Sargasso Sea for spawning before the next spawning season, typically between December and May. After hatching, European eel leptocephali are transported by the Gulf Stream, Frontal Countercurrents, North Atlantic Current, and Azores Current and return to Europe and North Africa for growth. Recruitment of European glass eels mainly occurs between October and June of the following year, and the recruiting season is more concentrated in countries closer to the spawning area and more dispersed in countries farther away. The consistent recruitment pattern and the growth rate of leptocephali suggest a larval transport period, also called larval duration, of around 1 year. Understanding the migratory life cycle of European eels can facilitate the evaluation or development of their conservation measures.</p>","author":"Hsiang‐Yi Hsu, \nKuan‐Mei Hsiung, \nYu‐San Han","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"f45ba2cad831c8fe56a9b05a793eee2e1fe8791f691c671eba3f58158d27f05e","category":"Environment"}