{"title":"Anthocyanins act as a sugar-buffer and an alternative electron sink in response to starch depletion during leaf senescence: a case study on a typical anthocyanic tree species, Acer japonicum","link":"https://academic.oup.com/jxb/article/75/11/3521/7626069?rss=1","date":1710201600000,"content":"<span><div>Abstract</div>We hypothesized that anthocyanins act as a sugar-buffer and an alternative electron sink during leaf senescence to prevent sugar-mediated early senescence and photoinhibition. To elucidate the role of anthocyanin, we monitored seasonal changes in photosynthetic traits, sugar, starch and N contents, pigment composition, and gene expression profiles in leaves exposed to substantially different light conditions within a canopy of an adult fullmoon maple (<span>Acer japonicum</span>) tree. Enhancement of starch amylolysis accompanied by cessation of starch synthesis occurred in the same manner independent of light conditions. Leaf sugar contents increased, but reached upper limits in the late stage of leaf senescence, even though leaf anthocyanins further increased after complete depletion of starch. Sun-exposed leaves maintained higher energy consumption via electron flow than shade-grown leaves during leaf N resorption. Thus, anthocyanins accumulated in sun-exposed leaves might have a regulative role as a sugar-buffer, retarding leaf senescence, and an indirect photoprotective role as an alternative sink for electron consumption to compensate declines in other metabolic processes such as starch and protein synthesis. In this context, anthocyanins may be key substrates protecting both outer-canopy leaves (against photoinhibition) and inner-canopy leaves (via shading by outer-canopy leaves) from high light stress during N resorption.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"f45c010dca65d3b323535121b5ff0783a7327b85a7bc85404648b8919fa13acc","category":"Environment"}