{"title":"The Efficacy of Topically Applied Curcumin 1% as Alternative or  Complementary to Triamcinolone Acetonate in Treatment of Oral  Lichen Planus (Randomize control trial)","link":"https://www.preprints.org/manuscript/202409.1822/v1","date":1727129822000,"content":"Aim of study: to evaluate the therapeutic impact of topically applied curcumin as Alternative  or Complementary to Triamcinolone Acetonate in Treatment of Oral Lichen Planus. Background: Oral lichen planus (OLP) is a chronic inflammatory disorder affecting the mucous  membranes, believed to be an immune-mediated condition. Its persisting nature can lead to  extended discomfort for those affected. The primary symptoms are pain and a burning  sensation, with a potential risk of malignancy if not properly managed, necessitating lifelong  clinical monitoring. Presently, OLP is considered a significant challenge due to the absence of  a definitive cure. Patients &amp; patients: Thirty patients with oral lichen planus were divided into three groups,  10 patients each: Group A: ten patients with OLP were received topical triamcinolone  acetonide. Group B: ten patients with OLP were received topical curcumin. Group C: ten  patients with oral lichen planus were received topical triamcinolone acetonide combiend with  topical curcumin. For six weeks. Each patient was examined at baseline, 1 and 3months of  therapy. Pain was scored using the visual analogue scale. Salivary level of interleukin 6 were  estimated at baseline, 1 and 3months evaluation periods. Results: Significant decrease in pain score was observed in all groups and there was a  statistically significant difference between them at all treatment periods in favor to group C . 2 Additionally, all groups showed a decrease in the size of lesions which was greater in group  A,C compared to the B group. A significant reduction of the mean interlukin6 continued down  to 3 months in all groups with statistically insignificant difference between them at three  months, while statistically significant difference in favor to group C at 1month was observed. Conclusion: The results proved the benefit of curcumin as a promising medication when used  in combination with conventional therapy in treatment of OLP patients. However, further long\u0002term studies with large sample size are needed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f461ce9bf2882936f979fd717f08138e0ba491a21724bb432b9436a890095356","category":"Interdisciplinary"}