{"title":"Apple Says iOS Developers Have 'Multiple' Ways of Reaching Users and Are 'Far From Limited' to Using Only the App Store","link":"https://www.macrumors.com/2021/03/25/apple-devs-not-limited-app-store-distribution/","date":1616674704000,"content":"As it faces a barrage of probes and investigations regarding the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> and the distribution of apps on its devices, Apple has told Australia's consumer watchdog that developers have \"multiple\" ways to reach iOS users and claims that they are \"far from limited\" to simply using the &zwnj;App Store&zwnj;.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/03/appstore.jpg\" alt=\"\" width=\"2000\" height=\"1032\" class=\"aligncenter size-full wp-image-730995\" />\r\n<br/>\r\nIn a <a href=\"https://www.accc.gov.au/system/files/Apple%20Pty%20Limited%20%2810%20February%202021%29.pdf\">new filing</a> (via <em><a href=\"https://www.zdnet.com/article/apple-says-ios-has-alternative-app-distribution-because-the-internet-exists/\">ZDnet</a></em>) responding to concerns from the Australian Competition & Consumer Commission that it exploits \"alleged market power in its role as a distributor of apps,\" Apple highlights multiple avenues that developers can take to reach customers. \r\n<br/>\r\n\r\n<br/>\r\nSpecifically, Apple points out that the \"whole web\" exists as an alternative means of distribution, arguing that the web has become a platform unto itself. Apple supports this claim by noting that iOS devices have \"unrestricted and uncontrolled\" access to the web, allowing users to download web apps.\r\n<br/>\r\n<blockquote>Even if a user only owns iOS-based devices, distribution is far from limited to the Apple &zwnj;App Store&zwnj; because developers have multiple alternative channels to reach that user. The whole web is available to them, and iOS devices have unrestricted and uncontrolled access to it. One common approach is for users to purchase and consume digital content or services on a website.\r\n<br/>\r\n\r\n<br/>\r\nWeb browsers are used not only as a distribution portal but also as platforms themselves, hosting \"progressive web applications\" (PWAs) that eliminate the need to download a developer's app through the &zwnj;App Store&zwnj; (or other means) at all. PWAs are increasingly available for and through mobile-based browsers and devices, including on iOS. </blockquote>Apple says that the alternative methods of distribution, such as web apps and developers' websites, pose a competitive threat to the &zwnj;App Store&zwnj;. Apple goes on to discuss other platforms, such as the Google Play Store, noting that it fights \"vigorously\" to attract developers to make apps for its platform instead of others.\r\n<br/>\r\n<blockquote>As explained further below, Apple faces competitive constraints from distribution alternatives within the iOS ecosystem (including developer websites and other outlets through which consumers may obtain third-party apps and use them on their iOS devices) and outside iOS.\r\n<br/>\r\n\r\n<br/>\r\nIndeed, Apple competes vigorously to attract the best developers because a reduction in the quality of apps, or restricted availability of popular apps in the &zwnj;App Store&zwnj;, would diminish the user experience. Any action undermining the popularity of the &zwnj;App Store&zwnj; — including impeding developers from being successful on the &zwnj;App Store&zwnj; — would be economically irrational, as this would destroy the value of the ecosystem to the detriment of consumers, app developers, and Apple itself. </blockquote>Apple's new comments are unlikely to sit well with some developers, particularly <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, which is pursuing a massive legal battle against Apple over being an alleged monopoly. Some developers claim that Apple holds a dominant position on its devices because of the &zwnj;App Store&zwnj;, and exploits its power to limit innovation and competition.\r\n<br/>\r\n\r\n<br/>\r\nJust this week, in a separate filing to the ACCC, Apple said <a href=\"https://www.macrumors.com/2021/03/22/apple-surprised-developer-concerns-app-review/\">it was \"surprised\"</a> to hear that some developers have concerns about the review process and the guidelines that apps must follow before appearing on the &zwnj;App Store&zwnj;. The ACCC launched its &zwnj;App Store&zwnj; investigation <a href=\"https://www.macrumors.com/2020/09/08/australia-opens-antitrust-inquiry-into-app-store/\">last year</a> and is expected to release an interim report on March 31.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/australia/\">Australia</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">antitrust</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/25/apple-devs-not-limited-app-store-distribution/\">Apple Says iOS Developers Have &#039;Multiple&#039; Ways of Reaching Users and Are &#039;Far From Limited&#039; to Using Only the App Store</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-says-ios-developers-have-multiple-ways-of-reaching-users-and-are-far-from-limited-to-using-only-the-app-store.2289556/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5_TNL1OlZM0:hAcjDTFYHqc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5_TNL1OlZM0:hAcjDTFYHqc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/5_TNL1OlZM0\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f472b24361cf89050250d919994fcef2bed6d1aceafe32ed5f143f93256becee","category":"Apple"}