{"title":"Perceptions of Sustainability among Children and Teachers: Problems revealed via the Lenses of Science Communication and Transformative Learning","link":"https://www.preprints.org/manuscript/202403.1393/v1","date":1711116994000,"content":"Scholars and policymakers see sustainability as depending on the interrelationships between the three pillars of the environment, society and the economy. However, it remains less clear how key stakeholders with a responsibility for educating the next generation perceive the concept of sustainability and act accordingly. In order to gain new insights, this research scrutinises participant perceptions on sustainability and climate change in two eco-schools in England for primary children (aged 5-11 years). Our case study involved individual interviews with classroom teachers and headteachers, group interviews with fourth- and fifth-year students (ages 10-12 years), and in-class observations. We also analysed data from student exercise books and photographs of school grounds to understand participants’ self-reported knowledge and perceptions of sustainability and climate change. Within a framework drawing on theories of science communication and transformative learning (a learning approach based on having challenging experiences), the results show that the integration of sustainability into the curriculum was limited and problematic. That is despite the fact that all students and teachers were aware of the environmental dimensions of sustainability, like climate change and the overuse of natural sources. These findings suggest that schools are no different to other institutional settings when it comes to dealing with the challenges of integrating sustainability into daily practice. We conclude that there is a need for in-service teacher education programmes to enable and motivate teachers to provide richer teaching-learning environments so as to enable effective learning in schools about sustainability and climate change.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f474d743f66f399d6e6b67140d36d4a3e646fdbef39c53927aae85c30b9bf127","category":"Interdisciplinary"}