{"title":"Pancreatectomy With En Bloc Superior Mesenteric Vein And All Its Tributaries Resection Without PV/SMV Reconstruction For “Low” Locally Advanced Pancreatic Cancer","link":"https://www.preprints.org/manuscript/202405.1209/v1","date":1716181554000,"content":"Introduction. “Vein definition” for locally advanced pancreatic ductal adenocarcinoma (LA PDAC) assumes portal-to-superior mesenteric vein (PV/SMV) unreconstructability due to tumor involvement or occlusion. Radical pancreatectomies with SMV resection without PV/SMV reconstruction are scarcely discussed in the literature. Retrospective analysis of 19 radical pancreatectomies for “low” LA PDAC with SMV and all its tributaries resection without PV/SMV reconstruction has shown zero mortality, overall morbidity –  56%, Dindo-Clavien – 3-10,5%, R0- rate – 82%, mean operative procedure time – 355±154 min, mean blood loss – 330±170 ml, delayed gastric emptying– 25%, clinically relevant postoperative pancreatic fistula – 8%. In three cases surgery was associated with superior mesenteric (n2) and common hepatic artery (n1) resection. Surgery was completed without vein reconstruction (n13) and with inferior mesenteric-to-splenic anastomosis (n6). There were no cases of liver, gastric, or intestinal ischemia.  A specific complication of the SMV resection without reconstruction was 2-3 days-long intestinal edema (48%). Median overall survival – 25 months, median progression-free survival – 18 months. All the relapses, except two, were distant. The possibility of successful SMV resection without PV/SMV reconstruction can be predicted before surgery by CT-based reconstructions. The mandatory anatomical conditions for the procedure were: 1) preserved SMV-SV confluence; 2) occluded SMV for any reason (tumor or thrombus); 3) well-developed inferior mesenteric vein collaterals with dilated intestinal veins; 4) no right-sided vein collaterals, and 5) no varices in the upper abdomen. Conclusion: “Low” LA PDACs involving SMV with all its tributaries can be radically and safely resected in highly and specifically selected cases without PV/SMV reconstruction with an acceptable survival rate.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f4770f53124ff4351de81da2c3a68c5bf6249981bd0af8c3bc07583bbb1550f3","category":"Interdisciplinary"}