{"title":"Integrating very high resolution environmental proxies in genotype–environment association studies","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13737?af=R","date":1719572374000,"content":"<h2>Abstract</h2>\n<p>Landscape genomic analyses associating genetic variation with environmental variables are powerful tools for studying molecular signatures of species' local adaptation and for detecting candidate genes under selection. The development of landscape genomics over the past decade has been spurred by improvements in resolutions of genomic and environmental datasets, allegedly increasing the power to identify putative genes underlying local adaptation in non-model organisms. Although these associations have been successfully applied to numerous species across a diverse array of taxa, the spatial scale of environmental predictor variables has been largely overlooked, potentially limiting conclusions to be reached with these methods. To address this knowledge gap, we systematically evaluated performances of genotype–environment association (GEA) models using predictor variables at multiple spatial resolutions. Specifically, we used multivariate redundancy analyses to associate whole-genome sequence data from the plant <i>Arabis alpina</i> L. collected across four neighboring valleys in the western Swiss Alps, with very high-resolution topographic variables derived from digital elevation models of grain sizes between 0.5 m and 16 m. These comparisons highlight the sensitivity of landscape genomic models to spatial resolution, where the optimal grain sizes were specific to variable type, terrain characteristics, and study extent. To assist in selecting variables at appropriate spatial resolutions, we demonstrate a practical approach to produce, select, and integrate multiscale variables into GEA models. After generalizing fine-grained variables to multiple spatial resolutions, a forward selection procedure is applied to retain only the most relevant variables for a particular context. Depending on the spatial resolution, the relevance for topographic variables in GEA studies calls for integrating multiple spatial scales into landscape genomic models. By carefully considering spatial resolutions, candidate genes under selection by a more realistic range of pressures can be detected for downstream analyses, with important applied implications for experimental research and conservation management of natural populations.</p>","author":"Annie S. Guillaume, \nKevin Leempoel, \nAude Rogivue, \nFelix Gugerli, \nChristian Parisod, \nStéphane Joost","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"f479f70eaf8aca89c6768512bf536a6bc47aa093d193707dd517417d518801d9","category":"Environment"}