{"title":"Forest Tree Virome as a Source of Tree Diseases and Biological Control Agents","link":"http://link.springer.com/10.1007/s40725-024-00214-8","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <span>\n                      <h3>Purpose of Review</h3>\n                      <p>The collective virome of forest trees can be considered to include not only plant viruses, but also viral communities harbored by all tree-associated organisms. In this review, we will concentrate on reviewing recent developments in the two fields of forest tree virology that have received the most research input during the last 5 years: (1) current knowledge of virus diseases affecting forest trees and their causal agents and (2) fungal viruses (mycoviruses) and properties that are required for utilizing them for biocontrol purposes.</p>\n                    </span>\n                    <span>\n                      <h3>Recent Findings</h3>\n                      <p>The discovery of plant and mycoviruses has been revolutionized during the last few years due to high-throughput sequencing (HTS). This has altered our view of virus diversity and prevalence, but also their host ranges, transmission routes, and host effects. Utilization of HTS has greatly expanded our knowledge of plant virus diversity and disease etiology in forest trees and revealed the commonness of cross-kingdom transmission events between fungi, oomycetes, plants, and arthropods. Research on mycoviruses has also identified several new mycoviruses that restrict the growth or virulence of forest pathogenic fungi.</p>\n                    </span>\n                    <span>\n                      <h3>Summary</h3>\n                      <p>Gaining knowledge of the collective virome of forest ecosystems is essential not only for understanding virus evolution and diversity but also for improving our understanding on virus impacts, and our ability for biocontrol-based and environmentally friendly management of viral and fungal diseases that affect economically important plants and beneficial insects, and for preventing possible disease outbreaks in the future. Virus infections play a central role in plant health, but viral symptoms on forest trees remain often unrecognized and may be confused with other biotic or abiotic damages. However, recent studies have revealed previously unknown viruses as causes of forest tree symptoms and suggest that viruses are responsible for far greater economic losses than recognized earlier. However, many knowledge gaps still need to be filled, particularly on the diversity of viruses that infect different species of forest trees, their irregular distribution within the plant, their mode of transmission, epidemiology and choice of hosts also regarding crop plants, their effect on the metabolism of their host tree, and their interaction with other microorganisms. Mycovirus research has already deciphered detailed information on many critical properties that affect utilizing them for biocontrol purposes. Still, more knowledge is needed concerning mycoviral transmission mode and stability in field conditions, the level of host tolerance against mycoviral infection, and the occurrence of interspecies mycovirus transmission in nature, and safety issues related to these topics.</p>\n                    </span>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"f4859457619b47f51a7e591600f6f80cbfb034d8d828ead666066eb20f8e0455","category":"Environment"}