{"title":"Sidewalk Labs เปิดตัว Pebble ระบบเก็บข้อมูลพื้นที่จอดรถแบบเรียลไทม์","link":"https://www.blognone.com/node/122735","date":1621358242000,"content":"<div><div><div><p>Sidewalk Labs บริษัทพัฒนาเทคโนโลยีสมาร์ทซิตี้ในกลุ่ม Alphabet เปิดตัว Pebble ระบบสำหรับเก็บและแสดงข้อมูลการจอดรถแบบเรียลไทม์ เพื่อช่วยในการบริหารจัดการที่จอดรถในเมือง</p>\n<p>Sidewalk Labs ระบุว่า ปัญหาที่จอดรถในเมืองเป็นปัญหาที่ซับซ้อน บางครั้งที่จอดไม่พอ สร้างปัญหาจราจรหรือมลภาวะ และบางครั้งที่จอดมากเกินไป เป็นภาระในการดูแลและไม่ได้ใช้ประโยชน์จากพื้่นที่มากเท่าที่ควร แต่ผู้วางแผนไม่มีข้อมูลสในการจัดการระบบจอดรถให้เหมาะสม เทคโนโลยีที่มีอยู่ปัจจุบันก็แพง, ติดตั้งยาก หรือไม่ก็ละเมิดความเป็นส่วนตัวมากเกินไป จึงเกิดเป็น Pebble เทคโนโลยีเก็บข้อมูลที่จอดรถที่ติดตั้งง่ายและราคาไม่แพง รวมถึงไม่ละเมิดความเป็นส่วนตัวของผู้ใช้ด้วย</p>\n<p>Pebble มีเซนเซอร์เซนเซอร์ทรงกลมขนาดเล็กสำหรับติดตั้งที่พื้นลานจอดรถเพื่อเก็บข้อมูลว่ามีรถจอดอยู่หรือไม่ และมีเกตเวย์เก็บรวบรวมข้อมูลจากเซนเซอร์ส่งขึ้นคลาวด์ผ่านระบบเครือข่ายโทรศัพท์เพื่อนำไปประมวลผลและใช้งานต่อ ซึ่งข้อมูลที่ Pebble เก็บมาจะไม่ใช่ข้อมูลระบุตัวตนของบุคคลหรือยานพาหนะ เซนเซอร์จะบอกแค่มีรถจอดหรือไม่เท่านั้น ซึ่ง Sidewalk Labs ออกแบบให้เซนเซอร์ใช้งานได้นานหลายปี และเกตเวย์ก็สามารถทำงานได้ตลอดเวลาเนื่องจากใช้พลังแสงอาทิตย์</p>\n<p>การมีข้อมูลที่จอดรถแบบเรียลไทม์จะช่วยย้ำเตือนให้คนขับรถรับทราบว่าที่จอดมีจำกัด ซึ่งจะเป็นการเชิญชวนให้ใช้ระบบ park and ride เพื่อต่อขนส่งสาธารณะทางอ้อม รวมถึงข้อมูลเหล่านี้ยังมีประโยชน์ในการใช้วิเคราะห์และวางแผนการสร้างที่จอดรถ เพราะที่จอดรถบางที่สามารถใช้ร่วมกันได้ ซึ่งจะทำให้การใช้พื้นที่ในเมืองโดยรวมมีประสิทธิภาพมากยิ่งขึ้น</p>\n<p>ที่มา - <a href=\"https://medium.com/sidewalk-talk/introducing-pebble-a-low-cost-way-to-manage-parking-and-curbs-dbb79b570fda\">Sidewalk Labs (Medium)</a>, <a href=\"https://techcrunch.com/2021/05/18/sidewalk-labs-launches-pebble-a-sensor-that-uses-real-time-data-to-manage-city-parking/\">TechCrunch</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/0fc820493b43fe97c635f204fed6e200.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/sidewalk-labs\">SideWalk Labs</a></div><div><a href=\"/topics/smart-city\">Smart City</a></div><div><a href=\"/topics/alphabet\">Alphabet</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f49529de37cf9e41ad44821d312321532fe48384dd678c6463f3513a6eb618a9","category":"Thai"}