{"title":"Event Horizon Telescope captures birth of black hole jet in Centaurus A","link":"https://arstechnica.com/?p=1781584","date":1626898602000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/centuariTOP-800x531.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/centuariTOP.jpg\">Enlarge</a> <span>/</span> Highest-resolution image of Centaurus A obtained with the Event Horizon Telescope on top of a color composite image of the entire galaxy. (credit: <a href=\"https://www.ru.nl/english/\">Radboud University/ESO/WFI/MPIfR//APEX/NASA/CXC/CfA/EHT/M. Janssen et al.</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The <a href=\"https://eventhorizontelescope.org\">Event Horizon Telescope</a> (EHT) collaboration made headlines in 2019 by capturing the very first direct image of a black hole at the center of a galaxy. Now, the EHT is back with another exciting breakthrough: images of the \"dark heart\" of a radio galaxy known as <a href=\"https://en.wikipedia.org/wiki/Centaurus_A\">Centaurus A</a>. The images enable the EHT to pinpoint the location of the supermassive black hole at the galaxy's center, according to <a href=\"https://www.nature.com/articles/s41550-021-01417-w\">a new paper</a> published in the journal Nature Astronomy. The images also capture the birth of a powerful jet emitting from the black hole. The jet's unusual characteristics could help astronomers answer a few nagging questions about how such jets are produced in the first place.</p>\n<p>\"This allows us for the first time to see and study an extragalactic radio jet on scales smaller than the distance light travels in one day,\" <a href=\"https://eventhorizontelescope.org/blog/eht-pinpoints-dark-heart-nearest-radio-galaxy\">said co-author Michael Janssen</a>, an astronomer at Max Planck Institute for Radio Astronomy in Bonn and Radboud University Nijmegen. \"We see up close and personally how a monstrously gigantic jet launched by a supermassive black hole is being born.\"</p>\n<p>Centaurus A (aka NGC 5128) is one of the largest and brightest objects in the night sky, making it especially popular with amateur stargazers, although it's only visible from the Southern Hemisphere and low northern latitudes. Located in the constellation Centaurus, the galaxy was discovered in 1826 by James Dunlop. In 1847, John Herschel noted its peculiar shape—it looks elliptical when viewed from Earth, with a lane of dust superimposed across it.</p></div><p><a href=\"https://arstechnica.com/?p=1781584#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1781584&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f498698b9a34ed599a93e28a404e361e16a7af24adc1f959b767a434e986e91f","category":"Tech"}