{"title":"The plant rhabdovirus viroporin P9 facilitates insect-mediated virus transmission in barley","link":"https://academic.oup.com/plcell/article/36/9/3483/7685853?rss=1","date":1717113600000,"content":"<span><div>Abstract</div>Potassium (K<sup>+</sup>) plays crucial roles in both plant development and immunity. However, the function of K<sup>+</sup> in plant–virus interactions remains largely unknown. Here, we utilized <span>Barley yellow striate mosaic virus</span> (BYSMV), an insect-transmitted plant cytorhabdovirus, to investigate the interplay between viral infection and plant K<sup>+</sup> homeostasis. The BYSMV accessory P9 protein exhibits viroporin activity by enhancing membrane permeability in <span>Escherichia coli</span>. Additionally, P9 increases K<sup>+</sup> uptake in yeast (<span>Saccharomyces cerevisiae</span>) cells, which is disrupted by a point mutation of glycine 14 to threonine (P9<sup>G14T</sup>). Furthermore, BYSMV P9 forms oligomers and targets to both the viral envelope and the plant membrane. Based on the recombinant BYSMV–GFP (BYGFP) virus, a P9-deleted mutant (BYGFP<sup>ΔP9</sup>) was rescued and demonstrated infectivity within individual plant cells of <span>Nicotiana benthamiana</span> and insect vectors. However, BYGFP<sup>ΔP9</sup> failed to infect barley plants after transmission by insect vectors. Furthermore, infection of barley plants was severely impaired for BYGFP-P9<sup>G14T</sup> lacking P9 K<sup>+</sup> channel activity. In vitro assays demonstrate that K<sup>+</sup> facilitates virion disassembly and the release of genome RNA for viral mRNA transcription. Altogether, our results show that the K<sup>+</sup> channel activity of viroporins is conserved in plant cytorhabdoviruses and plays crucial roles in insect-mediated virus transmission.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"f4a2a0f9a42acac734d6f04634a545d99dc182f7d27c5b759b823eeb94fc617d","category":"Environment"}