{"title":"Importance of Variable Turbine Efficiency in Run‐Of‐River Hydropower Design Under Deep Uncertainty","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035713?af=R","date":1718434800000,"content":"<h2>Abstract</h2>\n<p>When less water is available, hydropower turbines are less efficient, or have to stop altogether. This reality is often neglected in recent work on the planning and operations of hydropower systems, despite widespread expected increases in drought intensity, frequency and duration. This paper is the first to integrate variable-efficiency turbines into a hydropower plant design framework that accounts for design optimization as well as deep uncertainty in climatic and socio-economic variables. Specifically, this framework focuses on leveraging multi-objective robust decision making for the financially robust design of run-of-river hydropower plants, whose output is highly sensitive to flow variability. Application to five plants in Türkiye challenges two key design assumptions, use of net present value as a design objective and use of identical turbines. Instead, maximizing the benefit-cost ratio yields plants with better financial viability over a range of plausible futures. They tend to have smaller capacity, and feature a small turbine that is well-adapted to low-flow periods. Another key insight is that socio-economic uncertainties have as much or even more impact on robustness than climate conditions. In fact, these uncertainties have the potential to make many small hydropower projects too risky to build. Our findings are of considerable practical relevance at a time where 140 GW of unexploited small hydropower potential could help power the energy transition. They also highlight the need for similar research in reservoir-based plants, considering over 3,000 such plants planned or in construction worldwide.</p>","author":"Veysel Yildiz, \nSolomon Brown, \nCharles Rougé","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"f4a2b8e1b6469f0e4faef5d7d3ac49d8a0bd2733da845a16da82768207142359","category":"Environment"}