{"title":"We need better crash test dummies, says Government Accountability Office","link":"https://arstechnica.com/?p=1923489","date":1678723419000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-982837-001-800x531.jpg\" alt=\"Crash test dummy heads about to hit airbags\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-982837-001-scaled.jpg\">Enlarge</a> (credit: Wayne Eastep/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Women and older people are being failed by our crash test dummies, according to the US Government Accountability Office. The <a href=\"https://www.gao.gov/products/gao-23-105595\">GAO has just published</a> a new report on the topic and is concerned that the National Highway Traffic Safety Administration has not done enough to fill knowledge or research gaps that would make our vehicles safer for those more-vulnerable classes of occupants. Consequently, the GAO is recommending that NHTSA create a comprehensive plan to improve that crash test dummy data.</p>\n<p>There's no question that cars today are safer than they were even two decades ago. In addition to the crash testing required by the Federal Motor Vehicle Safety Standards (FVMSS), programs like NHTSA's New Car Assessment Program (NCAP) and the <a href=\"https://arstechnica.com/cars/2019/05/this-institute-crash-tests-cars-to-make-us-all-safer/\">Insurance Institute for Highway Safety's Top Safety Picks</a> publicize their test scores, which has forced manufacturers to improve occupant protection to get those all-important safety scores, and now cars have to be designed to deal with offset collisions, side impacts, and rollovers, as well as head-on crashes.</p>\n<p>But the benefits of improved in-car safety have been mostly seen by men.</p></div><p><a href=\"https://arstechnica.com/?p=1923489#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1923489&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"23e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f4b0502d90014c3a469a3667766e455acb91211efd7829f812bc2f","category":"Tech"}