{"title":"Police search Bahrain Victorious Tour de France team hotel","link":"https://cyclingtips.com/2021/07/police-search-bahrain-victorious-tour-de-france-team-hotel/","date":1626340484000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033261-062-650x433.jpg\" /></div><h2>Police search Bahrain Victorious Tour de France team hotel</h2><p>\n</p><p>French police searched the Bahrain Victorious team hotel on Wednesday after the conclusion of stage 17 of the <a href=\"https://cyclingtips.com/tag/tour-de-france/\">Tour de France</a>. </p>\n\n\n\n<p>The team said the investigation involved a search of riders’ rooms, and that police requested all of the team’s training files, which the team compiled with and gave to the officers as requested.</p>\n\n\n\n<p>“Following stage 17, we were greeted by several French police officers. We were not given a warrant to read through, but the team complied with all the officers’ requests,” Bahrain Victorious Technical Director Vladimir Miholjević said in a statement.</p>\n\n\n\n<p>“We are committed to highest level of professionalism and adherence to all regulatory requirements and will always be cooperating in a professional manner. The process had impacted our riders recovery and meal planning and as a professional team, the well being of our team is a key priority.”</p>\n\n\n\n<p>Movistar was reportedly staying at the same hotel but was not part of the investigation. </p>\n\n\n\n<p>The operation was carried out by the Marseille prosecutor’s office and the central office for the fight against attacks on the environment and public health (OCLAESP). This is the same office that <a href=\"https://cyclingtips.com/2020/09/french-police-searched-nairo-quintanas-hotel-room/\">searched the hotel of Arkéa-Samsic</a> at last year’s Tour.</p>\n\n\n\n<p>The Marseille prosecutor’s office later confirmed in a statement that it had opened a preliminary investigation on July 3.</p>\n\n\n\n<p>The investigation was into the possible “acquisition, transportation, possession and importing of a prohibited substance or method for use by an athlete without justification by members of Team Bahrain Victorious, currently in action at the 2021 Tour de France,” read a statement.</p>\n\n\n\n<p>Bahrain Victorious has already had a very successful 2021 Tour with two stage wins with Matej Mohoric and Dylan Teuns. Furthermore, Wout Poels is leading the King of the Mountains classification and the squad currently sits atop the Teams classification.</p>\n\n\n\n<p>Pau, the scene of the raid, has a weird history with the Tour de France. It was where Frank Schleck left the Tour de France after a positive doping test in 2012 and where Lance Armstrong held his infamous press conference in 2001 to deny allegations of cheating.</p>\n\n\n\n<p>It seems the legacy of Pau continues with news of the Bahrain Victorious raid.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/police-search-bahrain-victorious-tour-de-france-team-hotel/\">Read More</a>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f4b25e9378efdf8bb8e4685b84a33721f58bb02eec0181f145f169fe60bdace9","category":"Cycling"}