{"title":"Evaluating the Effect of Morphologic Units on Fractional Sediment Mobility and Bedload Transport in a Small Pool‐Riffle Reach","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037348?af=R","date":1721458800000,"content":"<h2>Abstract</h2>\n<p>This study examines the spatial pattern of fractional sediment mobility and assesses the influence of morphologic units on bedload transport in a small pool-riffle reach with limited supply. Using a 2D hydraulic model and a subsurface-based sediment transport model, shear stresses, fractional sediment mobility, and bedload transport were examined for flow events ranging in magnitude between 0.2Q<sub>bf</sub> and 1.5Q<sub>bf</sub>. Results reveal that while spatial variations in shear stress decrease as discharge increases, only a small proportion of the bed experiences high transport rates. At the reach scale, riffles are the primary morphological unit contributing to fully mobile sediment for all size fractions. However, at a subunit scale, there is evidence of sediment transport reversal for grains &gt;32 mm at flows near or exceeding bankfull discharge in association with shear stress reversal. These transport reversals are important for maintaining pools despite their infrequent occurrence in the study reach. Sediment transport maps indicate that bed morphology considerably influences sediment transport at low to moderate flows. During these events, the shear stress is sensitive to local bed topography and partial mobility is the dominant transport process. In contrast, variations in bedload transport rates decrease during high flows when the flow is less sensitive to variations in bed topography and the bed becomes fully mobile.</p>","author":"Nisreen G. Al‐Ghorani, \nMarwan A. Hassan, \nConor McDowell","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"f4cc5a39c4a821530abe87983f91f365b28b2904148bedd2ad28e11644810b9b","category":"Environment"}