{"title":"High-quality genome assembly enables prediction of allele-specific gene expression in hybrid poplar","link":"https://academic.oup.com/plphys/article/195/1/652/7615075?rss=1","date":1708992000000,"content":"<span><div>Abstract</div>Poplar (<span>Populus</span>) is a well-established model system for tree genomics and molecular breeding, and hybrid poplar is widely used in forest plantations. However, distinguishing its diploid homologous chromosomes is difficult, complicating advanced functional studies on specific alleles. In this study, we applied a trio-binning design and PacBio high-fidelity long-read sequencing to obtain haplotype-phased telomere-to-telomere genome assemblies for the 2 parents of the well-studied F<sub>1</sub> hybrid “84K” (<span>Populus alba</span> × <span>Populus tremula</span> var. <span>glandulosa</span>). Almost all chromosomes, including the telomeres and centromeres, were completely assembled for each haplotype subgenome apart from 2 small gaps on one chromosome. By incorporating information from these haplotype assemblies and extensive RNA-seq data, we analyzed gene expression patterns between the 2 subgenomes and alleles. Transcription bias at the subgenome level was not uncovered, but extensive-expression differences were detected between alleles. We developed machine-learning (ML) models to predict allele-specific expression (ASE) with high accuracy and identified underlying genome features most highly influencing ASE. One of our models with 15 predictor variables achieved 77% accuracy on the training set and 74% accuracy on the testing set. ML models identified gene body CHG methylation, sequence divergence, and transposon occupancy both upstream and downstream of alleles as important factors for ASE. Our haplotype-phased genome assemblies and ML strategy highlight an avenue for functional studies in <span>Populus</span> and provide additional tools for studying ASE and heterosis in hybrids.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"f4d41dd4161d42803e95a572a3fb01109d30468ae7e882879eeb5c832d9a63b3","category":"Environment"}