{"title":"Report: Vision Pro Headset's Complex Design Forcing Apple to Make 'Drastic' Production Cuts","link":"https://www.macrumors.com/2023/07/03/apple-vision-pro-drastic-production-cuts/","date":1688374210000,"content":"Apple has been forced to make \"drastic cuts\" to production forecasts for its Vision Pro mixed reality headset due to the complexity of its design and difficulties in production, reported the <em><a href=\"https://www.ft.com/content/b6f06bde-17b0-4886-b465-b561212c96a9\">Financial Times</a></em> on Monday.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/apple-vision-pro-eye-tracking.jpg\" alt width=\"2080\" height=\"1170\" />\r<br />\nApple's $3,500 headset is set to go on sale early next year, but analysts have suggested the lengthy gap between its unveiling at WWDC in June and official launch could be more to do with supply chain problems than a way to give developers time to create apps for the device. \r<br />\n\r<br />\nAccording to the paywalled report, Apple is said to have been unhappy with the productivity of manufacturing partners tasked with supplying the two micro-OLED displays for the wearer's eyes and the outward-facing curved lenticular lens. The micro-OLED displays were reportedly supplied by Sony and TSMC for the prototypes, but it is not known who is supplying them at scale. \r<br />\n\r<br />\nAs a result of production challenges, Apple is preparing to make fewer than 400,000 units in 2024, according to the report, citing sources close to Apple and Luxshare, the Chinese contract manufacturer that will initially assemble the device. Meanwhile, two China-based sole suppliers of certain components for the Vision Pro reportedly said Apple was only asking them for enough for 130,000 to 150,000 units in the first year.\r<br />\n\r<br />\n\"Both projections imply a significant cut to production from an earlier, internal sales target of 1mn units in the first 12 months,\" wrote the <em>FT</em>. \"The forecasts for low volumes reflect Apple's lack of confidence in being able to scale production, according to analysts and industry experts, following years of missed deadlines in launching the device,\" the report added.\r<br />\n\r<br />\nMeanwhile, Apple is said to have pushed back plans to launch a more affordable version of the headset that it hopes will appeal to the mass market. Apple is reportedly working with Korean display makers Samsung and LG on the second-generation headset, and has explored using mini-LED for the displays to drive the price lower. However, <em>FT</em>'s sources claimed Apple was insisting on using micro-OLED even for the non-Pro headset, despite suppliers failing to match expectations.\r<br />\n\r<br />\n<em>Bloomberg</em>'s Mark Gurman previously <a href=\"https://www.macrumors.com/2023/06/12/cheaper-apple-vision-headset-2025/\">reported</a> that Apple plans to launch a more affordable version of its Vision Pro headset by the end of 2025, likely to be called \"Apple Vision One,\" or more simply, \"Apple Vision.\" <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/ft-com/\">Financial Times</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/03/apple-vision-pro-drastic-production-cuts/\">Report: Vision Pro Headset's Complex Design Forcing Apple to Make 'Drastic' Production Cuts</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/report-vision-pro-headsets-complex-design-forcing-apple-to-make-drastic-production-cuts.2394909/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f4de642eaf3c8ca51704b04ec01e1ddcf7e2071b0b785860c6db23e58ae89f46","category":"Apple"}