{"title":"Paper‐and‐Pencil vs. Electronic Patient Records: Analyzing Time Efficiency, Personnel Requirements, and Usability Impacts on Healthcare Administration","link":"https://www.preprints.org/manuscript/202409.1883/v1","date":1727165216000,"content":"Objective\nThe healthcare industry has witnessed a paradigm shift with the adoption of Electronic Patient Records (EPRs), transitioning from traditional Paper and Pencil (P&amp;P) methods to sophisticated, technology-driven documentation systems. However, the integration of EPRs into clinical settings has introduced new challenges. This study investigates workflow consequences of switching from P&amp;P to EPR systems.\nMethods\nIn this study, two independent observers audited surgical ward rounds to assess the effects of transitioning from P&amp;P to EPR. These audits captured number of medical personnel and five key aspects before and after EPR implementation. Additionally, the EPR system's usability was gathered through the System Usability Scale (SUS) and the Post Study System Usability Questionnaire (PSSUQ).\nResults\nA total of 192 observations using P&amp;P and 160 with the EPR system were analyzed. Results indicated that physicians spent a lower proportion of time in patient rooms using the P&amp;P modality (median = 0.14, IQR = [0.06, 0.24]) compared to the EPR system (median = 0.19, IQR = [0.12, 0.29]). Conversely, nurses spent more time with the P&amp;P modality (median = 0.13, IQR = [0.08, 0.18]) than with the EPR system (median = 0.10, IQR = [0.06, 0.13]). The typical team in the P&amp;P modality comprised two physicians and four nurses, while teams in the EPR system generally included two or three physicians and three nurses. Usability assessments yielded scores rated as \"Not Acceptable.\"\nConclusion\nThe EPR is already known to contribute to an increased administrative burden. Our findings generally align with this view in the physician sample, whereas nurses did not encounter difficulties switching systems. However, usability scores indicated that the EPR system falls short of meeting user acceptance expectations. Given the continuous increase in administrative workload, our results suggest that ururcing administrative tasks could enhance the efficiency of medical duties performed at patient's bedside.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f4deb2b9f3ebe79218d32c185220cdd5d441b2d30327668e156ac016b1d0f501","category":"Interdisciplinary"}