{"title":"62 Relationship between feed efficiency and reproductive measures in beef heifers","link":"https://academic.oup.com/jas/article/102/Supplement_3/301/7757506?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The objective of this study was to determine the influence of residual feed intake (RFI) classification on reproductive measures and pregnancy rates in beef heifers. During an 8-yr period, 1,090 heifers were tested for feed efficiency in 70-d trials using a GrowSafe system. Heifers had ad libitum access to water and diets designed to meet NRC requirements for 0.90 kg/d gain. Diets, fed as a total mixed ration, were 85% forage and 15% concentrate which included vitamin and mineral supplements. Heifers were weighed at weaning, the beginning of the RFI trial, at yearling, end of the RFI trial and at breeding. Residual feed intake values were calculated, and heifers were grouped into RFI categories of Average (AVG), Efficient (EFF) or Inefficient (INE). At 13 mo of age, reproductive tract scores (RTS) and pelvic areas were measured. In 5 of the years, heifers (n = 487) also had antral follicle counts (AFC) determined via transrectal ultrasonography. Heifers were estrous synchronized and artificially inseminated (AI) with AI bulls balanced across efficiency categories. Estrus response to synchronization was recorded at fixed-time AI. Pregnancy status and fetal age were determined via transrectal ultrasonography at 60 d and 100 d after AI. Records from 1,078 heifers were used in the analysis (AVG = 428; EFF = 317; INE = 333). Dry matter intake (DMI), body weights, average daily gain (ADG), RTS, and AFC were analyzed using Mixed procedures in SAS. Estrus response and pregnancy rates were evaluated using Logistic procedures. Differences among RFI categories (<span>P</span> &lt; 0.0001) were a result of differences in DMI (<span>P</span> &lt; 0.001) averaging 12.5, 11.5, and 10.2 kg/d (SE = 0.44 kg/d) for INE, AVG and EFF heifers, respectively. In addition, ADG was greater (<span>P</span> &lt; 0.05) for AVG compared with INE heifers. Prior to RFI classification, birth weight was less (<span>P</span> &lt; 0.03) in EFF compared with AVG heifers, and weaning weight (<span>P</span> &lt; 0.01) greater in EFF compared with AVG or INE heifers. However, yearling weight and breeding weight were similar (<span>P</span> = 0.60) across RFI category. Indicators of reproductive development, RTS (<span>P</span> = 0.24) and AFC (<span>P</span> = 0.79) were not different among RFI category. Estrus response to synchronization increased (<span>P</span> &lt; 0.04) for INE (77.3%) compared with AVG (69.1%) or EFF (70.1%) heifers. However, fixed-time AI and final pregnancy rates were similar (<span>P</span> &gt; 0.69) among RFI categories and averaged 54.7%, 54.5%, 52.7% and 89.7%, 88.8%, 87.8% for AVG, EFF and INE heifers, respectively. In conclusion, differences in feed efficiency as indicated by RFI had limited influence on measures of reproductive development in beef heifers and did not alter pregnancy rates. Therefore, placing emphasis on feed efficiency in developing beef heifers should not alter reproductive performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f4dead633502ea87f24ce4ae6d150df9913c69d920c9d36533249735a5494c13","category":"Environment"}