{"title":"No live coverage for 2021 AJ Bell Women’s Tour","link":"https://www.cyclist.co.uk/news/10131/womens-tour-live","date":1632741329000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>27 Sep 2021</span></div>    </div></div><p>\nOnly nightly highlights will be available on ITV4 and Eurosport GCN</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/07/2019_womens_tour_champion_lizzie_deignan.jpg?itok=IZwEamA8\" />  </div>\n<div>\n      <p> The AJ Bell Women’s Tour has announced that the 2021 edition of the race will not be broadcast live. Organisers cited commercial realities as the reason they would not be able to expand their coverage of the week-long event, which takes place early next month.</p>\n<p>A free-to-air nightly highlights programme will be shown on ITV4 in the UK and then distributed internationally by Eurosport GCN. The Women’s Tour have stated they will provide content on their social media channels and website to inform and update fans.</p>\n<p>Organisers said, ‘The past two years have been incredibly challenging as a race organiser, particularly since there has not been an edition of the Women’s Tour for 28 months. This has been the hardest time in the race’s existence and provided challenges even greater than when we created and established the Women’s Tour in 2014.</p>\n<p>‘We appreciate that fans of the Women’s Tour in the UK and around the world will not be able to watch the race live. We share their disappointment. There is nothing that we would like more than to be able to showcase the fantastic racing, beautiful scenery and great community support that the race receives through a live broadcast.</p>\n<p>‘The whole organisation shares the same determination to have a fantastic Women’s Tour in October 2021 and to do our utmost to be able to tell the story of the 2022 race live around the world.’</p>\n<p>The inaugural edition of the Women’s Tour took place in 2014 and was won by Marianne Vos. As a result of the 2020 cancellation due to the coronavirus pandemic, the last instalment of the race occurred in 2019, when Lizzie Deignan beat Kasia Niewiadoma by just two seconds over six stages.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/wilier/8894/wilier-filante-slr-wilier-aero-road-bike\">Wilier Filante SLR: Wilier launches new aero road bike</a></div>      <div><a href=\"/in-depth/6894/gallery-wilier-s-greatest-bikes\">Gallery: the greatest Wilier bikes in history</a></div>      <div><a href=\"/news/6486/wilier-expands-range-by-launching-first-wheelsets\">Wilier expands range by launching first wheelsets </a></div>      <div><a href=\"/buying-guides/4343/best-road-bike\">Best road bikes: the best bikes on the market from £729 to over £10,000</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 118: on sale now!</a></div>    </div></div><p>\nThe 2021 edition of the Women’s Tour will take place from the 4th of October to the 9th of October. It was postponed from its original slot in February as a result of the pandemic and will travel from Bicester to Felixstowe over six stages, covering 535 km. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/events\">Events</a></div>    </div></div>","author":"rdavidson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"f4e580599908f6d574f1c1a858ae988a42965bcb62a08118a2070667b98f6b49","category":"Cycling"}