{"title":"Two datasets over South Tyrol and Tyrol areas to understand and characterize water resource dynamics in mountain regions","link":"https://www.preprints.org/manuscript/202409.2161/v1","date":1727429966000,"content":"In this work, we present two datasets for specific areas located in South Tyrol (Italy) and in Tyrol (Austria) that can be exploited to monitor and understand water resource dynamics in mountain regions. The idea is to provide the reader with information about the different sources of water supply over five defined test areas. The Snow Cover Fraction (SCF) and Soil Moisture Content (SMC) datasets are derived from machine learning algorithms based on remote sensing data. Both SCF and SMC products are characterized by a spatial resolution of 20 m and are provided for the period from October 2020 to May 2023 (SCF) and from October 2019 to September 2022 (SMC) respectively, each covering 3 seasons of interest, winter for SCF and spring-summer for SMC. For SCF maps, the validation with very high-resolution images shows high correlation coefficients of around 0.9. The SMC products were originally produced with an algorithm validated at global scale, but here, to obtain more insight in the specific alpine mountain environment, the values estimated from the maps are compared with ground measurements of automatic stations located at different altitudes and characterized by different aspects in the Val Mazia catchment in South Tyrol (Italy). In this case a MAE between 0.05 and 0.08 and an unbiased RMSE between 0.05 and 0.09 m3·m-3 were achieved. The datasets presented can be used as input for hydrological models as well as to hydrologically characterize the study alpine area starting from different sources of information.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f4e80fdfbbae744cd751866a927d8c0573b0445030b092a59505a02196a313a4","category":"Interdisciplinary"}