{"title":"Relationship between the extent of vascular injury and the evolution of surgically induced osteochondrosis lesions in a piglet model","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308641","date":1723125600000,"content":"<p>by Ferenc Tóth, Erick O. Buko, Alexandra R. Armstrong, Casey P. Johnson</p>\r\n\r\nOstechondritis dissecans (OCD) is an orthopaedic disease characterized by formation of osteochondral defects in developing joints. Epiphyseal cartilage necrosis (osteochondrosis [OC]) caused by focal failure of vascular supply is the known precursor lesion of OCD, but it remains to be established how the severity of vascular failure drives lesion healing or progression. In the current study we have implemented a novel piglet model of induced osteochondrosis of the lateral trochlear ridge of the femur to determine the role that the extent of ischemia plays in the development and progression of OC/OCD lesions. Ten 4-week-old Yorkshire piglets underwent surgical interruption of the vascular supply to the entirety (n = 4 pigs) or the distal half (n = 6 pigs) of the lateral trochlear ridge of the femur. At 2, 6, and 12 weeks postoperatively, distal femora were evaluated by magnetic resonance imaging (MRI) to determine the fate of induced OC lesions. At 12 weeks, piglets were euthanized, and the surgical sites were examined histologically. After complete devascularization, lesion size increased between the 6- and 12-week MRI by an average of 24.8 mm<sup>2</sup> (95% CI: [-2.2, 51.7]; p = 0.071). During the same period, lesion size decreased by an average of 7.6 mm<sup>2</sup> (95% CI: [-24.5, 19.4]; p = 0.83) in piglets receiving partial devascularization. At 12 weeks, average ± SD lesion size was larger (p&lt;0.001) in piglets undergoing complete (73.5 ± 17.6 mm<sup>2</sup>) vs. partial (16.5 ± 9.8 mm<sup>2</sup>) devascularization. Our study demonstrates how the degree of vascular interruption determines lesion size and likelihood of healing in a large animal model of trochlear OC.","author":"Ferenc Tóth","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f4eb7fe24e1c70a44d2542f1e8c0cee97dd47c1375f9c54164a438f4eb737f21","category":"Interdisciplinary"}