{"title":"Healthcare outcomes and dispositions in persons with obesity within emergency departments in Ontario, Canada: A cross-sectional analysis of the National Ambulatory Care Reporting System (NACRS), 2018–2022","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311190","date":1727359200000,"content":"<p>by Parmis Mirzadeh, Jennifer L. Kuk, Sean Wharton, Reagan A. Reid, Chris I. Ardern</p>\r\nIntroduction <p>The experience of persons with obesity (PwO) in the Canadian healthcare setting has not been widely studied. The objective of this study was to assess care in PwO in emergency departments in Ontario, Canada.</p> Methods <p>This secondary analysis made use of 2018–2022 Canadian Institute for Health Information’s National Ambulatory Care Reporting System. The sample consisted of 4547 individuals with an obesity diagnosis, and 4547 controls who were matched for sex, age, and main diagnosis. Ordinal logistic and multiple linear regression analyses were used to assess triage scores, wait times, and length of stay.</p> Results <p>PwO had 4.8 minutes longer wait time for a physician initial assessment (p&lt;0.01), 3.56 hours longer length of stay in the emergency department (p&lt;0.0001), and 55% greater odds (OR = 1.55, 95% CI: 1.43–1.68) of having a less urgent triage score compared to controls matched for main diagnosis. When further matched for triage score, PwO experienced over three hours longer length of stay for triage level 2 (emergent, p&lt;0.01), five hours longer for triage level 3 (urgent, p&lt;0.01), and nearly two hours longer for triage level 4 (less urgent, p&lt;0.05) cases.</p> Conclusion <p>PwO were rated as less urgent and experienced longer wait times and length of stay, compared to controls matched by sex, age, and main diagnosis. Additional research is needed to confirm the consistency of these findings in other provinces/territories, and to examine clinical outcomes, and the underlying reasons for differences.</p>","author":"Parmis Mirzadeh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f4ec3c3f3f25e2759a93be8c2fee90362ee0cfa632c929ca2df0398c22901176","category":"Interdisciplinary"}