{"title":"Striking UAW workers win key battery plant concession from General Motors","link":"https://arstechnica.com/?p=1974393","date":1696867505000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/GettyImages-1683415244-800x554.jpg\" alt=\"people hold strike signs saying UAW ON STRIKE\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/GettyImages-1683415244-scaled.jpg\">Enlarge</a> <span>/</span> UAW members and workers at the Mopar Parts Center Line, a Stellantis Parts Distribution Center in Center Line, Michigan, hold signs after walking off their jobs at noon on September 22, 2023, and picketing outside the facility. (credit:  MATTHEW HATCHER/AFP via Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Friday, the United Auto Workers gained a key concession from General Motors in its ongoing strike. Workers at GM battery manufacturing plants will be allowed to unionize, as revealed by UAW President Shawn Fain in a <a href=\"https://www.youtube.com/watch?v=BrcRs34Wv00\">livestream</a>.</p>\n<p>\"We were about to shut down GM’s largest money-maker, in Arlington, Texas. The company knew those members were about to walk immediately. And just that threat has provided a transformative win,\" Fain said. Our plan is winning at GM, and we expect it to win at Ford and Stellantis as well.\"</p>\n<p>The autoworker strike began when around 13,000 workers walked off their jobs at three factories in Michigan, Missouri, and Ohio after the UAW's previous contract with Ford, Stellantis, and General Motors expired without a new contract in place in mid-September. A week later, another 5,600 workers joined the strike at 38 locations across 20 states.</p></div><p><a href=\"https://arstechnica.com/?p=1974393#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1974393&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f4ed9c475cd019d9258f128f39118647902e83584fb64cb1f06a7cc0714ec166","category":"Tech"}