{"title":"Google loses “Location History” court battle in Australia","link":"https://arstechnica.com/?p=1757430","date":1618592567000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/02/Google-Maps-location-800x600.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/02/Google-Maps-location.jpg\">Enlarge</a> </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The Australian Federal Court <a href=\"https://www.accc.gov.au/media-release/google-misled-consumers-about-the-collection-and-use-of-location-data\">has ruled</a> that Google misled Android users over its collection of location data. This ruling is in reference to the \"<a href=\"https://arstechnica.com/tech-policy/2018/08/did-google-violate-users-privacy-when-it-secretly-kept-location-data/\">Location History</a>\" controversy from a few years ago. The <a href=\"https://apnews.com/article/828aefab64d4411bac257a07c1af0ecb\">Associated Press</a> reported at the time that turning off the Location History setting does not disable all location-tracking features across every Google product.</p>\n<p>The Australian Competition &amp; Consumer Commission (ACCC) brought the case against Google. The regulatory body's press release states that from January 2017 to December 2018 (the AP article was published in August 2018), \"Google misrepresented that the ‘Location History’ setting was the only Google Account setting that affected whether Google collected, kept or used personally identifiable data about their location.\" The ACCC continues, saying, \"In fact, another Google Account setting titled 'Web &amp; App Activity' also enabled Google to collect, store and use personally identifiable location data when it was turned on, and that setting was turned on by default.\"</p>\n<p>With the court's finding of wrongdoing, it's not clear what the Australian government plans to do about the situation yet. The press release says, \"The ACCC is seeking declarations, pecuniary penalties, publications orders, and compliance orders. This will be determined at a later date.\" ACCC Chair Rod Sims added, \"In addition to penalties, we are seeking an order for Google to publish a notice to Australian consumers to better explain Google’s location data settings in the future. This will ensure that consumers can make informed choices about whether certain Google settings that... collect location data should be enabled.\"</p></div><p><a href=\"https://arstechnica.com/?p=1757430#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1757430&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f4ee417fa2b37eabf04eadd15014e41d7c1b87d524618150592a460d8b674391","category":"Tech"}