{"title":"Distribution Characteristics and Genesis Mechanism of Ground Fissures in Three Northern Counties of the North China Plain","link":"https://www.preprints.org/manuscript/202406.1703/v1","date":1719268308000,"content":"The North China Plain is among the regions most afflicted by ground fissure disasters in China. Recent urbanization has accelerated ground fissure activity in the three counties of the northern North China Plain, posing significant threats to both the natural environment and socioeconomic sustainability. Despite the increased attention, a lack of comprehensive understanding persists due to delayed recognition and limited research. This study conducted field visits and geological surveys across 43 villages and 80 sites to elucidate the spatial distribution patterns of ground fissures in the aforementioned counties. By integrating these findings with regional geological data, we formulated a causative model to explain ground fissure formation. Our analysis reveals a concentration of ground fissures near the Niuxi and Rongxi faults, with the former exhibiting the most extensive distribution. The primary manifestations of ground fissures include linear cracks and patch-shaped collapse pits, predominantly oriented in east-west and north-south directions, indicating tensile failure with minimal vertical displacement. Various factors contribute to ground fissure development, including fault activity, ancient river channel distribution, bedrock undulations, rainfall, and ground settlement. Fault activity establishes a concealed fracture system in shallow geotechnical layers, laying the groundwork for ground fissure formation. Additionally, the distribution of ancient river channels and bedrock undulations modifies regional stress fields, further facilitating ground fissure emergence. Rainfall and differential ground settlement serve as triggering mechanisms, exposing ground fissures at the surface. This research offers novel insights into the causative mechanisms of ground fissures in the northern North China Plain, providing valuable scientific evidence for mitigating ground fissure disasters during the urbanization process in the region.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f50000cbed83b7d004557d9aa08f57224f2ef73e26aeb62ba5dca6fc79afe07c","category":"Interdisciplinary"}