{"title":"Study on ring-road incident duration based on latent class accelerated hazard model","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308473","date":1723471200000,"content":"<p>by Qiangru Shen, Xun Xie, Gen Li, Lan Wu, Le Zhao, Zhen Yang</p>\r\n\r\nAccurately estimating the duration of freeway incidents can enhance emergency management practices and reduce the likelihood of secondary incidents. To investigate the mechanisms through which key factors influence incident duration, this study sorted out the characteristics and variables of the incident duration on a special freeway in Zhejiang Province, that is, the ring road, and developed a latent class accelerated hazard model. Heterogeneity was incorporated into the model. Three distributions (Weibull, Log-normal, and Log-logistic) were compared, and the Log-logistic distribution exhibited superior performance. The analysis revealed two distinct latent classes: Latent Class 1 and Class 2, had class membership probability of 0.53 and 0.47, respectively, with a total of 11 variables being statistically significant at the 0.05 significance level. It is worth noting that, some neglected explanatory variables are discussed in depth in this study. For example, the mechanism of which specific lane is closed has an impact on the incident duration, rather than a general discussion of the number of lane closures. Furthermore, the way in which the driver involved in the incident reports to the police has a significant impact on the duration of incidents. Notably, potential heterogeneity and its influencing mechanism are captured in the model. Additionally, by predicting class membership using posterior probabilities, it was determined that most data points were more likely to belong to Class 1, and the incident duration primarily ranged between 0 and 60 minutes. These findings are helpful to reduce the duration of incidents on ring-roads and freeways in China, and provide theoretical support for the formulation of freeway incident management and treatment policies.","author":"Qiangru Shen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f5048b722d616b3bd47373e3a764dd833c8f4db562656c18c7ff3dcdcab8292a","category":"Interdisciplinary"}