{"title":"PSIII-9 Cannabinoid uptake and depletion in blood plasma of cattle fed hemp leaves","link":"https://academic.oup.com/jas/article/102/Supplement_3/488/7757735?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Recent legislation classified hemp (<span>Cannabis sativa L</span>.) as a non-drug type form of <span>Cannabis sativa</span> that can be legally cultivated if tetrahydrocannabinol (THC) remains &lt; 0.3%. As such, hemp has been classified as an agricultural commodity and production in the United States has increased. Hemp cultivation produces fibrous by-products, such as hemp leaves, that are not utilized for human needs and have potential as livestock feed, especially for cattle. However, the presence of cannabinoids in hemp by-products [e.g., THC and cannabidiol (CBD)] has restricted hemp as feed for livestock due to the potential for cannabinoid retention in tissues. The objective of this study was to determine the uptake and depletion profile of circulating cannabinoids in cattle fed hemp. Ruminally cannulated beef steers (n = 5) consuming forage were utilized in a trial involving a 10-d adaptation period, two 14-d periods during which intake and digestion were measured, and a 45-d monitoring period for tissue collection. Only data related to plasma are presented here. Hemp (cultivar Cherry Wine) was cultivated from May to August 2023, air dried, and manually stripped of leaves. In period 1, steers were fed ad libitum hay and supplemented alfalfa cubes at 0.2% body weight (BW). In period 2, steers received the same diet but were also supplemented hemp leaves at 3.9 mg/kg BW of cannabidiolic acid (CBDA) daily. Blood samples were collected via jugular venipuncture using an 18-gauge needle. Time points for collection in period 2 were 0, 2, 4, 6, 8,12, 36, 48, and 72 h after initial hemp introduction. Time points for collection in the monitoring period were 24, 48, 72, and 96 h after hemp was no longer offered. After collection, blood samples were centrifuged at 1500 x g for 10 min and plasma was analyzed for cannabinoids via ultra-performance liquid chromatography mass spectrometry (UPLC-MS/MS). Several cannabinoids [i.e., CBDA, cannabidivarnic acid (CBDVA), tetrahydrocannabivarnic acid (THCVA), and tetrahydrocannabinolic acid (THCA-A)] were present in plasma at detectable levels 2 h after initial hemp consumption and remained present 96 h after cessation of hemp consumption. THC was not detected in plasma; however, THCA-A, the precursor for delta-9 THC, was present 2 h after hemp was introduced (1.2 ng/mL), reaching peak concentrations at 72 h (20.4 ng/mL), and remained present 96 h after hemp was last consumed (2.8 ng/mL). CBD was detected 36 h after hemp introduction (1 ng/mL) and remained present 96 h after cessation of hemp (0.9 ng/mL) with peak concentrations 24 h after cessation of hemp consumption (3.3 ng/mL). These data indicate cattle consuming hemp rapidly uptake cannabinoids into circulation and these cannabinoids remain present for at least 96 h after hemp consumption ceases. These data provide a foundation for establishing a withdrawal period for hemp in cattle.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f5093e5a0ef76ee738175561cce678f78952dfd9c534d1c5a6f7224e180199c8","category":"Environment"}