{"title":"Predictability: A new distinguishing feature of cancer?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305181","date":1718200800000,"content":"<p>by Ofer N. Gofrit, Ariel Aviv</p>\r\n\r\nCancer is a consequence of stochastic (mutations, genetic, and epigenetic instabilities) and deterministic (evolutionary bottlenecks) events. Stochastic events are less amenable to prediction, whereas deterministic events yield more predictable results. The relative contribution of these opposing forces determines cancer predictability, which affects the accuracy of our prognostic predictions and is critical for treatment planning. In this study, we attempted to quantify predictability. The predictability index (PI) was defined as the median overall-survival at any time point divided by the standard error at that time. Using data obtained from the SEER program, we found striking differences in the PI of different tumors. Highly predictable tumors were malignancies of the breast, thyroid, prostate, and testis (5-year PI of 3516, 1920, 1919, and 1805, respectively). Less predictable tumors were colorectal, melanoma, and bladder (5-year PI of 1264, 1197, and 760, respectively). Least predictable were pancreatic cancer and chronic myelogenous leukemia (5-year PI of 129, and 42). PI decreased during follow-up in all examined tumors and showed sex differences in some cases. Thyroid cancer was significantly more predictable in women (5-year PI of 2579 vs. 748, p = 0.00017) and bladder cancer more predictable in men (5-year PI of 723 vs. 385, p = 0.012), Predictability is a potentially new distinguishing feature of malignancy. This study sheds light on prognostic accuracy and provides insight into the relative roles of stochastic and deterministic forces during carcinogenesis.","author":"Ofer N. Gofrit","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f509a02f08f9459af2fad39ec1c7e0823fdad74557a83d7af0ad38882334e252","category":"Interdisciplinary"}