{"title":"Nothing but relief: Kasper Asgreen ends Soudal–Quick-Step's misery","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/kasper-asgreen-ends-soudal-quick-steps-misery","date":1689882450000,"content":"\n      \n<p>For a team so anonymous, the <em><span>lanterne rouge </span></em>of the prize money classification until now, Soudal–Quick-Step have done remarkably well to remain one of the most-talked about teams at this year’s <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France.</a></p>\n<p><span>It’s partly a consequence of their status, of having Julian Alaphilippe and Fabio Jakobsen in their ranks, but mostly because of the rumours and doubts swirling around their finances and their star man who isn’t even here, Remco Evenepoel.</span></p>\n<div></div>\n<p>Alaphilippe’s decline has continued, and Jakobsen’s crash on stage four that eventually led to his exit has opened up a space to discuss the team’s ills and future, with Evenepoel seeking pastures new and Ineos Grenadiers and Israel-Premier Tech preparing to engage in a tussle to get him out of his contract that runs until the end of 2026. Meanwhile, questions surrounding the commitment of their owners, Zdenek Bakala and Patrick Lefevere, have only added to the noise. The big story from the actual racing was that they were underperforming.<span><br /></span></p>\n<p><span>Usually in their moment of need, such as the last two Classics campaigns, Evenepoel has stepped in and saved their blushes, putting a (temporary) end to the accusations that they’re a fading super power. On stage 18 of the Tour, as the race exited the Alps and headed back towards central France, they had no Remco in their cast, but they did have Kasper Asgreen.</span></p>\n<p><span>The Dane has been on a personal journey of suffering and torture in the past year. He was one of the poster boys for Denmark’s hosting of the Tour in 2022, but he never recovered from a crash at the Tour de Suisse, exited the race before the first rest day, and didn’t race again that year, citing fatigue syndrome. This season hasn’t been much better, the 28-year-old never really showing the form that won him the Tour of Flanders in 2021.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230720TDF1042-A.S.O._Charly_Lopez.jpg?v=1689882093\" alt=\"Tour de France 2023 stage 18\" /></div>\n<p><em>Image by Charly Lopez/ASO</em></p>\n<p><span>His appearance in stage 18’s breakaway looked to be a suicidal one. He was only joined by two others, Victor Campenaerts and Jonas Abrahamsen, with Pascal Eenkhoorn making it four later on. With the gap only ever allowed to stretch to 90 seconds, however, it looked doomed – a mission set to fail. But such a slender advantage was conversely always the plan.</span></p>\n<p><span>“That’s the game that was played,” Asgreen’s DS Tom Steels told </span><em><span>Rouleur</span></em><span>. “You know when you’re in a break you won’t ride away from the peloton. It was just waiting for the right moment to come.” In other words, it’s pointless expending energy to get a five minute gap when you know it’ll be brought back to a minute; best to save that energy and use it when the advantage is less than 60 seconds to give yourself a better chance of staying away. It was a piece of simple tactical brilliance, one that left this author wondering why more breaks don’t operate like that.</span></p>\n<p><span>A good plan, however, still needs to be executed. It was never going to be straightforward, but as the final approached, they still remained out front. It was tense, nervy, unpredictable, and it was only as the finish line came into sight in Bourg-en-Bresse that it looked probable for one of the quartet. Asgreen kicked first, just in time, held off the sprinters, and his torment was over.</span></p>\n<p><span>“I am back where I belong,” he declared, happiness and relief the overriding emotions. For Quick-Step, it was nothing but relief. Finally, their 36-stage wait for a win in the Tour – an eternity for one of cycling’s powerhouses – is over, and finally the Tour de France headlines are a reflection of their sporting prowess.</span></p>\n<p><em>*Cover image by Zac Williams/SWPix.com</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f50f5ebd2c10a1cdbfacc5ef4920250a21adad4f9b30ebdafd5c238308375b28","category":"Cycling"}