{"title":"Air Pollution and Mortality in India: Investigating the Nexus of Ambient and Household Pollution Across Life Stages","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023GH000968?af=R","date":1724133615000,"content":"<h2>Abstract</h2>\n<p>Air pollution in India is a foremost environmental risk factor that affects human health. This study first investigates the geographical distribution of ambient and household air pollution (HAP) and then examines the associated mortality risk. Data on fine particulate matter (PM<sub>2.5</sub>) concentration has been extracted from the Greenhouse Gas Air Pollution Interactions and Synergies (GAINS) model. HAP, mortality and socio-demographic data were extracted from the National Family and Health Survey-5, India, 2019–2021. Regression models were applied to see the difference in age-group mortality by different pollution parameters. The districts with PM<sub>2.5</sub> concentration above the National Ambient Air Quality Standard (NAAQS) level of 40 μg/m<sup>3</sup> show a higher risk of neonatal (OR-1.86, CI 1.418–2.433), postneonatal (OR-2.04, CI 1.399–2.971), child (OR-2.19, CI 0.999–4.803) and adult death (OR-1.13, CI 1.060–1.208). The absence of a separate kitchen shows a higher probability of neonatal (OR: 1.18, CI 1.074–1.306) and adult death (OR-1.06, CI 1.027–1.088). The interaction between PM<sub>2.5</sub> levels above NAAQS and HAP leads to a substantial rise in mortality observed for neonatal (OR 1.19 CI 1.051–1.337), child (OR 1.17 CI 1.054–1.289), and adult (OR 1.13 CI 1.096–1.168) age groups. This study advocates that there is a strong positive association between ambient and HAP and mortality risk. PM<sub>2.5</sub> pollution significantly contributes to the mortality risk in all age groups. Children are more vulnerable to HAP than adults. In India, policymakers should focus on reducing the anthropogenic PM<sub>2.5</sub> emission at least to reach the NAAQS, which can substantially reduce disease burden and, more precisely, mortality.</p>","author":"Mihir Adhikary, \nNandita Saikia, \nPallav Purohit, \nVladimir Canudas‐Romo, \nWolfgang Schöpp","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"f511bd2e84d315f6d6eef0d5ed58c0bacc1d37da1c53254af7d79fd6b42b3684","category":"Environment"}