{"title":"198 Evaluation of zinc source and concentration on growth performance of nursery swine","link":"https://academic.oup.com/jas/article/102/Supplement_2/98/7665077?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Trace minerals (TM) supplementation in swine diets can negatively interact with other nutrients. Zinc (Zn) and copper (Cu) mutually inhibit their intestinal absorption; thus, limiting their bioavailability. Recent peer-reviewed work has suggested that nursery pigs fed a diet supplemented with increased Zn experienced impaired Cu metabolism, negatively impacting growth performance. However, it has been demonstrated that mitigation of antagonisms might be possible with the use of organic TM supplemented at decreased concentrations. To validate these findings, a total of 2,629 pigs [initial body weight (BW) = 6.2 kg] were used in a 37-d experiment. Pens of 36 pigs were randomly allotted to 1 of 8 dietary treatments with 9 replications per treatment. Dietary treatments were formulated to contain 1 of 4 Zn sources: Zn Sulfate, Zn Hydroxychloride A (Intellibond Zn [Micronutrients Inc., Indianapolis, IN), Zn Hydroxychloride B [Zn Hydroxychloride (Alltech, Inc., Nicholasville, KY)] or Organic Zn [Bioplex Zn (Alltech, Inc)] at 1 of 2 concentrations: 125 or 250 ppm. The concentrations utilized for Organic Zn treatment were 62.5 or 125 ppm per published recommendations. Experimental diets were fed in two phases: phase 1 from d 0 to 21 and phase 2 from d 22 to 37. Added Cu in both dietary phases was 10 ppm. At d 37, serum and liver samples (data not showed) were collected from 1 barrow per pen and submitted to Michigan State University Veterinary Diagnostic Laboratory to determine Zn and Cu concentration. No significant source × concentration interactions were observed for growth performance in this study. From d 0 to 37, pigs fed the greatest Zn concentration had less (<span>P</span> = 0.040) average daily feed intake (ADFI) and marginally decreased (<span>P</span> = 0.060) average daily gain (ADG), despite Zn source (Table 1). In addition, a marginal improvement (<span>P</span> = 0.070) in gain to feed ratio (G:F) was observed in pigs fed diets containing Organic Zn, regardless of concentration. For mineral concentrations in serum, there was a marginally significant source × concentration interaction (<span>P</span> = 0.078), where pigs fed diets with 125 ppm of Zn Hydroxychloride B had one of the greatest Zn concentrations, yet it was drastically reduced when pigs were fed diets with 250 ppm. Furthermore, Cu concentration in serum was decreased (<span>P</span> = 0.045) in pigs fed the greatest concentration of Zn, despite source. In conclusion, these results suggest that greater dietary Zn concentration impaired Cu absorption, reduced feed intake, and marginally decreased growth. Organic Zn, included at 50% reduced concentrations, marginally improved feed efficiency.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f52037e9448964c45ffa32cd81e4bf88be7ca4af414ca3ded84e76a8a805e8fb","category":"Environment"}