{"title":"The double life of trichomes: understanding their dual role in herbivory and herbicide resistance","link":"https://academic.oup.com/evolut/article/78/6/1121/7633789?rss=1","date":1711065600000,"content":"<span><div>Abstract</div>Understanding the evolutionary forces that maintain phenotypic variation in ecologically relevant traits has long been one of the central goals of evolutionary ecology. While the maintenance of variation in plant defense is most often hypothesized to be due to trait trade-offs or spatiotemporal variation in herbivore abundance, the role that heterogeneous selective agents may play on the maintenance of variation in plant defense is less examined. Trichomes are hair-like appendages on plant surfaces that can defend against multiple damaging agents such as pathogens, herbivores, and UV radiation. It is currently unknown however if conflicting selection from such heterogeneous agents of damage may act to maintain the variation observed in trichome traits. Here, we assess whether trichomes serve as an herbicide resistance trait and how it coincides with the conventionally studied defensive strategy of herbivory resistance. In a series of experiments, we exposed the annual invasive velvetleaf (<span>Abutilon theophrasti</span>) to glyphosate (active ingredient in “Roundup”) to investigate whether trichome traits (type and density) are linked to herbicide resistance and to test whether herbicide influences selection on plant trichomes. We found that an increased proportion of branched trichomes positively impacted herbicide resistance and chewing herbivory resistance. We also found evidence that glyphosate imposes positive selection on branched trichomes in velvetleaf. Overall, our results indicate that branched trichomes can contribute to both herbicide and herbivory resistance, serving a concordant rather than conflicting role to reduce plant injury. Our findings further suggest that novel anthropogenic agents of selection can alter the composition of plant defense traits, potentially impacting trait-mediated interactions among external stressors.</span>","author":"","siteTitle":"Evolution Current Issue","siteHash":"a2040112c8b98efe6d76767c53ee42b7ea8ce26086ad99269623cfcce66a3405","entryHash":"f526c746a3491a81dd4f9a28b1f1e25ea8a1b9f95179b1613ed6bb03a4dec1aa","category":"Environment"}