{"title":"Implementing routine collection of EQ-5D-5L in a breast cancer outpatient clinic","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307225","date":1724767200000,"content":"<p>by Sofia Torres, Ahmed M. Bayoumi, Ana B. K. Abrahao, Maureen Trudeau, Kathleen I. Pritchard, Chun Nim Li, Nicholas Mitsakakis, Geoffrey Liu, Murray Krahn</p>\r\nPurpose <p>A cross-sectional study was conducted to investigate the feasibility of implementing routine collection of the Euro-Qol 5 dimensions (EQ-5D) questionnaire, to inform drug and health technology reimbursement decision making.</p> Methods <p>Women with breast cancer were recruited during scheduled clinic visits to an academic cancer centre. EQ-5D-5L was self-administered using electronic tablets. Diagnostic and treatment data were abstracted from patient charts. Feasibility was assessed primarily by the proportion of patients who fully completed EQ-5D-5L and by their willingness to complete the instrument at each clinic visit.</p> Results <p>588 women were approached for study participation, 341 were enrolled. Fully completed EQ-5D-5L questionnaires were obtained in 323 participants (95% of participants, 95% CI 92–97%). Median time for EQ-5D-5L completion was 1.5 minutes (range:0.35 to 14.7). Mean age of participants was 58 years old. Most women who completed EQ-5D were White, born outside Canada and presented a high education level; one-quarter had metastatic disease. Most participants reported “No problems” in all EQ-5D-5L dimensions. Mean EQ-5D-5L index and mean EQ-5D-5L VAS values for all participants were respectively 0.83 (SD 0.13) and 75.7 (SD 17.45), with patients with metastatic disease scoring the lowest values. Seventy-eight percent of participants were willing to complete EQ-5D-5L at each clinic visit; lower Charlson comorbidity index and higher education level were predictors of willingness to continue to answer EQ-5D-5L.</p> Conclusions <p>Tablet-based collection of EQ-5D-5L in the context of routine clinical practice proved to be feasible. However, many patients declined study participation or reported being in full health, raising concerns about whether this method of collecting EQ-5D adequately represents the health status of all breast cancer patients.</p>","author":"Sofia Torres","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f5281d1b58858e993f71162794c89511be3a52778b231faa3440b653d4f1dbad","category":"Interdisciplinary"}