{"title":"“I cannot wait to possess you”: Reading 18th century letters for the first time","link":"https://arstechnica.com/?p=1980839","date":1699315265000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/loveletters1CROP-800x532.jpg\" alt=\"bundles of 18th century letters in three piles\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/loveletters1CROP.jpg\">Enlarge</a> <span>/</span> The letters before they were opened and read by Renaud Morieux at The National Archives, Kew. (credit: The National Archives / Renaud Morieux)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>University of Cambridge historian Renaud Morieux was poring over materials at the National Archives in Kew when he came across a box holding three piles of sealed letters held together by ribbons. The archivist gave him permission to open the letters, all addressed to 18th century French sailors from their loved ones and seized by Great Britain's Royal Navy during the <a href=\"https://en.wikipedia.org/wiki/Seven_Years%27_War\">Seven Years' War</a> (1756-1763).</p>\n<p>\"I realized I was the first person to read these very personal messages since they're written,\" <a href=\"https://www.eurekalert.org/news-releases/1006737?\">said Morieux</a>, who just published his analysis of the letters in the journal Annales Histoire Sciences Sociales. \"These letters are about universal human experiences, they’re not unique to France or the 18th century. They reveal how we all cope with major life challenges. When we are separated from loved ones by events beyond our control like the pandemic or wars, we have to work out how to stay in touch, how to reassure, care for people and keep the passion alive. Today we have Zoom and WhatsApp. In the 18th century, people only had letters, but what they wrote about feels very familiar.”</p>\n<p>England and France have a long, complicated history of being at war, most notably the <a href=\"https://en.wikipedia.org/wiki/Hundred_Years%27_War\">Hundred Years' War</a> in the 14th and 15th centuries. The two countries were also almost continuously at war during the 18th century, including the Seven Years' War, which was fought in Europe, the Americas, and Asia-Pacific as England and France tried to establish global dominance with the aid of their respective allies. The war technically evolved out of the North American colonies when England tried to expand into territory the French had already claimed. (Fun fact: A 22-year-old George Washington led a 1754 ambush on a French force at the <a href=\"https://en.wikipedia.org/wiki/Battle_of_Jumonville_Glen\">Battle of Jumonville Glen</a>.) But the conflict soon spread beyond colonial borders, and the British went on to seize hundreds of French ships at sea.</p></div><p><a href=\"https://arstechnica.com/?p=1980839#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1980839&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f5475b3138b54e27522001e3f94101530fb95a2a25056d757b151265b2c7f5c4","category":"Tech"}