{"title":"Neotropical mammal responses to megafires in the Brazilian Pantanal","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17278?af=R","date":1713949271000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/e83f1896-ad32-44b7-9565-1529f896d661/gcb17278-toc-0001-m.png\" alt=\"Neotropical mammal responses to megafires in the Brazilian Pantanal\" />\n<p>We investigated how forest fires in the Brazilian Pantanal affected the occupancy of eight mammals and the density of jaguars and ocelots. We found that occupancy or habitat use declined for six of the species, with the giant armadillo being the most affected species, and the density of jaguars and ocelots remained stable, though the persistence of individuals after the fires was low, suggesting that immigration sustained the population. These results suggest that fires will have significant impacts on the distribution and fitness of species in fire-affected areas, and wider studies on population trends post-fires are needed.</p>\n<br />\n<h2>Abstract</h2>\n<p>The increasing frequency and severity of human-caused fires likely have deleterious effects on species distribution and persistence. In 2020, megafires in the Brazilian Pantanal burned 43% of the biome's unburned area and resulted in mass mortality of wildlife. We investigated changes in habitat use or occupancy for an assemblage of eight mammal species in Serra do Amolar, Brazil, following the 2020 fires using a pre- and post-fire camera trap dataset. Additionally, we estimated the density for two naturally marked species, jaguars <i>Panthera onca</i> and ocelots <i>Leopardus pardalis</i>. Of the eight species, six (ocelots, collared peccaries <i>Dicotyles tajacu</i>, giant armadillos <i>Priodontes maximus</i>, Azara's agouti <i>Dasyprocta azarae</i>, red brocket deer <i>Mazama americana,</i> and tapirs <i>Tapirus terrestris</i>) had declining occupancy following fires, and one had stable habitat use (pumas <i>Puma concolor</i>). Giant armadillo experienced the most precipitous decline in occupancy from 0.431 ± 0.171 to 0.077 ± 0.044 after the fires. Jaguars were the only species with increasing habitat use, from 0.393 ± 0.127 to 0.753 ± 0.085. Jaguar density remained stable across years (2.8 ± 1.3, 3.7 ± 1.3, 2.6 ± 0.85/100 km<sup>2</sup>), while ocelot density increased from 13.9 ± 3.2 to 16.1 ± 5.2/100 km<sup>2</sup>. However, the low number of both jaguars and ocelots recaptured after the fire period suggests that immigration may have sustained the population. Our results indicate that the megafires will have significant consequences for species occupancy and fitness in fire-affected areas. The scale of megafires may inhibit successful recolonization, thus wider studies are needed to investigate population trends.</p>\n<h2>Resumo</h2>\n<p>A crescente frequência e gravidade dos incêndios causados pelo homem provavelmente terão efeitos deletérios na distribuição e persistência das espécies. Em 2020, mega incêndios no Pantanal brasileiro queimaram 43% do bioma e resultaram na mortalidade em massa da vida selvagem. Nós investigamos mudanças no uso ou ocupação do habitat para uma comunidade de oito espécies de mamíferos na Serra do Amolar, Brasil, após os incêndios de 2020, usando um conjunto de dados de armadilhas fotográficas instaladas no período pré e pós-fogo. Além disso, estimamos a densidade de duas espécies naturalmente marcadas, a onça-pintada <i>Panthera onca</i> e a jaguatirica <i>Leopardus pardalis</i>. Das oito espécies, seis (a jaguatirica, o cateto <i>Dicotyles tajacu</i>, o tatu-canastra <i>Priodontes maximus</i>, a cutia <i>Dasyprocta azarae</i>, o veado mateiro <i>Mazama americana</i> e a anta <i>Tapirus terrestris</i>) tiveram ocupação reduzida após os incêndios, e uma teve uso de habitat estável (a onça-parda, <i>Puma concolor</i>). O tatu-canastra apresentou o declínio mais acentuado na ocupação após os incêndios de 0,431 ± 0,171 para 0,077 ± 0,044. A onça-pintada foi a única espécie com uso crescente de habitat, de 0,393 ± 0,127 para 0,753 ± 0,085. A densidade da onça-pintada permaneceu estável ao longo dos anos (2,8 ± 1,3, 3,7 ± 1,3, 2,6 ± 0,85/100 km<sup>2</sup>), enquanto a densidade da jaguatirica aumentou de 13,9 ± 3,2 para 16,1 ± 5,2/100 km<sup>2</sup>. No entanto, o baixo número de onças-pintadas e jaguatiricas recapturadas após o período do fogo sugere que a imigração pode ter sustentado as populações. Nossos resultados indicam que os mega incêndios terão consequências significativas para a ocupação e resiliência das espécies nas áreas afetadas pelo fogo. A escala dos mega incêndios pode inibir uma recolonização bem-sucedida, pelo que são necessários estudos mais amplos para investigar as tendências populacionais.</p>","author":"Rocío Bardales, \nValeria Boron, \nDiego Francis Passos Viana, \nLara L. Sousa, \nEgil Dröge, \nGrasiela Porfirio, \nMaricruz Jaramillo, \nEsteban Payán, \nClaudio Sillero‐Zubiri, \nMatthew Hyde","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"f54c0594895e5a38e13a8b5d8fed04fd119b7cd5c928743a11ab6ada532e79dc","category":"Environment"}