{"title":"Bruno 1/CELF regulates splicing and cytoskeleton dynamics to ensure correct sarcomere assembly <i>Drosophila</i> flight muscles","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002575","date":1714399200000,"content":"<p>by Elena Nikonova, Jenna DeCata, Marc Canela, Christiane Barz, Alexandra Esser, Jessica Bouterwek, Akanksha Roy, Heidemarie Gensler, Martin Heß, Tobias Straub, Ignasi Forne, Maria L. Spletter</p>\r\n\r\nMuscles undergo developmental transitions in gene expression and alternative splicing that are necessary to refine sarcomere structure and contractility. CUG-BP and ETR-3-like (CELF) family RNA-binding proteins are important regulators of RNA processing during myogenesis that are misregulated in diseases such as Myotonic Dystrophy Type I (DM1). Here, we report a conserved function for Bruno 1 (Bru1, Arrest), a CELF1/2 family homolog in <i>Drosophila</i>, during early muscle myogenesis. Loss of Bru1 in flight muscles results in disorganization of the actin cytoskeleton leading to aberrant myofiber compaction and defects in pre-myofibril formation. Temporally restricted rescue and RNAi knockdown demonstrate that early cytoskeletal defects interfere with subsequent steps in sarcomere growth and maturation. Early defects are distinct from a later requirement for <i>bru1</i> to regulate sarcomere assembly dynamics during myofiber maturation. We identify an imbalance in growth in sarcomere length and width during later stages of development as the mechanism driving abnormal radial growth, myofibril fusion, and the formation of hollow myofibrils in <i>bru1</i> mutant muscle. Molecularly, we characterize a genome-wide transition from immature to mature sarcomere gene isoform expression in flight muscle development that is blocked in <i>bru1</i> mutants. We further demonstrate that temporally restricted Bru1 rescue can partially alleviate hypercontraction in late pupal and adult stages, but it cannot restore myofiber function or correct structural deficits. Our results reveal the conserved nature of CELF function in regulating cytoskeletal dynamics in muscle development and demonstrate that defective RNA processing due to misexpression of CELF proteins causes wide-reaching structural defects and progressive malfunction of affected muscles that cannot be rescued by late-stage gene replacement.","author":"Elena Nikonova","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"f553129ba4f6285c7b45b8c9364993de0fc888680ccf0927337c00e79183a5d6","category":"Environment"}