{"title":"Specialized’s 2022 Kenevo SL is a super-aggressive e-enduro bike with incredible powertrain packaging","link":"https://www.bikeradar.com/news/specialized-2022-kenevo-sl/","date":1620921602000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Specialized-Kenevo-SL-pack-73cab56.jpg?quality=45&amp;resize=620,413\" />                                            <p><a href=\"https://www.bikeradar.com/brand/specialized/\">Specialized</a> has launched its long-anticipated 2022 Kenevo SL <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-mountain-bikes/\">electric mountain bike</a>, which, according to Specialized is its Enduro model with added electrical assistance.</p>\n<p>It’s the next logical addition to the range, taking the long-travel suspension layout of <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/specialized-enduro-comp-review/\">its award-winning Enduro</a> and adding the compact assistance of its slightly updated SL1.1 motor system – originally <a href=\"https://www.bikeradar.com/reviews/bikes/electric-bikes/specialized-turbo-levo-sl-review/\">found on the Turbo Levo SL</a> – rather than the Full Power 2.2 system used on the <a href=\"https://www.bikeradar.com/news/specialized-2021-turbo-levo/\">2022 Turbo Levo</a>.</p>\n<p>The bike sits between the non-assisted Enduro and the 5.4kg/12lb heavier (thanks to a higher capacity battery and more powerful Brose motor) Kenevo that was launched a couple of years ago. Specialized claims this offers a balance between power, capability and weight.</p>\n<p>Both the electric Kenevo SL and Levo SL are targeted at riders looking for electrical assistance but turned off by the weight of a traditional e-MTB. We have a size S3 S-Works Kenevo SL in for testing and it weighs 20.7kg.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The mid-range SL Expert comes with a smattering of Fox and in-house Specialized and Roval parts.</span></figcaption><span> <i>Specialized</i></span></div>\n<h2>The 2022 Kenevo SL frame and suspension</h2>\n<p>The 170mm travel 2022 Kenevo SL mirrors the Enduro’s suspension as well as frame, with the same six-bar suspension linkage configuration that effectively uses a <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-mountain-bike-rear-suspension-systems/\" target=\"_blank\">four-bar rear triangle</a> with an additional two bars to drive the shock – it’s just the pivot locations that differ slightly to account for the motor/battery.</p>\n<p>These two extra bars allow Specialized to independently control axle path and leverage rates of the shock. It also insulates the shock from side-loading, which can add friction and wear.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Specialized Kenevo SL’s suspension linkage uses a six-bar configuration.</span></figcaption><span> <i>Specialized</i></span></div>\n<p>This layout was developed for the <a href=\"https://www.bikeradar.com/news/specialized-demo-2020-mullet-bike/\">Demo DH bike</a>, with Loic Bruni and Finn Iles providing plenty of input, and from there it transferred to the Enduro and now Kenevo SL.</p>\n<p>The axle path of the bike is designed to keep the ride as smooth as possible, with an initially rearward axle path that makes it easier for the bike to soak up impacts from the ground. The suspension is said to be relatively active over rougher tracks to keep the ride smooth.</p>\n<p>Later in the stroke, the axle path is more forward, which separates the forces on the chain from pedalling forces, to minimise pedal kickback.</p>\n<p>Progression late in the suspension’s travel via the kinematic isn’t as dramatic as it might have been, with Specialized relying on the <a href=\"https://www.bikeradar.com/news/fox-2021-suspension/\">Fox X2’s bumper</a>. Furthermore, using the physical bumper, rather than ramp up in the shock’s air spring, allows for a larger volume air spring and thus more capacity to use all the bike’s travel.</p>\n<p>Specialized’s engineers have worked hard on the Rx shock tune (each bike’s specific sag value) and have developed a comprehensive suspension set-up program that’s available online should you want to tweak it.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Specialized’s motor is one of the best out there.</span></figcaption><span> <i>Specialized</i></span></div>\n<p>Squeezing the motor into the chassis, around the low-slung suspension was apparently tricky. However, with an already low centre of gravity, this has only been improved with the addition of the powertrain (motor and battery).</p>\n<p>As such, Specialized is saying that the bike should be even more stable and resistant to deflections as it rides the trail.</p>\n<h2>The Specialized Kenevo SL motor system</h2>\n<p>When it came to the motor and battery system, Specialized had a couple of items on its wishlist for the Kenevo SL.</p>\n<p>The Turbo Super Light motor delivers up to 35Nm of torque and 240W. This is significantly less torque than ‘regular’ e-MTBs (usually 70 to 90Nm), and rather than offering the full-on eMTB experience where there can easily be a lot of reliance on the assistance, the focus is more about gentle assistance on the hills.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The internal battery pack is relatively small, but there’s a battery extension pack available that sits in the bike’s bottle cage to up the range.</span></figcaption><span> <i>Specialized</i></span></div>\n<p>The motor’s power is supplied by a 320Wh battery with an optional 160Wh extender battery available.</p>\n<p>With the regular battery in place, the Kenevo SL weighs around 4kg more than an Enduro, and gives up to four hours of assistance – boosted to around seven hours with the extender.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Get a little extra ride-time with the battery booster pack.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<p>The Kenevo’s controller has updated firmware, with more control and a new Mastermind computer for extra information while you’re out on the bike.</p>\n<p>The power delivery has been smoothed, too, thanks to lessons learned from the Levo SL, and reflects improvements in the ride dynamics for technical climbs and how the power cuts out when you reach maximum assistance speed. Alterations have also been made as a result of Specialized testing awkward gear combinations, such as low-torque low-cadences, to try and find its foibles.</p>\n<p>These Mastermind firmware improvements are available ‘over the air’ as an update to all bikes with this motor (Levo SL / <a href=\"https://www.bikeradar.com/reviews/bikes/electric-bikes/specialized-turbo-vado-sl-4-0-review/\">Vado SL</a>), so there’s no need to visit a shop to update.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Data on power levels and battery are now displayed on the top tube.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<p>Specialized says that the ability to update bikes remotely means its R&amp;D on the firmware side of things is never complete – for example, an anti-theft system is due to be released later this year.</p>\n<h2>Specialized Kenevo SL geometry</h2>\n<p>The Kenevo SL uses Specialized’s ‘S’ sizing system. While this largely follows Small to XL sizing, the idea is that shorter seat tubes mean riders of a wider range of heights can fit on a given size – or, a given rider height can fit on a range of bike sizes, meaning preferences on reach (for example) can easily be accounted for.</p>\n<p>The Kenevo has a number of <a href=\"https://www.bikeradar.com/news/bikeradar-tech-talk-podcast-ep-3-mountain-bike-geometry/\">geometry adjustment features</a>, too. For example, head angles can be adjusted between 62.5, 63.5 and 64.5 degrees, and there’s 6mm of bottom bracket height adjustment and 5mm of chainstay length adjustment.</p>\n<p>There’s an online geometry calculator to help you work out what shape might best work for you.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Specialized’s battery and motor system is packaged incredibly well into the bike and allows for geometry that follows that of the non-powered Enduro.</span></figcaption><span> <i>Specialized</i></span></div>\n<p>As such, there are a lot of geometry configuration possibilities. So, below are the key figures for the Kenevo in its lowest, longest and slackest setting.</p>\n<ul><li><strong>Reach S2/S3/S4/S5:</strong> 435mm/460mm/485mm/510mm</li>\n<li><strong>Stack S2/S3/S4/S5:</strong> 614mm/622mm/631mm/640mm</li>\n<li><strong>Seat tube length S2/S3/S4/S5:</strong> 400mm/420mm/440mm/465mm</li>\n<li><strong>Wheelbase S2/S3/S4/S5:</strong> 1,238mm/1,269mm/1,298mm/1,327mm</li>\n<li><strong>Head angle:</strong> 62.5 degrees</li>\n<li><strong>BB height:</strong> 348mm</li>\n<li><strong>Chainstay length:</strong> 447mm</li>\n<li><strong>Seat angle:</strong> 76.2 degrees</li>\n</ul><h2>Specialized Kenevo SL models</h2>\n<p>Two models of the Kenevo SL are available: the top-level S-Works and an Expert model.</p>\n<p>An S-Works frame-only package is also available.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The head tube cable routing looks super-clean in this American/European brake setup – in the UK our ‘moto’ brake setups might not look quite so clean, sadly!</span></figcaption><span> <i>Specialized</i></span></div>\n<h3>Specialized S-Works Turbo Kenevo SL spec</h3>\n<ul><li><strong>Price</strong>: £12,500 / €13,999</li>\n<li><strong>Suspension</strong>: Fox Factory 38 (170mm) fork and X2 shock</li>\n<li><strong>Brakes</strong>: SRAM Code RSC</li>\n<li><strong>Drivetrain</strong>: SRAM XX1 AXS</li>\n<li><strong>Seatpost</strong>: SRAM AXS Reverb dropper post</li>\n<li><strong>Wheelset</strong>: Roval Traverse SL</li>\n<li><strong>Tyres</strong>: Specialized Butcher/Eliminator, GRID TRAIL casing, 29×2.6in</li>\n</ul><h3>Specialized Turbo Kenevo Expert spec</h3>\n<ul><li><strong>Price: </strong>£8,750 / €9,499</li>\n<li><strong>Suspension: </strong>Fox Performance Elite 38 fork and Performance X2 shock</li>\n<li><strong>Brakes: </strong>SRAM Code RS</li>\n<li><strong>Drivetrain: </strong>SRAM X01/GX</li>\n<li><strong>Seatpost: </strong>X-Fusion Manic dropper post</li>\n<li><strong>Wheelset: </strong>Roval Traverse</li>\n<li><strong>Tyres: </strong>Specialized Butcher/Eliminator tyres, GRID TRAIL casing, 29×2.6in</li>\n</ul><h3>Specialized S-Works Kenevo SL frameset</h3>\n<ul><li><strong>Price: </strong>£6500 / €6,999</li>\n<li><strong>Suspension: </strong>Fox Factory X2 shock</li>\n</ul><h2>Specialized S-Works Kenevo SL first ride impressions – Rob Weaver</h2>\n<p>As you might expect, given it’s essentially the same bike, the Kenevo SL feels very similar to the Specialized Enduro (although I couldn’t get the dropper as low as I’d have liked on my S3 model).</p>\n<p>The Kenevo SL feels like a big, burly machine and, like the Enduro, it also feels more than comfortable when pedalling uphill. A roomy seated position and a steep seat angle help to keep you well-positioned on the bike, even on steeper inclines and I never struggled with the front wheel lifting.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Kenevo feels pretty much like a normal bike, with just a bit of help when needed.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<p>Power from the Turbo Super Light motor is dished out in a very smooth and easy-to-control way, which makes for a very natural ride experience, especially when taking on more technical climbs.</p>\n<p>If you’re coming from a non-assisted MTB, it’s bikes like this – or should I say, motors like this – that will help make that transition to electric a bit easier. If you do get to a slower section that’s a touch more awkward, toggling through the power modes is quick and easy thanks to the bar-mounted controller.</p>\n<p>On the descents, the Kenevo SL feels reassuringly solid and massively capable. The suspension is supple and well-controlled, but also well-supported. Coupled with the geometry (I rode the bike in the ‘high/slack’ setting), this helps to make the Kenevo SL the most maneuverable e-MTB I’ve ridden.</p>\n<p>Not only does it feel more like a heavy-hitting enduro bike (albeit a slightly heavier one) once you exceed the motor’s limit, I had no issues lofting the front wheel up in the air or gapping sections of track on mellower trails.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Smooth as you like, the Kenevo SL shouldn’t hold you back on the descents.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<p>As speeds pick up, it’s clear that the Kenevo is a bike that means business. It’ll soak up the chunder with masses of composure and stability.</p>\n<p>Through flat turns, I was conscious of the slack head angle/long front centre (which you can alter quite easily), but riding in a more committed position and weighting the front end more confidently soon helped to counter any issues here.</p>\n<p>Get your head around that (or swap into one of the different six geometry settings to alter how it feels) and you’re rewarded with a seriously fast bike with incredible suspension and a low centre of gravity that delivers confidence by the bucketload. It makes getting to the top easy but, most importantly, feels more akin to a regular bike on the way down.</p>\n<p>Could the new Kenevo SL be the best of both worlds? Offering uphill assistance on a bike that also delivers when pointed back down the hill? We’ll have a full review coming soon!</p>","author":"Tom Marvin","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f556856bf6946778fe800bbcdedd5ee0f267284dfb60d955c605d31c8bfee1e1","category":"Cycling"}