{"title":"Incidence of influenza virus-associated Severe Acute Respiratory Infections in three districts in 2018 at Gharbia governorate, Egypt","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003152","date":1714744800000,"content":"<p>by Hossam Hassan, Amr Kandeel, Manal Fahim, Hanaa Abu ElSood, Shereen Elghazaly, Reham Kamel, Sahar El Shourbagy, Salma Afifi, Mohamed Abdel Fattah, Miyoung Choi, Sang Gyu Lee, Vasuki Rajaguru, Whiejong Han</p>\r\nAims <p>Influenza remains a contributor to substantial global morbidity and mortality. There is very limited data on disease burden in Egypt. The purpose of this study was to estimate the incidence of influenza-associated Severe Acute Respiratory Illness (SARI) in three districts in Gharbia governorate in 2018.</p> Methods <p>This study Followed the World Health Organization (WHO) manual for estimating disease burden associated with seasonal influenza. The hospital admission database was screened for SARI patients in three districts at Gharbia governorate in 2018. A hospital admission survey (HAS) was used to define the catchment population. The incidence rate estimation was computed as the number of influenza-positive SARI cases per 100,000 population.</p> Results <p>A total of 180 SARI cases were identified in the catchment area. The median age was 23 years [IQR: 2–53], and 45% were males. Out of the total SARI cases, 33.3% influenza was confirmed by the laboratory test of RP-PCR. Influenza A(H3N2) virus predominated representing 55.0% of patients, thanA(H1N1) 26.7% and Flu-B virus 18.3%. Influenza prevailed in winter and spring; no deaths from influenza were reported. The annual incidence of influenza-associated SARIs found higher in &lt;2 years (282 /100,000) and ≥65 years patients (215/100,000) at significant level p&lt;0.001.</p> Conclusion <p>The WHO Manual for estimating disease burden associated with seasonal influenza was successfully operationalized in the three districts of Gharbia governorate. It can be used in other districts. A considerable burden was associated with influenza viruses requiring hospitalization, especially among the older adult group.</p>","author":"Hossam Hassan","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"f55d555934314cdd2a402626df0cae956b00d34e918299497bc2a568e6701694","category":"Environment"}