{"title":"Cyclist’s 31 Inspirational Women No15: Denise Mueller-Korenek","link":"https://www.cyclist.co.uk/sponsored/9305/cyclist-s-31-inspirational-women-no15-denise-mueller-korenek","date":1614710852000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/maria-david\">Maria David</a></span>\n      <span class=\"field-item odd\"><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-03-15T12:14:00+00:00\">15 Mar 2021</span></div>    </div></div><p class=\"short-teaser\">\nThe fastest ever human being on a bicycle</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/03/denise_mueller_korenek.jpg?itok=TgWcr_uq\" />  </div>\n<div class=\"field field-name-body\">\n      <p> <a href=\"/tags/zwift-womens-history-month\"><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/02/31_inspirational_women_clickable_logo_new.jpg\" alt=\"Cyclist's 31 Inspirational Women\" border=\"0\" /></a></p>\n<p><strong>To celebrate International Women's Month, we have partnered with Zwift to tell the stories of 31 inspirational women across 31 days</strong></p>\n<p><strong>Words</strong>: Maria David <strong>Photo</strong>: Matt Ben Stone</p>\n<p>On 16th September 2018, 45-year old Denise Mueller-Korenek was propelled five miles along Bonneville Flats, Utah on her bicycle, <a href=\"/news/5326/fastest-cyclist-ever-setting-a-world-record-speed-of-183mph-on-a-bicycle\">to hit a new world speed record of 183.9mph</a>.</p>\n<p>The effort involved riding a specially constructed bicycle that was attached to a racing car fitted with a large fairing and drag-raced for three miles to build up speed. The tether was then released and Denise continued under her own power, drafting off the car, with the official maximum speed recorded between miles four and five.</p>\n<p>It was an extreme undertaking, but Denise was no stranger to this kind of thing. She had tried to break the existing record of 166.9mph two years earlier, but bad weather limited her speed to 147.7mph, though that was still enough to break the women’s record.</p>\n<p>Denise had been a cycle racer as a youngster, winning junior national titles on the road, track and on the mountain bike. She then left cycling to start a family and pursue a corporate career within the family security business, where she is now CEO.</p>\n<p>But it was when she met up again with her old coach, John Howard, in 2014, that he encouraged her to get back into cycle racing and try her hand at a land speed record.</p>\n<p>In John, she had the perfect coach, since he himself is a former record holder. All the same, preparation wasn’t plain sailing for the mother of three from San Diego. In 2017 she suffered a broken shoulder blade while training, and then she accidentally shot herself in the leg during a shooting a competition. She also got married during that time. But nothing would detract her from her goal.</p>\n<blockquote><p>Before I got in the car I asked Denise if she wanted to break or shatter the record. Her response was of course, 'Shatter'</p></blockquote>\n<p>When selecting who would drive the car for her record attempt, it was important to have someone with whom there is absolute trust, given the complexity and dangers of the event. Communication between driver and rider, which is done using lighting cues, is imperative.</p>\n<p>Enter Shea Holbrooke, a successful female racing driver on the sports car and touring car circuit. Shea recalls the event: ‘When I first met Denise we quickly developed a sisterly bond and I was all in from the beginning.</p>\n<p>‘Denise is unlike any other athlete I’ve met. She’s incredibly determined, fun-loving, a great friend and someone who knows how to lift others to the top with her.</p>\n<p>‘For me, training entailed learning the craft of land speed and salt flat racing, which is very different from sports car road racing.</p>\n<p>‘Together with John, the three of us put a lot of time into calculating and doing our best at simulating what it would be like. But really, nothing can prepare you for something like what we did.’</p>\n<p>As the day approached, the magnitude of what they were doing started to sink in. For Shea, the realisation that the smallest mistake she made could harm or even kill Denise was a worry.</p>\n<p>‘This type of racing, this record takes a completely different mindset to the type of racing I’m accustomed to. I could only control what I could control. All other factors – the bicycle prep and maintenance, the tether system connecting the bike to the dragster, the climate, wind, visibility, even the mechanics of the dragster, were out of my control.</p>\n<p>‘The week of breaking the record was definitely a trying one. It wasn’t all that fun for the crew and myself. We were feeling unprepared, emotions were high and things were going wrong. It was like the salt was telling me, “Don’t do it.” Our group were seriously a group of heroes that week. We couldn’t have feelings, we need to be machines and just do it – a lot easier said than done.'</p>\n<p>Race day came, and waiting in the staging lanes felt like an eternity for the driver and rider.</p>\n<p>‘I leaned a lot on the team for support and frankly I’ve never felt more supported by a group than those guys in all my years of racing.</p>\n<p><strong>Find the rest of <a href=\"/tags/zwift-womens-history-month\"><em>Cyclist's 31 Inspirational Women</em></a> here</strong></p>\n<p>‘Before I got in the car I asked Denise if she wanted to break or shatter the record. Her response was of course, \"Shatter\". I pulled her off the line faster than I had before, and I never felt more clear and precise in my driving and with light system cues.</p>\n<p>‘I was focused on the speed, and felt and remember every oscillation of the salt and gust of wind. I remember keeping my eyes glued on a low peak on a mountain way in the distance. Before we got to the fourth mile I saw what looked like 184mph on the GPS speed. I thought, “No freaking way.”</p>\n<p>‘The four-to-five mile felt like an out of body experience. I thought, “Holy shit… we’re shattering the record”, and I’m the only one that knows it. It was so important to keep my composure. Slowing down and stopping is the hardest part of all; it’s like trying to catch a butterfly.’</p>\n<p>Once out of the car, Shea joined her Project Speed rider.</p>\n<p>‘I was overwhelmed with excitement and emotion, screaming… she just shattered the record and I freaking drove the dragster to help her do it. Denise was in shock. It was a perfect execution.</p>\n<p>‘It’s unconventional what we did. Record-breakers in the past were all men. For us, it was special but for those watching I think we changed how the game can be played.’</p>\n<p>When interviewed immediately afterwards by the <em>Wall Street Journal</em>, Denise summed it up as follows: ‘No one has ridden a bicycle as fast as I’ve ridden – 183.9mph – and it feels pretty darn good. Nothing is out of reach if you’re willing to do the hard work for it. Set a goal, do the work and enjoy the ride.’</p>\n<p><strong>For more from Zwift this International Women's Month</strong>, <a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5638607737&amp;iu=/359/impcount.co.uk\" target=\"_blank\">visit here</a>. </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/cyclists\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Cyclists</a></div>    </div></div>","author":"mjames","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"f55e990787bfd21cb9cb1899164c7e6bcaaab017a843137edcad494467313b34","category":"Cycling"}