{"title":"Evidence for adaptive strategies in larval capelin on the northeastern coast of Newfoundland, Canada","link":"https://academic.oup.com/plankt/article/46/2/126/7618474?rss=1","date":1709424000000,"content":"<span><div>Abstract</div>Fish species with high mortality during early life may maximize fitness using adaptive strategies to time hatching to match favorable environmental conditions (match/mismatch) or extending spawning/hatching to disperse risk (bet-hedging). We examined support for these strategies in a collapsed forage fish, capelin (<span>Mallotus villosus</span>), in coastal Newfoundland (2018–2021). Capelin shift from spawning at warm, intertidal to cool, subtidal (15–40 m) habitats in warmer years, with unknown recruitment consequences. We hypothesized that match/mismatch (specifically, Coastal Water Mass Replacement Hypothesis) would be supported if densities of recently hatched larvae showed pulses that overlapped with high prey and low predator densities. Generalized additive models revealed that larval densities increased with zooplankton prey biomass, but were not influenced by predator biomass or temperature, contrasting with pre-collapse studies and providing equivocal support for match/mismatch. Protracted larval emergence and previously documented high variability in larval traits supported a bet-hedging strategy. Larval condition (i.e. length, yolk-sac diameter) did not differ between habitats but varied among years, where the highest proportion of larvae in poor condition was from the intertidal site in the warmest year (2018). Findings suggest that spawning habitat shifts may have limited impact on stock recovery relative to year-specific environmental conditions that influence larval condition.</span>","author":"","siteTitle":"Journal of Plankton Research Current Issue","siteHash":"76dddc2a9ba5dfb3490083b30b542d64431810a1f59aa42d49b14d3439ebc9c8","entryHash":"f566af25ddad7145e1617330595c51c78ba9f547359cbd101d674609aca71d1e","category":"Environment"}