{"title":"Apple Vision Pro doomed–no really, it’s true","link":"https://www.macworld.com/article/2241389/vision-pro-headlines-get-ahead-of-themselves.html","date":1708428600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Once upon a time, it seemed like headlines were supposed to sum up a story.</p>\n\n\n\n<p>Before the Vision Pro was even released, we were treated to this headline in The Washington Post.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.washingtonpost.com/technology/2024/01/30/apple-vision-pro-privacy/&amp;xcust=1-1-2241389-1-0-0&amp;sref=https://www.macworld.com/feed\">“Apple’s new Vision Pro is a privacy mess waiting to happen”</a></p>\n\n\n\n<p>Before we get into the details, does that <em>sound</em> like any Apple product to you?</p>\n\n\n\n<div><div>\n<blockquote>\n<p>… you might want to know this device collects more data than any other personal device I’ve ever seen.</p>\n</blockquote>\n\n\n\n<p>Collects it? Maybe. But you could say Face ID collects your face and Touch ID collects your fingerprint. The point is <em>what it does with it after that</em>.</p>\n</div></div>\n\n\n\n<div><div>\n<blockquote>\n<p>[Google] Glass was so reviled that the nickname for people wearing them was Glassholes. Now we have to brace for, perhaps, the Vision Bros.</p>\n</blockquote>\n\n\n\n<p>Okay, the Macalope actually likes that one.</p>\n</div></div>\n\n\n\n<div><div>\n<blockquote>\n<p>Most of my Vision Pro concerns are, at this point, speculative.</p>\n</blockquote>\n\n\n\n<p>Welp, better get them into the pages of a prominent national periodical with a salacious headline, then! Time’s a-wastin’!</p>\n</div></div>\n\n\n\n<div><div>\n<blockquote>\n<p>Who gets to access the maps these devices build of our homes and data about how we move our bodies?</p>\n</blockquote>\n\n\n\n<p>Oh, the Macalope knows this one. Because he watched Apple’s Vision Pro keynote and then read the company’s <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2241389-1-0-0&amp;u=https://www.apple.com/privacy/docs/Apple_Vision_Pro_Privacy_Overview.pdf\">PDF on Vision Pro privacy</a>.</p>\n</div></div>\n\n\n\n<div><div>\n<blockquote>\n<p>…visionOS also maps your surroundings on-device…</p>\n</blockquote>\n\n\n\n<p>That means it doesn’t send it to apps.</p>\n</div></div>\n\n\n\n<div><div>\n<blockquote>\n<p>In addition to offering the existing data privacy permissions from our other platforms, visionOS includes control over sharing hand movement and surroundings data with apps.</p>\n</blockquote>\n\n\n\n<p>Turns out the company that uses privacy as a marketing tool is also actually pretty concerned about privacy, if only because it uses it as a marketing tool.</p>\n</div></div>\n\n\n\n<div><div>\n<p>That’s not the only Vision Pro headline that goes a bit off the deep end.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/2024/2/14/24072792/apple-vision-pro-early-adopters-returns&amp;xcust=1-1-2241389-1-0-0&amp;sref=https://www.macworld.com/feed\">“Apple fans are starting to return their Vision Pros”</a></p>\n</div></div>\n\n\n\n<p>Now, that may be true. The two-week return window was up last Friday for those who bought their Vision Pros on day one, so if “Apple fans” weren’t sure it was worth the relatively high price, late last week was the time to call it.</p>\n\n\n\n<p>But if you’re going to write that headline, you should back it up better than The Verge did. Because if we take a look at the “Apple fans” they list, it doesn’t seem likely that you’d reach any of them via the email address jobzrulz@mac.com. Running down the list we have The Verge’s own product manager, the CEO of an AI company, an engineer working in crytpo currency, a random Reddit user (probably the most Apple fan-y of the lot), <em>a Google employee</em>, and a tech influencer whose pinned tweet shows him sitting in a Tesla holding a Samsung foldable and says “Hard to deny Samsung is winning right now.”</p>\n\n\n\n<p>The don’t make Apple fans the way they used to.</p>\n\n\n\n<p>Now, maybe some of these people would surprise us with their fervor for Apple products, but let’s just say this group would make a really weird <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Macintosh_User_Group&amp;xcust=1-1-2241389-1-0-0&amp;sref=https://www.macworld.com/feed\">MUG</a>.</p>\n\n\n<div><figure><img src=\"https://images.idgesg.net/images/idge/imported/imageapi/2021/12/28/13/macalope-2021-100915055-orig.jpg?quality=50&amp;strip=all&amp;auto=webp&amp;quality=85,70\" alt=\"Macalope\" loading=\"lazy\" /></figure><p>IDG</p></div>\n\n\n\n\n<p>Still, many of their concerns seem completely valid. If the horny one had shelled out $3,500 for a device and found it was making him nauseated and giving him red eyes and headaches, he’d return it, too. And, as the piece notes, these are not uncommon complaints about VR headsets in general and the Macalope has seen them noted elsewhere as side-effects of using the Vision Pro.</p>\n\n\n\n<p>It seems likely Apple has made a better VR headset than was previously available, probably one with fewer side effects even. But it still has side effects for some users and at such a high price, why would anyone suffering from them keep it?</p>\n\n\n\n<p>Still, it would be nice if the things said in the headline had a more solid basis in fact. Maybe on the next internet.</p>\n\nVirtual Reality, Wearables</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f571bffeac6946471890ad66fd7942112b116e9d9c5b6817b6f9d702d36b627c","category":"Apple"}