{"title":"Digital Developmental Advising Systems for Engineering Students Based on ABET Student Outcomes Evaluations","link":"https://www.preprints.org/manuscript/202406.0158/v1","date":1717491031000,"content":"The purpose of this research is to examine the benefits and limitations of implementation of novel digital academic advising systems using automated collection and reporting processes for ABET student outcomes data based on principles of authentic OBE for effective developmental advising. We examine digital developmental advising models of undergraduate engineering programs in two universities that employ customized features of the web-based software EvalTools® - Advising Module based on assessment methodology incorporating the Faculty Course Assessment Report, Performance Indicators and hybrid rubrics classified according to the affective, cognitive and psychomotor domains of Bloom’s learning model. A case study approach over a six-year period is adopted for this research. The two case studies present results of samples of developmental advising activity employing sequential explanatory mixed methods models using a combination of quantitative and qualitative analyses of a) detailed students’ outcomes and Performance Indicators information; and b) self-evaluation of their professional development and lifelong learning skills. The findings of this study show that digital advising systems employing the Faculty Course Assessment Report using Performance Indicators and hybrid rubrics can provide comprehensive and realistic outcomes data to help both developmental advisors and students easily identify the specific cause of performance failures, implement practical recommendations for remedial actions and track improvements. Inherent strong skills can also be identified in academically weak students by observing patterns or trends of relatively better performing outcomes to reinforce natural affinity for learning specialized competencies and pursue related and successful career paths.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f57371a91adc6557e19487c5d476634d963cdefce3b8c9ed0affe8c0937fe006","category":"Interdisciplinary"}