{"title":"The only terrestrial lineage in the Branchiopoda redefined: a new species of Bryospilus Frey, 1980 (Cladocera: Anomopoda) from India and adaptations of waterfleas to life on land","link":"https://academic.oup.com/jcb/article/doi/10.1093/jcbiol/ruae054/7750673?rss=1","date":1725667200000,"content":"<span><div>Abstract</div>Only a small proportion of the world’s crustacean taxa is adapted to limno-terrestrial microhabitats that are disconnected from conventional surface waterbodies. In rare occasions, water films on terrestrial tropical and subtropical vegetation may also harbour specialised cladocerans. <span>Bryospilus</span> Frey, 1980 (Chydoridae) is the only genus within the class Branchiopoda that is specialised to living almost exclusively in water-saturated terrestrial moss patches, leaf litter, and phytotelms. The remarkable waterflea lineage, which has a suite of highly unusual characters within the family, has been found in terrestrial habitats in rainforests of West Africa, South and Central America, and New Zealand. We discovered a new moss-inhabiting chydorid from western India, <span>Bryospilus</span> (<span>Indobryospilus</span>) <span>bharaticus</span><strong>n. sp.</strong>, the first representative of the genus from the Oriental Region. Its morphology and behaviour are highly unusual for a species of <span>Bryospilus</span>. In comparison to its congeners, the new species can swim and it has significantly less oligomerisation, with three terminal setae on the antennal endopod instead of two and seven exopod setae on the third limb instead of six, among other features. We define a new subgenus <span>Indobryospilus</span><strong>nov.</strong> and we amend the genus <span>Bryospilus</span>. The new species is a living evolutionary connection, characterised by a phenotype which provides us with new clues about evolutionary transitions in the only terrestrial branchiopod genus. Our results are informative beyond Cladocera, as the morphology of this species provides insights about the evolution and parallelisms of aquatic crustaceans that have specialised in limno-terrestrial habitats. We revisit the morphology of the genus, the disjunct biogeographical pattern with a potential ancient signature, and discuss the functional adaptations of these cladocerans to life on land, as well as convergences with subterranean lineages. A new key to the world species of <span>Bryospilus</span> species is included.</span>","author":"","siteTitle":"Journal of Crustacean Biology Current Issue","siteHash":"8ca07ea220dbc7082c62912ab6b47a7a5a309f6e19a7257844b27bf0267b5f04","entryHash":"f57579e8d756aa1020a24ea53193bc6c85fed46b0695f0c00133bc9e88ad9266","category":"Environment"}