{"title":"Rocket Report: Key Ariane 6 test delayed; NASA urged to look at SLS alternatives","link":"https://arstechnica.com/?p=1976485","date":1697799637000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/Psyche-10-800x534.jpg\" alt=\"The Falcon Heavy rocket's two side boosters returned to Cape Canaveral for landing after sending NASA's Psyche spacecraft on its way into deep space.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/Psyche-10.jpg\">Enlarge</a> <span>/</span> The Falcon Heavy rocket's two side boosters returned to Cape Canaveral for landing after sending NASA's Psyche spacecraft on its way into deep space. (credit: Trevor Mahlmann/Ars Technica)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 6.16 of the Rocket Report! Lots of news here today about big rockets, including a push by SpaceX to speed up launch licensing by the Federal Aviation Administration. The full-court press in Washington, DC, comes as the company says its Starship rocket is ready for a second flight test but still awaiting final regulatory approval. The earliest the launch could now occur is during the first half of November.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Virgin Galactic to fly sixth mission in six months</strong>. The California-based suborbital space tourism company <a href=\"https://press.virgingalactic.com/galactic-05-research-mission-set-to-become-virgin-galactics-sixth-flight-in\">announced this week</a> that its \"Galactic 05\" mission will take flight as early as November 2. Such a flight would continue Virgin Galactic's impressive monthly cadence of flying its VSS<em> Unity</em> spacecraft this year. This flight will carry researchers who will use the interior of the space plane as a lab for research.</p></div><p><a href=\"https://arstechnica.com/?p=1976485#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1976485&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f57c13c19b3b57a1d1522f9ff9b86378e55d011342f4aff9e1310e66c3fd39cd","category":"Tech"}