{"title":"Identification of pathways to high-level vancomycin resistance in <i>Clostridioides difficile</i> that incur high fitness costs in key pathogenicity traits","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002741","date":1723730400000,"content":"<p>by Jessica E. Buddle, Lucy M. Thompson, Anne S. Williams, Rosanna C. T. Wright, William M. Durham, Claire E. Turner, Roy R. Chaudhuri, Michael A. Brockhurst, Robert P. Fagan</p>\r\n\r\n<i>Clostridioides difficile</i> is an important human pathogen, for which there are very limited treatment options, primarily the glycopeptide antibiotic vancomycin. In recent years, vancomycin resistance has emerged as a serious problem in several gram-positive pathogens, but high-level resistance has yet to be reported for <i>C</i>. <i>difficile</i>, although it is not known if this is due to constraints upon resistance evolution in this species. Here, we show that resistance to vancomycin can evolve rapidly under ramping selection but is accompanied by fitness costs and pleiotropic trade-offs, including sporulation defects that would be expected to severely impact transmission. We identified 2 distinct pathways to resistance, both of which are predicted to result in changes to the muropeptide terminal D-Ala-D-Ala that is the primary target of vancomycin. One of these pathways involves a previously uncharacterised D,D-carboxypeptidase, expression of which is controlled by a dedicated two-component signal transduction system. Our findings suggest that while <i>C</i>. <i>difficile</i> is capable of evolving high-level vancomycin resistance, this outcome may be limited clinically due to pleiotropic effects on key pathogenicity traits. Moreover, our data identify potential mutational routes to resistance that should be considered in genomic surveillance.","author":"Jessica E. Buddle","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"f57f0ccf889f825e54a5bbb179a53c30c38dd2c7addc490007dc5753cf05df6f","category":"Environment"}