{"title":"Machine learning with taxonomic family delimitation aids in the classification of ephemeral beaked whale events in passive acoustic monitoring","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304744","date":1717509600000,"content":"<p>by Alba Solsona-Berga, Annamaria I. DeAngelis, Danielle M. Cholewiak, Jennifer S. Trickey, Liam Mueller-Brennan, Kaitlin E. Frasier, Sofie M. Van Parijs, Simone Baumann-Pickering</p>\r\n\r\nPassive acoustic monitoring is an essential tool for studying beaked whale populations. This approach can monitor elusive and pelagic species, but the volume of data it generates has overwhelmed researchers’ ability to quantify species occurrence for effective conservation and management efforts. Automation of data processing is crucial, and machine learning algorithms can rapidly identify species using their sounds. Beaked whale acoustic events, often infrequent and ephemeral, can be missed when co-occurring with signals of more abundant, and acoustically active species that dominate acoustic recordings. Prior efforts on large-scale classification of beaked whale signals with deep neural networks (DNNs) have approached the class as one of many classes, including other odontocete species and anthropogenic signals. That approach tends to miss ephemeral events in favor of more common and dominant classes. Here, we describe a DNN method for improved classification of beaked whale species using an extensive dataset from the western North Atlantic. We demonstrate that by training a DNN to focus on the taxonomic family of beaked whales, ephemeral events were correctly and efficiently identified to species, even with few echolocation clicks. By retrieving ephemeral events, this method can support improved estimation of beaked whale occurrence in regions of high odontocete acoustic activity.","author":"Alba Solsona-Berga","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f583023096ecf3adf68e44c813260b36c886944da3ee8130e47bd2e44b506174","category":"Interdisciplinary"}