{"title":"Improving performance of aerosol jet printing using machine learning‐driven optimization","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300110?af=R","date":1713256151000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/f26f1c85-4263-4104-b574-659563c91b5d/appl202300110-gra-0001-m.png\" alt=\"Improving performance of aerosol jet printing using machine learning-driven optimization\" /><p>This paper introduces a machine learning (ML) approach to streamline and optimize aerosol jet printing processes. Traditionally reliant on time-consuming trial and error, the proposed method leverages data-driven ML techniques. By learning from existing experiments, the model predicts printed line width and optimal process parameters, significantly minimizing the need for extensive experimentation in aerosol jet printing.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Aerosol jet printing is a promising technology for printing functional materials on a variety of substrates with high precision and resolution. This technology has the potential to revolutionize the manufacturing industry by providing a low-cost, high-resolution printing technique that can be used to produce additively printed electronics, sensors, and energy devices. However, the optimization of this process has traditionally relied on time-consuming trial-and-error methods, hampering its efficiency and scalability. Machine learning (ML) models have the potential to overcome these challenges and improve the quality, speed, and efficiency of the printing process. In this paper, we propose an approach that leverages ML algorithms to streamline and enhance the aerosol jet printing optimization process. Our methodology involves data collection through systematic experimentation with various parameter settings. This data set serves as the foundation for training different ML model capable of predicting printed line characteristics and optimal printing process parameter. We validate our approach by performing experiments on different inks, and we compare the results of our ML-based optimization approach to those obtained using traditional trial-and-error methods. The results demonstrate that our approach offers significantly higher accuracy and efficiency. To enhance our approach's accessibility and ease of use, we incorporate AutoML techniques which automates the process of selecting the most suitable ML algorithms and hyperparameters, reducing the burden of manual configuration. Furthermore, we introduce a user-friendly web-based interface that facilitates the entire ML pipeline, from data preprocessing to prediction and batch processing. This interface empowers users to efficiently manage and manipulate their data, select appropriate ML algorithms, and execute predictions, ultimately improving accuracy and model performance.</p>","author":"Prashantkumar Pandey, \nSteffen Ziesche, \nGauranggiri Meghanathi","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"f58bee6bc89618ee28ab498438960ea7aeb8e3f96bcfc8e59fa3a1854ff71420","category":"Environment"}