{"title":"Apple overhauls its entire Windows app suite, including iCloud and Apple Music","link":"https://arstechnica.com/?p=2001967","date":1707420942000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/icloud-windows-new2-980x805.jpg\" /></div>\n          <p>\n            The new iCloud for Windows app, which does a surprisingly good job of looking like a native Windows 11 app. It also respects the system dark mode setting.                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Big news for people who prefer iPhones but also prefer to use Windows PCs: Apple has quietly overhauled its entire suite of Windows apps, including non-beta versions of the Apple Music, Apple TV, and Devices apps that it began previewing for Windows 11 users <a href=\"https://arstechnica.com/gadgets/2023/01/apple-previews-a-trio-of-apps-that-will-finally-replace-itunes-for-windows/\">over a year ago</a>. Collectively, these apps replace most of the functionality from the iTunes for Windows app; iTunes for macOS was discontinued <a href=\"https://arstechnica.com/gadgets/2019/10/macos-10-15-catalina-the-ars-technica-review/7/#h1\">all the way back in 2019</a>. Apple has also released a major iCloud for Windows update with an overhauled design.</p>\n<p>All of the apps are currently available in the Microsoft Store. While the previews that Apple released last year required Windows 11 22H2 or newer, the final versions of all four new apps also work in Windows 10 for people who have chosen not to upgrade or whose PCs do not meet the system requirements.</p>\n<p>The Apple Music and Apple TV apps both offer access to Apple's streaming music and video libraries for people with subscriptions, though both apps will also import and play your local music and video libraries from iTunes if you have them.</p></div><p><a href=\"https://arstechnica.com/?p=2001967#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2001967&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f591847472b11f272f8569914c82f451105c8bfcddecd809676bd63d9525985b","category":"Tech"}