{"title":"A shocking sprint, one wild horse and trouble at Team SD Worx - What was going on in the women's Strade Bianche?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-shocking-sprint-one-wild-horse-and-trouble-at-team-sd-worx-what-was-going-on-at-strade-bianche-donne","date":1677940637000,"content":"\n      <p><span>Maybe it was the blazing Tuscan sun, or the nerves and chaos that the white dust roads throw up, or perhaps it was the wild sight of a stray horse among the race convoy, but the 2023 women's edition of <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a> was one of the strangest in memory.</span></p>\n<div></div>\n<p><span>One of the most confusing things about the sport of cycling is that there can only be one winner of a bike race, yet everybody races in a team. In theory, every rider contributes to the victory, yet only one stands on the podium and gets the accolades at the end of the day. For sponsors and stakeholders, it doesn’t really matter which rider that is, as long as they have the right logos on their jersey. It’s for this reason that when two or three riders of the same team come to the finish line together, they normally share the victory. We’ve seen it numerous times in cycling history, think back to just a few weeks ago at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/sandstorm-a-women-s-uae-tour-review\">women’s UAE Tour</a> when Elisa Longo-Borghini and Gaia Realini crossed the line hand-in-hand, or last season when the men’s <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/is-jumbo-visma-cycling-s-new-super-team\">Jumbo Visma team scored a 1-2-3</a> in the first stage of <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice\">Paris-Nice</a>. They crossed the finish line arm in arm, united as teammates.</span></p>\n<p><span>As Demi Vollering and Lotte Kopecky of Team SD Worx stormed towards the finish line in the final kilometre of this year’s Strade Bianche Donne, this was the approach we expected them to take. Maybe Kopecky would give the win to Vollering, respecting that the younger rider had been out in the breakaway for longer and that she’d never won the race before, while Kopecky took victory in Strade Bianche last year. Or maybe it would be decided by the sports directors in the team car behind. Either way, few expected it to turn out how it did.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1471176824_1024x1024.jpg?v=1677940173\" alt />As the finish line in Piazza del Campo approached, Vollering and Kopecky opened up a storming, aggressive sprint against each other. In that moment, the fact they wore the same jersey meant nothing. This was about victory and pride, and certainly no hand holding.</span></p>\n<p><span>“I think my emotions were a bit confused at first because in the moment that I looked around to celebrate with her, she overtook me,” Vollering explained after the race. “Then I was like, is she just doing a lead out for me? But then I felt like she was really going for it and I was like, okay, we're not teammates anymore.”</span></p>\n<p><span>Anyone watching the immediate reaction of the Dutch rider after she crossed the finish line would have seen the pure, bitter and unfiltered disappointment of Vollering. She had, in fact, won the race, but due to the closeness of the sprint, there was a period of a couple of minutes where she believed that it was Kopecky who had taken victory. Rumours swirled around the chaotic hustle of the mixed zone after the race that Vollering had even shouted at Kopecky as she crossed the finish line, frustrated by her teammate’s decisions.</span></p>\n<p><span>“After the finish I was like, what did we do? At one moment I thought we should celebrate across the line together, but then she went for it and I was like, okay, I have to go,” Vollering said. “I was a bit confused after the finish line and she felt the same, because we didn't know what the result was we were both a bit like: can we celebrate? In the end it's the team that wins and we always say this, it doesn't matter who wins if as long as this is the team then it's good.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1471187661_1024x1024.jpg?v=1677940187\" alt />Vollering’s line about the victory being one for the team, rather than one for an individual, is a perfect answer from a PR perspective. However, the reality is that if it really is just a victory for the team, why didn’t they cross the line together, with no concern over which person’s front wheel crossed the line first? Does the responsibility lie with the sports directors who have an impartial view from the team car? Should they have instructed the two riders what to do?</span></p>\n<p><span>“We were focusing on getting the gap back to Kristen [Faulkner], who was in front, and we only got it back with 700m to go,” explained Team SD Worx sports director, Anna van der Breggen, after the race. “It was up to the girls to decide who was the strongest. We’re in the car, we don’t know how they are, so they decide.”</span></p>\n<p><span>“In the end, we didn’t expect that they would both be in this position. Maybe next time we will speak about when you go in front together, who can win the race. But for now, we didn't do it, because we didn't expect it. If we’d have had time to think about it, maybe we would have told them, but we were focusing on getting the gap back.”</span></p>\n<p><span>Perhaps the actions of Vollering and Kopecky surprised many and it wasn’t a fairytale Team SD Worx ending on the picturesque Tuscan roads, but when it comes to bike racing, did it actually make it a far more exciting finish? People turn on the TV to watch real battles between riders, and we certainly got that from Vollering and Kopecky today, just because sharing victories has been the done thing between teammates in the past, does that make it right?</span></p>\n<p><span>“I think there's no good, or best way to do things like this. That we came to the finish together is super good for the team. If two riders decide they race the final between them, then I think that's fine. I mean, why not?” Vollering said after the race. “I think it was very exciting for people to watch. It also shows that women's cycling is really a battle between every rider.”</span></p>\n<p><span><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1471170657_1024x1024.jpg?v=1677940210\" alt /></em>With this, Vollering has a real point. Perhaps it was unbelievable to the masses that the two riders decided to sprint it out between each other, but that’s what bike racing is all about. Neither Vollering or Kopecky would be the racers they are today without a fighting instinct and ruthless desire to win. We watched the sort of sprint for victory that we all tuned in for, and bike racing is, at the end of the day, doing your utmost to take the win, even if that means tricky conversations on the team bus post-race.</span></p>\n<p><span>“We are killers,” Vollering explained. “Lotte always goes for everything and that's really something that I really like from her, she always goes to the limits and over the limits. If I look back now it's really cool to finish this way because I beat Lotte and that's always nice to know. It’s not that it was given to me.”</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"6dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f59278bef4f6f52bd7b7883e7d3bf635f1c97fec1f26f42d3b99db","category":"Cycling"}