{"title":"The contribution of energy systems during 30-second lower body Wingate anaerobic test in combat sports athletes: Intermittent versus single forms and gender comparison","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303888","date":1716559200000,"content":"<p>by Erkan Tortu, Ibrahim Ouergui, Süleyman Ulupinar, Serhat Özbay, Cebrail Gençoğlu, Luca Paolo Ardigò</p>\r\n\r\nCombat sports, encompassing a range of activities from striking and grappling to mixed and weapon-based disciplines, have witnessed a surge in popularity worldwide. These sports are demanding, requiring athletes to harness energy from different metabolic pathways to perform short, high-intensity activities interspersed with periods of lower intensity. While it is established that the anaerobic alactic (ATP-PC) and anaerobic lactic systems are pivotal for high-intensity training sessions typical in combat sports, the precise contribution of these systems, particularly in varied training modalities such as single (SMT) and intermittent (IST) forms of the 30-second Wingate test, remains inadequately explored. This study aims at comparing performance outputs, physiological responses and gender differences during the SMT and IST forms of the 30-second Wingate test. Thirty-three highly trained combat sports athletes (17 women, 16 men; 10 boxing, 8 wrestling, 8 taekwondo and 7 karate) randomly performed SMT and IST. The IST consisted of three 10-second all-out attempts separated by 30 seconds of passive recovery, whereas the SMT was a single 30-second maximal effort. Resting, exercise and post-exercise oxygen uptake and peak blood lactate value were used to determine the metabolic energy demands via the PCr-LA-O<sub>2</sub> method. The findings showed that total metabolic energy expenditure (TEE), ATP-PCr system contribution and the output of mechanical variables were higher in the IST than in the SMT form (all p&lt;0.001). In contrast, the contribution of glycolytic and oxidative systems was higher in the SMT form (all p&lt;0.001). However, exercise form and gender interaction were not significant (p&gt;0.05). In combat sports, performance is not only determined by physiological and technical skills but also by metabolic energy input and efficiency. Therefore, our results can provide a comparison regarding the effects of exercise type and gender on metabolic energy metabolism to design the training of combat sports athletes.","author":"Erkan Tortu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f5985955bb0d9dcfc230d88b894447415ffe616d2e65f328d030d12a34ada872","category":"Interdisciplinary"}