{"title":"‘Old Yankee Stadium’s Rise and Fall: The Complete Story of “The House That Ruth Built”’","link":"https://www.cbssports.com/mlb/news/mlb-predictions-2023-expert-picks-for-full-baseball-standings-playoff-fields-and-world-series-champions/","date":1680233645000,"content":"\n<p>Dayn Perry at CBS Sports, in a magnificently comprehensive look back at the original Yankee Stadium, which opened 100 years ago:</p>\n\n<blockquote>\n  <p>On April 18, 1923, it was a brisk 49 degrees in New York City, a\nspring in name only. The wind whipped up dust from the dirt roads\nand vacant lots abutting the ballpark that now rose from the\nplaned-out soil of city plot 2106, lot 100. Those same winds\nwhirled the eight-foot copper baseball bat that served as a\nweathervane from atop the in-play flagpole in center field. There\nhad been a farm there, granted to John Lion Gardiner just prior to\nthe Revolutionary War, and then a sawmill, and the surrounding\nsweeps of land seemed more suited to just that — an old farm or\nsawmill — rather than what now scraped the sky.</p>\n\n<p>And what loomed above, three decks high, was a concrete-and-steel\ncolossus unexampled in sports and certainly baseball. The forging\nof the stadium at 161st and River displaced 45,000 cubic yards of\nBronx soil. Then it devoured 20,000 yards of concrete; four\nmillion feet of lumber; 800 tons of re-bar; 2,200 tons of steel\nbeams and channels and angles and plates; 13,000 yards of topsoil\nand 116,000 square feet of Merion Bluegrass sod; one million\nscrews of brass.</p>\n\n<p>It was not the first stadium to be raised up in the medium of\nmodern construction materials, but it was the most hulking, the\nmost impossible-seeming. Unlike Wrigley, Fenway, Shibe, Crosley or\nothers of the prior generation, Yankee Stadium defied words like\n“cozy” or “intimate” at every grand angle. In that way, it augured\na coming era in which ballparks would no longer tuck into their\nexisting neighborhoods but rather barge in with shoulders wide and\narms akimbo. The original design of Yankee Stadium of course\nreflected some geographic limitations, but its final presence\nlooked and felt like an unyielding one. Yankee Stadium was big and\nbad like its warrior-poet Babe Ruth — like its titular hometown\nnine soon would be — and it authored a reimagining: that the\n“ballpark” could be elevated and sprawled into the realm of\n“stadium.” And so it was the first ballpark to be called a\nstadium.</p>\n</blockquote>\n\n<p>The second-finest ballpark ever built.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/30/yankee-stadium-100\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"f59cac8cd77f477499511a43bb06c76a433dcf5179b071e73e959784d25c1eeb","category":"Tech"}