{"title":"Birth preparedness and pregnancy complication readiness and associated factors among pregnant women in Ethiopia: A multilevel analysis","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003127","date":1715781600000,"content":"<p>by Addisalem Workie Demsash, Teshome Bekana, Sisay Yitayih Kassie, Adamu Ambachew Shibabaw, Geleta Nenko Dube, Agmasie Damtew Walle, Milkias Dugassa Emanu, Abiy Tasew Dubale, Alex Ayenew Chereka, Gemeda Wakgari Kitil, Bekem Dibaba Degefa, Aselefech Seyife, Abdurahman Mohammed Ahmed, Zenebe Abebe Gebreegziabher, Sewnet Getaye Workie</p>\r\n\r\nMaternal and child deaths occur during pregnancy and delivery. Timely information on signs of pregnancy complications and ways to plan for normal birth is a strategy to reduce maternal and child deaths. The purpose of this study was to assess birth preparedness, and pregnancy complications readiness and identify associated factors in Ethiopia. A cross-sectional study design was used. A total of 1635 weighted samples of pregnant women were included for analysis from the 2016 Ethiopian demographic and health survey data set. Multilevel mixed-effect logistic regression was used to estimate the effects of potential variables on birth preparedness and complication readiness. STATA version 15 software was used for data processing and analysis. A variable with a p-value &lt; 0.05 with a 95% confidence interval was considered a significant factor. Pregnant women were informed about convulsions (8.02%), fever (35.95%), abdominal pain (28.92%), leaking fluid from the vagina (28.21%), and blurred vision (17.98%). Pregnant women prepared for supplies needed for birth (38.70%), transportation (20.04%), money (18.97%), people’s support for birth (5.03%), and blood donors (3.11%). Only 56% and 44.91% of pregnant women had good birth preparedness and were informed about pregnancy complications respectively. Educational status, antenatal care visits, and region were significant factors associated with birth preparedness and complication readiness. Distance to health facility and residency were significantly associated with birth and complication readiness, respectively. Birth preparedness and complication readiness among pregnant women were low in Ethiopia. Empowering women with education, installing safe roads, building accessible health facilities, and emphasizing pregnancy complications and birth preparedness plans during antenatal care visits are important interventions to enhance birth preparedness and pregnancy complication readiness.","author":"Addisalem Workie Demsash","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"f5a42b4e92d6d915da191d7e5974a7db601689a65df2751eed3659da0325f6c3","category":"Environment"}