{"title":"A001 | เริ่มต้นกับ Ansible – Inventory","link":"https://www.icez.net/blog/167503/a001-ansible-introduction-inventory","date":1658496212000,"content":"<p>Ansible เป็นเครื่องมือจัดการการตั้งค่า Server ที่เราสามารถเขียนบอกว่าต้องการให้มี/ไม่มีอะไรบน server โดยใช้ syntax ของ YAML ในการเขียน โดยโครงสร้างหลักๆ จะแบ่งเป็น 4 ส่วนดังนี้</p>\n<ol>\n<li>inventory</li>\n<li>playbook</li>\n<li>role</li>\n<li>module/collection</li>\n</ol>\n<p>ซึ่งข้อ 4 จะเป็นสิ่งที่มีสำเร็จรูปมาให้แล้ว แต่อาจต้องโหลดเพิ่มผ่านคำสั่ง <code>ansible-galaxy collection</code> อีกที โดยสามารถดู collection ที่มีอยู่แล้วได้ด้วยคำสั่ง <code>ansible-galaxy collection list</code> ส่วนการทำอะไรต้องการ collection ไหนให้ดูในเอกสารของ ansible module นั้นๆ อีกครั้ง</p>\n<h2>Inventory</h2>\n<p>การเริ่มใช้งาน ansible (ไม่นับขั้นตอนติดตั้ง) สิ่งแรกที่เราต้องมีก็คือ inventory file ที่จะให้ ansible รู้ว่าเรากำลังจะจัดการเครื่องไหนบ้าง โดยโครงสร้างที่ง่ายที่สุดคือโครงสร้างแบบ ini file ดังนี้</p>\n<pre>[groupname]\nhost1\nhost2\n</pre>\n<p>(สมมติว่าเซฟในชื่อไฟล์ชื่อ hosts)</p>\n<p>เมื่อมีไฟล์ inventory แล้ว เราสามารถเรียกใช้ ansible โดยให้เรียกไฟล์ inventory ได้โดยการใส่ parameter <code>-i hosts</code> (แก้คำว่า hosts เป็นชื่อไฟล์ inventory ที่เราสร้างขึ้นมา) เพิ่มในคำสั่ง ansible หรือ ansible-playbook ตอนเราสั่ง หรือสามารถตั้งค่าในไฟล์ ansible.cfg ให้ใช้งานไฟล์ inventory นี้โดยอัตโนมัติก็ได้ โดยสร้างไฟล์ชื่อ ansible.cfg ไว้ใน folder เดียวกัน แล้วใส่ข้อความลักษณะประมาณนี้</p>\n<pre>[defaults]\ninventory = hosts\n</pre>\n<p>โดยปกติแล้ว ansible จะเชื่อมต่อไปหา server ตามที่เราระบุผ่าน ssh config และจะพยายามใช้ ssh key ในการเชื่อมต่อ (ถ้ามี) โดยถ้าไฟล์ private key ของเราไม่ใช่ชื่อ ~/.ssh/id_rsa ก็สามารถระบุตัวแปรเพิ่มไปใน inventory ได้ว่าให้แต่ละ host ใช้ key ไหน</p>\n<pre>[groupname]\nhost1 ansible_private_key_file=\"/home/user/.ssh/privatekey1\"\nhost2 ansible_private_key_file=\"/home/user/.ssh/privatekey2\"\n</pre>\n<p>หรือถ้าทั้ง group ทุก server ใช้ key เดียวกันหมดก็สามารถกำหนดเป็น variable ของ group ก็ได้เช่นกัน เช่น</p>\n<pre>[groupname]\nhost1\nhost2\n\n[groupname:vars]\nansible_private_key_file=\"/home/user/.ssh/privatekey1\"\n</pre>\n<p>หรือหากเราต้องการใช้รหัสผ่านในการเชื่อมต่อ (ไม่แนะนำ) สามารถตั้งรหัสผ่านไว้ให้แต่ละ host ได้ (ย้ำว่าไม่แนะนำ อย่าหาทำ) ลักษณะดังนี้</p>\n<pre>[groupname]\nhost1 ansible_password=\"123456\"\nhost2 ansible_password=\"abcdef\"\n</pre>\n<p>เมื่อได้ inventory แล้วสามารถทดสอบการเชื่อมต่อไปหา host ปลายทางได้โดยใช้คำสั่งดังนี้</p>\n<pre> ansible -i hosts -m ping all </pre>\n<p>หากไม่สามารถเชื่อมต่อได้ ให้ลองเพิ่ม option -vvv ลงไปเพื่อดูว่า ansible เชื่อมต่อไปยัง server ปลายทางด้วย user/คำสั่งอะไรยังไง แล้วแก้ไขการตั้งค่าของ ansible ให้ถูกต้องอีกครั้ง</p>\n<p>ansible จะใช้การตั้งค่าของ ssh client ตามที่เราตั้งค่าไว้ (~/.ssh/config) ดังนั้นสามารถตั้งค่าการเชื่อมต่อในนี้ก็ได้เช่นกัน</p>","author":"icez","siteTitle":"icez network","siteHash":"5f9deb5660f47c4b8baf580eb765815e4a6d536737656e8ab8bde4","entryHash":"f5b03e8afc81628fcb99327c9ba67c9193cb363d58c87096638fcd","category":"Thai"}