{"title":"Impact of depression on self-efficacy, illness perceptions and self-management among people with type 2 diabetes: A systematic review of longitudinal studies","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302635","date":1715004000000,"content":"<p>by Andualem Derese, Yohannes Gebreegzhiabhere, Girmay Medhin, Sisay Sirgu, Charlotte Hanlon</p>\r\nBackground <p>Treating comorbid depression does not always improve outcomes for people with type 2 diabetes. Evidence is lacking on potential psychological and behavioural intermediaries of the impact of depression on diabetes outcomes.</p> Objective <p>To synthesise evidence on the impact of comorbid depression on self-efficacy, illness perceptions, and self-management in people with type 2 diabetes.</p> Data sources <p>We searched PubMed, Embase, PsycINFO, and Global Health databases from inception up to 29<sup>th</sup> March 2023.</p> Study eligibility criteria <p>Only prospective studies (cohort or intervention studies) were included, with no restrictions on language. The outcomes were self-efficacy, illness perceptions, and self-management.</p> Participants <p>People with type 2 diabetes in community or health settings.</p> Exposure <p>Comorbid depression or depressive symptoms in people with type 2 diabetes.</p> Synthesis of results <p>A narrative review of heterogeneous studies.</p> Risk of bias <p>The risk of bias was assessed using the Effective Public Health Practice Project (EPHPP) quality assessment tool for quantitative studies.</p> Results <p>Twenty-five studies were included, all from high-income countries. Depression was associated with lower self-efficacy (2 studies), poor illness perception (1 study), and poor self-management practices (17 studies) in people with type 2 diabetes. In 6/7 studies, depressive symptoms predicted less adherence to dietary recommendations, 8/10 studies found depressive symptoms were associated with poor medication adherence, 1/3 study found that depressive symptoms were associated with poor weight control, 3/4 with less physical exercise, and 2/3 with general self-care practices.</p> Limitations <p>There were no studies from low- and middle-income countries and non-Western settings, and we cannot assume the mechanisms linking comorbid depression with diabetes outcomes are similar.</p> Conclusions <p>Comorbid depression was associated with lower self-efficacy, poorer self-management, and less adaptive illness perceptions among people with diabetes.</p>","author":"Andualem Derese","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f5b3426e8d306764ea7e38f812044a370b885b94b5fc500a243779349c056490","category":"Interdisciplinary"}