{"title":"Feminist Architecture and Challenging Gender-Biased Urbanization through Architectural Practice: An Overview of Equitable Environment","link":"https://www.preprints.org/manuscript/202403.0759/v1","date":1710346018000,"content":"This paper explores the concept of feminist architecture and its potential to challenge gender norms and stereotypes in urban design. Women face specific challenges in urban spaces, including safety concerns, lack of accessibility, and discrimination. Feminist architecture offers a potential solution to these challenges by providing a framework that prioritizes the needs and experiences of marginalized groups, including women. The study employs a mixed-methods approach to conduct a review of relevant literature, case studies, and examples of feminist architecture from around the world to address research questions related to barriers and benefits of implementing feminist architecture in mainstream design practices. After identifying obstacles, this paper offers concrete strategies to overcome these barriers and the findings suggest that by prioritizing inclusivity, accessibility, sustainability, and democracy, feminist architecture principles offer a framework for designing urban environments that are just, equitable, and empowering for all individuals. However, despite the potential gains of incorporating feminist architecture into the design process, there are several barriers and limitations that designers may face. Therefore, to overcome these barriers and limitations, implementing feminist architecture principles require a commitment to understanding how gender operates in society, financial support, policy advocacy, and collaborative approaches among designers. By creating inclusive, gender-neutral, and supportive spaces and promoting diversity and inclusion within learning and practice, feminist architecture has the capacity to transform the built environment and make it more inclusive, equitable, and just for everyone.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f5bb364aef981a81094c47f272952769469c35d06fc1b6d3b7b5ba6b361138ef","category":"Interdisciplinary"}