{"title":"Apple Starts Letting Developers Add Alternative App Marketplaces to App Store Connect","link":"https://www.macrumors.com/2024/02/08/app-store-connect-alternative-app-marketplaces/","date":1707430623000,"content":"EU developers can now add alternative app marketplaces to <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> Connect, <a href=\"https://developer.apple.com/news/releases/\">Apple said today</a>. Apple is also accepting submissions for the Notarization process, which is required for all apps that will be distributed through alternative marketplaces.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/App-Store-vs-EU-Feature-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nApple is making these changes to ‌App Store‌ Connect ahead of the launch of iOS 17.4, an update that <a href=\"https://www.macrumors.com/2024/01/25/ios-17-4-alternative-app-marketplaces-eu/\">overhauls the app ecosystem in the European Union</a>. Alternative app marketplaces are special iOS apps that can be downloaded onto an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> from a website or a web browser, serving as an alternative to the ‌App Store‌. App marketplaces are able to distribute iOS apps, giving developers a way to sell their apps without using the ‌App Store‌.\r<br />\n\r<br />\nBoth alternative marketplaces and apps that are added to the ‌iPhone‌ through one of the marketplaces are checked over by Apple to prevent malware, viruses, and similar malicious content.\r<br />\n\r<br />\nTo add an alternative app marketplace or submit an app for Notarization, developers must <a href=\"https://developer.apple.com/news/?id=e59yuu15\">agree to Apple's new business terms</a>. The business terms include a Core Technology Fee that requires app marketplaces to pay .50 euros per install, and apps to pay the same fee after 1 million installs.\r<br />\n\r<br />\nWith alternative app marketplaces able to be added to ‌App Store‌ Connect, marketplace distribution and marketplace apps can be set up, and TestFlight can be used to beta test new features.\r<br />\n\r<br />\nTestFlight also supports apps that use alternative browser engines and alternative payments through third-party payment providers.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/apple-developer-program/\">Apple Developer Program</a>, <a href=\"https://www.macrumors.com/guide/app-store-connect/\">App Store Connect</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/08/app-store-connect-alternative-app-marketplaces/\">Apple Starts Letting Developers Add Alternative App Marketplaces to App Store Connect</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-starts-letting-developers-add-alternative-app-marketplaces-to-app-store-connect.2418959/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f5bc79a57f39818321041ebe10af4addf553f19ef10dcb919ee1c4b6a541c04d","category":"Apple"}