{"title":"Joint modeling of longitudinal and survival data for the evaluation of the impact of irrigation systems on the time until the occurrence of phoma leaf spot in Arabica coffee plants","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13956?af=R","date":1728735896000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>The coffee crop is prominent in Brazilian agriculture, making the country a global power in this area. One of the main concerns in the coffee sector is disease, which can affect coffee productivity and quality. Thus, it is important to evaluate the factors that may affect coffee quality and thus enhance the development of strategies to reduce coffee losses and costs and optimize production. This study evaluated the influence of the type of irrigation (self-propelled, drip, and center pivot) on the time until the occurrence of phoma leaf spot on Arabica coffee plants, considering the intensity of the disease. Additionally, the association between longitudinal incidence and the time until an event of interest was assessed based on the joint modeling of longitudinal and survival data.</p>\n<h2>Results</h2>\n<p>The results of this study identify the effectiveness of drip irrigation system compared with other systems; the use of such systems was associated with an ~46.5% reduction in the risk of leaf spot disease compared with the use of a self-propelled irrigation system. The use of a center pivot system increased the risk of disease progression compared with a self-propelled system. An association between the longitudinal and survival processes was also observed.</p>\n<h2>Conclusion</h2>\n<p>The findings demonstrate the superior performance of the drip irrigation system in controlling phoma leaf spot disease in Arabica coffee plants compared with self-propelled and center pivot systems. This research highlights the potential of using drip irrigation to establish more effective agricultural practices in coffee cultivation, contributing to better disease management and improved crop quality. © 2024 Society of Chemical Industry.</p>","author":"Daiane de Oliveira Gonçalves, \nNatalia da Silva Martins Fonseca, \nRenata Cristina Martins Pereira, \nEdson Ampélio Pozza, \nMarcelo Ângelo Cirillo","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"f5bcd55d9c2d64863f3c2e5a6bcfdeb674457d7df3e14877b3da5d9a6bbe7b1b","category":"Environment"}