{"title":"Rover PSIcle integrates wireless pressure sensor into Presta valve stem","link":"https://cyclingtips.com/2021/05/rover-psicle-integrates-wireless-pressure-sensor-into-presta-valve-stem/","date":1621988084000,"content":"<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Rover-Development-PSIcle-pressure-sensor-1-1340x754.jpg\" /><figcaption>The new Rover Development PSicle pressure sensor sounds very promising as a way to accurately measure your tire pressure without having to carry a dedicated pressure gauge.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Rover-Development-PSIcle-pressure-sensor-2-1340x754.jpg\" /><figcaption>Current prototypes are 3D-printed, but production units will most likely be injection-molded. And as silly as this sounds, the asymmetrical nature of the PSIcle is bound to bother some people.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Rover-Development-PSIcle-pressure-sensor-3-1340x754.jpg\" /><figcaption>The PSIcle is built into a Presta valve extender, so it can be used on both tubeless and tube-type wheels (provided the valve stem has a removable core).</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Rover-Development-PSIcle-pressure-sensor-4-1340x754.jpg\" /><figcaption>To get a reading, you just fire up the Rover app and tap the phone against the sensor.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Rover-Development-PSIcle-pressure-sensor-6-1340x754.jpg\" /><figcaption>Do you really need this level of accuracy? No, but it’s better to have too much than not enough.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Rover-Development-PSIcle-pressure-sensor-5-1340x754.jpg\" /><figcaption>Claimed accuracy on the low-pressure version is far greater than any rider will ever really need.</figcaption></figure></li></ul></figure>\n\n\n\n<p>Remember the <a href=\"https://cyclingtips.com/2021/04/tubolitos-new-psens-inner-tube-tells-you-how-much-air-is-in-your-tires/\" target=\"_blank\">Tubolito PSENS pressure-measuring inner tube</a> we told you about a couple of weeks ago? While the concept was interesting, the execution was definitely pretty lacking. As if on cue, upstart company Rover Development has announced another NFC-based wireless tire pressure sensor, only this one is built into a Presta valve stem, and is claimed to be far more accurate.</p>\n\n\n\n<p>Similar to the Quarq TyreWiz, Rover’s new PSIcle sensor simply threads on to a Presta valve stem — be it a tubeless valve or a conventional inner tube — and uses a free smartphone app to get a pressure reading. But whereas the TyreWiz requires a battery, the PSIcle uses Near Field Communication technology that requires no power at all. You do have to bring the phone right next to the sensor since the transmission distance is so much shorter, but for most people interested in such a thing, that won’t be a big deal.</p>\n\n\n\n<p>Rover has two versions of the PSIcle on tap: one optimized for 0-40 psi, and the other designed for 0-400 psi. Claimed accuracy for the lower-pressure model is just +/- 0.06 psi (which would make the PSIcle an ideal companion for fat bike riders), and a still-impressive +/- 0.7 psi for the higher-pressure one. In either case, Rover says the PSicle will provide an “instant” measurement, and “pressure readings are updated even as you inflate the tire.” </p>\n\n\n\n<p>Whether that means the PSIcle provides readings in real-time is unclear, though. The NFC sensor in the Tubolito tube required you to re-take measurements as the pressure was increased or decreased, and there was also a slight delay as the pressure sensor reset before you could get a true reading.</p>\n\n\n\n<p>As is seemingly the norm these days, Rover Development is launching the PSIcle on Kickstarter starting today, with a discounted price of US$52 for a pair of sensors. Delivery of production units is slated for September 2021.</p>\n\n\n\n<p>More information can be found at <a href=\"http://www.roverdev.us\" target=\"_blank\">www.roverdev.us</a>. </p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/rover-psicle-integrates-wireless-pressure-sensor-into-presta-valve-stem/\">Rover PSIcle integrates wireless pressure sensor into Presta valve stem</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f5bf478ca7736586ac4a199abf083f924e38dd70190b7304784ddd24f18c8811","category":"Cycling"}