{"title":"Deformation trends of two types of toppling in underdip and anti-dip bedding slopes under water-level fluctuations in the Xiluodu Reservoir using InSAR technology","link":"http://link.springer.com/10.1007/s10346-023-02197-2","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Toppling is among the most common deformation types in steeply bedded rock slopes. With the construction of high dams in large rivers, various toppling deformations have occurred in reservoir areas, and it is still unclear how toppling deformation varies with long-term water-level fluctuations. To identify the deformation characteristics and different responses to the water-level fluctuations of the two types of toppling in underdip bedding and anti-dip bedding slopes, stacking interferometric synthetic aperture radar (stacking-InSAR) and small baseline subset InSAR (SBAS-InSAR) technologies were used based on Sentinel-1 SAR data from 8 years following reservoir impoundment. Initially, topplings that deformed locally after impoundment and those that deformed later exhibited complete deformation. According to the stacking-InSAR deformation profile and the deformation characteristics of typical permanent scatter (PS) points from SBAS-InSAR, both Xingguangsanzu (XGSZ) and Yanwan (YW) toppling instabilities can be divided into two deformation zones. According to the annual stacking-InSAR results and the deformation rates of the two zones of topplings, the deformation mode of the XGSZ toppling instability was retrogressive and that of the YW toppling instability was progressive. The crack distributions were related to the surface deformation and the slope topography, and the main tension cracks were very consistent with the large deformation area revealed by InSAR. In terms of long-term deformation, the XGSZ toppling instability mainly suffered from collapse of the front edge before reservoir impoundment, which turned into overall deformation after the first impoundment, while the YW toppling instability deformed after impoundment. The deformation area of the XGSZ toppling instability expanded faster than that of the YW toppling instability in the first 3 years after impoundment. Regarding the relationship with water-level fluctuations, the SBAS-InSAR results showed that the impact of water-level drawdown on the YW toppling instability was more significant than that on the XGSZ toppling instability. The elevation of the YW toppling instability affected by water-level fluctuations was higher than that of the XGSZ toppling instability, and it was speculated that the strong water conductivity of the fault fracture zone in the middle of the slope affected the deformation of the YW toppling instability.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"f5c530d2a06672ab6f37b8c7a7a8804301d7fca5ccbfe7534a0505cbdb5d7cc0","category":"Environment"}