{"title":"Inner Structure of the Lateral Geniculate Complex of Adult and Newborn Acomys cahirinus","link":"https://www.preprints.org/manuscript/202407.0582/v1","date":1720422291000,"content":"Acomys cahirinus is a unique Rodentia species with several distinctive physiological traits, such as precocial development and remarkable regenerative abilities. These characteristics render A. cahirinus increasingly valuable for regenerative and developmental physiology studies. Despite this, the structure and postnatal development of the central nervous system in A. cahirinus have been inadequately explored, with only sporadic data available. This study is the first in a series of papers addressing these gaps. Our first objective was to characterize the structure of the main visual thalamic region, the lateral geniculate complex, using several neuronal markers (including Ca2+-binding proteins, glutamic acid decarboxylase enzyme, and non-phosphorylated domains of heavy-chain neurofilaments) to label populations of principal neurons and interneurons in adult and newborn A. cahirinus. As typically found in other rodents, we identified three subdivisions in the geniculate complex: the dorsal and ventral geniculate nuclei (LGNd and LGNv) and the intergeniculate leaflet (IGL). Additionally, we characterized internal diversity in the LGN nuclei. The \"shell\" and \"core\" regions of the LGNd were identified using calretinin in adults and newborns. In adults, the inner and outer parts of the LGNv were identified using calbindin, calretinin, parvalbumin, GAD67, and SMI-32, whereas in newborns, calretinin and SMI-32 were employed for this purpose. Our findings revealed more pronounced developmental changes in LGNd compared to LGNv and IGL, suggesting that LGNd is less mature at birth and more influenced by visual experience.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f5e808c44bba92f2c1863e5d5ae39d2c3c774297d5d54de31d3dbaf32dfecf80","category":"Interdisciplinary"}