{"title":"260 Effect of different doses of phytase (HiPhorius) and two primary calcium sources on nutrient digestibility, retention and blood parameters in weaned piglets","link":"https://academic.oup.com/jas/article/102/Supplement_2/161/7664875?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>An 18-d study evaluated the effect of increasing phytase levels in diets with limestone or Ca-formate on Ca and P digestibility, P retention, and blood inositol, Ca, and P in weaned piglets. At weaning, male piglets [n = 60; 29.8 ± 1.10 d of age; initial body weight (BW) = 8.8 ± 0.31 kg) were randomly allocated to ten diets formulated as a 2 × 5 factorial design with 2 primary Ca sources (limestone or Ca-formate) and 5 Ca/P levels. There was a positive control diet (PC; 0.76% Ca, 0.34 dP) and 4 negative control diets (NC; 0.56% Ca, 0.34% dP) supplemented with phytase at 0, 750, 1,500, and 3,000 FYT/kg. At d 10, piglets were individually housed in metabolism crates and fed 3.2 x metabolic weight. On d 14 to 18, fecal and total urine samples were collected. Apparent total tract digestibility (ATTD) was calculated for dry matter (DM), organic matter (OM), crude protein (CP), ash, Ca, and P using TiO<sub>2</sub> as marker. Urinary P was measured to calculate P retention. These data were analyzed as a 2-way interaction. On d 0 (baseline), 8 and 18, blood samples were collected to analyze serum Ca and P, and plasma inositol. Blood data were analyzed as a 3-way interaction. Results indicated that piglets fed Ca-formate had greater ATTD of Ca (75.0% vs. 71.4%, <span>P</span> &lt; 0.01) but decreased ATTD of P (66.4% vs. 68.8%, <span>P</span> &lt; 0.01), than piglets fed limestone. Phytase supplementation improved ATTD of DM, ash, OM, CP, P, and Ca compared with the NC and PC. An interaction between Ca/P levels and Ca-sources was observed for urinary P (<span>P</span> = 0.03), as there were no differences between Ca sources in piglets fed the NC or the 750 FYT diets, but piglets fed the PC diet and the NC+1,500 or 3,000 FYT with limestone had greater urinary P compared with Ca-formate. A 2-way interaction between Ca/P levels and d was observed for plasma inositol (<span>P</span> = 0.012). On d 8 and 18, there was no difference between the NC and PC;, however, phytase supplementation at 750, 1,500, and 3,000 FYT increased plasma inositol on d 8 (58.2, 80.7, and 89.5 μmol) and d 18 (70.2, 85.4, and 106.4 μmol). There was only a main effect of Ca/P levels in serum P. Compared with the NC (73.7 mg/L), the PC and the NC+750, 1,500, and 3,000 FTU/kg increased serum P (90.3, 89.1, 87.6, and 93.2 mg/L, respectively, <span>P</span> &lt; 0.01). There was no effect of Ca source on blood inositol and P. No significant dietary treatment effects were observed in serum Ca. In conclusion, using Ca-formate instead of limestone increases Ca digestibility but reduces P digestibility, likely due to a greater Ca solubility of Ca-formate. This suggests that diets should be formulated based on digestible Ca instead of total Ca.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f5ed36d8f464a14820409d7fcc07e524e4c53047d3768c753255f0f4f978f756","category":"Environment"}