{"title":"Evaluation of cytokine expressions in patients with recurrent aphthous stomatitis: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305355","date":1718114400000,"content":"<p>by Fangjun Teng, Qiuchen Jin</p>\r\n\r\nThis systematic review and meta-analysis aimed to evaluate the expression levels of various T helper (Th) cell-secreted cytokines in recurrent aphthous stomatitis (RAS). Case-control studies comparing the serum or salivary levels of cytokines between RAS patients and healthy controls were searched in PubMed, EMBASE, Web of Science, and Google Scholar prior to September 30, 2023. Cytokines produced by Th1 (interleukin [IL]-1, IL-2, IL-8, IL-12, tumor necrosis factor alpha [TNF-α], interferon gamma [IFN-γ]), Th2 (IL-4, IL-5, IL-6, IL-10, IL-13), and Th17 (IL-17A) cells were investigated. The standard mean difference (SMD) with 95% confidence interval (CI) was calculated to detect the difference. A total of 20 studies comprising 1070 RAS patients and 536 healthy controls were included. RAS patients had significantly higher salivary levels of IL-2 (SMD = 4.15, 95%CI 0.83–7.48), IL-5 (SMD = 0.53, 95%CI 0.05–1.00), IL-6 (SMD = 0.48, 95%CI 0.12–0.84), IL-12 (SMD = 0.94, 95%CI 0.18–1.71), and TNF-α (SMD = 1.31, 95%CI 0.44–2.18) compared to healthy controls. Serum levels of IL-6 (SMD = 0.48, 95%CI 0.30–0.66), TNF-α (SMD = 0.70, 95%CI 0.22–1.17), and IFN-γ (SMD = 0.72, 95%CI 0.17–1.28) were significantly increased, while serum IL-10 levels (SMD = -2.25, 95%CI -3.99 to -0.52) were reduced in RAS patients. Patients diagnosed with major RAS had markedly elevated serum IL-8 levels (SMD = 0.39, 95%CI 0.07–0.71) and a trend toward higher serum IL-6 levels (SMD = 0.51, 95%CI -0.02 to 1.04) than those with minor RAS. In conclusion, Th1/Th2-related cytokines, especially IL-2, IL-6, and TNF-α, are involved in the pathogenesis of RAS development and progression and are potential therapeutic targets for RAS.","author":"Fangjun Teng","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f5fe2cb61c373613582377a88e5746cedfd149c8efb14937f6ce719e341b0c4b","category":"Interdisciplinary"}