{"title":"Molecular sibship reconstruction reveals a promiscuous mating system in brood parasitic little bronze-cuckoos (Chalcites minutillus)","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae041/7676548?rss=1","date":1716163200000,"content":"<span><div>Abstract</div>In theory, emancipation from parental care is expected to favor promiscuous mating systems. However, in avian brood parasites, monogamy is surprisingly widespread, and it has been proposed that this may be favored by factors such as low population density and territoriality. Correspondingly, our previous research revealed that brood parasitic Horsfield’s bronze-cuckoos (<span>Chalcites basalis)</span>, which occur at low population densities and defend territories, are monogamous. Here, we contrast this study with the mating system of the congeneric little bronze-cuckoo (<span>C. minutillus)</span>, an obligate brood parasite that exploits more concentrated hosts and is, therefore, likely to occur at higher population densities. We use single nucleotide polymorphisms to characterize the reproductive patterns of unsampled adults by inferring sibling relationships among 30 offspring. We show that (1) little bronze-cuckoos occurred at high densities, (2) polygamy was the most common mating pattern found in this study in both sexes, and (3) where multiple cuckoo eggs are laid in the same nest, they were unrelated. These results indicate that females do not defend exclusive territories, and males do not defend multiple females (polygyny). Instead, little bronze-cuckoos appear to have a non-territorial, promiscuous mating system. Our results are consistent with theoretical predictions that polygamy is more likely to evolve in species that are emancipated from parental care, where there are plenty of available mates, and where home ranges are not defended.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"f604990516812ba1308881877a29083d7658d83170ba9061838a17acc6717e47","category":"Environment"}