{"title":"A drained nutrient‐poor peatland forest in boreal Sweden constitutes a net carbon sink after integrating terrestrial and aquatic fluxes","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17246?af=R","date":1710831600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/40ed1700-9e99-40d6-9241-beaa87f3375b/gcb17246-toc-0001-m.png\" alt=\"A drained nutrient-poor peatland forest in boreal Sweden constitutes a net carbon sink after integrating terrestrial and aquatic fluxes\" />\n<p>This study reveals that a drained peatland forest in the nutrient-poor boreal region acts as net ecosystem carbon sink (−115 ± 5 g C m<sup>−2</sup> year<sup>−1</sup>) after integrating all key terrestrial and aquatic carbon fluxes. It further shows that, following &gt;100 years of drainage, the environmental response of carbon fluxes significantly differed from those in an adjacent natural mire. The study further suggests that contrasting forest structure may considerably affect the net ecosystem carbon balance, highlighting in particular the important role of the ground vegetation.</p>\n<br />\n<h2>Abstract</h2>\n<p>Northern peatlands provide a globally important carbon (C) store. Since the beginning of the 20th century, however, large areas of natural peatlands have been drained for biomass production across Fennoscandia. Today, drained peatland forests constitute a common feature of the managed boreal landscape, yet their ecosystem C balance and associated climate impact are not well understood, particularly within the nutrient-poor boreal region. In this study, we estimated the net ecosystem carbon balance (NECB) from a nutrient-poor drained peatland forest and an adjacent natural mire in northern Sweden by integrating terrestrial carbon dioxide (CO<sub>2</sub>) and methane (CH<sub>4</sub>) fluxes with aquatic losses of dissolved organic C (DOC) and inorganic C based on eddy covariance and stream discharge measurements, respectively, over two hydrological years. Since the forest included a dense spruce-birch area and a sparse pine area, we were able to further evaluate the effect of contrasting forest structure on the NECB and component fluxes. We found that the drained peatland forest was a net C sink with a 2-year mean NECB of −115 ± 5 g C m<sup>−2</sup> year<sup>−1</sup> while the adjacent mire was close to C neutral with 14.6 ± 1.7 g C m<sup>−2</sup> year<sup>−1</sup>. The NECB of the drained peatland forest was dominated by the net CO<sub>2</sub> exchange (net ecosystem exchange [NEE]), whereas NEE and DOC export fluxes contributed equally to the mire NECB. We further found that the C sink strength in the sparse pine forest area (−153 ± 8 g C m<sup>−2</sup> year<sup>−1</sup>) was about 1.5 times as high as in the dense spruce-birch forest area (−95 ± 8 g C m<sup>−2</sup> year<sup>−1</sup>) due to enhanced C uptake by ground vegetation and lower DOC export. Our study suggests that historically drained peatland forests in nutrient-poor boreal regions may provide a significant net ecosystem C sink and associated climate benefits.</p>","author":"Cheuk Hei Marcus Tong, \nKoffi Dodji Noumonvi, \nJoshua Ratcliffe, \nHjalmar Laudon, \nJärvi Järveoja, \nAndreas Drott, \nMats B. Nilsson, \nMatthias Peichl","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"f60caac3a75cb5a9cdffa707fc5ac9e2d03d1a0adef5e9f1cb66736138d86988","category":"Environment"}