{"title":"Data Analytics in Agriculture: Enhancing Decision-Making for Crop Yield Optimization and Sustainable Practices","link":"https://www.preprints.org/manuscript/202406.1042/v1","date":1718606039000,"content":"Collaboration across the agriculture supply chain is essential to address the high-yield demand and sustainable practices amid global overpopulation. Limited resources, such as soil, are compromised by excessive chemical agents and nutrient use. The Internet of Things (IoT) and smart farming offer solutions by optimizing agent application, data analysis, and farm monitoring. Evidence from numerous studies indicates that collaboration in the supply chain, including farmers, can improve efficiency and productivity, reduce costs, and enhance crop quality. This research focuses on implementing IoT technology to enhance decision-making for crop yield optimization and sustainable practices on a real farm. By collaborating with a farm in the southern region of Zagreb, Croatia, farmers were trained on sensor usage and yield monitoring. Small farms in that region face challenges in improving yields due to limited capacity and lack of entrepreneurial skills. The DMAIC methodology was applied to define the problem and measure relevant parameters. The analysis demonstrated consistent patterns between electrical conductivity (EC) measurements and potassium levels in soil. It suggests the potential for estimating potassium concentrations based on EC readings, or vice versa. Leveraging EC as a proxy for potassium levels could offer a cost-effective means of assessing soil fertility and nutrient dynamics. Additionally, the PCA biplot analysis highlighted that pH value behaved independently. Understanding these dynamics enhances knowledge of soil variability and informs sustainable soil management practices.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f60e8e0083b8a58468c74bccdc6d02167170f680b2efdd3fcb0a9e6b8aae4980","category":"Interdisciplinary"}