{"title":"How watching beavers from space can help drought-ridden areas bounce back","link":"https://arstechnica.com/?p=1992974","date":1703857127000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/12/beaver-800x533.jpg\" alt=\"Beaver on a dam\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/12/beaver.jpg\">Enlarge</a> <span>/</span> Where beavers set up home, the dams they build profoundly change the landscape.  (credit: <a href=\"https://www.gettyimages.com/detail/photo/beaver-dam-royalty-free-image/1160279313\">Troy Harrison</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>For the first time in four centuries, it’s good to be a beaver. Long persecuted for their pelts and reviled as pests, the dam-building rodents are today hailed by scientists as ecological saviors. Their ponds and wetlands store water in the face of drought, filter out pollutants, furnish habitat for endangered species, and fight wildfires. In California, <i>Castor canadensis</i> is so prized that the state recently committed millions to its restoration.</p>\n<p>While beavers’ benefits are indisputable, however, our knowledge remains riddled with gaps. We don’t know how many are out there, or which direction their populations are trending, or which watersheds most desperately need a beaver infusion. Few states have systematically surveyed them; moreover, many beaver ponds are tucked into remote streams far from human settlements, where they’re near-impossible to count. “There’s so much we don’t understand about beavers, in part because we don’t have a baseline of where they are,” says Emily Fairfax, a beaver researcher at the University of Minnesota.</p>\n<p></p></div><p><a href=\"https://arstechnica.com/?p=1992974#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1992974&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f60f72e5f3c6385dbbd1924f990dcf967d487cb2045e93b68361c7e403cf116e","category":"Tech"}