{"title":"Apple has finally told us how much Vision Pro weights–and wow is it heavy","link":"https://www.macworld.com/article/2212537/apple-vision-pro-weight-battery-accessories.html","date":1705678921000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple Vision Pro went up for preorder this morning, and we learned a few things about it in the process. For one, you can order the Zeiss Optical Inserts separately<strong> </strong>to share the device with a friend or family member, and for another, it’s very, very heavy.</p>\n\n\n\n<p>We’ve been reading reports about Vision Pro’s problematic weight since Apple began the first demos at WWDC in June, but we didn’t have an exact number until today. According to Apple Vision Pro tech specs, the headset weighs 21.2 to 22.9 ounces (600 to 650 grams) depending on the Light Seal and headband configuration. For comparison, that’s about the weight of the 12.9-inch iPad Pro (24 ounces/682 grams) and much heavier than the Meta Quest 3, which weighs 18.2 ounces (516 grams) and PlayStation VR2 (19.8 ounces/560 grams). </p>\n\n\n\n<p>And that’s not including the battery. Apple says the battery pack, which is attached via a USB-C cable to the device and is meant to be slipped into a pocket, weighs 12.5 ounces (353 grams) on its own. Add it all up and the entire package weighs more than two pounds. That’s a significant amount of weight strapped to your face and body and will surely be among the main improvements in the 2nd-gen model.</p>\n\n\n\n<p>Among the other tidbits we learned today:</p>\n\n\n\n<ul>\n<li>The Zeiss Optical Inserts can be ordered separately for your own Vision Pro or someone else’s device. You don’t need to upload your prescription at the time of purchase.</li>\n\n\n\n<li>There are numerous accessories for purchase, including a travel case ($199), battery ($199), Belkin Battery Holder ($50), Solo knit Band ($99), Dual Loop Band ($99), Light Seal ($199), and Light Seal Cushion ($29). AppleCare+ is also available for $499.</li>\n\n\n\n<li>Vision Pro’s display can be mirrored to any AirPlay‑enabled device, including iPhone, iPad, Mac, Apple TV (2nd generation or later), or AirPlay‑enabled smart TV.</li>\n\n\n\n<li>Vision Pro is rated for Up to 2 hours of general use and can be used while charging the battery.</li>\n\n\n\n<li>The Polishing Cloth is embossed with the Apple Vision Pro name.</li>\n</ul>\n\n\n\n<p>Additionally, Apple has posted a <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2212537-1-0-0&amp;u=https://www.apple.com/apple-vision-pro/guided-tour/\">10-minute guided tour</a> explaining how navigation and gestures work as well as several apps. </p>\n\n\n\n<p>You can <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2212537-1-0-0&amp;u=https://www.apple.com/shop/buy-vision/apple-vision-pro\">preorder Vision Pro at Apple.com now</a> and the device will arrive in stores beginning February 2.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f60f6029f12022e8256d1b4848a2b2f6699fc36fff11f9196be4a0fdf836cc18","category":"Apple"}