{"title":"Hope clipless pedals, Rapha Trail Windblock jersey, BAT lube and more","link":"https://www.bikeradar.com/features/first-look-friday/hope-clipless-pedals-rapha-trail-windblock-jersey-smith-altis-gravel-helmet/","date":1636700429000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/FotoJet-ad6282a.jpg?quality=45&amp;resize=620,413\" />                                            <p>Welcome back to <a href=\"https://www.bikeradar.com/features/first-look-friday/\">First Look Friday</a>. Below is a selection of the products that have landed with me recently, but first, here are a few highlights from the BikeRadar team this week.</p>\n<p> </p>\n<p>Now the clocks have changed and the dark evenings have arrived, we’ve compiled a list of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-lights/\">best mountain bike lights for 2021</a> as well as a round-up of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-lights-for-road-cycling/\">best bike lights for road cyclists</a>. Even on your local trails, night riding can be a whole new experience, so don’t let the early evenings shrink your bike-riding time.</p>\n<p> </p>\n<p>And don’t let wet, cold feet put you off either. With our list of top-rated <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-cycling-shoes/\">winter cycling shoes</a>, you can keep your toes toastie and dry throughout the winter months.</p>\n<p> </p>\n<p>On the news front,<a href=\"https://www.bikeradar.com/news/2022-cannondale-scalpel-ht/\"> Cannondale has added a new Scalpel HT</a> to its cross-country bike range. Like its full-suspension stablemate, it features progressive geometry. In addition, it includes a front-wheel sensor that connects the Cannondale app to record and show ride data.</p>\n<p> </p>\n<p>We also get the lowdown on <a href=\"https://www.bikeradar.com/news/wtb-vulpine/\">WTB’s re-released Vulpine tyre</a>, a low-profile, go-fast gravel tyre. Plus, check out the new <a href=\"https://www.bikeradar.com/news/dt-swiss-erc-dicut-wheels/\">DT Swiss ERC DICUT</a> aero wheels, with a new profile that’s claimed to outperform competitors in the wind tunnel.</p>\n<p> </p>\n<p>However, what’s most exciting is the opportunity to come and <a href=\"https://www.bikeradar.com/news/vacancy-bikeradar/\">work with us at BikeRadar</a>. We’re recruiting for three positions. So, if you love bikes, this could be your ideal opportunity. Check out all the info you need <a href=\"https://www.bikeradar.com/news/vacancy-bikeradar/\">here</a>.</p>\n<p> </p>\n<h2>Hope Technology Union TC Clipless pedals</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Halifax brand has jumped into the clipless pedal market with three models. These TC pedals are the mid-size trail version.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>Hope is constantly filling up its components catalogue with new parts. These clipless pedals released in August this year join its H2O flat pedals. There are three guises available: the RC, TC and GC, which stands for Race, Trail and Gravity respectively.</p>\n<p> </p>\n<p>The TC version here is the mid-sized trail platform built around a Cr-Mo axle. However, a titanium one will be available. We’re keen to see if the three sealed bearings and a Norglide bushing keep them spinning freely through a British winter.</p>\n<p> </p>\n<p>Of course, being Hope, the pedals’ bodies are CNC’d from aluminium billet and available in six colours. We’d expect nothing less from the Halifax brand. They also feature four pins per side for additional grip when riding clipped out.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> You can see the CNC’d pedal body and there’s a screw to tune the spring tension for entry and release.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>Hope has forgone using SPD-compatible cleats and used its own proprietary system. It supplies two sets of cleats with either 4-degree float and 12-degree release angle, or 5 degrees of float and 13-degree release angle.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Hope uses proprietary cleats, and the pedals come with a 4-degree or 5-degree float option.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>The clip mechanism is spring-loaded at the front and back, which Hope claims helps ease of entry. Plus, it’s made from stainless steel, so it shouldn’t corrode or lose its looks through the life of the pedal.</p>\n<p> </p>\n<p>We’re keen to see how Hope’s first take on a clipless pedal stacks up against the established order.</p>\n<ul><li>£150 / €185 / $190 (ex tax)</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<p> </p>\n<p> </p>\n<h2>BAT tyre sealant and chain lube</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> BAT is a South African brand with a latex-based tyre sealant.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>Details are thin on the ground about this South African brand. Still, BAT tyre sealant is a liquid-based latex, with a natural rubber that aims to seal tyres quickly and for the duration of the tyre. Its low viscosity means it should coat the inside of the tyre well. The manufacturer recommends between 60 and 125ml, depending on whether you’re a svelte lightweight racer or a weekend warrior.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> BAT also offers a synthetic wax emulsion chain lube.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>BAT also has a chain lube. This is a water-based synthetic wax emulsion. The synthetic wax has been designed to provide long-lasting and thorough penetration of the chain rollers. BAT claims the emulsion doesn’t dry out like a hard wax and offers low dirt pick-up and natural water resistance.</p>\n<p> </p>\n<p>We think it’s worth a look just for the packaging itself.</p>\n<ul><li>BAT Tyre Sealant £18</li>\n<li>BAT Chain Lube £8.99</li>\n</ul><p> </p>\n<p> </p>\n<h2>Rapha Trail Windblock jersey</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Rapha’s entry into the MTB market features some smart kit, such as this Merino jersey with a wind-blocking front panel.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>Recently, cycling brand Rapha has expanded into the mountain bike segment. Its Trail Windblock jersey looks ideal for the coming winter months, where a little additional protection against a biting breeze is always welcome.</p>\n<p> </p>\n<p>The main body is cut from a 145gms Merino wool that’s been developed for additional durability and all-day comfort, and its natural anti-bacterial should help keep the stink down.</p>\n<p> </p>\n<p>The front panel is where the wind-blocking features come in, and it’s made from a wind and tear-resistant fabric to protect against wind and chill.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The front panel is not only windproof but also tear-resistant.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>The full-length sleeves are constructed from tough nylon fabric to help prevent snags or rips on bushes, or when inevitably slipping off in the winter slop.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The sleeves are made from repairable nylon fabric and feature a soft, comfortable cuff.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<p>The cut is made around a riding position, and there’s a repair kit that comes with the jersey so you can patch up the sleeves if you do tear them. The rest of the jersey is covered by Rapha’s repair service, which is cool to see.</p>\n<ul><li>£100</li>\n</ul><p> </p>\n<h2>100% Altis Gravel helmet</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> 100%’s new Altis Gravel helmet is claimed to be a lightweight and protective lid.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>You’ll be aware that many of us at BikeRadar are multi-disciplined. While most of the things I post are mountain-bike based, this new Altis Gravel helmet from 100% caught my attention.</p>\n<p> </p>\n<p>Built to be lightweight yet protective, it features extended rear coverage courtesy of its high-density EPS foam. It also benefits from 100%’s Smartshock® Rotational Protective System. Using a series of 11 elastomers that move independently from the helmet’s shell, the design is intended to reduce rotational forces in an accident.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> 100%’s Smartshock elastomers are designed to reduce rotational impact forces in an accident.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>14 large vents help keep you cool, and the anti-microbial liner is removable and washable to keep it fresh. An adjustable ratchet system and push-release snap buckle ensure it stays in place and doesn’t bounce around when bridleway bashing.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Altis Gravel helmet offers more protection down the back of the head and a ratchet cradle to help keep it secure.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>Another thing that can’t be overlooked is the price. At just under £90, that seems pretty decent for a helmet these days, considering what you can spend.</p>\n<ul><li>£89.99</li>\n</ul><p> </p>\n<h2>Altura Esker jacket</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The new Adventure range from Altura includes this lightweight packable waterproof Esker jacket.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>Altura’s Esker jacket is a lightweight shell from its new Adventure range of gear. Designed as a packable jacket for mixed-weather rides, it uses a polyester fabric with 5K/5K waterproof and breathability ratings for helping keep the worst off you.</p>\n<p> </p>\n<p>The Esker jacket has a relaxed fit for comfort and boasts a drop tail hem to stop spray splashing your backside. Waterproof zips and bonded seams help keep the jacket from leaking. At the same time, mid-rift mesh vents with storm flap covers add to the jacket’s breathability.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Welded seams and waterproof zips help keep the jacket from leaking.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p> </p>\n<p>Elasticated cuffs should give a secure fit over gloves, and the hood is helmet-compatible. Inside the chest pocket is an elastic strap that the jacket packs down into.</p>\n<ul><li>£100</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>","author":"Luke Marshall","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f611503057ebb428e206c0a78dd6b09d41a974cc57f4ef9b2416cb88ac9a0d5a","category":"Cycling"}