{"title":"Polar fieldwork in the 21<sup>st</sup> century: Early Career Researchers considerations regarding safety and sustainability","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000415","date":1720188000000,"content":"<p>by Adina Moraru, Laura Helene Rasmussen, Filippo Calì Quaglia, Alexandra Middleton, Howard M. Huynh, Adrián López-Quirós</p>\r\n\r\nConducting fieldwork in polar regions presents a multifaceted challenge not only because of the remoteness of the environment, but also potential geopolitical disputes, language barriers, divergent national policies, and disparities in emergency healthcare access. This review addresses the climate crisis and reevaluates the ethical considerations of polar fieldwork in alignment with broader social responsibilities, with particular emphasis on the challenges faced by Early Career Researchers (ECRs). Ongoing climate change and its associated impacts and effects (e.g., reduced snow and ice cover, thawing permafrost, intensified fires, and increased wildlife interactions) will undoubtedly compound the aforementioned challenges. ECRs, often with a heightened awareness for contending with issues pertaining to environmental conservation and sustainability, face greater career stakes than tenured researchers, which can lead to innovation in addressing safety concerns regarding polar fieldwork. This review summarizes current challenges faced by ECRs in polar fieldwork, elaborates on how these may change during this century, and presents possible solutions. To address the aforementioned challenges, we propose a comprehensive set of recommendations, including innovative data collection methods using improved technology and emphasizing meaningful remote local collaborations to minimize the travel and environmental impact and risk of disease contagion. We advocate for reducing the redundancy among research groups by promoting data sharing. Additionally, we suggest enhancing cooperation by integrating (traditional) Indigenous knowledge while respecting the rights of Arctic communities. Such recommendations highlight the intricate dynamics of polar fieldwork safety and logistics in a changing climate, emphasizing the need for adaptability, sustainability, and inclusivity in research practices. A call for action towards revising current practices is clear, emphasizing that ECRs can be key agents in forging and establishing responsible, comprehensive, and adaptive protocols toward enhancing safe and successful fieldwork in the polar sciences.","author":"Adina Moraru","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"f626103a7559ed9ba72e061b99c49eb3d89e8369c8557b438200c812b6a2bc81","category":"Environment"}