{"title":"ผู้เล่นแก้บั๊ก GTA Online ลดเวลาโหลดเข้าเกม 70% ทีมงานจ่ายเงินพร้อมนำมาใช้จริง","link":"https://www.blognone.com/node/121702","date":1615872987000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>ผู้เล่น GTA Online นามว่า t0st เกิดข้อสงสัยว่าทำไมเวลาโหลดเข้าเล่น GTA Online ของเขา ถึงยาวกว่าการโหลดเข้าเล่น Story Mode ถึง 6 เท่าด้วยกัน (1 นาทีกว่า เทียบกับ 6 นาที) เขาจึงลงมือค้นหาว่าปัญหามาจากไหนกันแน่ และพบว่าปัญหานั้นมาจากโค้ดของ Rockstar ที่ทำให้เกิดคอขวดบนซีพียู</p>\n<p>t0st ที่ใช้ซีพียู AMD-FX8350 ทำการค้นหาปัญหาโดยใช้ตัว Profiler ชื่อ <a href=\"http://lukestackwalker.sourceforge.net/\">Luke Stackwalker</a> ก่อนจะพบปัญหาคอขวดบนซีพียูเธรดเดียว และพบว่าเกมมีปัญหาในการ parse ไฟล์ JSON ขนาด 10MB เพราะตัว parser ถูกเขียนมาได้ไม่ค่อยดีนัก กับอีกปัญหาคือหลัง parse ไฟล์เสร็จ ตัวโค้ดยังพยายามทำ duplication check ซึ่งกินเวลานานอีกด้วย</p>\n<p>หลังจาก t0st แก้ปัญหาทั้งสองอย่างนี้ (อ่านรายละเอียดการแก้ปัญหาแบบเต็มได้ที่<a href=\"https://nee.lv/2021/02/28/How-I-cut-GTA-Online-loading-times-by-70/\">บล็อกของ t0st</a>) เวลาโหลดเข้าเกมก็ลดลงจาก 6 นาที เหลือเพียง 1 นาที 50 วิ หรือลดลงไปถึง 69.4% เลยทีเดียว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ddafee4654585be8cb51d1757fe2da07.jpg\" alt=\"\" /></p>\n<p>ทีมงาน Rockstar เข้ามาตรวจสอบวิธีการแก้ไขของ t0st พบว่าโค้ดมีปัญหาจริง และวิธีแก้ของ t0st ใช้ได้จริง จึงมอบเงินรางวัล 10,000 ดอลลาร์ จากโครงการค้นหาบั๊กเกี่ยวกับความปลอดภัยในเกมให้เป็นกรณีพิเศษ รวมถึงบอกว่าจะนำวิธีแก้นี้ไปอัพเดตในแพทช์อย่างเป็นทางการในอนาคต และกล่าวขอบคุณ t0st สำหรับวิธีแก้ปัญหา</p>\n<p>เป็นอีกครั้งที่ชุมชนผู้เล่นต้องลงมาแก้บั๊กในเกมด้วยตัวเอง ซึ่งเป็นเรื่องดีที่คราวนี้ Rockstar มองเห็น ตบรางวัลให้ และเตรียมนำวิธีแก้ไปใช้จริง อย่างไรก็ตาม เสียงตอบรับเกม GTA Online ในไทย ในปัจจุบัน ยังมีผู้เล่นจำนวนมากพบผู้เล่นที่ใช้โปรแกรมโกงเกมอยู่ ซึ่ง Rockstar คงต้องดำเนินการแก้ไขปัญหากันต่อไป</p>\n<p>ที่มา - <a href=\"https://nee.lv/2021/02/28/How-I-cut-GTA-Online-loading-times-by-70/\">t0st blog</a>, <a href=\"https://www.pcgamer.com/rockstar-thanks-gta-online-player-who-fixed-poor-load-times-official-update-coming/\">PC Gamer</a></p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/gta\">GTA</a></div><div class=\"field-item odd\"><a href=\"/topics/games\">Games</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f6290f14a966ebeecb7a395d996e6af0362c74038a298d0052ffb87bba4e6f4d","category":"Thai"}