{"title":"Potential Impacts of Diversification of Food Retail Working Hours on Consumer Behaviour and the Benefits for Local Producers","link":"https://www.preprints.org/manuscript/202409.0902/v1","date":1726064401000,"content":"The capability of large food retail chains to respond quickly to changes in consumer behaviour and their dominant market position affects all food market players and often conflicts with the interests of national food producers, which can reduce the presence of locally sourced products in the food product mix in the country. In Latvia, there have been several proposals to limit retailers' opening hours on weekends and public holidays to increase the viability of small local food producers, retailers, and catering enterprises; however, limiting retailers' opening hours without research-based arguments is unacceptable. The research studies conducted in Europe also do not give a unified conclusion. Household consumer behaviour in the food market is viewed as an essential argument for increasing domestic demand and economic stability. Accordingly, the present research aims to identify the impacts of diversification of opening hours of food supermarkets on consumer shopping habits and the implications for creating an advantage for small and medium agri-food producers in selling their products. The research applied a quantitative approach to identify the main trends in society (n=2738), with a survey including 31 variables to quantify consumer behaviour, values, and opinions and seven socio-demographic variables. If a decision were made in Latvia to close grocery shops on Sundays or reduce their opening hours on weekends, 85% of consumers indicated that they would be unlikely to change their usual shopping location and would plan to shop at a supermarket on other days. The choice between farmers' markets and local food shops on Sundays would be made by 45% of consumers, with more than half (53%) of them shopping at local food shops at least a few times a month. It could, therefore, be argued that reducing the opening hours of supermarkets and closing them on Sundays and public holidays do not provide a competitive advantage and do not divert consumers to small and medium agri-food producers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f630fa8eb98af6a97c9ef6cfbbbdaac1d58fb3ab41726d4b82f53036798e3d36","category":"Interdisciplinary"}