{"title":"Beyond Algorithms: Skills Of Designers That AI Can’t Replicate","link":"https://smashingmagazine.com/2023/04/skills-designers-ai-cant-replicate/","date":1680516000000,"content":"<p>At the start of the Coronavirus pandemic, I led the redesign of a tablet app used by sales representatives of the world’s largest food &amp; beverage company. Never having been a sales representative, nor having ever played one on TV, I was curious about their typical workday. Adapting the first rule of design — Know Thy User — our lockdown approach was to conduct video interviews. As soon as company restrictions allowed, I met two sales representatives at a local Walmart. </p>\n<p>Masked and socially distant, I walked a mile in their shoes through the dairy, pet food, and freezer aisles. This single visit uncovered many insights that had not come up in the video interviews and online walkthroughs. I shared this with the team, spread across the world, and everyone could empathize with the sales representatives: juggling multiple devices and printouts, struggling to make technology work in extreme conditions like a low-lit walk-in freezer, and trying to work without hindering harried shoppers. The sales reps would repeat these tasks between twenty and thirty times a day, five days a week, which sounds about as fun as it is. </p>\n<p>Our team used these insights to experiment with different concepts, refine them based on feedback from sales representatives, and launch a redesigned app that received glowing feedback from the representatives and praise from the company stakeholders.</p>\n<p>Curiosity, empathy, and collaboration were some of the designer-like or <em>designerly</em> behaviors we used to transform the sales representatives’ experience. These behaviors are a few of the behaviors and skills that designers use throughout the design process. Design researcher and educator Nigel Cross first used the word <em>designerly</em> to refer to <strong>underlying patterns of how designers think and act</strong>. </p>\n<p>Designers spend years learning technical design skills, and as they use those hard skills to do their jobs, their designs are impactful when they actively use these non-technical <em>designerly</em> skills and behaviors. <em>Designerly</em> skills and behaviors make us creative and innovative and distinguish us from machines and technology like Artificial Intelligence (AI). </p>\n<p>Yes, the same AI that you can’t avoid reading or hearing about on social media or in the news. Stories and posts about people being equally worried about layoffs and AI taking over their jobs, and some even suggesting that AI is why those jobs won’t come back. Creators and people traditionally considered creative, like artists, writers, and designers, seem especially concerned about AI making them redundant. Guesstimates of when AI will perform tasks better than humans just add to the frenzy.</p>\n<p><img src=\"https://files.smashing.media/articles/skills-designers-ai-cant-replicate/1-timeline-ai-development.jpg\" /></p>\n<p>The assumption that AI will replace people is based on the premise that both have the same qualities, abilities, and skills. But that’s just not true. Artificial intelligence is simply technology that is taught to <strong>mimic human intelligence to perform tasks</strong>. It is trained on large amounts of data — <a href=\"https://www.springboard.com/blog/data-science/machine-learning-gpt-3-open-ai/\">by some estimates</a>, the equivalent of a quarter of the Library of Congress, the world’s largest library. </p>\n<p>AI is better than humans in certain tasks that involve processing and analyzing large amounts of data quickly, accurately, rationally, and consistently. <strong>Artificial Intelligence may create, but it can’t be creative.</strong> It cannot match humans in areas that rely on skills and behaviors that are distinctly human, like intuition, emotional intelligence, cultural context, and changing situations. </p>\n<p>Humans are conscious beings with a subconscious mind that can influence decisions and change those decisions based on experience, context, environment, wisdom, and understanding. This takes us years, decades, and even a lifetime to learn and apply, and it cannot be programmed in machines, no matter how sentient they may appear to be. Not for the foreseeable future. </p>\n<p>Being <em>designerly</em> takes thinking, feeling, and acting like a designer. I’ve been thinking about and observing what it means to be <em>designerly</em>, and by using six such skills and behaviors, I will discuss how humans have an advantage over AI. I used the head, heart, and hands approach for transformative sustainability learning (Orr, Sipos, et al.) to organize these <em>designerly</em> skills related to thinking (head), feeling (heart), and doing (hands), and offer ways to practice them. </p>\n<p>Using our head, heart, and hands together to make a transformative difference is what distinguishes us from AI and makes us human, creative, and innovative.</p>\n<p><img src=\"https://files.smashing.media/articles/skills-designers-ai-cant-replicate/3-designerly-skills.png\" /></p>\nHead\n<p>The skills, behaviors, and habits to help you think like a designer and create a <em>designerly</em> mindset include curiosity and observation.</p>\n<h3>Cultivate Curiosity</h3>\n<p>Curiosity is the desire to know. It is a pleasure to ask, explore, experiment, discover, learn, and understand. We see this relentless curiosity in small children, who explore everything novel around them. As they grow up, that curiosity starts getting stifled in many, partly because they are taught to look for an answer instead of exploring questions. </p>\n<p>This curiosity stifler of focusing on the answer is what AI is programmed to do. AI is also limited by its knowledge and understanding of the world, unable to explore beyond those boundaries. Also, without physical senses, AI cannot experience the world and be curious about things we see, hear, touch, taste, and smell around us. </p>\n<p>This gives us a leg up on AI if we can overcome other curiosity-stiflers like self-consciousness, the shame of not knowing, and the fear of ridicule. </p>\n<p>Let’s deconstruct curiosity to understand different types of curiosity we can nurture and build in ways AI cannot. In the 1950s, British-Canadian psychologist Daniel Berlyne presented a model distinguishing between two types of curiosity: <strong>perceptual</strong>, based on stimulation, and <strong>epistemic</strong>, driven by a genuine desire for knowledge. He also distinguished between two types of behaviors to address that curiosity: <strong>diversive</strong> exploration, motivated by a need for novel stimulation or a desire to explore, and <strong>specific</strong> exploration, motivated by curiosity and a search for new information.</p>\n<p><img src=\"https://files.smashing.media/articles/skills-designers-ai-cant-replicate/2-curiosity-dimensions.png\" /></p>\n<p>This gives us four dimensions of curiosity, which have their time and place, but the quadrant we are discussing lies at the intersection of the desire to explore and the desire for knowledge. Diversive-Epistemic curiosity is where people use the desire to explore and apply it to learning new things. TED Talks are an example of knowledge exploration, where people can learn about just about any topic they care to explore.</p>\n<p>You can cultivate curiosity by being intentional in developing the joy of exploration. Set some time aside every day to learn something new, and pick topics that interest you. Start small and gradually increase the time you spend learning something daily as well as for expanding the topics. I would suggest starting with just 10–20 minutes a day. That’s enough time to watch a TED talk, read a book summary, or start learning a new skill. Reading multiple book summaries on a topic is an easy way to identify the next book you should read cover to cover over a few days or weeks. </p>\n<p>Curious exploration broadens the mind to new ideas, perspectives, and approaches, lays the foundation for the cross-pollination of ideas, and leads to creative and innovative solutions.</p>\n<p><strong>Advantage:</strong> People</p>\n<h3>Notice &amp; Observe</h3>\n<p>While often used as synonyms, noticing is seeing something for the first time, while observing is paying close attention to something or someone. Being creative begins with <strong>noticing what others have overlooked</strong>, followed by closer, <strong>intentional observation</strong> when warranted. </p>\n<p>In traditional ethnography, researchers observe people and cultures in an immersive manner. Design ethnography or digital ethnography is not as extreme; researchers and designers only spend days or weeks observing users, instead of years. The operative word is observing — watching and listening. The payoff is that ethnography can inform and improve design decisions. You don’t need to wait for your next project to observe people. Instead, make it an everyday habit, and you will not only hone your powers of observation, but it will also gradually become second nature.</p>\n<p>AI cannot do this because it relies on the limited data it is trained with, unlike people who have an unlimited ability to notice and observe new things all the time. Even if it could overcome that hurdle, without emotions and context, AI would not be able to understand the feelings and emotions involved in the people or situation being observed. We can observe a situation and understand the context and meaning behind it as we process what we are noticing and observing. </p>\n<p>We can build our power of observation by taking the time to pay attention to people and their behavior. You can do this anytime — while you are in a coffee shop or waiting in the grocery checkout line. Get your nose out of that glowing rectangle, remove your headphones, and look around. While you may end up seeing others captivated by their own glowing rectangles, start observing the details: </p>\n<ul>\n<li>What type of phones are they using? </li>\n<li>Are they passively consuming content or actively interacting with a game or person? </li>\n<li>What emotions do you notice?</li>\n</ul>\n<p>When you start paying attention, you will be surprised by things you may have seen but not noticed or observed in the past. And the more you practice, the more natural it will become. Noticing and observing the world around you in new and different ways provides inspiration and helps reveal issues and patterns, leading to better ideas and solutions. </p>\n<p><strong>Advantage</strong>: People</p>\nHeart\n<p>The skills, behaviors, and habits to help you feel like a designer and create a <em>designerly</em> attitude include empathy and advocacy. </p>\n<h3>Be Empathetic</h3>\n<p>My favorite definition of empathy is by Roman Krznaric in his book, <em>Empathy: Why It Matters, and How to Get It</em>:</p>\n<blockquote>Empathy is the art of stepping imaginatively into the shoes of another person, understanding their feelings and perspectives, and using that understating to guide your actions.<br />— Roman Krznaric</blockquote>\n\n<p>There are three types of empathy, according to psychologists Daniel Goleman and Paul Ekman: </p>\n<ol>\n<li>Cognitive,</li>\n<li>Emotional,</li>\n<li>Compassionate.</li>\n</ol>\n<p>The empathy that results in thinking, feeling, and doing are all important and have their place in our lives, but the empathy that results in doing, <strong>compassionate empathy</strong>, goes beyond understanding others and sharing their feelings by driving us to do what we can to help them. This helps us make a difference in people’s lives. I am talking about genuinely employing empathy, not doing it as lip service or checking a box off in the process. </p>\n<p>Successful designers routinely use empathy in <strong>human-centered design</strong>. They start with an understanding of the people they are designing for by observing them and immersing themselves in their users’ environments. Designers then apply that deep understanding to design products and experiences that work for those users.</p>\n<p>While AI can measure people’s emotions from their expressions and is being <a href=\"https://www.wired.com/story/artificial-intelligence-empathy/\">trained to mimic human emotions</a>, AI machines and tools don’t have consciousness and cannot understand or experience emotions. AI also lacks personal, shared experiences that allow us to show empathy to varying degrees. </p>\n<p>Even if you are not empathetic by nature, try building it over the coming days with one or more interactions with others:</p>\n<ul>\n<li><strong>Suspend judgment.</strong><br />It is difficult to be empathetic if you are mentally judging the other person. If you voice that judgment, you will not be able to be empathetic, and the other person may stop sharing with you.</li>\n<li><strong>Listen attentively with your eyes and ears.</strong><br />Engage more than one sense to listen actively so that you can respond deeply. Pay attention to <em>what</em> the other person is saying, not how you need to respond. Be completely present with the other person, putting aside our modern distractions. </li>\n</ul>\n<p>Being empathetic takes practice for most of us. Be empathetic. </p>\n<p><strong>Advantage:</strong> People</p>\n<h3>Advocate For Others</h3>\n<p>User advocacy is at the heart of <em>designerly</em> skills and behaviors. The skills and behaviors of curiosity, observance, and empathy create a deep understanding of users and their needs, but that is only the beginning. User advocacy brings all of the above to life and turns that respect for the user into action to address their needs. It also shares that understanding with others involved so they, too, can identify with users. </p>\n<p>Being a user advocate means <strong>representing the interests of users in an ocean of competing interests</strong>. A user advocate represents the user throughout the design process, giving the user a voice, bringing them to life, and making the impersonal user personal.</p>\n<p>Without curiosity, observation, and empathy, AI is unable to use those skills and behaviors to be an advocate. AI also lacks the creativity to come up with solutions to address the needs of others. AI can be programmed to follow rules and guidelines to protect people, an increasingly important area of ethical AI. If you’ve been following the news, this has led to mixed results, sometimes <a href=\"https://www.tomsguide.com/opinion/bing-chatgpt-goes-off-the-deep-end-and-the-latest-examples-are-very-disturbing\">going off the deep end</a> in some instances. No points for guessing that AI cannot make ethical judgment calls on its own. </p>\n<p>However, people can do that. And we can manifest it in design by doing what’s right for users. I previously wrote about <a href=\"https://www.smashingmagazine.com/2018/06/ethics-of-persuasion/#principles-and-questions\">principles for designers</a>; two of them summarized below:</p>\n<ul>\n<li><strong>Do no harm.</strong><br />Your decisions may affect the minds, behavior, and lives of your users and others around them, so be alert and guard against misusing the influence of your designs. Ask yourself: Would you be comfortable with someone else using your design on you, your parents, or your child?</li>\n<li><strong>Be aware of your responsibility to your intended users, unintended users, and society at large.</strong><br />Accept appropriate responsibility for the outcomes of your design. During design, follow up answers to “How might we…?” with “At what cost?”</li>\n</ul>\n<p>Remind yourself that you are not the user and use your knowledge of the user to represent the user when they are absent. Advocate for them.</p>\n<p><strong>Advantage</strong>: People</p>\nHands\n<p>The skills, behaviors, and habits to help you act like a designer are brought to life through visual communication and collaboration. </p>\n<h3>Communicate Visually</h3>\n<p><strong>Storytelling is an important skill</strong> that vividly paints a picture in people’s minds, driving them to action. It converts words to a visual that people will remember, but even then, different people may all visualize the same thing differently. This happens whether you’re listening to your favorite inspirational speaker or reading your favorite fiction author. No matter how painstakingly a speaker or author describes a character or a situation, chances are high that two people sitting right next to each other both have different images in their minds. However, when there is an accompanying image or visual, people are literally on the same page (or slide, graph), which slashes the risk of them imagining different things. That’s the power of thinking and communicating visually.</p>\n<p>Not all designers are artistic, but <strong>you don’t have to be artistic to be a visual thinker or communicator</strong>. Even a rough sketch on a whiteboard or a notepad can often communicate information faster than the written or verbal form. The aim is to make ideas tangible quickly, to get to the right idea faster. User researchers and designers commonly use visualizations to help them make sense of data and come up with new ideas.</p>\n<p>Without physical senses, AI cannot think or communicate visually. Without emotions, the ability to understand context, and creativity, AI cannot ‘read the room’ or come up with ideas outside its dataset and communicate outside its current language abilities, making visual communication impossible. However, people can use AI as a tool to communicate visually, especially with tools that convert text prompts to images.</p>\n<p>Next time you describe something, instead of writing a page of instructions or talking it out, use a quick sketch. Describing a process? Boxes and arrows are very powerful. Talking about a screen or two? A rough layout, highlighting the important parts, along with an arrow showing how you get from one to another, is more powerful. Or a quick screen recording. Sketching not your thing? Use images. I’ve been known to use LEGO photography in my articles and presentations. You can also mock up something without advanced design tools. For instance, I had a non-designer boss who communicated visually using PowerPoint. And if you are in the mood to explore and experiment, try one of the many AI text-to-image generators.</p>\n<p>Show. Don’t only tell.</p>\n<p><strong>Advantage</strong>: People</p>\n<h3>Collaborate</h3>\n<p>We can achieve much more, much faster, working together. It is uncommon for a single person to come up with the best solution by themselves. Gone are the days of the lone designer working on a solution by themselves. No single person or discipline has the answer to all problems, design or otherwise. It usually takes a team from different disciplines and backgrounds to solve big problems. </p>\n<p>A multi-disciplinary team working together toward a common goal is an example of collaboration. This brings different perspectives into the creation process, from idea generation to providing feedback and validation during the creation process.</p>\n<p>Collaboration relies on <strong>understanding and navigating social dynamics</strong>. While some people struggle with that, AI fails. Ditto for the ability to negotiate or compromise. Some people struggle with that too, but AI cannot unless specifically programmed to. Collaboration also requires the <strong>ability to adapt</strong> based on live inputs, feedback, or the situation, which traditional AI has limited capability to do beyond its training phase. </p>\n<p>That said, AI can support collaboration if you think about people collaborating with AI tools. We’ve seen how AI tools can generate designs, logos, layouts, code, write content, do homework, and generate legal documents. But there are enough examples of it being plain wrong, which is why we should use them as assistants in our workflow. </p>\n<p><a href=\"https://www.sogeti.com/ai-for-qe/section-4-2-automate-scale/chapter-4/\">AI tools can support the efforts of designers and researchers</a> by reducing manual human effort (e.g., transcribing), making people more efficient and saving time (e.g., text-based video editing), providing machine learning-based insight (e.g., attention prediction), and augmenting human effort (e.g., AI evaluation). Just remember that AI is not perfect, and there are plenty of mistakes and errors, as shown below (I’m not India-based, did not write <em>The UX Book</em>, and never taught at the schools mentioned).</p>\n<p><img src=\"https://files.smashing.media/articles/skills-designers-ai-cant-replicate/5-chatgpt-output.png\" /></p>\n<p>Next time you are working on a project, get others involved. These could be different departments, different specialties, different backgrounds, and, where appropriate, even customers — maybe even AI.</p>\n<p><strong>Advantage</strong>: People</p>\nConclusion\n<p>I’ll use an analogy from the restaurant industry of chefs and cooks to draw parallels between humans and AI. Chefs can cook meals by themselves, but they are more effective when they focus on the strategic work of planning the menu, overseeing the cooks who tactically follow recipes, sometimes improvising, and applying the finishing touches before the meal is served to customers. Robots have replaced parts of what cooks do and technology that may suggest recipes and meals, but it still needs the chef to make the final decisions. </p>\n<p><img src=\"https://files.smashing.media/articles/skills-designers-ai-cant-replicate/4-playground-ai-image-generation.png\" /></p>\n<p>Artificial Intelligence is changing the way we work and live, making us more efficient. As designers, we can use AI to support ideation, analyze data, generate variations, and predict behavior based on patterns. This will free us up to <strong>focus on more strategic aspects of design</strong>, using the <em>designerly</em> skills above which are impossible to duplicate, and for which people have the advantage over AI. We can use AI to make us more efficient and allow us to do what we do best — understand our users, stakeholders, and real-world constraints and then collaborate with others to design successful solutions. What we do won’t change as much as how we do it, with AI augmenting, instead of replacing us.</p>\n<p><strong>Advantage</strong>: People</p>\n<p>AI cannot be trained to mimic these <em>designerly</em> skills the way we can practice and develop them because it is not conscious, cannot adapt, and does not have the experiences, emotions, or intuition that we have. AI can artificially mimic some but cannot match human abilities in these areas. Skills like curiosity, observation, empathy, advocacy, visual communication, and collaboration are key non-technical skills to help us use the head, heart, and hands together to be more <em>designerly</em> and thrive in a world of AI.</p>\n<h3>Resources:</h3>\n<h4>Links</h4>\n<ul>\n<li>“<a href=\"https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/\">What Is ChatGPT Doing … and Why Does It Work?</a>,” Stephen Wolfram<br />Yes, AI is more than ChatGPT, but this is the AI tool that’s currently viral</li>\n<li>“<a href=\"https://www.nytimes.com/2023/02/16/technology/chatbots-explained.html\">Why Chatbots Sometimes Act Weird and Spout Nonsense</a>,” Cade Metz</li>\n<li>“<a href=\"https://aeon.co/essays/to-understand-ai-sentience-first-understand-it-in-animals\">What Has Feelings?</a>,” Kristin Andrews and Jonathan Birch</li>\n<li>“<a href=\"https://www.emerald.com/insight/content/doi/10.1108/14676370810842193/full/html\">Achieving Transformative Sustainability Learning: Engaging Head, Hands And Heart</a>,” Yona Sipos, Bryce Battisti, Kurt Grimm</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2018/06/ethics-of-persuasion/\">The Ethics Of Persuasion</a>,” Lyndon Cerejo</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/12/future-design-human-powered-ai-driven/\">The Future Of Design: Human-Powered Or AI-Driven?</a>,” Keima Kai</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2023/03/ai-technology-transform-design/\">How AI Technology Will Transform Design</a>,” Nick Babich &amp; Gleb Kuznetsov</li>\n</ul>\n<h4>Books</h4>\n<ul>\n<li><a href=\"https://www.amazon.com/Designerly-Ways-Knowing-Nigel-Cross/dp/1846283000\">Designerly Ways Of Knowing</a>, Nigel Cross</li>\n<li><a href=\"https://www.amazon.com/Curious-Desire-Know-Future-Depends/dp/0465097626/\">Curious: The Desire To Know and Why Your Future Depends On It</a>, Ian Leslie</li>\n<li><a href=\"https://www.amazon.com/Empathy-Why-Matters-How-Get/dp/0399171401/\">Empathy: Why It Matters, And How to Get It</a>, Roman Krznaric </li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"f634f19fb4eea19b7af9ac41c4165089c80d827412f4a9df3df9095c0224fe94","category":"Tech"}