{"title":"The rumor is true: Rimac is taking over Bugatti with Porsche’s help","link":"https://arstechnica.com/?p=1778245","date":1625499612000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/01_00_bugatti_chiron_super_sport_windtunnel_front-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/01_00_bugatti_chiron_super_sport_windtunnel_front.jpg\">Enlarge</a> <span>/</span> The Bugatti Chiron will be joined by new electrified models.   (credit: Bugatti)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>For almost a year, <a href=\"https://www.carmagazine.co.uk/car-news/industry-news/bugatti/vw-group-rimac/\">a rumor has been circulating</a> that Volkswagen Group plans to offload Bugatti to Croatian electric vehicle specialists <a href=\"https://arstechnica.com/tag/rimac-automobili/\">Rimac</a>. That rumor turns out to be true: on Monday Porsche and Rimac revealed that they are forming a new joint venture called Bugatti-Rimac at the end of this year. It will be headquartered in Zagreb, Croatia, although Bugatti's manufacturing will remain where it is currently, in Molsheim, France.</p>\n<p>Originally founded in 1909 by Ettore Bugatti, the company became known during the interwar period for cars that were at the apex of style and speed, winning Grands Prix as well as the approval of the ultra-rich. Based in Molsheim in the Alsace region, it foundered following Bugatti's death in 1947 and disappeared in 1963, before being resurrected by industrialist Romano Artioli in 1987. In this incarnation, Bugatti set up <a href=\"https://www.hagerty.com/media/automotive-history/wandering-the-hallowed-abandoned-halls-of-the-bugatti-eb110/\">a high-tech factory in Campogalliano, Italy</a> to build the <a href=\"https://arstechnica.com/cars/2019/08/these-mclaren-f1s-and-bugatti-eb110s-were-the-stars-of-car-week/\">carbon fiber EB110 supercar</a>, before a faltering global economy put paid to Artioli's ambitions.</p>\n<p>In 1998, Bugatti began its third incarnation when Volkswagen Group bought the name and returned the company to Molsheim. The driving force was <a href=\"https://arstechnica.com/cars/2019/08/ferdinand-piech-dies-father-of-the-porsche-917-and-bugatti-veyron/\">Ferdinand Piech</a>, VW Group's CEO at the time and grandson of Ferdinand Porsche. Piech wanted a car that had 1000 metric horsepower and a top speed of at least 260 mph (418km/h), and Bugatti delivered it with the Veyron 16.4 in 2005. Since then its hand-built a series of increasingly quick, extremely expensive hypercars, but questions have increasingly been asked about Bugatti's relevance within VW Group at a time when the rest of the brands are all going electric.</p></div><p><a href=\"https://arstechnica.com/?p=1778245#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1778245&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f6346806f33bc43886391ea69f140831100c0dee71647de33a2c33867cd0ff2f","category":"Tech"}