{"title":"Apple’s Game Porting Toolkit is the first real step to fixing Mac gaming","link":"https://www.macworld.com/article/1945978/game-porting-toolkit-gaming-mac-valve-proton.html","date":1686825000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Look, Mac gaming is not in good shape. Apple pitched the <a href=\"https://www.macworld.com/article/1485513/mac-mini-m2-pro-gaming-graphics-performance.html\">Mac mini with M2 Pro</a> as a sort of showcase for how great Mac gaming can be, and I wrote about it earlier this year. It can indeed play games respectably, but a similarly-priced Windows PC is more than twice as fast for gaming, and the Mac vs. Windows game catalog is like comparing a cookie jar with a cookie factory. Sure, they both have good cookies, but these things are not the same.</p>\n\n\n\n<p>Apple doesn’t seem interested in offering good bang for the buck when it comes to gaming hardware, but at least there’s a real effort to get the software situation into better shape. When announcing macOS Sonoma at <a href=\"https://www.macworld.com/wwdc\">WWDC</a>, Apple took time to showcase some new gaming capabilities and even brought famous developer Hideo Kojima out to promote <em>Death Stranding</em> coming to Mac later this year. Nothing says “Mac gaming” more than Apple excitedly trumpeting the Mac release of a four-year-old game.</p>\n\n\n\n<p>The new gaming features coming to <a href=\"https://www.macworld.com/article/1942313/macos-14-sonoma-featrues-screensavers-widgets-safari-video-conferencing.html\">macOS Sonoma</a> are a good step forward, though. A new Game Mode works with any game to give it higher process priority, reduces AirPods audio latency, and doubles the Bluetooth sampling rate for game controllers. Game Mode is only for Macs with Apple Silicon, but that’s the way everything seems to be going, isn’t it?</p>\n\n\n\n<p>But it’s a developer tool called the Game Porting Toolkit that might have the biggest impact on Mac gaming. With a bigger investment from Apple, it could provide a huge boost to the Mac game library.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/mac-metal-game-porting-toolkit.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Game Porting Toolkit\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/mac-metal-game-porting-toolkit.jpg?quality=50&amp;strip=all 1526w, https://b2c-contenthub.com/wp-content/uploads/2023/06/mac-metal-game-porting-toolkit.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/06/mac-metal-game-porting-toolkit.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/06/mac-metal-game-porting-toolkit.jpg?resize=1200%2C801&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/06/mac-metal-game-porting-toolkit.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/06/mac-metal-game-porting-toolkit.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"801\" /></figure><p>Apple</p></div>\n\n\n\n<h2>Game Porting Toolkit is Rosetta for Windows games…almost</h2>\n\n\n\n<p>One of the new developer tools for macOS Sonoma is a Game Porting Toolkit that is based on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.codeweavers.com/blog/mjohnson/2023/6/6/wine-comes-to-macos-apple-s-game-porting-toolkit-powered-by-crossover-source-code&amp;xcust=1-1-1945978-1-0-0&amp;sref=https://www.macworld.com/feed\">CrossOver source code from CodeWeavers</a>. Essentially, it takes the x86 code, DirectInput commands, XAudio commands, Direct3D commands, and other Windows gaming API calls and translates them in real time to the appropriate Apple Silicon stuff. </p>\n\n\n\n<p>Yes, Apple has a developer tool that will literally let you run a modern, high-end Windows game on Mac without any recompiling or other changes.</p>\n\n\n\n<p>That sounds a lot like <a href=\"https://www.pcworld.com/article/394895/what-is-valve-proton-steam-deck-games-software-explained.html\">Proton</a>, the translation tool that Valve developed to run Windows games on Linux for the Steam Deck. And indeed, it is very similar. But Valve maintains and updates Proton as an end-user tool. Like Rosetta 2 on Apple Silicon Macs, Proton is meant for everyday people to make use of fundamentally incompatible software without any hassle. Apple’s tool is just for developers to start prototyping.</p>\n\n\n\n<p>The big flaw with the Game Development Toolkit’s translation feature is that regular users can’t use it. Developers with Xcode can use it to run Windows games as a first “how does this work on Mac” step, but they’ll still have to go through all the other steps in translating a game to Mac: porting the source code, recompiling HLSL shaders, translating other graphics work to Metal, changing all the input and display APIs to native Mac equivalents, and more. Apple has a new Metal Shader Converter that should help speed along this process, but making a Mac version of a Windows game is still a big effort.</p>\n\n\n\n<h2>This is too promising to remain a developer tool</h2>\n\n\n\n<p>Already, enterprising Mac enthusiasts have installed the new Xcode 15 command-line tools and the Game Porting Toolkit to run Windows games on their Macs. One user got <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/macgaming/comments/143ae4f/diablo_iv_on_m1_max_mbp_14_using_macos_ventura_134/&amp;xcust=1-1-1945978-1-0-0&amp;sref=https://www.macworld.com/feed\">Diablo IV</a> running. Another fired up <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/macgaming/comments/142vjdz/i_got_cyberpunk_2077_running_on_an_m1_macbook/&amp;xcust=1-1-1945978-1-0-0&amp;sref=https://www.macworld.com/feed\">Cyberpunk 2077</a> and it isn’t exactly smooth but it’s amazing it even works with such fidelity. Others have run <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/macgaming/comments/143gqx1/elden_ring_on_m2_air8gb_not_too_shabby/&amp;xcust=1-1-1945978-1-0-0&amp;sref=https://www.macworld.com/feed\">Elden Ring</a>, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/macgaming/comments/143c97j/warframe_dx12_running_on_game_porting_toolkit/&amp;xcust=1-1-1945978-1-0-0&amp;sref=https://www.macworld.com/feed\">Warframe</a>, Spider-Man, Hi-Fi Rush, and more. </p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>This is all very exciting, but performance could be better, and the steps to do this are beyond regular users. To actually bring these games to Mac, the developers still need to do significant translation work and re-publish a Mac version.</p>\n\n\n\n<p>I suggested before that Apple needs a “Proton for Mac” of sorts. Perhaps it could call it <em>Rosetta Gaming</em> or something similar, but the idea would be a user-downloadable tool that lets a bunch of Windows games run directly on Mac without any work from the developers. The Game Porting Toolkit is halfway there. But Valve did a ton of work on a title-by-title basis to fix bugs and problems with specific games and improve their performance, and it continues to do so with <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://github.com/ValveSoftware/Proton/wiki/Changelog&amp;xcust=1-1-1945978-1-0-0&amp;sref=https://www.macworld.com/feed\">regular Proton updates</a>. Apple would need to engage in a similar effort, as well as maintain a list of compatible titles. It’s a lot of heavy lifting.</p>\n\n\n\n<p>But just imagine if Apple did it! Hundreds of top Windows games could run on Macs with Apple Silicon just as easily as apps made for Intel-based Macs. Just install a new Rosetta, check a compatibility list, and off you go. You would always get better performance with a native Mac version, but nothing would encourage publishers more than seeing real everyday gamers actually playing their games on Mac.</p>\n\n\n\n<p>  </p>\n\nApple, Gaming</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f640f5861252e65359f9bda56e2fd7b1cd4f8ae907c41f48fd8090e830beaf0a","category":"Apple"}