{"title":"De-MA.ch: A Web Database for Electron and X-ray Microanalysis to Assist Electron Microscope Lab Managers and Users","link":"https://academic.oup.com/mam/article/30/3/489/7685923?rss=1","date":1717113600000,"content":"<span><div>Abstract</div>Lab managers and users of scanning electron microscope or electron probe microanalyzer facilities aiming for qualitative or quantitative X-ray analyses require comprehensive, yet flexible documentation structures for their daily work and available reference material, with a complete X-ray data library, a repository of energy- and wavelength-dispersive spectra, and an instrument scheduling mechanism. An online multilaboratory database system available at <a href=\"https://de-ma.ch\">https://de-ma.ch</a> is presented with the primary goals of providing information on microanalytical reference materials, analytical setups, characteristic X-ray data, and for managing reservation and training requests. This website is designed for multiuser facilities, where experience ranges from beginners to expert users. Registered users will find these tools useful in developing and maintaining high-quality, reproducible, and efficient analyses, whereas lab managers will keep records of their microanalytical reference material database and analytical protocols. The database also serves an educational purpose by (a) providing information on reference materials, (b) encouraging students to select appropriate X-ray lines to analyze, (c) providing analytical setups for point analysis or mapping, (d) identifying unknown X-ray lines, (e) displaying energy- or wavelength-dispersive spectra, and (f) recalculating mineral formula from quantitative wt% analysis results, based on a number of oxygen atoms or cations.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"f64c66ee2fbfb0f76e7356fb209b9ab9ecca727eed31dd4264c14ab78f3c73d8","category":"Environment"}