{"title":"Evaluation of a scheme to identify risks for tail biting in pigs","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305960","date":1724940000000,"content":"<p>by Roberta Maria D’Alessio, Conor G. Mc Aloon, Carla Correia-Gomes, Alison Hanlon, Keelin O’Driscoll</p>\r\n\r\nThe study aimed to assess the effectiveness of a tail-biting risk assessment scheme. The scheme consisted of trained private veterinary practitioners (assessors) applying a risk assessment tool on commercial pig farms to six pens per farm. The assessment tool included animal and non-animal-based observations which were used to determine the perceived risk of tail biting for each pen. For this study 27 farms were assessed, and a subsequent batch of pigs from each farm underwent post-mortem tail lesion scoring at the abattoir. The assessments revealed that a high percentage of pens had fully slatted flooring (92%) and mixed-sex populations (84%), with a significant proportion of pens containing pigs which were all tail docked (92%). Most pens (86%) did not allow all pigs simultaneous access to feeders. Enrichment was present in 88% of the pens, but most (46%) were supplied with only one item, and only 15% offering multiple enrichment types. The study found no significant associations between the risk of tail biting and visible injuries, dirty flanks, or tucked tails, as assessed by the assessors (P &gt; 0.05). Similarly, the risk of tail biting reported per pen was not associated with aggressive, damaging, or exploratory behaviours (P &gt; 0.05). At the abattoir, 96% of pigs’ tails exhibited minor skin damage, with only 4% showing moderate to severe damage. Furthermore, no links were found between the scores obtained during slaughter and the risk of tail biting, as reported by the assessors (P &lt; 0.05). Although the tool was useful in identifying several improvements that could be made at farm level in areas such as stocking density, enrichment provision and reducing tail docking, overall the results underscored the need for improved training of assessors, and the challenge of associating management practices and animal based measures with tail-biting risk.","author":"Roberta Maria D’Alessio","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f64ef95622ad54e8b1856195ad1e0d4c93c6d258f6b53a8a674be92b38356e08","category":"Interdisciplinary"}