{"title":"Zhilong Huoxue Tongyu capsule improves myocardial ischemia/reperfusion injury via the PI3K/AKT/Nrf2 axis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302650","date":1714485600000,"content":"<p>by Xiaoping Zhao, Fang Yang, Hao Wu, Zhongcai Fan, Gang Wei, Yuan Zou, Jinyi Xue, Mengnan Liu, Gong Chen</p>\r\nIntroduction <p>Zhilong Huoxue Tongyu Capsule (ZL) is a Chinese medicine used for the treatment of cardio-cerebral diseases. However, the pharmacological mechanisms underlying its regulation of myocardial ischemia/reperfusion injury (MI/RI) remain unclear.</p> Purpose <p>This study aims to investigate the effects and mechanisms of ZL on MI/RI in mice.</p> Materials and methods <p>C57BL/6J mice were randomly assigned to four groups: Sham group, I/R group, ZL group, and ZLY group. The MI/RI mouse model was established by ligation of the left anterior descending coronary artery for 30 minutes, followed by reperfusion for 120 minutes to restore blood perfusion. Cardiac function was evaluated using cardiac ultrasound. Histopathological changes and myocardial infarction area were assessed using Hematoxylin and eosin (H&amp;E) staining and triphenyltetrazolium chloride (TTC) staining. The changes in oxidative stress- and ferroptosis-related markers were detected. RT-qPCR, Western blot, and ELISA were conducted to further explore the mechanism of ZL in improving MI/RI.</p> Results <p>Our findings demonstrated that ZL exerted a protective effect against MI/RI by inhibiting ferroptosis, evidenced by the upregulation of antioxidant enzymes such as GSH and GPX4, coupled with the downregulation of ACSL4, a pro-ferroptosis factor. Furthermore, ZL positively impacted the PI3K/AKT/Nrf2 pathway by promoting ATPase activities and enhancing the relative protein expression of its components. Notably, the administration of a PI3K/AKT inhibitor reversed the antioxidant and anti-ferroptosis effects of ZL to some extent, suggesting a potential role for this pathway in mediating ZL’s protective effects.</p> Conclusions <p>ZL protects against MI/RI-induced ferroptosis by modulating the PI3K/AKT signaling pathway, leading to increased Nrf2 expression and activation of the HO-1/GPX4 pathway. These findings shed light on the potential therapeutic mechanisms of ZL in the context of cardiovascular diseases.</p>","author":"Xiaoping Zhao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f654d33b91fc87e2519e7fb6b4682244161671ae521b5fa8c921358fa376aa90","category":"Interdisciplinary"}