{"title":"Instagram and Facebook Messenger Chats to Disconnect This Month","link":"https://www.macrumors.com/2023/12/05/instagram-messenger-chats-disconnecting/","date":1701770231000,"content":"Meta has revealed plans to end Instagram users' ability to chat with Facebook accounts later this month, rolling back a feature that it introduced over three years ago.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/instagram-messenger.jpg\" width=\"3440\" height=\"1680\" />\r<br />\nIn <a href=\"https://www.macrumors.com/2020/09/30/facebook-unifies-messenger-and-instagram/\">September 2020</a>, Meta (then Facebook) announced it was merging its Facebook Messenger service with Instagram direct messaging, allowing Instagram users to chat with Facebook users and vice versa using the same platform.\r<br />\n\r<br />\nThe move was supposed to be part of a long-term plan to merge Messenger, Instagram, and WhatsApp chat platforms into one underlying messaging infrastructure. The idea behind the plan was said to be to keep people within the Facebook ecosystem, and off of rival texting apps like Apple's iMessage.\r<br />\n\r<br />\nHowever, according to an <a href=\"https://help.instagram.com/654906392080948\">updated Instagram support page</a>, beginning in mid-December the following cross-app communication features will no longer be available to Instagram users:\r<br />\n<blockquote><ul><li>You won't be able to start new conversations or calls with Facebook accounts from Instagram.</li>\r<br />\n<li>Any existing chats on Instagram that you've had with Facebook accounts will become read-only, even if these Facebook accounts are removed from the chat. This means that you and others with Instagram accounts can't send new messages in these chats.</li>\r<br />\n<li>Facebook accounts won't be able to view your Activity Status or whether you've seen a message.</li>\r<br />\n<li>Any existing chats you've had with Facebook accounts won't move to your inbox on Facebook or Messenger.</li></ul></blockquote>When cross-app chat ends, Instagram users will need to start a new chat on Messenger or Facebook from their Facebook account to continue conversations with Facebook accounts.\r<br />\n\r<br />\nMeta offered no reason for the change, but <em><a href=\"https://9to5google.com/2023/12/04/instagram-facebook-messenger-chats-disconnected/\">9to5Google</a></em> speculates that it could be part of a larger effort to comply with Europe's Digital Markets Act (DMA). The theory is that Meta could be preparing to introduce wider interoperability between Instagram, Messenger, and WhatsApp, which would fulfill a key requirement of the DMA. Either that or it is simply scaling back Messenger once again – the company recently removed SMS/MMS support on Android and has shut down Messenger Lite.<div>Tags: <a href=\"https://www.macrumors.com/guide/facebook-messenger/\">Facebook Messenger</a>, <a href=\"https://www.macrumors.com/guide/instagram/\">Instagram</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/05/instagram-messenger-chats-disconnecting/\">Instagram and Facebook Messenger Chats to Disconnect This Month</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/instagram-and-facebook-messenger-chats-to-disconnect-this-month.2412848/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f65be2c639dadee8046622d62ac43bebe331098bf69a4930971792d8639c4af3","category":"Apple"}