{"title":"Controlled experiments fail to capture plant phenological response to chilling temperature","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13888?af=R","date":1719576864000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Controlled experiments are increasingly important for investigating how and to what degree plant phenology responds to global climate change. Current experiments underline that chilling and forcing temperatures are two major environmental cues shaping the budburst date of temperate species, but whether experiments could reflect the observed responses to chilling has rarely been examined.</p>\n<h2>Location</h2>\n<p>Europe and North America.</p>\n<h2>Time periods</h2>\n<p>1951–2021.</p>\n<h2>Major taxa studied</h2>\n<p>Temperate trees and shrubs.</p>\n<h2>Methods</h2>\n<p>Using an experimental database of budburst dates for 50 species derived from previous literature and observational data of the same species at 12,579 stations in Europe and 1469 stations in the USA, we compared the response of forcing requirement (FR) of the budburst date to chilling accumulation (CA) between observations and experiments using a common measure of FR and CA.</p>\n<h2>Results</h2>\n<p>The median, variance and probability distribution of CA-FR curves differed significantly between experiments and observations in most cases. The distinction in chilling effects between experiments and observations could be attributed to the difference in thermal space, heat stress, genetic variation among provenances, different forcing treatments adopted and plant materials used in the experiments.</p>\n<h2>Main conclusions</h2>\n<p>Our results suggest that the uncertainty of phenological models based solely on the experimental data needs to be re-evaluated when predicting future spring phenological responses across broad spatial scales.</p>","author":"Huanjiong Wang, \nShaozhi Lin, \nJunhu Dai, \nQuansheng Ge","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"f65c20d58b6b2121662f6b1c8ac7846791be21b0dc18d6f426941ed50b34ec18","category":"Environment"}