{"title":"‘I could never have imagined this’ - Felix Gall deserves the spotlight","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/i-could-never-have-imagined-this-felix-gall-deserves-the-spotlight","date":1689790979000,"content":"\n      <p><span>Jonas Vingegaard and Tadej Pogačar’s rivalry has often stolen the limelight so far in this year’s <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, and stage 18 was no exception. As the Jumbo-Visma rider stormed up the Col de la Loze and dealt one final definitive blow to Pogačar who crawled ruefully up the mountain behind, Twitter was ablaze with the news. It was what the commentators were talking about as the key, definitive moment of the stage. But, while all of that was going on, Felix Gall, in his first ever Tour de France, was putting in the performance of his life up the road ahead. Just like when Wout Poels took victory on stage 15 in Les Gets, Gall’s victory today almost felt secondary to the overarching narrative about Vingegaard and Pogačar which has shaped this race so far. It’s understandable that the fight for the yellow jersey is one of the main talking points each day in the Tour, but Gall’s ride deserves accolades alongside that.</span></p>\n<div></div>\n<p><span>AG2R Citroën executed an almost perfect stage today from the breakaway. With three riders present when the 30-rider strong group eventually established itself after a brutal fight in the opening kilometres of the stage, the French squad were active and present consistently throughout the day, contributing hugely to the workload to ensure that they had enough leeway to be safe from a blazing yellow jersey group behind. As they approached the foot of the revered Col de la Loze, it was Ben O’Connor putting big turns in on the front of the break, setting the stage perfectly for what was to come from Gall. When the Aussie rider pulled off the front after his final effort, he almost came to a complete standstill on the steep slopes, likely not even noticing the fan that ran alongside him offering a slice of pizza.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg17_gall02_2023_1024x1024.jpg?v=1689790881\" alt=\"Felix Gall stage 17 Tour de France\" /></div>\n<p><span></span><em><span>Image: James Startt</span></em></p>\n<p><span>From then, it was up to Gall to finish the job. The Austrian rider launched his blow with just over six kilometres to the summit of the Loze, kicking on ahead of his rivals early on in the climb, something that was a surprise to many. For Simon Yates and Chris Harper behind, both of Jayco-Alula, there was no panic or immediate response to Gall – they kept a steady and calm rhythm. At this point, with the experience of Yates, there were questions about whether Gall had gone too early. It seemed even Yates himself underestimated the strength and endurance of the AG2R Citroën rider, though, as he slowly disappeared through the crowds and up the mountain ahead.</span></p>\n<p><span>Gall’s body moved from side to side as he methodically made his way towards the summit, his mouth sometimes fell open with the effort but his legs seemed to keep doing what was asked of them. He could never relax, for Yates was hovering around 20 seconds behind, coming into his own on the steepest gradients, looking as if he was dancing over the pedals. Vingegaard was picking off riders further down the road too, a menacing blur of yellow also threatening to ruin the dreams of the men from the breakaway.</span></p>\n<p><span>The grimace on Gall’s face grew as the gap to Yates teetered dangerously in the balance, his necklace moving with the ebb and flow of his body as he hauled himself over the eye-watering gradients. But the summit was not the finish line, and for Gall especially, the descent could be just as much of a challenge as the uphill. </span></p>\n<p><span>At the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-suisse-all-the-essential-info\">Tour de Suisse</a> earlier this year, Gall struggled in the queen stage of the on the tricky descents, losing a few bike lengths to the general classification group and conceding the overall race lead. It would not be the same story today for the 25-year-old, who had a Tour stage win so close he could almost touch it.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230719TDF0083-A.S.O._Pauline_Ballet_1024x1024.jpg?v=1689792175\" alt=\"Felix Gall stage 17 Tour de France\" /></div>\n<p><span></span><em><span>Image: Pauline Ballet/ASO</span></em></p>\n<p><span>Once he had successfully navigated the precarious downhill twists and turns, Gall faced one final kick up towards the finish line. The effort was etched on his face as he grinded towards the chequered flag, the last cruel, steep ramps drawing every ounce of energy from the brave rider. In the end, he was able to finish alone, digging deep to hold off Yates and emerging in the sunlight to punch the air with joy. It was a fairytale finish for AG2R Citroën and Gall on one of the toughest days in this Tour de France so far. The Austrian rider announced himself as one of the best bike racers in the world, worthy of his own story, one which undoubtedly has many chapters still to be written.</span></p>\n<p><span>“It’s incredible. I don’t know what to say,” Gall explained emotionally in his post-race interview. “I was just so afraid that I would be caught in the last descent. One year ago I could never have imagined to be in this position now. I didn't have much confidence before joining this team. They saw something in me which I didn't any more, and that gave me confidence again. It's not that you gain confidence overnight, it's a slow process. I think it has been a successful process the last one-and-a-half years, and that's why I'm also really grateful.\"</span></p>\n<p><span>Mid-way through speaking, Gall was interrupted by O’Connor, who had worked tirelessly throughout the day to set things up for Gall to attack. “Enjoy it, you’re a champion,” O’Connor said after the pair hugged happily, and the Australian rider’s words echo true. Vingegaard versus Pogačar might be one story of today, but Gall’s ride was of epic proportions too. A champion, indeed.</span></p>\n<p><em><span>Cover image: James Startt</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f66198966957a6b762492fb129d7fa9b53110f3b01213cc857a33ec2df75b4b9","category":"Cycling"}