{"title":"Interscapular Pain after Anterior Cervical Discectomy and Fusion: Does Zygapophyseal Joints over Distraction Play a Role?","link":"https://www.preprints.org/manuscript/202403.1383/v1","date":1711109372000,"content":"Introduction: Anterior cervical discectomy and fusion (ACDF) for cervical disc herniation (CDH) is commonly performed. Specific postoperative complications include dysphagia, dysphonia, cervicalgia, adjacent segment disorder, cage subsidence, and infections. However, interscapular pain is commonly reported by these patients after surgery, although its mechanisms have been not clarified yet. Methods: This retrospective series of 31 patients undergoing ACDF for CDH at a single Academic Hospital. Baseline and postoperative clinical, radiological, and surgical data were analyzed.  The linear regression analysis was conducted to identify any factor independently influencing the occurrence rate of postoperative interscapular pain. Results: The mean age was 57.6±10.8 years, and the M:F ratio was 2.1. The preoperative mean VAS-arm was 7.15±0.81 among the 20 patients reporting brachialgia, and the mean VAS-neck was 4.36±1.43 among those 9 patients reporting cervicalgia. At 1 month interscapular pain was still reported by 8 out of the 17 patients who experienced it postoperatively, and it was recovered in all patients after 2 months. The regression analysis showed how the interscapular pain was not directly associated to age(p=0,74), gender(p=0,46), smoking status(p=0,44), diabetes(0,42), preoperative brachialgia(p=0,21) or cervicalgia(p=0,48), symptoms duration(p=0,13), baseline VAS-arm(p=0,11), VAS-neck(p=0,93), or mJOA(p=0,63) scores, or disc height modification(p=0,90). However, the postoperative increase of the mean zygapophyseal joint rims distance was identified as an independent factor in determining interscapular pain (p=0,02). Conclusions: Our study revealed that the onset of interscapular pain following ACDF may be determined by over-distraction of the zygapophyseal joints rim. Then, proper sizing of prosthetic implants could reduce this painful complication.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f666cd3708c3834d32af11a68eead340bdd1fee542060ee63946afb58edc993c","category":"Interdisciplinary"}