{"title":"watchOS 8 brings new health and messaging features to the Apple Watch this year","link":"https://arstechnica.com/?p=1770191","date":1623090273000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/Apple-watchOS-8-announced-ars-technica-4-800x265.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/Apple-watchOS-8-announced-ars-technica-4.png\">Enlarge</a> <span>/</span> watchOS 8 introduces a new Portraits watch face, the Mindfulness app, support for ID and key cards in Wallet, a new HomeKit dashboard, and an improved Photos app. (credit: Apple)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>On Monday, Apple detailed its plans for watchOS 8, the next major software update for the Apple Watch. The operating system will introduce improved texting and photo sharing, new HomeKit integrations, and some smaller updates to health and fitness features.</p>\n<p>The Apple Watch's Breathe app has been replaced by Mindfulness, which incorporates Breathe and Reflect activities. Breathing gets new animations while Reflect sends mindfulness prompts like, \"bring to mind a relationship you cherish and think about it,\" and an accompanying calming animation you can focus on as you reflect. There will also be a few new pointers in the app to help you focus and relax. You'll be able to set if or when you get such prompts throughout the day.</p>\n<p>In Fitness, Apple is adding two new workouts: Tai Chi and Pilates. Apple Fitness+ gets another set of workouts focused on HIIT (high-intensity interval training); the service will also include Artist Spotlights, which suggests music to play during your workouts. watchOS8 will also provide respiratory-rate tracking for sleep, but not for workouts.</p></div><p><a href=\"https://arstechnica.com/?p=1770191#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1770191&amp;comments=1\">Comments</a></p>","author":"Corey Gaskin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f66cf04c2ac474a9b77a8f767c78aab32d7d5eacca013488aa2dffcab84db05f","category":"Tech"}