{"title":"Conspiracy theorist said death threats were “jokes”—but jury didn’t buy it","link":"https://arstechnica.com/?p=1761220","date":1619716417000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/Brendan-Hunt-YouTube-video-800x564.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/Brendan-Hunt-YouTube-video.png\">Enlarge</a> <span>/</span> Brendan Hunt frequently posted videos about conspiracy theories to sites including YouTube and BitChute. (credit: <a href=\"https://www.youtube.com/watch?v=x9I_LEi3Tcc&amp;t=111s\">Brendan Hunt/YouTube</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Over the past 20 years, Brendan Hunt increasingly bought into conspiracy theories. But unlike many others like him, he wasn’t just falling down the rabbit hole—he was the one digging it. In posts made to YouTube and other platforms, Hunt voiced support for a number of conspiracy theories. His journey began in the wake of 9/11 and reached its nadir two days after the attack on the US Capitol, when he posted a video titled “Kill Your Senators.”</p>\n<p>Hunt was arrested shortly after posting the video, which was just the latest in a series of pointed threats against public officials that previously included a call for the “public execution” of Democratic leaders, including House Speaker Nancy Pelosi (D-Calif.), Senate Majority Leader Chuck Schumer (D-N.Y.), and Rep. Alexandria Ocasio-Cortez (D-N.Y.). Yesterday, a jury found him guilty on one count of threatening to assault or murder US officials. Hunt and his defense claimed his threats were just jokes made in poor taste, but the jury didn't buy it. He had dug himself in too deep.</p>\n<p>Hunt has contributed to the furor around far-right conspiracy theories, including those about the 9/11 terrorist attacks, the Sandy Hook Elementary School massacre, the Boston Marathon bombing, and, most recently, the “Stop the Steal” movement. The latter was a conspiracy theory that <a href=\"https://arstechnica.com/tech-policy/2021/04/it-took-facebook-two-months-to-realize-stop-the-steal-might-turn-violent/\">gained steam on Facebook</a> in the wake of the 2020 presidential election.</p></div><p><a href=\"https://arstechnica.com/?p=1761220#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1761220&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f671fcd80c1d6f44758ff696aec2aabbffc2275ba2198d208c4f3c8b8b890b06","category":"Tech"}