{"title":"An open letter to Patrick Moster from Team Africa Rising","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/an-open-letter-to-patrick-moster-from-team-africa-rising","date":1627664153000,"content":"\n      <p><strong>An Open Letter to Patrick Moster</strong></p>\n<p>To understand humanity and the effect our words and actions have on one another, we must take the time to understand our place in society in relation to others who may not look like us or follow the same religious tradition or come from a similar country.</p>\n<p>As the Development Director for Team Africa Rising, I, along with another colleague, were behind the social media Twitter storm the past two days. Yes, we are still calling for your resignation. And yes, we still believe the German Cycling Federation and the UCI need to take a stronger stance regarding your racist outburst and your conditional apology.<span>  </span>However, I do believe, you, the cycling world and frankly, most of us, can learn something from this event and learn some valuable lessons.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/mosters-comments-are-part-of-a-wider-problem-in-the-sport\">Related – Opinion: Patrick Moster's comments are part of a wider problem in the sport</a></strong></em></p>\n<p>You dehumanised two men who were not like you, who come from a different part of the world.<span>  </span>I lived eight years in Rwanda living and working with the young men and women of Team Rwanda Cycling. Living in Rwanda makes one acutely aware of the consequences of racist language. I am a middle-aged white woman from Las Vegas. I made mistakes. I said things that I would reconsider or take back, but during those years I learned about my privileged place in this world and how much the world is unequal. I lived in a country undone by the words of one group dehumanising another over decades leading to one of the most devasting loss of lives – the 1994 Rwandan Genocide – the world had ever witnessed.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1234322409_1024x1024.jpg?v=1627663101\" /></p>\n\n<p><em>Azzedine Lagab Photo: Ina Fassbender/ Getty Images</em></p>\n<p>Words matter. Your words mattered. What you do next matters.</p>\n<p>Azzedine Lagab, the double Olympic cyclist from Algeria is a son, a husband, and a father of two young girls. He is one of the most consistent cyclists on the continent. Lagab is a role model to all the young cyclists of his country. Did you know, he’s responsible for making sure the next generation of cyclists have better opportunities than he had growing up in the sport? He is a man of deep religious conviction, one of the few riders in the peloton willing to sacrifice getting ahead in the sport if it means not adhering to his beliefs. We could all learn to be better people by watching and knowing someone like Azzedine Lagab.</p>\n<p>Amanuel Ghebreigzabhier, who rides for Trek-Segafredo, is a sweet, shy young man with a megawatt smile. I spent a few days riding with him in my car at the Tour of Rwanda, years ago when he was 19, after he had to dropped out due to illness. He was crushed. He gave so much of himself to stay in the Tour to the detriment of his own health. He is a hero in Eritrea. Did you know cycling is the national sport of Eritrea? Did you know they race every weekend around the streets of Asmara? Do you know how difficult it is to travel, to be on an international team, to get visas, for an Eritrean?</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1320830967_1024x1024.jpg?v=1627663278\" /></p>\n\n<p><em>Amanuel Ghebreigzabhier. Photo: Sara Cavallini/Getty Images</em></p>\n<p>In one split second you reduced these two incredibly talented cyclists and upstanding young men to a nasty stereotype. You dehumanised them. Your German cyclist, Nikias Arndt, saw this, your country saw this, and you owe all of them an unconditional apology. But let’s first start with Azzedine and Amanuel. Apologise to them personally. You owe them that. Secondly, step down, voluntarily, it is the right thing to do. Tell people why, learn from it, teach others, and return a better person and a more upstanding coach. Be a role model. You have the ability to turn this horrible event into something positive.</p>\n<p>It is that important in changing the narrative of racism in the sport of cycling.</p>\n<p><em>Kimberly Coats</em></p>\n<p><em>Director of Development</em></p>\n<p><em>teamrwandacycling@gmail.com</em></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f6837e242d055bf9fb7c3167f069fec1fc9b6608465133d2f3ad948290d99cd3","category":"Cycling"}