{"title":"Correlation between the Morphological Profile of Patients and Temporomandibular Disorders: Analysis of Data Derived from Low-Dose C.B.C.T","link":"https://www.preprints.org/manuscript/202407.1283/v1","date":1721117780000,"content":"Abstract\nBackground: Temporomandibular disorders (TMD) are a range of clinical problems related to the temporomandibular joint (TMJ), chewing muscles, and surrounding facial structures. Functional magnetic resonance studies suggest that these disorders affect over 5% of the population. The relationship between dental occlusion and TMD has been a topic of debate in dentistry; some researchers suggest using lateral cephalograms and cephalometric data to identify which morphological profiles and types of malocclusion are most likely to cause TMD. The aim of this study is to identify the morphological profiles and associated skeletal malocclusions that have the greatest influence on the development of TMD. This will be accomplished through the analysis of cephalometric data obtained from cephalograms and condylar section images of patients from the Orthognathodontics Department of Chieti, who underwent low-dose cbct during their initial visit.\nMatherial and methods: This study, conducted at the Orthognathodontics Department of Gabriele D’Annunzio University in Chieti, examined a group of 67 patients (both males and females) presenting with signs of temporomandibular joint disorders (TMD). The inclusion criteria for the study were first-time TMD diagnosis, age 18 and above, and accessible medical records, wide field of view cone beam low dosage, and photographs. Patients with a history of tumor, trauma, surgical interventions in the jaw and facial area, fractures, and other craniofacial anomalies were excluded from the study. The aim of the study is to further understand the morphological profiles and associated skeletal malocclusions that contribute to TMD. \nResults: male patients: sagittal profile: 56% exhibited a skeletal Class II profile due to mandibular retrognathia. Vertical Profile: 73% were brachyfacial with a hypodivergent pattern. Dental Relationships: Increased overjet and a tendency towards deep bite were observed. 23% exhibited deep bite, 20% were normodivergent, and 8% were dolichofacial. The soft tissue profile tended towards flatness. Condyle Position: in Class II hypodivergent males, the condyle was non-concentric and positioned more posteriorly. In mesiodivergent males, the condyle was concentric, while in hyperdivergent males, it was slightly anterior. Female Patients: Sagittal Profile: 79% had a skeletal Class II profile with mandibular retrognathia. Vertical Profile: 47% were hypodivergent with reduced anterior facial height (105°). Dental Relationships: 17% exhibited deep bite, and 48% of those with a Class II profile had increased overjet. 43% were mesofacial, and 10% were dolichofacial. Condyle Position: In Class II hypodivergent and normodivergent females, the condyle was non-concentric and positioned more posteriorly. In hyperdivergent females, the condyle was positioned more anteriorly and higher in the fossa.\nConclusion: The study highlighted significant differences in cephalometric parameters and condyle positions between male and female patients with TMD. A posteriorly positioned condyle was associated with a flattened condylar head, particularly in Class II hypodivergent profiles. These findings underscore the importance of individualized diagnostic and treatment approaches based on detailed cephalometric and condylar assessments. Further research is needed to explore the implications of these variations for TMD management and outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f686045567fbec8e713b8569e9c31f089ce648af9952b5788ce0248aa89db080","category":"Interdisciplinary"}