{"title":"Activation of BDNF-TrkB Signaling in Specific Structures of the Sheep Brain by Kynurenic Acid","link":"https://www.preprints.org/manuscript/202410.1272/v1","date":1729066825000,"content":"Fluctuations in kynurenic acid (KYNA) and brain-derived neurotrophic factor (BDNF) levels in the brain reflect its neurological status. The aim of the study was to investigate the effect of transiently elevated KYNA concentration in the cerebroventricular circulation on the expression of BDNF and its high-affinity tropomyosin-related kinase receptor B (TrkB) in specific structures of the sheep brain. Intracerebroventricularly cannulated anestrous sheep were subjected to a series of four 30-min infusions of KYNA: 4×5 μg/60 μL/30 min (KYNA20, n=6) and 4×25 μg/60 μL/30 min (KYNA100, n=6) or a control infusion (n=6), at 30-min intervals. Sections of the hippocampal CA3 field, amygdala (AMG), prefrontal cortex (PCx), and the hypothalamic medial-basal (MBH) and preoptic (POA) areas were dissected from the brain immediately after the experiment. The highest concentration of BDNF protein was found in the CA3 field (P&amp;lt;0.01), which was 8-fold higher than in the AMG and 12-fold higher than that in the PCx (MBH and POA were not analyzed). The most pronounced BDNF mRNA expression was observed in the MBH followed by the PCx, POA, AMG and CA3, while the highest abundance of TrkB mRNA was recorded in the AMG followed by the MBH, PCx, CA3 and POA. KYNA increased (P&amp;lt;0.05-P&amp;lt;0.01) BDNF protein levels and the expression of its gene in the brain structures examined, with the effect varying by dose and brain region. KYNA, particularly at the KYNA100 dose, also increased (P&amp;lt;0.01) TrkB gene expression, except for the AMG, where the lower KYNA20 dose was more effective (P&amp;lt;0.01). These findings suggest a positive relationships between KYNA levels in the cerebroventricular circulation and BDNF-TrkB expression in specific brain regions in a sheep model. This indicates that a transient increase in CSF KYNA concentration can potentially restore BDNF production, whose deficiency underlies numerous neurological disorders..","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f68d8040e41df6d8d71c513d063d8bda0de3bd4ef17ca24c987d862a7175a619","category":"Interdisciplinary"}