{"title":"Amazon’s Fire TV Is Adding Full-Screen Video Ads That Play When You Start Your Fire TV","link":"https://cordcuttersnews.com/amazons-fire-tv-is-adding-full-screen-video-ads-that-play-when-you-start-your-fire-tv/","date":1701477235000,"content":"\n<p>Luke Bouma, writing for Cord Cutters:</p>\n\n<blockquote>\n  <p>Today, Cord Cutters News has confirmed that Amazon is adding \nfull-screen video ads that will play when you start your Fire TV \nunless you quickly perform an action on it. </p>\n\n<p>This new update will be rolling out to all Fire TVs made in 2016 \nor newer. With this update, the ad at the top of your Fire TV will \nnow start playing full-screen, often promoting a movie or TV show. \nBy hitting the home button, you can quickly exit the ad or if you \nquickly perform an action on the Fire TV once it finishes, you \nwill avoid the video ad, but you only have a few seconds. </p>\n\n<p>“Our focus is on delivering an immersive experience so customers \ncan enjoy their favorite TV shows and movies, as well as browse \nand discover more content they’ll want to watch. We’re always \nworking to make the Fire TV experience better for customers and \nhave updated one of the prominent placements in the UI to play a \nshort content preview if no other action is taken by a customer \nupon turning on their Fire TV.” Amazon said in a statement to Cord \nCutters News. </p>\n</blockquote>\n\n<p>What a load of horseshit from Amazon in that statement. Autoplaying ads aren’t “immersive”. And this is in no way “working to make the Fire TV experience better for customers”. Working to make things better would mean getting rid of shit like this, not adding it.</p>\n\n<p>I really don’t understand how anyone uses anything but an Apple TV box. Apple TV is far from perfect but holy hell, it really does start from the perspective of respecting you, the user. The people at Apple who make it are obviously trying to create the experience that they themselves want when they’re watching TV at home.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/12/01/fire-tv-startup-ads\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"f691a84c89d48514da55e8ceee79ea32ce556de44eb4941859259d8bf6754c64","category":"Tech"}