{"title":"Sediment dynamics shape macrofauna mobility traits and abundance on tidal flats","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12669?af=R","date":1725847977000,"content":"<h2>Abstract</h2>\n<p>Tidal flats are valuable ecosystems that depend on complex biogeomorphic processes between organisms and sediment transport. Climate change has led to a rise in extreme weather events, such as storms. This, in turn, has increased sediment dynamics and created risks for the benthic communities inhabiting tidal flats. However, replicating sediment disturbances caused by extreme weather is difficult. To overcome this, we used the plow rake to enhance the natural tidal currents and wave conditions to simulate intensified sediment dynamics. The raking disturbance was repeated on two intertidal zones with different inundation frequencies and wind fetch levels to simulate the increasing frequency of storm impact on sediments due to climate change. We compared the measurements of sediment dynamics and macrofauna between plots that were raked and the control plots that were only influenced by natural hydrodynamics. Results showed that tidal flat sediments experienced erosion by 10–20 mm after six times biweekly raking treatments, depending on the site-specific hydrodynamic conditions. Sediment dynamics served as a helpful tool for monitoring the species distribution regarding mobility traits: the high dynamic exposed sites were inhabited by mobile species, while the low dynamic sheltered sites were characterized by less-mobile species. Moreover, the raking treatment decreased the abundance of species with immobile traits, yet the species composition did not experience significant change. Overall, the present findings indicate that tidal flats with low sediment dynamics and immobile macrofauna are at higher risk of declining abundance under intensified sediment disturbances than areas with high sediment dynamics and mobile macrofauna.</p>","author":"Zhengquan Zhou, \nTim J. Grandjean, \nJaco de Smit, \nJim van Belzen, \nGregory S. Fivash, \nBrenda Walles, \nOlivier Beauchard, \nJeroen van Dalen, \nDaniel B. Blok, \nLennart van IJzerloo, \nTom Ysebaert, \nTjeerd J. Bouma","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"f6926e2933bc3bdf1d136556defdddf5e57fa9320c3ebc173031bba46a51fac3","category":"Environment"}