{"title":"Air‐based polyethylene fragmentation with high yield to form microplastic particles as reference material candidates","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202200121?af=R","date":1707196547000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/89254e97-0158-4073-a0a4-40769cd006f5/appl202200121-gra-0001-m.png\" alt=\"Air-based polyethylene fragmentation with high yield to form microplastic particles as reference material candidates\" /><p>New method for producing aged microplastics in high yield that can be used to produce reference materials for validation. An example of aging and fragmentation of high-density polyethylene is also presented with additional physical and chemical characterization of shape, size, aging state by carbonyl index, and density.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Microplastic (MP) particles with sizes between 1 and 1000 µm are widely distributed worldwide. Origin, transport pathways, and fate are poorly known, as sampling, sample preparation, and detection methods are major challenges. In addition, reference materials that mimic environmental particles are lacking. The most challenging is the yield of MP particle production and the need for resource-intensive grinding with liquid nitrogen. In this paper, a machine is designed to produce aged microplastic particles as reference material candidates with high yield. The machine is based on ultraviolet aging of a thin foil and mechanical fragmentation using clean air. An example of aging and fragmentation of high-density polyethylene with additional physical and chemical characterization of shape, size, aging state by carbonyl index, and density is presented.</p>","author":"Marco Schmitt, \nKorinna Altmann, \nPetra Fengler, \nMichael Gehde","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"f6950d1a416a1fa7de55ef750f19276739fa42edfd5a546987726b491a3360ef","category":"Environment"}