{"title":"Three-Dimensional Singular Stress Fields and Interfacial Crack Path Instability in Bicrystalline Superlattices of Orthorhombic/Tetragonal Symmetries","link":"https://www.preprints.org/manuscript/202403.1319/v1","date":1711091982000,"content":"First, a recently developed eigenfunction expansion technique, based in part on separation of the thickness-variable and partly utilizing a modified Frobenius type series expansion technique in conjunction with the Eshelby-Stroh formalism, is employed to derive three-dimensional singular stress fields in the vicinity of the front of an interfacial crack weakening an infinite bicrystalline superlattice plate, made of orthorhombic  (cubic, hexagonal and tetragonal serving as special cases) phases, of finite thickness and subjected to the far-field extension/bending, in-plane shear/twisting and anti-plane shear loadings, distributed through the thickness. Crack-face boundary and interface contact conditions as well as those that are prescribed on the top and bottom surfaces of the bicrystalline superlattice plate are exactly satisfied. \n\tIt also extends a recently developed concept of lattice crack deflection (LCD) barrier to a superlattice, christened  superlattice crack deflection (SCD) energy barrier for studying interfacial crack path instability, which can explain crack deflection from a difficult interface to an easier neighboring cleavage system. Additionally, the relationships of the nature (easy/easy, easy/difficult or difficult/difficult) interfacial cleavage systems based on the present solutions with the structural chemistry aspects of the component phases (such as orthorhombic, tetragonal, hexagonal as well as FCC (face centered cubic) transition metals and perovskites) of the superlattice are also investigated. Finally, results pertaining to the through-thickness variations of mode I/II/III stress intensity factors and energy release rates for symmetric hyperbolic sine distributed load and their skew-symmetric counterparts that also satisfy the boundary conditions on the top and bottom surfaces of the bicrystalline superlattice plate under investigation, also form an important part of the present investigation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f6a14b508a632bac7a6146a8197acd6b10751938447dd8d26665b782e4e2c34e","category":"Interdisciplinary"}