{"title":"Dictyophora indusiata polysaccharide attenuated LPS‐induced intestinal inflammation of mice via the TLR4/JNK signaling pathway","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13888?af=R","date":1726223113000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p><i>Dictyophora indusiata</i> polysaccharide is an important bioactive component of <i>D. indusiata</i>, playing an important role in alleviating inflammation. The present study aimed to investigate the anti-inflammatory effect and mechanism of <i>D. indusiata</i> polysaccharide on lipopolysaccharide (LPS)-induced intestinal inflammation in mice.</p>\n<h2>RESULTS</h2>\n<p>Our results indicated that <i>D. indusiata</i> polysaccharide ameliorated intestinal inflammation of mice by increasing the body weight, the number of goblet cells and decreasing inflammatory cell infiltration. In addition, <i>D. indusiata</i> polysaccharide significantly up-regulated expression of <i>ZO-1</i>, <i>Occuldin</i> mRNA, which were 2.55-fold and 2.28-fold higher than the LPS group, respectively. In particular, <i>D. indusiata</i> polysaccharide effectively inhibited the Toll-like receptor 4 (TLR4)/ c-Jun NH2-terminal kinase (JNK) signalling pathway which was 0.34-fold and 0.49-fold of gene expression and 0.41-fold and 0.39-fold of protein expression in the LPS group, respectively.</p>\n<h2>CONCLUSION</h2>\n<p>The results of the present study suggested that <i>D. indusiata</i> polysaccharide exerted anti-inflammatory and intestinal protective effects by inhibiting the TLR4/JNK signaling pathway, which will provide a basis for the potential value of <i>D. indusiata</i> polysaccharide as prebiotics in food applications. © 2024 Society of Chemical Industry.</p>","author":"Zihao Zhang, \nZhikun Zeng, \nLin Wang, \nBin Xiong, \nBaodong Zheng, \nYi Zhang, \nLei Pan","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"f6a8859ade3bf53449c6946a15438c60c0998b0fc7ca187627f554eb90d78563","category":"Environment"}