{"title":"How self-states help: Observing the embodiment of self-states through nonverbal behavior","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300682","date":1711720800000,"content":"<p>by Isabelle Engel, Maja Dshemuchadse, Caroline Surrey, Leander Roos, Philipp Kanske, Stefan Scherbaum</p>\r\n\r\nThe concept of self-states is a recurring theme in various psychotherapeutic and counseling methodologies. However, the predominantly unconscious nature of these self-states presents two challenges. Firstly, it renders the process of working with them susceptible to biases and therapeutic suggestions. Secondly, there is skepticism regarding the observability and differentiation of self-states beyond subjective experiences. In this study, we demonstrate the feasibility of eliciting self-states from clients and objectively distinguishing these evoked self-states through the lens of neutral observers. The self-state constellation method, utilized as an embodied approach, facilitated the activation of diverse self-states. External observers then assessed the nonverbal manifestations of affect along three primary dimensions: emotional valence, arousal, and dominance. Our findings indicate that external observers could reliably discern and differentiate individual self-states based on the bodily displayed valence and dominance. However, the ability to distinguish states based on displayed arousal was not evident. Importantly, this distinctiveness of various self-states was not limited to specific individuals but extended across the entire recording sample. Therefore, within the framework of the self-state constellation method, it is evident that individual self-states can be intentionally evoked, and these states can be objectively differentiated beyond the subjective experiences of the client.","author":"Isabelle Engel","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f6c973fb7ebb5c89c61aa080e550b54e5d9bf8378a2aa56a4b8633b5e0e0e515","category":"Interdisciplinary"}