{"title":"Laser‐assisted graphene‐like materials for oil‐spill clean up","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300114?af=R","date":1713852833000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/e5475af0-1388-4586-96c3-988251208af4/appl202300114-gra-0001-m.png\" alt=\"Laser-assisted graphene-like materials for oil-spill clean up\" /><p>Conversion of grape molasses and polyimide foil/tape into a laser-assisted graphene-like product. Diesel and crude oil adsorption capacity of the graphene-like material is 33–56 g/g depending on oil and precursor type.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Conventional synthetic sorbents for oil spill cleanup are the most widely employed materials, although a major drawback is the extensive chemical modification that they have undergone, making them economically and environmentally nonsustainable. The use of inexpensive, abundant, nontoxic, biodegradable, and reusable lignocellulosic materials might be an alternative to conventional sorbents, with obvious positive impact on sustainability and circular economy. The present study subsequently utilizes the well-established process, of converting grape molasses—a byproduct of the winemaking industry that represents a typical and abundant source of biomass—into a laser-assisted graphene-like product (LA-B). Comparative experiments were carried out with two additional materials that are similarly produced by the same laser-assisted method, yet use synthetic polyimide foil and tape polymers as precursors, namely LA-F and LA-T. The results showed that diesel oil adsorption capacity of LA-B was 33.5 g/g, while the ultraoleophilic LA-T adsorbed 57 g/g and LA-F adsorbed 41 g/g. Furthermore, the crude oil uptake was 31.1, 56.0, and 38.6 g/g for LA-B, LA-T, and LA-F, respectively. The adsorption of oil on the used materials could be well-described by pseudo-second-order kinetics, showing that over 80% of oil was removed from the water within 15 min.</p>","author":"Miltiadis Zamparas, \nMichail Athanasiou, \nNikolaos Samartzis, \nVassileios Dracopoulos, \nSpyros Yannopoulos, \nTheophilos Ioannides","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"f6d1c449f2b8b289095c8b684880cec75078698e0608549dad54e372fad534f8","category":"Environment"}