{"title":"Drinking on Tour: From the Can Hunt to the Sticky Bottle","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/drinking-on-tour-from-the-can-hunt-to-the-sticky-bottle","date":1625827270000,"content":"\n      <p><span>Back in the early days of the race, the Tour de France had a drinking problem. </span></p>\n<p><span>We’re not just talking about alcohol, although we’ll get on to that shortly. The amount of any fluid that riders could receive during a stage was tightly controlled from the race’s inception right up to the era of colour TV. It seems scarcely believable given modern knowledge of dehydration and its impact on performance, but even in the 1960s riders were limited to four bidons; two on the bike and two more handed up at predetermined feeding stations.</span></p>\n<div></div>\n<p><span>This was partly thanks to Tour founder Henri Desgrange’s sadistic attitude to human performance and sporting competition (he once tried to make all his riders eat exactly the same food during the Tour but that idea was quickly shot down) and partly down to the cycling orthodoxy that having fluids sloshing around in your system would slow you down. One of the many quotes attributed to Jacques Anquetil was “driest is fastest.” No, we don’t get it either, but it made sense then.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-yellow-jersey-at-the-tour-de-france-a-brief-history\">Related: The Yellow Jersey at the Tour de France, a brief history</a></em></strong></p>\n<p><span>Perhaps unsurprisingly, riders in the Tour got very, very thirsty, not least when the race traversed the hot and dry south, as it does this week. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-639621483_1024x1024.jpg?v=1625826694\" /></span></p>\n<p><span>The riders had two options. Firstly, they could refill their bidons under convenient fonts or streams but this was unpredictable, time-consuming and left them at the mercy of consuming a little bit of whatever nasties were floating around in rural France’s water sources. For that reason, tap water was avoided like the plague that it may or may not have contained. Good Samaritans with trustworthy taps were also in short supply. </span></p>\n<p><span>The better choice was to go to the bar. For a team leader, that meant barking his orders to his lacky and sending them instead. It was one of the perks of being a captain: on Tour it was never your round. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-closest-edition-of-the-tour-de-france\">Related: The closest Tour de France winning margins in history</a></em></strong></p>\n<p><span>This practice lent its name to a Tour tradition: </span><i><span>la chasse à la canette</span></i><span>. The can hunt. Parched team leaders would yell ‘café’ or a similar battle cry and the raiding party would take shape. Bar owners in the nearest town would stand by, bemused, as domestiques stormed through the doors and the plunder began. All of a sudden two dozen skinny sunburned Vikings would commence their two-wheeled supermarket sweep, shoving whatever they could find up their jerseys and into sagging pockets and making off without leaving so much as a centime. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-56218079_1024x1024.jpg?v=1625826553\" /></span></p>\n<p><span>It wasn’t just a cool Perrier or Coca Cola either, since team leaders would often prefer something stronger. Look at this picture: that ain’t fizzy pop they’re pilfering from a nearby truck. Indeed, alcohol often played a significant role in the performances of the Tour, both good and bad, although distilling fact from fiction can be a difficult task. It was an essential performance-enhancing (or discomfort-dulling) drug from day one. Eddy Merckx’s legendary ride to Mourenx in 1969 may have been fuelled by a bidon of champagne. Alcohol was undoubtedly a factor in the death of Tom Simpson from heat exhaustion on Mont Ventoux in 1967, with one eyewitness reporting seeing Simpson put brandy in his bidon ahead of the stage. </span></p>\n\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/are-you-being-served-a-domestique-s-guide-to-the-tour-de-france\">Related: Are you being served? A Domestique's Guide to the Tour de France</a></em></strong></p>\n<p>In the aftermath of Simpson’s death organisers reluctantly allowed more refreshment from teams. Perversely this wasn’t because they wanted riders to hydrate better but because they wanted to remove a loophole in recently introduced anti-doping rules. Riders who had fallen foul of the simple tests had often escaped discipline by claiming that whatever banned substance had got into their system was actually from a bottle handed up to them from the roadside. <i>It weren’t me, guv, it were them pesky priests.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-155364309_1024x1024.jpg?v=1625826770\" /></i></p>\n<p><span>Nowadays you’ll notice that most riders never drink anything handed to them from the roadside, only using it to pour over their heads or legs (the notable exception was a well-known Belgian pensioner named Lucien Blyau who followed the cycling calendar from the 1970s until his death in 2016. His face and Collstrop jersey were instantly recognisable to riders in the grupetto; the little cans of coke he handed out to them were instantly welcomed too). </span></p>\n<p><span>And thus ended the era of the can hunt. The leopard can’t change his spots, however, and riders quickly realised that if they lingered while taking a bottle from their team car while the driver happened to accelerate, they could accelerate along with it.  </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/are-you-being-served-a-domestique-s-guide-to-the-tour-de-france\"></a></em></strong><span>There was no longer such a thing as a free drink, but riders could still get a free ride. The era of the </span><i><span>bidon collé</span></i><span> – the ‘sticky bottle’ – was born.  </span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f6d86253fd5e5016c53e45af0607c0aa8943fc8e60ca69966f5717805b6fed67","category":"Cycling"}