{"title":"Best aero road bike 2021 | 11 top-rated aero bikes and buyer’s guide","link":"https://www.bikeradar.com/advice/buyers-guides/best-aero-road-bike/","date":1628874000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/MG_9310-bf5e1ec.jpg?quality=45&amp;resize=620,413\" />                                            <p>The pursuit of speed is undoubtedly part of what makes cycling so exhilarating. And when it comes to going fast, aerodynamics has the biggest influence.</p>\n<p>Representing the leading edge of road-bike technology, the best aero road bikes challenge traditional notions of what makes a fast race bike.</p>\n<p>The latest aero bikes combine wind-cheating profiles with next-level integration to make these machines as slippery as possible. Sure, they may not always be at the cutting-edge when it comes to weight, but if you think an 8kg road bike can’t be fast, think again.</p>\n<p>Still, there is a lot to consider when it comes to finding the best aero road bike for your needs.</p>\n<p>For those of us who aren’t blessed to be WorldTour pros with a team of mechanics at hand, an aero bike still needs to be easy to live with. Do you need an engineering degree to maintain it? Do the deep-section wheels make it a handful on windy days? How does it perform on broken back roads? We’ve answered those questions in pursuit of finding the best aero bikes money can buy.</p>\n<h2>Are aero road bikes worth it?</h2>\n<p>Aero bikes are commonplace in the pro peloton, where riders are chasing marginal gains and, of course, have access to the latest <a href=\"https://www.bikeradar.com/features/pro-bike/2021-worldtour-bikes/\">WorldTour bikes</a> from their team sponsors.</p>\n<p>The angular, sculpted frames of aero bikes particularly come to the fore on long, flat stages and under the sprinters, where the lower drag of the wind-cheating tube profiles can give them the extra turn of speed they need to clinch a victory.</p>\n<p>Teams and their bike sponsors will typically provide riders with the choice between an aero bike and a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-climbing-bikes/\">lightweight climbing bike</a>, and some riders will swap between them depending on the terrain.</p>\n<p>Some riders now stick to their aero bikes regardless of terrain, riding them on more undulating and mountainous terrain. This is particularly true for breakaway specialists, who spend a lot more time in the wind than other riders and seek out whatever advantage they can get.</p>\n<p>That said, one of the recent trends in bike design has been the combination of low weight and aerodynamics, and some brands offer just one machine to meet both requirements.</p>\n<p>The <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/specialized-s-works-tarmac-sl7-review/\">Specialized S-Works SL7</a> and <a href=\"https://www.bikeradar.com/news/pinarello-dogma-f/\">Pinarello Dogma F</a> are just two examples of aero-influenced all-rounders found in the WorldTour peloton, but generally, we’ve seen the convergence of lightweight and aerodynamics.</p>\n<p>Still, aero road bikes are the fastest option out there in the majority of circumstances and you don’t have to be a pro to benefit, especially if you’re a rider who places a lot of significance on riding fast. After all, for a lot of people, <a href=\"https://www.bikeradar.com/features/aero-bike-test-notes/\">riding fast is fun</a>.</p>\n<p>If that’s you, then read on for our pick of the best aero bikes, as tested by the BikeRadar team, and read our full buyer’s guide at the end of the article to help you find the right bike for you.</p>\n<section><div>\n        <h2>Best aero road bikes in 2021, as rated and reviewed by our expert testers</h2>\n<ul><li><strong>Cannondale SystemSix Hi-Mod eTap AXS:</strong> £10,500 / $12,500</li>\n<li><strong>Trek Madone SL6 Disc:</strong> £3,900 / $4,700 / AU$6,500 / €4,499</li>\n<li><strong>Cube Litening SLT C:68X:</strong> £7,499 / €7,499</li>\n<li><strong>Felt AR Ultegra Di2:</strong> £6,299 / $6,999 / €6,999</li>\n<li><strong>Lapierre Aircode DRS 8.0:</strong> £6,300</li>\n<li><strong>Merida Reacto 6000:</strong> £2,800 / €3,099</li>\n<li><strong>Vitus ZX-1 EVO CRS Ultegra Di2:</strong> £3,999 / $5,200 / AU$68,00 / €5,500</li>\n<li><strong>Canyon Aeroad CFR Di2:</strong> £7,699 / $7,599 / AU$11,749 / €7,499</li>\n<li><strong>Cervélo S3 Disc Ultegra:</strong> £3,999 / $5,000</li>\n<li><strong>Orro Venturi Evo 105:</strong> £2,100/ $2,667 / €2,457</li>\n<li><strong>Wilier Triestina Cento10 SL Ultegra Di2:</strong> £5,540 / €5,600</li>\n</ul><p>\n\n    </p></div>\n    </section><h3>Cannondale SystemSix Hi-Mod eTap AXS</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>5.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The world’s fastest bike has seen an update and can still happily claim its crown for speed.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<ul><li>£10,500 / $12,500 as tested</li>\n<li>Still one of the fastest bikes in the world</li>\n<li>Nimble handling and a comfortable ride</li>\n</ul><p>This Cannondale SystemSix is an incredibly fast bike that left us feeling that other brands are still playing catch-up with Cannondale when it comes to creating aero bikes.</p>\n<p>The Hi-Mod frameset is Cannondale’s stiffest carbon fibre, and despite the stiffness and aero tubing, we found this to be a remarkably comfortable bike to ride.</p>\n<p>This bike has a halo-spec with a SRAM eTap AXS groupset, 64mm deep carbon wheels and Cannondale’s two-piece aero KNOT handlebar, which still allows for plenty of adjustment.</p>\n<p>The price is high, but when you compare it to other bikes of this spec it is competitive, and there is always the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cannondale-systemsix-carbon-ultegra-review/\">Cannondale SystemSix Carbon Ultegra</a>.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cannondale-systemsix-hi-mod-etap-axs-review/\">Read our full Cannondale SystemSix Hi-Mod eTap AXS review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Trek Madone SL6 Disc</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>5.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Trek Madone SL6 Disc won our Aero Bike of the Year award in 2020.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<ul><li>£3,900 / $4,700 / AU$6,500 / €4,499 as tested</li>\n<li>Comfortable thanks to Trek’s IsoSpeed decoupler</li>\n<li>Two-piece cockpit for adjustability</li>\n</ul><p>Winner of the aero category in our <a href=\"https://www.bikeradar.com/features/bike-of-the-year/\">Bike of the Year 2020</a> test, the Madone SL6 inherits the super-slippery frame shapes of the pro level, very expensive Madone SLR9. Trek has switched to a lower spec, heavier carbon lay-up and a separate bar and stem, but the cables and hoses still run internally.</p>\n<p>Like its big sibling, the Madone SL6 has Trek’s IsoSpeed decoupler built into its rear triangle. Trek says that this makes the Madone twice as compliant as its rivals; a claim supported by our testing.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/trek-madone-sl6-disc-review/\">Read our full Trek Madone SL6 Disc review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n\n<h3>Cube Litening SLT C:68X</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Cube Litening SLT C:68X is a highly accomplished race-ready rig.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<ul><li>£7,499 / €7,499 as tested</li>\n<li>Fast with extremely stable handling</li>\n<li>Full-on superbike with a price lower than competitors</li>\n</ul><p>The Cube Litening SLT C:68X doesn’t disappoint. It’s ridiculously rapid, holds onto speed fast and is surprisingly comfortable.</p>\n<p>The bike is dripping in the latest features you’d expect from a superbike, including a one-piece cockpit, hydraulic disc brakes, deep-section wheels and electronic gears courtesy of its SRAM Red AXS HRD groupset.</p>\n<p>It might be a lot of money, but given its spec, it’s remarkably competitive in this category of bikes. There is also the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cube-litening-c68x-pro-review/\">Cube Litening SLT C:68 Pro</a> if your budget doesn’t extend quite so high.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cube-litening-c68x-slt-review/\">Read our full Cube Litening SLT C:68X review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Felt AR Ultegra Di2</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Fast, flexible, aerodynamic bike with a near-perfect performance.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<ul><li>£6,299 / $6,999 / €6,999 as tested</li>\n<li>Fast, user-friendly and with an excellent spec</li>\n<li>Internal routing limits handlebar height adjustment</li>\n</ul><p>Felt claims the AR Ultegra Di2 is 9.4 per cent more aerodynamic than its predecessor, and there’s no denying that out on the road you can feel the aero difference over a more ‘normal’ road bike. It isn’t as light as other aero road bikes, but this doesn’t get in the way of the Felt being incredibly fun to ride.</p>\n<p>When it comes to spec, Felt has done a great job with a near faultless package including carbon finishing kit, an Ultegra Di2 groupset and Reynolds wheels with Continental GP5000 clincher tyres.</p>\n<p>While the internal cabling does look clean and aid aero performance, it leads to some handlebar height adjustment issues, which is worth bearing in mind.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/felt-ar-ultegra-di2-review/\">Read our full Felt AR Ultegra Di2 review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Lapierre Aircode DRS 8.0</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Lapierre Aircode DRS 8.0 comes with bolt-on aero bars.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£6,300 as tested</li>\n<li>Fast with accurate handling</li>\n<li>Superbly equipped</li>\n</ul><p>Now in its third generation, the Lapierre Aircode DRS 8.0 follows the trends for aero bikes with the integration of disc brakes and hidden cables – not forgetting clearance for 28mm tyres.</p>\n<p>The bike also addresses weight and comfort, two issues that are often associated with aero bikes, with a 900g frame and a carbon layup that is said to improve frame compliance.</p>\n<p>Despite the aggressive geometry that screams urgency as soon as you get on the bike, there’s no denying that this bike is comfy to ride. It’s a real technical achievement and the spec does it justice with Ultegra Di2 gearing and a DT Swiss wheelset. Lapierre even throws in some bolt-on aero bars for extra versatility and value for money.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/lapierre-aircode-drs-8-0-review/\">Read our full Lapierre Aircode DRS 8.0 review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Merida Reacto 6000</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> There aren’t many aero bikes that can compete with the Reacto in terms of value.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<ul><li>£2,800 as tested</li>\n<li>Great value for money</li>\n<li>Excellent frameset but wheels are heavy and tyres are average</li>\n</ul><p>The unisex Merida Reacto 6000 is a great value aero road bike with excellent handling and a stiff and fast frameset that shares its geometry with the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/merida-reacto-team-e/\">Merida Reacto Team-E</a>.</p>\n<p>The bike does put you in an aggressive position, which makes sense for a bike that is built for speed. This could be tiring on your arms and hands on long rides, but we had no issues during testing.</p>\n<p>The spec is good, but there are compromises. It has a cockpit that bucks the trend by sticking with a non-integrated design, which might not be desirable for some but others will find it very practical. There is an Ultegra groupset that performs as good as ever, but the wheels are on the heavy side and you would probably want to upgrade the tyres right away.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/merida-reacto-6000-review/\">Read our full Merida Reacto 6000 review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Vitus ZX-1 EVO CRS Ultegra Di2</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> A fast and purposeful bike that’s perfectly at home when you’re sprinting in the drops.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<ul><li>£3,999 / $5,200 / AU$68,00 / €5,500 as tested</li>\n<li>Incredible value fast aero bike</li>\n<li>Integrated handlebar rules out front-end fit adjustments</li>\n</ul><p>The ZX-1 is Vitus’s flagship aero bike, and despite the relatively low price tag, the bike boasts a spec that wouldn’t be out of place on a much more expensive ride, with Ultegra Di2, deep-section wheels and aero-profiled finishing kit.</p>\n<p>The bike is incredible value for money, then, and it doesn’t disappoint on the road either with a joyous ride. The geometry is racy, but it isn’t the most aggressive making this bike a good choice if you value stability.</p>\n<p>The only thing to look out for is the integrated cockpit which doesn’t allow for front-end fit adjustments, so it might be wise to try before you buy.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/vitus-zx-1-evo-crs-ultegra-di2-review/\">Read our full Vitus ZX-1 EVO CRRS Ultegra Di2 review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Canyon Aeroad CFR Di2</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li><a href=\"https://www.canyon.com/en-gb/road-bikes/aero-bikes/aeroad/cfr/aeroad-cfr-disc-di2/2452.html\" target=\"_blank\">Buy direct from Canyon</a></li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The Canyon Aeroad CFR Di2 comes with a power meter.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<ul><li>£7,699 / $7,599 / AU$11,749 / €7,499 as tested</li>\n<li>Includes power meter</li>\n<li>Mismatched tyres compromise comfort on rough roads</li>\n</ul><p>Canyon says that the 2021 Aeroad is the fastest race bike available, saving you 5.4 watts at 45kph compared to the outgoing version. At 7.3kg it’s not heavy either, despite wide, deep tube profiles.</p>\n<p>There’s a clever adjustable bar/stem with fully integrated cabling that lets you change bar width by 40mm and handlebar height by 15mm, to suit your preferences.</p>\n<p>In this top CFR spec, the Aeroad comes with <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-di2-r9170-first-ride-review/\">Shimano Dura-Ace R9170 Di2</a> and an integrated power meter. The 28mm rear tyre and seatpost make for plenty of rear-end comfort, but we found the 25mm front tyre on the DT Swiss ARC 1100 Dicut 62 DB wheels chattery over rough roads.</p>\n<p>The wheels are being superseded by the newer version of this wheelset though, which is has wider rims and should up ride quality.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/canyon-aeroad-cfr-di2-review/\">Read our full Canyon Aeroad CFR Di2 review</a></li>\n</ul><h3>Cervélo S3 Disc Ultegra</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> On the road, the S3 accelerates effortlessly and silently.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<ul><li>£3,999 / $5,000 as tested</li>\n<li>Awesome aero experience</li>\n<li>Choppy ride on rough surfaces</li>\n</ul><p>Cervélo invented the aero road bike, and the S3 Disc builds on the brand’s 25 years of aero knowledge with a claimed 13 watts less drag and a 68g weight saving on its predecessor. Cables all run internally, despite the S3 having a separate bar and stem for adjustability.</p>\n<p>The wheelbase is short even on larger sized frames, leading to sharp handling, although the bike would benefit from an upgrade from the alloy DT Swiss P1800 wheels. Run tubed, they lead to a rather choppy ride over uneven road surfaces; a swap to 28mm tyres might help.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cervelo-s3-disc-ultegra-review/\">Read our full review of the Cervélo S3 Disc Ultegra</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Orro Venturi Evo 105</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Handling is smooth and stable, so you get super-aero speeds for less cash.</span></figcaption><span> <i>Robert Smith / Immediate Media</i></span></div>\n<ul><li>£2,100/ $2,667 / €2,457 as tested</li>\n<li>Tuneable spec</li>\n<li>Reasonable price</li>\n<li>Some flex in the front end</li>\n</ul><p>At £2,100, the Orro Venturi Evo is a British aero bike that won’t break the bank. It looks great too, with space for 28mm tyres and an aggressive, racing position. We reckon it rolls with the best on flatter undulating roads, although there’s a little front-end flex when pushed hard.</p>\n<p>You can custom-tune the spec to your requirements, but alongside a <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-105-r7000-r7020-groupset-review/\">Shimano 105 R7000 groupset</a>, the test bike came with Vision Team 30 aero alloy wheels and fast-rolling Continental tyres. It’s a nice package at a nice price.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/orro-venturi-evo-105-review/\">Read our full Orro Venturi Evo 105 review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Wilier Triestina Cento10 SL Ultegra Di2</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The SL has kammtail tubes for aero efficiency.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<ul><li>£5,540 / €5,600 as tested</li>\n<li>Sharp handling</li>\n<li>Firmer ride than some</li>\n</ul><p>The Cento10 SL is a lower price point version of Wiler’s previous flagship road bike, the Cento10 Pro (the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/wilier-filante-slr-review/\">Filante</a> is now its top aero racer).</p>\n<p>The SL shares much in common with the Pro, using the same moulds for the frame, and really it feels like a masterstroke because the bike is almost indistinguishable from a superbike, at a much more affordable cost.</p>\n<p>The bike is firmer than some but it’s a dream to ride with a long and low position that feels balanced when cornering fast, and handling that puts other aero bikes to shame.</p>\n<p>The equipment spec is high, too, with Shimano Ultegra Di2, Wilier’s own carbon wheels and a Selle Italia SLR Boost Cabonio saddle, but the 25mm tyres might be on the slim side for some.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/wilier-triestina-cento10-sl-ultegra-di2-first-ride-review/\">Read our Wilier Triestina Cento10 SL Ultegra Di2 first ride review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<hr /><h2>Also consider…</h2>\n<p>This bike scored fewer than four out of five stars in testing so hasn’t been included in our main list, but is still worth considering and might tick the right boxes for you.</p>\n<h3>Scott Foil 10</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>3.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> A bike that is sculpted to be slightly more than just for speed and can handle multi-terrain too.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<ul><li>£5,949 / $6,000 / €5,999 as tested</li>\n<li>Efficient on a variety of terrain</li>\n<li>Not the fastest aero bike</li>\n</ul><p>The Scott Foil 10 aims to balance aerodynamics and weight, to create a bike that is suitable for riding on mixed terrain. The result is that it isn’t the fastest bike on tarmac, but it does make up for that in other areas such as on broken road surfaces, and the Scott Foil 10 is probably best understood as a competent all-rounder.</p>\n<p>The SRAM Force eTap AXS groupset offers loads of gear range and precise shifting. Scott has specced the bike with 28mm tyres, but there is room for up to 30mm and probably a bit more if you want to push things.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/2021-scott-foil-10-review/\">Read our full Scott Foil 10 review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<hr /><h2>Buyer’s guide to aero road bikes: what to look for</h2>\n<h3>What is an aero bike?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Unsurprisingly, aero road bikes prioritise all-out speed.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>An aero bike prioritises aerodynamic features, aiming to give you a little free speed as you ride.</p>\n<p>That starts with aero tube profiles, usually a truncated aerofoil design (also known as a Kammtail), with a smoothly curving leading edge and an abruptly chopped-off rear. The idea is to trick the wind into following the drag-saving shape of a full aerofoil while saving weight and maintaining frame stiffness.</p>\n<p>Truncated shapes are particularly evident on the down tube and seat tube, but on dedicated aero bikes usually carry over to the head tube, fork blades, seatpost and the rest of the frame.</p>\n<p>The latest aero bikes are all about integration and it’s rare to see exposed cables at the front end of the bike. The trick for bike manufacturers is providing that integration without sacrificing fit or everyday useability – some brands do this better than others.</p>\n<p>Aero bikes will sometimes have a more aggressive <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-geometry-explained/\">road bike geometry</a> than all-round race bikes – and certainly more aggressive than endurance or sportive bikes. That normally means a longer, lower position that allows the rider to hunker down over the bar, reducing frontal profile for less wind resistance.</p>\n<p>An aero bike arguably needs deep-section aero wheels to complete the deal. The best will come with them, but some makers fit more basic wheelsets (usually to keep the price down), expecting you to buy your own.</p>\n<h3>Aero bike vs road bike</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Giant TCR (left) was a radical bike when it was first released, but looks conservative next to the aero Merida Reacto (right).</span></figcaption><span> <i>Max Wilman / Immediate Media</i></span></div>\n<p>It looks as if the era of the specialist aero bike may be passing. As we’ve already mentioned, the latest generation of lightweight/all-rounder race bikes increasingly incorporates aero features.</p>\n<p>Take the <a href=\"https://www.bikeradar.com/news/2021-specialized-tarmac/\">Specialized Tarmac SL7</a> road bike, for example. It’s almost as aero as the brand’s <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/specialized-s-works-venge-sram-etap-review/\">Venge</a> specialist aero bike, which has now been removed from the range with Specialized adopting a ‘One bike to rule them all’ philosophy.</p>\n<p>Other formerly conventional road bikes that have had an aero makeover include the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cannondale-supersix-evo-carbon-disc-ultegra-review/\">Cannondale SuperSix</a> (overall winner of our <a href=\"https://www.bikeradar.com/features/bike-of-the-year/\">Bike of the Year 2020</a> test), the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/trek-emonda-sl-6-pro-review/\">Trek Emonda</a> and the <a href=\"https://www.bikeradar.com/news/scott-addict-rc-disc/\">Scott Addict</a>, with all these brands promoting aero benefits in a lightweight package.</p>\n<p>As with any bike purchase, it’s a case of weighing up the options and choosing the right machine for your needs. If you’re looking for more of an all-rounder with an aero edge, there are now plenty of options out there. Equally, if all-out speed is your thing, a dedicated aero bike will have that ace up its sleeve.</p>\n<h3>What is the fastest aero bike?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Cannondale claimed the SystemSix was the fastest bike in the world when it was released – but take manufacturer claims with a pinch of salt.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Almost every aero bike will be accompanied by some kind of claim about how the bike is faster than its predecessor or competitors. Aero gains are often quoted as seconds saved over 40km at 45kph or such, but do you regularly ride at that speed? The laws of physics mean that if your average speed is half that, you’ll reap an eighth of that figure.</p>\n<p>With around 80 per cent of wind resistance down to you, rather than the bike, there is only so much help an aero bike can provide. That’s before we get to the rider’s engine, too. If speed is your thing, here are <a href=\"https://www.bikeradar.com/advice/go-faster-for-free/\">five ways you can ride faster for free</a>.</p>\n<p>Having said that, few riding experiences beat the feeling of free speed when riding fast on a sharp-handling aero bike, especially on a rapid downhill or full-gas on a flat or rolling road.</p>\n<p>As for the ‘fastest’ aero bike, as ever we’d tread with caution when it comes to manufacturer claims. Sure, you can factor it into your buying decision, but there’s lots more to consider besides, including fit, usability, frame features (for example, tyre clearance) and budget.</p>\n<h3>Tube shapes</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> May aero road bikes have kammtail tube shaping, like on this Wilier Cento10.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>It goes without saying that an aero bike will have aero tube profiles. These are most obvious on the main tubes of the bike, the down tube and the seat tube in particular.</p>\n<p>Aero features will likely extend to the seatstays, which are often dropped, hitting the seat tube some way down from its top, as well as being aero in profile. The head tube, fork and seatpost (and its clamp) are also likely to have had the aero treatment.</p>\n<p>The first crop of aero road bikes, led by the Cervélo Soloist, had teardrop-shaped tubes. It’s the classic aerodynamic shape, but the tail adds a lot of weight without much structural benefit, so the frames tended to be heavy. The extended profile could also make for tricky handling in crosswinds.</p>\n<p>That’s changed now, with the realisation that a truncated aerofoil (or Kammtail) can be more aerodynamically efficient than a teardrop. Air forms an eddy behind the cut-off edge of the tube and air flowing past this forms a teardrop shape that’s much longer than the tube. Trek says that although the length of its Kammtail tubing is less than three times its width, it behaves aerodynamically as if it’s eight times the width.</p>\n<p>With that in mind, there’s potentially a quadruple benefit from truncated aerofoils: they use less material for a lighter frame, they are more structurally rigid, they produce longer virtual tails to the tubes and they’re less edgy in crosswinds.</p>\n<p>Another plus: they make it much easier for manufacturers to produce aero designs that comply with the geometry rules set by the UCI, cycling’s world governing body.</p>\n<h3>Integration</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Not a cable in sight. The CP0018 Aerocockpit on Canyon’s Aeroad is a prime example of front-end integration.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>The new frontier in aero bike design is front-end integration. That means that the <a href=\"https://www.bikeradar.com/features/road-bike-handlebars-guide-how-to-choose-the-right-ones/\">handlebar</a> and stem are often one piece, with a broad, flat aero shape to the bar. At least some of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-brake-gear-cables-explained/\">brake and gear cables</a> will run internally into the frame, so they’re out of the airflow.</p>\n<p>There’s a surprising amount of drag from round cables routed externally. Pinarello claimed burying the cables inside the bar and stem of the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/pinarello-dogma-f12-dura-ace-di2-disc-review/\">Dogma F12</a> improved aerodynamics by more than 5 per cent relative to its F10 predecessor, which had external cabling (Pinarello has since launched the new <a href=\"https://www.bikeradar.com/news/pinarello-dogma-f/\">Dogma F</a>).</p>\n<p>The flip side is that some integrated systems can be difficult to work with, so expect to spend more on maintenance or to deal with more frustration if doing it yourself.</p>\n<p>Also, make sure you’re comfortable with the position dictated by a bike’s integrated carbon bar/stem. There are limited size options and adjustability to many integrated systems. The best integrated cockpits keep everything clean and tidy, hiding the cables from the wind, but still allow for easy servicing and fit adjustments, most likely by keeping the handlebar and stem as two separate units.</p>\n<h3>Ride quality</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Madone uses Trek’s IsoSpeed rear suspension technology to improve comfort.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>With their chunky tube profiles, aero bikes of old had a (often justified) reputation for a harsh ride.</p>\n<p>That’s largely changed with the modern crop of aero bikes, as brands have learned how to design frames for a more comfortable ride without compromising aerodynamics, and <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">road disc brakes</a> have increased tyre clearances – you can now run a 28mm or even 30mm tyre in many of the latest aero bikes.</p>\n<p>Nevertheless, it’s something to look out for if you’re thinking of buying an aero bike. It’s worth reading <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/\">road bike reviews</a> and, ideally, taking a test ride before parting with your cash, especially if you live somewhere with rough roads.</p>\n<h3>Geometry</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Long and low is the aim of the aero bike geometry game, with many bikes even looking fast.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>As mentioned above, an aero bike will typically promote a long, low ride position. That’s great for cutting through the wind, but make sure you’ll be comfortable riding an aero bike (or that it offers the adjustability you need) before taking the plunge. <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-fix-5-of-the-most-common-causes-of-bike-pain/\">Neck, back, shoulder and hand pain</a> can be issues if you’re not very flexible or not used to an aggressive position.</p>\n<p>You may adapt to the position, but if you’re not racing you don’t want to end up suffering on your bike to go a little faster – being forced to cut your ride short due to pain or picking up an injury is counter-productive, to say the least.</p>\n<h3>Weight</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Aero bikes can still climb. The weight and performance difference between many conventional road bikes and aero bikes is slim.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Weight used to be a driving factor behind bike design, with a lower weight perceived to result in a faster and better ride. Aero bikes disprove the rule with many tipping the scale at around 8kg and feeling lightning quick.</p>\n<p>While a super lightweight bike might serve you better on long climbs, the weight and performance difference between many more conventional bikes and aero bikes is marginal, and improving your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/power-to-weight-ratio/\">power-to-weight ratio</a> can be one way to offset the difference. There are also <a href=\"https://www.bikeradar.com/features/8-ways-to-make-your-road-bike-lighter/\">ways to make your road bike lighter</a> if you’re that way inclined.</p>\n<p>A lightweight bike might feel more responsive, but geometry and tyre choice arguably have as much impact on the feel of a bike as weight. If you want something that feels responsive and snappy, look for a bike with a short wheelbase and a head tube angle of around 73.5 degrees.</p>\n<h3>Wheels</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Really, aero bikes need deep-section wheels to make the most of the aerodynamic frames.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>An aero bike needs an aero wheelset to complement – and make the most of – the frame’s aerodynamics. It’s still all too common to find an aero frameset equipped with budget, non-aero wheels. Recognising this, some brands are now fitting wheels worthy of the investment they’ve made in their frames.</p>\n<p>Unless you’ve got a set of go-fast wheels already sitting at home, it’s worth looking for a bike that comes with decent deep-section wheels. If not, and you do want to upgrade, budget the best part of £1,000 for a set of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">best road bike wheels</a>.</p>\n<h3>Brakes</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Disc brakes are pretty much standard on the latest high-end aero bikes.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Disc brakes have largely taken over on all new bikes but rim brake outliers are still out there, particularly if you’re <a href=\"https://www.bikeradar.com/features/how-to-buy-a-used-or-second-hand-bike-online/\">buying a second-hand bike</a>.</p>\n<p>If you go for a rim brake aero bike (and, most likely, an older model), you may find that the calipers have been moved out of the wind. The front brake may be integrated into the fork and the rear brake may be under the bottom bracket.</p>\n<p>Fortunately, this is less common nowadays and, as a general rule, we’d steer riders away from integrated brakes. Integrated front brakes are often less effective than a separate caliper, and rear brakes under the bottom bracket are prone to brake rub and getting covered in filth.</p>\n<p>Most high-end aero bikes now come with disc brakes, but it’s worth bearing in mind if you’re looking at a lower-priced rim brake model.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f6ddfee59955d0ae9eb3017e6b0df125ad581f072c10c1b82c02d8c4b67487ff","category":"Cycling"}