{"title":"Climatic and Environmental Impacts on the Sedimentation of the SW Taiwan Margin Since the Last Deglaciation: Geochemical and Mineralogical Investigations","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004745?af=R","date":1722248707000,"content":"<h2>Abstract</h2>\n<p>Many scientific studies have been conducted to constrain present and past source-to-sink processes and their controlling factors. The role of typhoon and monsoon rainfall on chemical weathering and soils erosion in east Asia is still not well established. Clay minerals and major elements, combined with Nd and Sr isotopic compositions were analyzed on sediments from Core MD18-3569 located on the Taiwan margin in the northeastern South China Sea. The aim was to reconstruct the weathering history of small river basins of southwest Taiwan and to establish the impact of East Asian summer monsoon and typhoon rainfall on source to sink processes since the last glacial period. <sup>87</sup>Sr/<sup>86</sup>Sr and ɛNd values and predominant illite-chlorite indicate that the rivers of southwest Taiwan is the sole source of sediments to Core MD18-3569 since last deglaciation. Variations in clay mineral assemblages and major elements allowed us to evaluate the intensity of past weathering in the rivers of southwest Taiwan. We demonstrated that long-term changes of chemical weathering intensity record from Taiwan are driven by changes in the summer monsoon rainfall. The deglaciation is characterized by a progressive increase in the intensity of chemical weathering, which peaked at the beginning of the Holocene. The chemical weathering degree of sediments from Taiwan decreases during the Holocene concurrently with a weakening of the summer monsoon, increase in typhoon activity, and changes in the vegetation cover. All these processes induce soil erosion, regressive pedogenesis, due to shorter residence time of minerals in the soils of southwest Taiwan.</p>","author":"Joffrey Bertaz, \nZhifei Liu, \nChristophe Colin, \nArnaud Dapoigny, \nAndrew Tien‐Shun Lin, \nYanli Li, \nZhimin Jian","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"f707f4a52c0abd4917c1f406630f469cb99c53b50e71434190d1aaf18cb9e9bb","category":"Environment"}