{"title":"Shaded streams with permeable watersheds provide naturally resilient fish habitat refugia during heatwaves","link":"https://onlinelibrary.wiley.com/doi/10.1111/fme.12704?af=R","date":1711976310000,"content":"<h2>Abstract</h2>\n<p>Streamflow, dissolved oxygen, and water temperature underpin stream fish habitat suitability, so climate change could cause widespread habitat deterioration. Identifying stream characteristics that mediate habitat resilience to heatwaves will allow conservation effort prioritisation. Here, a set of readily applied metrics were used to assess hydrological and oxythermal responses of neighbouring salmonid streams, with distinctive geologies, soil-types, and localised riparian shading, to periods of anomalously warm conditions. During heatwaves, low flows, warm-water temperatures, and diel oxygen variability, associated with biogenic production and respiration, predominated. In a low-shade stream lacking significant catchment water storage, high daytime (&gt;22°C) and night-time (&gt;19°C) water temperatures and low early morning O<sub>2</sub> concentrations (&lt;5 mg L<sup>−1</sup>) accumulated oxythermal stress for salmonids throughout summer. A stream with localised shading and a higher proportion of underlying aquifers and permeable soils throughout its watershed experienced considerably less cumulative oxythermal stress (O<sub>2</sub> &gt; 6 mg L<sup>−1</sup>; temperatures &lt;19°C), whilst slower release of subsurface water bolstered base flows during dry spells. Our findings support conservation of shaded streams with permeable watersheds characterised by higher soil infiltration rates and aquifer storage capacity as salmonid sanctuaries under a warmer, drier summer climate. Preventing water quality and hydromorphological deterioration are paramount for safeguarding their role as climate refugia.</p>","author":"Seán Kelly, \nFiona L. Kelly","siteTitle":"Wiley: Fisheries Management and Ecology: Table of Contents","siteHash":"2b1b3fff230d9382f58e34a4967fc2d5f8d98012b5e160c81a8e044227f32245","entryHash":"f71912cdff87db1c33532fe0c1f38d699232edfa80fb943496566c874f5fe222","category":"Environment"}