{"title":"Meet Codux: The React Visual Editor That Improves Developer Experience","link":"https://smashingmagazine.com/2023/06/codux-react-visual-editor-improves-developer-experience/","date":1686816000000,"content":"<p>This article is a sponsored by <a href=\"https://www.wix.com/\">Wix</a></p>\n<p>Personally, I get tired of the antics at the start of any new project. I’m a contractor, too, so there’s always some new dependency I need to adopt, config files to force me to write the way a certain team likes, and deployment process I need to plug into. It’s never a fire-up-and-go sort of thing, and it often takes the better part of a working day to get it all right.</p>\n<p>There are a lot of moving pieces to a project, right? Everything — from integrating a framework and establishing a component library to collaboration and deployments — is a separate but equally important part of your IDE. If you’re like me, jumping between apps and systems is something you get used to. But honestly, it’s an act of Sisyphus rolling the stone up the mountain each time, only to do it again on the next project.</p>\n<p>That’s the setup for what I think is a pretty darn good approach to streamline this convoluted process in a way that supports any common project structure and is capable of enhancing it with visual editing capabilities. <a href=\"https://codux.hopp.to/smashing\">It’s called Codux</a>, and if you stick with me for a moment, I think you’ll agree that Codux could be the one-stop shop for everything you need to build production-ready React apps.</p>\nCodux is More “Your-Code” Than \"Low-Code\"\n<p>I know, I know. <em>\"Yay, another visual editor!\"</em> says no one, ever. The planet is already full of those, and they’re really designed to give folks developer superpowers without actually doing any development.</p>\n<p>That’s so not the case with Codux. There are indeed a lot of \"low-code\" affordances that could empower non-developers, but that’s not the headlining feature of Codux or really who or what it caters to. Instead, Codux is a fully-integrated IDE that provides the bones of your project while improving the developer experience instead of abstracting it away.</p>\n<p>Do you use CodePen? What makes it so popular (and great to use) is that it \"just\" works. It combines frameworks, preprocessors, a live rendering environment, and modern build tools into a single interface that does all the work on \"Save\". But I still get to write code in a single place, the way I like it.</p>\n<p>I see Codux a lot like that. But bigger. Not bigger in the sense of more complicated, but bigger in that it is more integrated than frameworks and build tools. It _is_ your framework. It _is_ your component library. It _is_ your build process. And it just so happens to have incredibly powerful visual editing controls that are fully integrated with your code editor.</p>\n<p><img src=\"https://files.smashing.media/articles/codux-react-visual-editor-improves-developer-experience/codux-new-project.png\" /></p>\n<p>That’s why it makes more sense to call Codux “your code” instead of the typical low-code or no-code visual editing tools. Those are designed for non-developers. Codux, on the other hand, is made <em>for developers</em>.</p>\n<p>In fact, here’s a pretty fun thing to do. Open a component file from your project in VS Code and put the editor window next to the Codux window open to the same component. Make a small CSS change or something and watch both the preview rendering <em>and</em> code update instantly in Codux.</p>\n<p><img src=\"https://files.smashing.media/articles/codux-react-visual-editor-improves-developer-experience/cloudcash-screenshot.png\" /></p>\n<p>That’s just one of those affordances that really polish up the developer experience. Anyone else might overlook something like this, but as a developer, you know how much saved time can add up with something like this.</p>\nCode, Inspect And Debug Together At Last\n<p>There are a few other affordances available when selecting an element on the interactive stage on Codux:</p>\n<ul>\n<li>A <strong>style panel</strong> for editing CSS and trying different layouts. And, again, changes are made in real-time, both in the rendered preview and in <em>your</em> code, which is visible to you all the time — whether directly in Codux or in your IDE. </li>\n<li>A <strong>property panel</strong> that provides easy access to all the selected properties of a component with visual controllers to modify them (and see the changes reflected directly in the code)</li>\n<li>An <strong>environment panel</strong> that provides you with control over the rendering environment of the component, such as the screen or canvas size, as well as the styling for it.</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/codux-react-visual-editor-improves-developer-experience/cloudcash-weekly-sumup.png\" /></p>\nMaybe Give Codux A Spin\n<p>It’s pretty rad that I can fire up a single app to access my component library, code, documentation, live previews, DOM inspector, and version control. If you would’ve tried explaining this to me <em>before</em> seeing Codux, I would’ve said that’s too much for one app to handle; it’d be a messy UI that’s more aspiration than it is a liberating center of development productivity.</p>\n<p>No lying. That’s exactly what I thought when the Wix team told me about it. I didn’t even think it was a good idea to pack all that in one place.</p>\n<p>But they did, and I was dead wrong. Codux is pretty awesome. And apparently, it will be even more awesome because the<a href=\"https://www.codux.com/faq\"> FAQ talks about a bunch of new features</a> in the works, things like supporting full frameworks. The big one is an online version that will completely remove the need to set up development environments every time someone joins the team, or a stakeholder wants access to a working version of the app. Again, this is all in the works, but it goes to show how Codux is all about improving the <em>developer experience</em>.</p>\n<p>And it’s not like you’re building a Wix site with it. Codux is its own thing — something that Wix built to get rid of their own pain points in the development process. It just so happens that their frustrations are the same that many of us in the community share, which makes Codux a legit consideration for any developer or team.</p>\n<p>Oh, and it’s free. You can <a href=\"https://codux.hopp.to/smashing\">download it right now</a>, and it supports Windows, Mac, and Linux. In other words, you can give it a spin without buying into anything.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"f7221da3c7a81184584296be4b33260be17f3970adc8da5cb65639facb773366","category":"Tech"}