{"title":"Effects of cleft lip on visual scanning and neural processing of infant faces","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300673","date":1711548000000,"content":"<p>by Amanda C. Hahn, Juergen A. Riedelsheimer, Zoë Royer, Jeffrey Frederick, Rachael Kee, Rhiannon Crimmins, Bernd Huber, David H. Harris, Kelly J. Jantzen</p>\r\n\r\nInfant faces readily capture adult attention and elicit enhanced neural processing, likely due to their importance evolutionarily in facilitating bonds with caregivers. Facial malformations have been shown to impact early infant-caregiver interactions negatively. However, it remains unclear how such facial malformations may impact early visual processing. The current study used a combination of eye tracking and electroencephalography (EEG) to investigate adults’ early visual processing of infant faces with cleft lip/palate as compared to normal infant faces, as well as the impact cleft palate has on perceived cuteness. The results demonstrated a significant decrease in early visual attention to the eye region for infants with cleft palate, while increased visual attention is registered on the mouth region. Increased neural processing of the cleft palate was evident at the N170 and LPP, suggesting differences in configural processing and affective responses to the faces. Infants with cleft palate were also rated significantly less cute than their healthy counterparts (mean difference = .73, p &lt; .001). These results suggest that infants’ faces with cleft lip/palate are processed differently at early visual perception. These processing differences may contribute to several important aspects of development (e.g., joint attention) and may play a vital role in the previously observed difficulties in mother-infant interactions.","author":"Amanda C. Hahn","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f73580d40965fd014fe652a210b20c359c016e440aea07cbda5565b50c4b0daa","category":"Interdisciplinary"}