{"title":"Hackers exploited Windows 0-day for 6 months after Microsoft knew of it","link":"https://arstechnica.com/?p=2007765","date":1709592424000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/11/zeroday-800x534.jpg\" alt=\"The word ZERO-DAY is hidden amidst a screen filled with ones and zeroes.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/11/zeroday.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/\">Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Hackers backed by the North Korean government gained a major win when Microsoft left a Windows zero-day unpatched for six months after learning it was under active exploitation.</p>\n<p>Even after Microsoft patched the vulnerability last month, the company made no mention that the North Korean threat group Lazarus had been using the vulnerability since at least August to install a stealthy rootkit on vulnerable computers. The vulnerability provided an easy and stealthy means for malware that had already gained administrative system rights to interact with the Windows kernel. Lazarus used the vulnerability for just that. Even so, Microsoft has long said that such admin-to-kernel elevations don’t represent the crossing of a security boundary, a possible explanation for the time Microsoft took to fix the vulnerability.</p>\n<h2>A rootkit “holy grail”</h2>\n<p>“When it comes to Windows security, there is a thin line between admin and kernel,” Jan Vojtěšek, a researcher with security firm Avast <a href=\"https://decoded.avast.io/janvojtesek/lazarus-and-the-fudmodule-rootkit-beyond-byovd-with-an-admin-to-kernel-zero-day/\">explained</a> last week. “Microsoft’s<a href=\"https://www.microsoft.com/en-us/msrc/windows-security-servicing-criteria\"> security servicing criteria</a> have long asserted that ‘[a]dministrator-to-kernel is not a security boundary,’ meaning that Microsoft reserves the right to patch admin-to-kernel vulnerabilities at its own discretion. As a result, the Windows security model does not guarantee that it will prevent an admin-level attacker from directly accessing the kernel.”</p></div><p><a href=\"https://arstechnica.com/?p=2007765#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2007765&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f75a3aaefebb73ced33102de5ac064d936a76f417b234b42e635e2e9002b8982","category":"Tech"}