{"title":"Hydrological Projections in the Third Pole Using Artificial Intelligence and an Observation‐Constrained Cryosphere‐Hydrology Model","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004222?af=R","date":1712754857000,"content":"<h2>Abstract</h2>\n<p>The water resources of the Third Pole (TP), highly sensitive to climate change and glacier melting, significantly impact the water and food security of millions in Asia. However, projecting future spatial-temporal runoff changes for TP's mountainous basins remains a formidable challenge. Here, we've leveraged the long short-term memory model (LSTM) to craft a grid-scale artificial intelligence (AI) model named LSTM-grid. This model has enabled the production of hydrological projections for the seven major river basins of TP. The LSTM-grid model integrates monthly precipitation, air temperature, and total glacier mass changes (total_GMC) data at a 0.25-degree model grid. Training the LSTM-grid model employed gridded historical monthly runoff and evapotranspiration data sets generated by an observation-constrained cryosphere-hydrology model at the headwaters of seven TP river basins during 2000–2017. Our results demonstrate the LSTM grid's effectiveness and usefulness, exhibiting a Nash-Sutcliffe Efficiency coefficient exceeding 0.92 during the verification periods (2013–2017). Moreover, river basins in the monsoon region exhibited a higher rate of runoff increase compared to those in the westerlies region. Intra-annual projections indicated notable increases in spring runoff, especially in basins where glacier meltwater significantly contributes to runoff. Additionally, the LSTM-grid model aptly captures the runoff changes before and after the turning points of glacier melting, highlighting the growing influence of precipitation on runoff after reaching the maximum total_GMC. Therefore, the LSTM-grid model offers a fresh perspective for understanding the spatiotemporal distribution of water resources in high-mountain glacial regions by tapping into AI's potential to drive scientific discovery and provide reliable data.</p>","author":"Junshui Long, \nLei Wang, \nDeliang Chen, \nNing Li, \nJing Zhou, \nXiuping Li, \nXiaoyu Guo, \nHu Liu, \nChenhao Chai, \nXinfeng Fan","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"f75b4ac065ecb59584b370bdf8409c361acdbeda1cf87694bca6e62e50c3e747","category":"Environment"}