{"title":"Measure and Improve Your Application Resilience with AWS Resilience Hub","link":"https://aws.amazon.com/blogs/aws/monitor-and-improve-your-application-resiliency-with-resilience-hub/","date":1636588083000,"content":"<p>I am excited to announce the immediate availability of <a href=\"https://aws.amazon.com/resilience-hub\">AWS Resilience Hub</a>, a new AWS service designed to help you define, track, and manage the resilience of your applications.</p> \n<p>You are building and managing resilient applications to serve your customers. Building distributed systems is hard; maintaining them in an operational state is even harder. The question is not if a system will fail, but when it will, and you want to be prepared for that.</p> \n<p>Resilience targets are typically measured by two metrics: <a href=\"https://en.wikipedia.org/wiki/Disaster_recovery#Recovery_Time_Objective\">Recovery Time Objective</a> (RTO), the time it takes to recover from a failure, and <a href=\"https://en.wikipedia.org/wiki/Disaster_recovery#Recovery_Point_Objective\">Recovery Point Objective</a> (RPO), the maximum window of time in which data might be lost after an incident. Depending on your business and application, these can be measured in seconds, minutes, hours, or days.</p> \n<p><span>AWS Resilience Hub</span> lets you define your RTO and RPO objectives for each of your applications. Then it assesses your application’s configuration to ensure it meets your requirements. It provides actionable recommendations and a resilience score to help you track your application’s resiliency progress over time. <span>Resilience Hub</span> gives a customizable single dashboard experience, accessible through the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a>, to run assessments, execute prebuilt tests, and configure alarms to identify issues and alert the operators.</p> \n<p><span>AWS Resilience Hub</span> discovers applications deployed by <a href=\"https://aws.amazon.com/cloudformation/\">AWS CloudFormation</a> (this includes <a href=\"https://aws.amazon.com/serverless/sam/\">SAM</a> and <a href=\"https://docs.aws.amazon.com/cdk/latest/guide/getting_started.html\">CDK</a> applications), including cross Regions and cross account stacks. <span>Resilience Hub</span> also discovers applications from <a href=\"https://docs.aws.amazon.com/ARG/latest/userguide/resource-groups.html\">Resource Groups</a> and <a href=\"https://docs.aws.amazon.com/general/latest/gr/aws_tagging.html\">tags</a> or chooses from applications already defined in <a href=\"https://docs.aws.amazon.com/servicecatalog/latest/adminguide/appregistry.html\">AWS Service Catalog AppRegistry</a>.</p> \n<p>The term “application” here refers not just to your application software or code; it refers to the entire infrastructure stack to host the application: networking, virtual machines, databases, and so on.</p> \n<p><strong><span>Resilience assessment and recommendations<br /> </span></strong><span>AWS Resilience Hub</span>’s resilience assessment utilizes best practices from the <a href=\"https://aws.amazon.com/architecture/well-architected/\">AWS Well-Architected Framework</a> to analyze the components of your application and uncover potential resilience weaknesses caused by incomplete infrastructure setup, misconfigurations, or opportunities for additional configuration improvements. <span>Resilience Hub</span> provides actionable recommendations to improve the application’s resilience.</p> \n<p>For example, <span>Resilience Hub</span> validates that the application’s <a href=\"https://aws.amazon.com/rds/\">Amazon Relational Database Service (RDS)</a>, <a href=\"https://aws.amazon.com/ebs/\">Amazon Elastic Block Store (EBS)</a>, and <a href=\"https://aws.amazon.com/efs\">Amazon Elastic File System (Amazon EFS)</a> backup schedule is sufficient to meet the application’s RPO and RTO you defined in your resilience policy. When insufficient, it recommends improvements to meet your RPO and RTO objectives.</p> \n<p>The resilience assessment generates code snippets that help you create recovery procedures as <a href=\"https://aws.amazon.com/systems-manager/\">AWS Systems Manager</a> documents for your applications, referred to as <a href=\"https://en.wikipedia.org/wiki/Standard_operating_procedure\">standard operating procedures</a> (SOPs). In addition, <span>Resilience Hub</span> generates a list of recommended <a href=\"https://aws.amazon.com/cloudwatch/\">Amazon CloudWatch</a> monitors and alarms to help you quickly identify any change to the application’s resilience posture once deployed.</p> \n<p><span><strong>Continuous resilience validation<br /> </strong></span>After the application and SOPs have been updated to incorporate recommendations from the resilience assessment, you may use <span>Resilience Hub</span> to test and verify that your application meets its resilience targets before it is released into production. <span>Resilience Hub</span> is integrated with <a href=\"http://aws.amazon.com/fis\">AWS Fault Injection Simulator (FIS)</a>, a fully managed service for running fault injection experiments on AWS. <span>FIS</span> provides fault injection simulations of real-world failures, such as network errors or having too many open connections to a database. <span>Resilience Hub</span> also provides APIs for development teams to integrate their resilience assessment and testing into their CI/CD pipelines for ongoing resilience validation. Integrating resilience validation into CI/CD pipelines helps ensure that every change to the application’s underlying infrastructure does not compromise its resilience.</p> \n<p><span><strong>Visibility<br /> </strong></span><span>AWS Resilience Hub</span> provides a comprehensive view of your overall application portfolio resilience status<br /> through its dashboard. To help you track the resilience of applications, <span>Resilience Hub</span> aggregates and<br /> organizes resilience events (for example, unavailable database or failed resilience validation), alerts, and insights from services like <a href=\"https://aws.amazon.com/cloudwatch/\">Amazon CloudWatch</a> and <a href=\"http://aws.amazon.com/fis\">AWS Fault Injection Simulator (FIS)</a>. <span>Resilience Hub</span> also generates a resilience score, a scale that indicates the level of implementation for recommended resilience tests, alarms and recovery SOPs. This score can be used to measure resilience improvements over time.</p> \n<p>The intuitive dashboard sends alerts for issues, recommends remediation steps, and provides a single place to manage application resilience. For example, when a <a href=\"https://aws.amazon.com/cloudwatch/\">CloudWatch</a> alarm triggers, <span>Resilience Hub</span> alerts you and recommends recovery procedures to deploy.</p> \n<p><span><strong><span>AWS Resilience Hub</span> in Action<br /> </strong></span>I developed a non-resilient application made of a single <span>EC2</span> instance and an <a href=\"https://aws.amazon.com/rds/\">RDS</a> database. I’d like <span>Resilience Hub</span> to assess this application. <a href=\"https://github.com/sebsto/guestbook-demo\">The CDK script to deploy this application on your AWS Account is available on my GitHub repository</a>. Just install CDK v2 (<code>npm install -g aws-cdk@next</code>) and deploy the stack (<code>cdk bootstrap &amp;&amp; cdk deploy --all</code>).</p> \n<p>There are four steps when using <span>Resilience Hub</span>:</p> \n<ul> \n <li>I first add the application to assess. I can start with <span>CloudFormation</span> stacks, <a href=\"https://docs.aws.amazon.com/servicecatalog/latest/adminguide/appregistry.html\">AppRegistry</a>, <a href=\"https://docs.aws.amazon.com/ARG/latest/userguide/resource-groups.html\">Resource Groups</a>, or another existing application.</li> \n <li>Second, I define my resilience policy. The policy document describes my RTO and RPO objectives for incidents that might impact either my application, my infrastructure, an entire availability zone, or an entire AWS Region.</li> \n <li>Third, I run an assessment against my application. The assessment lists policy breaches, if any, and provides a set of recommendations, such as creating <a href=\"https://aws.amazon.com/cloudwatch/\">CloudWatch</a> alarms, standard operating procedures documents, or fault injection experiment templates.</li> \n <li>Finally, I might setup any of the recommendations made or run experiments on a regular basis to validate the application’s resilience posture.</li> \n</ul> \n<p><span><strong>Preparation<br /> </strong></span>To start, I open my browser and navigate to the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a>. I select <span>AWS Resilience Hub</span> and select <strong>Add application</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/04/2021-10-31_18-14-23.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/04/2021-10-31_18-14-23.png\" /></a></p> \n<p>My sample app is deployed with three <span>CloudFormation</span> stacks: a network, a database, and an <span>EC2</span> instance.  I select these three stacks and select <strong>Next</strong> on the bottom of the screen:</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_18-14-57-1.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_18-14-57-1.png\" /></a></p> \n<p><span>Resilience Hub</span> detects the resources created by these stacks that might affect the resilience of my applications and I select the ones I want to include or exclude from the assessments and click <strong>Next</strong>. In this example, I select the NAT gateway, the database instance, and the <span>EC2</span> instance.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_18-17-55-1.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_18-17-55-1.png\" /></a></p> \n<p>I create a resilience policy and associate it with this application. I can choose from policy templates or create a policy from scratch. A policy includes a name and the RTO and RPO values for four types of incidents: the ones affecting my application itself, like a deployment error or a bug at code level; the ones affecting my application infrastructure, like a crash of the <span>EC2</span> instance; the ones affecting an availability zone; and the ones affecting an entire region. The values are expressed in seconds, minutes,  hours, or days.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_18-19-26-1.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_18-19-26-1.png\" /></a></p> \n<p>Finally, I review my choices and select <strong>Publish</strong>.</p> \n<p><span><strong>Assessment</strong></span><br /> Once this application and its policy are published, I start the assessment by selecting <strong>Assess resiliency</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_21-01-21-1.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_21-01-21-1.png\" /></a></p> \n<p>Without surprise, <span>Resilience Hub</span> reports my resilience policy is breached.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_21-02-51-1.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_21-02-51-1.png\" /></a></p> \n<p>I select the report to get the details.  The dashboard shows how Region, availability zone, infrastructure and application-level incident expected RTO/RPO compare to my policy.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-11-04_22-33-05-1.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-11-04_22-33-05-1.png\" /></a></p> \n<p>I have access to <strong>Resiliency recommendations</strong> and <strong>Operational recommendations</strong>.</p> \n<p>In <strong>Resiliency recommendations</strong>, I see if components of my application are compliant with the resilience policy. I also discover recommendations to <strong>Optimize for availability zone RTO/RPO</strong>, <strong>Optimize for cost</strong>, or <strong>Optimize for minimal changes</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-11-04_22-12-52.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-11-04_22-12-52.png\" /></a></p> \n<p>In <strong>Operational recommendations</strong>, on the first tab, I see a list of proposed <strong>Alarms</strong> to create in <a href=\"https://aws.amazon.com/cloudwatch/\">CloudWatch</a>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_21-04-26-1.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_21-04-26-1.png\" /></a></p> \n<p>The second tab lists recommended <strong>Standard operating procedures</strong>. These are <a href=\"https://aws.amazon.com/systems-manager/\">Systems Manager</a> documents I can run on my infrastructure, such as <strong>Restore from Backup</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/04/2021-10-31_21-04-45.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/04/2021-10-31_21-04-45.png\" /></a></p> \n<p>The third tab (<strong>Fault injection experiment templates</strong>) proposes experiments to run on my infrastructure to test its resilience. Experiments are run with <span>FIS</span>. Proposed experiments are <strong>Inject memory load</strong> or <strong>Inject process kill</strong>.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/04/2021-10-31_21-05-01.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/04/2021-10-31_21-05-01.png\" /></a></p> \n<p>When I select <strong>Set up recommendations</strong>, <span>Resilience Hub</span> generates <span>CloudFormation</span> templates to create the alarms or to execute the SOP or experiment proposed.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_21-11-04-1.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-10-31_21-11-04-1.png\" /></a></p> \n<p>The follow up screens are quite self-explanatory. Once generated, templates are available to execute in the <strong>Templates</strong> tab. I apply the template and observe how it impacts the resilience score of the application.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-11-07_16-41-42.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/07/2021-11-07_16-41-42.png\" /></a></p> \n<p><a href=\"https://github.com/sebsto/guestbook-demo\">The CDK script you used to deploy the sample applications</a> also creates a highly available infrastructure for the same application. It has a load balancer, an auto scaling group, and a database cluster with two nodes. As an exercise, run the same assessment report on this application stack and compare the results.</p> \n<p><strong><span>Pricing and Availability<br /> </span></strong><span>AWS Resilience Hub</span> is available today in <span>US East (Ohio)</span>, <span>US East (N. Virginia)</span>, <span>US West (Oregon)</span>, <span>Asia Pacific (Singapore)</span>, <span>Asia Pacific (Tokyo)</span>, <span>Europe (Ireland)</span>, and <span>Europe (Frankfurt)</span>. We will add more regions in the future.</p> \n<p>As usual, you pay only for what you use. There are no upfront costs or minimum fees. You are charged based on the number of applications you described in <span>Resilience Hub</span>. You can try <span>Resilience Hub</span> free for 6 months, up to 3 applications. After that, <span>Resilience Hub</span>‘s price is $15.00 per application per month. Metering begins once you run the first resilience assessment in <span>Resilience Hub</span>. Remember that <span>Resilience Hub</span> might provision services for you, such as <a href=\"https://aws.amazon.com/cloudwatch/\">CloudWatch</a> alarms, so additional charges might apply. Visit the <a href=\"http://aws.amazon.com/resilience-hub/pricing\">pricing page</a> to get the details.</p> \n<p>Let us know your feedback and <a href=\"http://aws.amazon.com/resilience-hub\">build your first resilience dashboard today</a>.</p> \n<a href=\"https://twitter.com/sebsto\">-- seb</a>","author":"Sébastien Stormacq","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"f761b3ab339a2243efc8919981fc26da7fc1b87d729b3d2a7f3b84aefc1bf96d","category":"Tech"}