{"title":"Impact of turbidity on the gill morphology and hypoxia tolerance of eastern sand darter (Ammocrypta pellucida)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15679?af=R","date":1719289824000,"content":"<h2>Abstract</h2>\n<p>Anthropogenic stressors such as agriculture and urbanization can increase river turbidity, which can negatively impact fish gill morphology and growth due to reduced oxygen in the benthic environment. We assessed the gill morphology, field metabolic rate (FMR), and two hypoxia tolerance metrics (oxygen partial pressure at loss of equilibrium, PO<sub>2</sub> at LOE, and critical oxygen tension, <i>P</i>\n<sub>crit</sub>) of eastern sand darter (<i>Ammocrypta pellucida</i>), a small benthic fish listed as threatened under the <i>Species at Risk Act</i> in Canada, from rivers in southern Ontario. Field trials were conducted streamside in the Grand River (August 2019; mean NTU 8) and in the comparatively more turbid Thames River (August 2020; mean NTU 94) to test the effect of turbidity on each physiological endpoint. Gills were collected from incidental mortalities and museum specimens, and were assessed using hematoxylin and eosin and immunofluorescent staining. The between-river comparison indicated that turbidity significantly increased interlamellar space and filament width but had no significant influence on other gill morphometrics or FMR. Turbidity significantly increased PO<sub>2</sub> at LOE (i.e., fish had a lower hypoxia tolerance) but did not significantly impact <i>P</i>\n<sub>crit</sub>. Therefore, although turbidity influences hypoxia tolerance through LOE, turbidity levels were not sufficiently high in the study rivers to contribute to measurable changes in gill morphology or metabolism in the wild. Determining whether changes in gill morphology or metabolism occur under higherturbidity levels would help resolve the ecological importance of turbidity on species physiology in urban and agricultural ecosystems.</p>","author":"Britney L. Firth, \nPaul M. Craig, \nD. Andrew R. Drake, \nMichael Power","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"f769cb3f4c803b5cfba9dd4cd1e09c17b7a66f8dffd0f40ef63ae6615ff3b61c","category":"Environment"}