{"title":"PSVIII-12 Nutrient digestibility, production performance, and eggshell calcium and phosphorus levels of White Leghorn hens fed ahiflower press cake and micronized seed","link":"https://academic.oup.com/jas/article/102/Supplement_3/594/7757690?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Laying hens can benefit from dietary inclusions of oil seeds and their co-products such as ahiflower seeds and ahiflower press cake as sources of energy and nutrients. However, the type and inclusion level of the ahiflower product to achieve these beneficial effects is yet to be investigated. This study aims to determine the effect of ahiflower seed and press cake on production performance, nutrient digestibility, and eggshell calcium (Ca) and phosphorus (P) contents in laying hens. A total of 240 64-week-old Lohman LSL-Lite laying hens were randomly allotted to 1 of 8 treatments for 3 periods (4 weeks/period). The experiment was a completely randomized design with six replicate cages/treatment and 5 hens/cage. The treatments included a control diet (CD), or CD supplemented with 10% Flaxseed as a reference oilseed diet (FS), 1%, 5%, and 10% micronized ahiflower seed (AS), and 5%, 10%, and 15% ahiflower press cake (APC). Production performance was determined at the end of each period, while Ca and P concentrations in eggshell and nutrient digestibility were determined in the third period. Dietary treatment had no significant effect (<span>P</span> &gt;0.05) on eggshell P and Ca levels, body weight (BW), feed conversion ratio (FCR), and hen-day production percentage (HDEP). Although feed intake (FI) was significantly reduced (<span>P</span> &lt; 0.05) in 15% APC when compared to CD, it was not different from 5 and 10% APC inclusion levels. Furthermore, FI and HDEP increased (<span>P</span> &lt; 0.05), while FCR and BW decreased (<span>P</span> &lt;0.05) along the periods. Compared to CD (2129kcal/kg), nitrogen corrected apparent metabolizable energy (AMEn) increased (<span>P</span> &lt; 0.05) in 10% FS (2754kcal/kg), 1% (2681kcal/kg), and 10% AS (2546kcal/kg) and 15% APC (2673kcal/kg). 10% APC (78.9) reduced (<span>P</span> &lt;0.05) P digestibility compared to 10%FS (85.5) and 1%AS (78.9). Calcium digestibility was higher (<span>P</span> &lt;0.05) in hens fed 10% FS (85.5) compared to 10%AS (63.0) and 5%,10% and 15%APC but similar to CD (83.4) and 1% (78.9) and 5%AS (65.3). In conclusion, dietary inclusion of up to 10% AS and 15% APC did not affect BW, FCR, and HDEP in older Lohman LSL-Lite laying hens. Also, AMEn and the digestibility of CP, Ca, and P were positively influenced by different inclusion levels of APC and AS.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f782b46e1da4de3855b2540a467d975d6c2ba9bc98312a5595cbff564aebcb4f","category":"Environment"}