{"title":"Stan Portus | A collision with a car has left me angrier than ever about cycling culture wars","link":"https://www.bikeradar.com/features/opinion/sunak-cycling-culture-wars-plan-for-motorists/","date":1695982299000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/09/GettyImages-1569116627-c587314.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/09/GettyImages-1569116627-c587314.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/GettyImages-1569116627-c587314.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/GettyImages-1569116627-c587314.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/GettyImages-1569116627-c587314.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/09/GettyImages-1569116627-c587314.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"LONDON, ENGLAND - AUGUST 1: A cyclist passes between planters blocking a road for cars in a low traffic neighbourhood (LTN) on August 1, 2023 in London, England. Prime Minister Rishi Sunak has called for a review of low traffic neighbourhoods (LTNs) in England, supporting drivers' concerns and sparking a debate on green policies. LTNs aim to reduce traffic, street crime and air pollution, but face criticism from some Conservative MPs who argue they impede motorists' freedom and cause congestion on other roads. (Photo by Carl Court/Getty Images)\" title=\"LONDON, ENGLAND - AUGUST 1: A cyclist passes between planters blocking a road for cars in a low traffic neighbourhood (LTN) on August 1, 2023 in London, England. Prime Minister Rishi Sunak has called for a review of low traffic neighbourhoods (LTNs) in England, supporting drivers' concerns and sparking a debate on green policies. LTNs aim to reduce traffic, street crime and air pollution, but face criticism from some Conservative MPs who argue they impede motorists' freedom and cause congestion on other roads.  (Photo by Carl Court/Getty Images)\" />                                            <p>Last Sunday was a perfect day for a bike ride. The weather was warm but not hot. The light golden and the air still. It was a glorious September day. I’d headed out for a ride along the roads around Epping Forest, a few miles out from where I live in East London.</p>\n<p>Coming back into the city, I felt rejuvenated from my ride – a rare feeling after the miserable weather we had through August and life getting in the way of cycling.</p>\n<p>But just a mile from my house, I collided with a car that had pulled out of a parking space on the right-hand side of the road and was blocking my lane.</p>\n<p>Before I knew what was happening, I was flying across the bonnet of the car. I don’t know how long I was airborne, or how exactly I hit the ground. But I knew my face was covered in blood, my lip instantly swollen and my bike had landed further up the road from me.</p>\n<p>I curled up into a ball on the road, waiting for the stars in my vision to pass, asking the driver of the car, and a bus driver who had run over, to call an ambulance.</p>\n<p>I was incredibly lucky. The paramedics who turned up at the scene said I didn’t have to go to the hospital. I didn’t need stitches. I hadn’t broken anything, despite my face being lacerated. Even my kit remained intact, with no tears or rips. I honestly can’t believe it.</p>\n<p>But since the crash, I’ve felt angry. Not at what happened exactly, but at the fact that as a cyclist you are so unprotected on the road.</p>\n<p>I am angry because we need better infrastructure for cycling; because we do not have what’s needed to keep us safe.</p>\n<h2>‘What if’</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Commuters cycle in front of a bus in The City of London, UK, on Monday, Aug. 14, 2023. Average earnings excluding bonuses rose 7.3% in the year through June, only slightly less than the 7.9% rate of consumer-price inflation, Bloomberg Economics predicts ahead of official labor market data due to be published on Aug. 15. Photographer: Jason Alden/Bloomberg via Getty Images\" title=\"Commuters cycle in front of a bus in The City of London, UK, on Monday, Aug. 14, 2023. Average earnings excluding bonuses rose 7.3% in the year through June, only slightly less than the 7.9% rate of consumer-price inflation, Bloomberg Economics predicts ahead of official labor market data due to be published on Aug. 15. Photographer: Jason Alden/Bloomberg via Getty Images\" />\n\n</div><div><figcaption><span><i></i> Cyclist fatalities are the lowest they’ve been in 30 years, but there’s still so much work to be done.</span></figcaption><span> <i>Jason Alden/Bloomberg via Getty Images</i></span></div>\n<p>Part of what stimulated this anger and these thoughts was a simple game of what if: what if I had left the house later or earlier, not stopped at certain points on my ride, or carried on at others?</p>\n<p>What if the road I was cycling along when the collision happened had a cycle lane? What if the likelihood of me negotiating that space on the road with a car had been reduced?</p>\n<p>Transport for London (TfL) published its <a href=\"https://content.tfl.gov.uk/casualties-in-greater-london-2022.pdf\" target=\"_blank\">official road safety data for 2022</a> in May, showing that 101 people lost their lives on the roads of the city, and seven of those were cyclists.</p>\n<p>TfL says fatalities on London roads were up 35 per cent compared to 2021. However, it highlights fatalities were down 18 per cent and 58 per cent when compared to the averages of 2017-19 and 2005-2009 respectively, periods not “heavily affected by pandemic restrictions and changes to travel plans”.</p>\n<p>The charity Cycling UK has also shared that cyclist fatalities hit the lowest number in 30 years in 2022, with a 24 per cent drop in the rate of cyclist fatalities per billion miles cycled in 2022 compared to pre-pandemic levels.</p>\n<p>Cycling UK believes a number of initiatives, such as liveable neighbourhoods and updates to the Highway Code, may be part of the reason behind the decrease in cyclist fatalities.</p>\n<p>Sarah Mitchell, Cycling UK’s chief executive, said at the news of this 30-year low: “These figures prove the tragic death toll on our roads isn’t inevitable.”</p>\n<p>“Proving cause and effect is always difficult, but over the last two years, a number of measures have been introduced to make roads safer, such as an updated Highway Code, wider roll-out of 20mph zones, and interventions to reduce through traffic in residential areas. It is likely a combination of these contributed to last year’s reduction in cyclist deaths,” Mitchell added.</p>\n<p>Despite these promising figures, cyclists are still over-represented in fatalities and injuries on the road. To combat this, Cycling UK says we need the infrastructure to keep cyclists – and pedestrians – safe. This is a view shared by TfL in its road safety data report, where it says “clearly there is a need to continue to roll-out safe cycle infrastructure”.</p>\n<h2>The culture war is blood-boiling</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"LONDON, UNITED KINGDOM - 2023/09/23: A protestor holds a placard during the ULEZ Protest. Protesters against Ultra Low Emission Zone (ULEZ) expansion brought traffic to a standstill as they demonstrated against the expansion of London's Ultra Low Emission Zone. Drivers in outer London pay a £12.50 daily fee if their vehicles do not meet required emissions standards. (Photo by Loredana Sangiuliano/SOPA Images/LightRocket via Getty Images)\" title=\"LONDON, UNITED KINGDOM - 2023/09/23: A protestor holds a placard during the ULEZ Protest. Protesters against Ultra Low Emission Zone (ULEZ) expansion brought traffic to a standstill as they demonstrated against the expansion of London's Ultra Low Emission Zone. Drivers in outer London pay a £12.50 daily fee if their vehicles do not meet required emissions standards. (Photo by Loredana Sangiuliano/SOPA Images/LightRocket via Getty Images)\" />\n\n</div><div><figcaption><span><i></i> Rishi Sunak is expected to lean into the motorists’ agenda after the Conservatives’ narrow win in the Uxbridge by-election.</span></figcaption><span> <i>Loredana Sangiuliano/SOPA Images/LightRocket via Getty Images</i></span></div>\n<p>This is why the recent funding cuts, debates and culture wars around cycling are so blood-boiling.</p>\n<p>In March, the government announced cuts to cycling, which included a reduction of funding for cycle lanes and other infrastructure by 75 per cent in England, from £200 million per year to £50 million.</p>\n<p>Since then, Prime Minister Rishi Sunak has whipped up a culture war around transport, ordering a review of Low Traffic Neighbourhoods and not supporting the expansion of London’s ultra-low emission zone (Ulez).</p>\n<p>The Conservatives’ narrow win in the Uxbridge by-election was seen as helped by residents’ opposition to the expansion of Ulez by London’s Labour mayor Sadiq Khan. The winner of the by-election, Steve Tuckwell, campaigned not as Conservative but as the “anti-Ulez candidate”.</p>\n<p>Now, Sunak’s “<a href=\"https://www.theguardian.com/politics/2023/sep/28/rishi-sunak-expected-to-limit-powers-of-councils-in-england-to-curb-car-use-20mph-speed-limit-traffic-camera-fines\" target=\"_blank\">plan for motorists</a>” is expected to limit the number of 20mph speed restrictions and favour drivers over bus passengers.</p>\n<p>In large part, these acts have been criticised on environmental grounds, and as I have written before, the prioritisation of cars and other vehicles over active transport is <a href=\"https://www.bikeradar.com/features/opinion/powering-up-britain-electric-cars/\">a blow to our chances of reaching net zero</a>.</p>\n<p>But there is also a question of safety. While TfL says cycling in the UK’s capital is much safer now, “cars continued to be the main vehicle type involved in collisions in 2022” and “speeding remains the biggest risk to road users with around half of the 2022 fatal collisions in London (48 out of 99) reporting speed as a contributory factor”.</p>\n<p>Pandering to the demands of motorists in a bid to win votes and cutting off funds for cycling will likely make travelling by bike a less appealing and more dangerous activity, undoing the work that has been done to make cycling safer.</p>\n<p>I was lucky. But others may not be as lucky as I.</p>\n<p> </p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f782c6b0b302fd494b7fcdaf543bef18778e0b490e5281d29e136fd2d710b260","category":"Cycling"}