{"title":"Diversity, habitat and activity patterns of mesocarnivore assemblages in an Afrotropical protected forest savannah mosaic of Central Cameroon","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13283?af=R","date":1718040507000,"content":"<h2>Abstract</h2>\n<p>Little is known about the diversity and ecology of mesocarnivores in the Mpem and Djim National Parks in central Cameroon. Therefore, we undertook a rapid assessment using camera traps from September 2021 to December 2021. The main objective of our study was to collect data on the diversity, abundance and relative frequency of mesocarnivores per habitat type and their activity period using camera traps with a distance sampling method. In 1700 trap nights, we recorded 53 events of seven mesocarnivores, all belonging to the family of Viveridae, Herpesdidae and Felidae which yield 3.12 mesocarnivores per 100 days. The black-legged mongoose (<i>Bdeogale nigripes</i>, Pucheran, 1855) exhibited the highest capture rate (CR, 0.88). The long-nosed mongoose (<i>Xenogale naso,</i> Winton, 1901) was found in all habitats class and was the more active mesocarnivore. The Shannon-Weaver diversity index (H) showed a high diversity of species in the community with high diversity in the near primary forest. We obtained a lower dominance of one species over the other, a lower richness and a more even distribution of species between habitats. Our results suggest a possible spatio-temporal niche partitioning between the species recorded, with blotched genet <i>(Genetta maculata,</i> Gray, 1830), showing no clear peak of activity. However, the rarefaction curve indicates that the effort expended was insufficient, suggesting that additional sampling is required to obtain a reasonable estimate of species richness within our community. The activity patterns of the recorded mesocarnivores were generally similar to those reported elsewhere but suggest some behavioural flexibility. Although all these species are listed as Least Concern by the IUCN, the low number of recorded events may indicate that mesocarnivores may be threatened in this area if effective conservation strategies are not implemented.</p>\n<h2>Résumé</h2>\n<p>La diversité et l'écologie des mésocarnivores dans le parc national de Mpem et Djim, au centre du Cameroun, sont peu connues. Par conséquent, nous avons entrepris une évaluation rapide à l'aide de pièges photographiques de septembre 2021 à décembre 2021. L'objectif principal de notre étude était de collecter des données sur la diversité, l'abondance et la fréquence relative des mésocarnivores par type d'habitat et leur période d'activité en utilisant des pièges photographiques avec une méthode d'échantillonnage à distance. En 1700 nuits de piège, nous avons enregistré 53 événements de sept mésocarnivores, tous appartenant à la famille des Viverridés, des Herpestidés et Félins, ce qui donne 3.12 mésocarnivores pour 100 jours. La mangouste à pattes noires (<i>Bdeogale nigripes</i>, Pucheran, 1855) a présenté le taux de capture le plus élevé (CR, 0.88). La mangouste à long museau (<i>Xenogale naso</i>, Winton, 1901) a été observée dans toutes les classes d'habitats et était le mésocarnivore le plus actif. L'indice de diversité de Shannon-Weaver (H) a révélé une grande diversité d'espèces dans la communauté, avec une grande diversité dans la forêt primaire environnante. Nous avons obtenu une moindre dominance d'une espèce par rapport à l'autre, une moindre richesse et une répartition plus homogène des espèces entre les habitats. Nos résultats proposent une répartition spatio-temporelle possible des niches entre les espèces recensées, la genette panthère (<i>Genetta maculata</i>, Gray, 1830) ne présentant pas de pic d'activité clair. Cependant, la courbe de raréfaction indique que l'effort déployé était insuffisant, ce qui suggère qu'un échantillonnage supplémentaire est nécessaire pour obtenir une estimation raisonnable de la richesse des espèces au sein de notre communauté. Les schémas d'activité des mésocarnivores recensés étaient généralement similaires à ceux rapportés ailleurs, mais indiquent une certaine flexibilité comportementale. Bien que toutes ces espèces soient classées dans la catégorie « préoccupation mineure » par l'UICN, le faible nombre d'événements enregistrés peut indiquer que les mésocarnivores peuvent être menacés dans cette zone si des stratégies de conservation efficaces ne sont pas mises en œuvre.</p>","author":"Ernest D. B. Fotsing, \nMeigang M. F. Kamkeng, \nSalah Marcel Senge, \nDietmar Zinner","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"f78af59a5995e6bbd95e9e236074e9fccebb2fcc7ccf87e158436bb539624634","category":"Environment"}