{"title":"Top Stories: iPhone 15 Pro Overheating Fix, Apple Watch Double Tap, and More","link":"https://www.macrumors.com/2023/10/07/top-stories-iphone-15-pro-overheating-fix/","date":1696683600000,"content":"After a few weeks of controversy over potential overheating in the new iPhone 15 Pro models, Apple this week released a software update to help address the issue, which the company says is not the result of the new titanium casing or other thermal design problems.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/top-stories-7oct2023.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nApple is also continuing work on the next round of more significant software updates led by iOS 17.1, and we're keeping tabs on everything that's new. Notably, the latest watchOS 10.1 beta enables the Double Tap feature that was one of the main promotional selling points of the latest Apple Watch Series 9 and Apple Watch Ultra 2 models, so read on for all the details on these stories and more! \r<br />\n\r<br />\n<h2>Apple Releases iOS 17.0.3 With Fix for iPhone 15 Pro Overheating</h2>\r<br />\nApple this week <a href=\"https://www.macrumors.com/2023/10/04/apple-releases-ios-17-0-3/\">released iOS 17.0.3 with a fix</a> for an issue that may cause the iPhone 15 Pro models to run warmer than expected. The software update also includes several <a href=\"https://www.macrumors.com/2023/10/04/ios-17-0-3-enterprise-bug-fixes/\">enterprise-related bug fixes</a> and important security updates, according to Apple.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/iOS-17.0.3-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nApple said the iPhone 15 Pro's titanium frame was <a href=\"https://www.macrumors.com/2023/09/30/apple-iphone-15-pro-overheating-details/\">not a contributing factor to the overheating</a>, and it said the software update does not lower the A17 Pro chip's performance to address the issue.\r<br />\n\r<br />\n<h2>iOS 17.1 Beta: All the New Features So Far</h2>\r<br />\nApple this week made the <a href=\"https://www.macrumors.com/2023/10/04/ios-17-1-public-beta-2/\">second beta of iOS 17.1</a> available to developers and public beta testers, and there are some new features as usual.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/iOS-17.1-On-iPhone-15-Feature-2.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nWe've put together a list of <a href=\"https://www.macrumors.com/guide/ios-17-1-beta-features/\">all of the new features and changes introduced in the iOS 17.1 betas so far</a>. The software update is expected to be released later this month for the iPhone XS and newer, so there are likely still a few more beta versions to come.\r<br />\n\r<br />\n<h2>Warning: BMW Wireless Charging May Break iPhone 15's Apple Pay Chip</h2>\r<br />\nIf you have an iPhone 15 and drive a BMW, it might be best to avoid charging the device with the vehicle's wireless charging pad for now.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/BMW-Logo-iPhone-15-Pro.jpg\" alt width=\"1489\" height=\"744\" />\r<br />\nOver the past few weeks, some BMW owners have complained that their <a href=\"https://www.macrumors.com/2023/10/01/bmw-charging-may-break-iphone-15-nfc-chip/\">iPhone 15's NFC chip no longer works after charging the device</a> with their vehicle's wireless charging pad. It's unclear if the issue has been resolved with iOS 17.0.3 or the iOS 17.1 beta.\r<br />\n\r<br />\n<h2>watchOS 10.1 Beta 2 Adds Support for Double Tap</h2>\r<br />\nThe new Double Tap gesture for the Apple Watch Series 9 and Apple Watch Ultra 2 is <a href=\"https://www.macrumors.com/2023/10/03/watchos-10-1-double-tap-support/\">functional starting with the second beta of watchOS 10.1</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/apple-watch-ultra-double-tap-feature-green.jpg\" alt width=\"2210\" height=\"1243\" />\r<br />\nDouble Tap lets you <a href=\"https://www.macrumors.com/2023/10/04/new-apple-watch-double-tap-gesture/\">tap your index finger and thumb together twice</a> to perform common actions on the Apple Watch, such as stopping a timer, playing and pausing music, snoozing an alarm, answering and ending a phone call, and more, all without touching the screen.\r<br />\n\r<br />\n<h2>Original Apple Watch is Now Obsolete, Including $17,000 Gold Model</h2>\r<br />\nAll first-generation Apple Watch models released in 2015 have now been declared obsolete by Apple, meaning they are no longer eligible for repairs or other service at Apple Stores and Apple Authorized Service Provider locations.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/Apple-Watch-Edition-Gold-2015-Feature.jpg\" alt width=\"2117\" height=\"1191\" />\r<br />\nThis includes the original 18-karat gold Apple Watch Edition model which sold for up to $17,000 at launch. The solid-gold Apple Watch option was discontinued in 2016 and replaced with more reasonably priced but still premium-priced Apple Watch Edition models made with cermamic or titanium for future years.\r<br />\n\r<br />\n<h2>How to Get the Most Out of the iPhone 15 Pro's Action Button</h2>\r<br />\nOn our YouTube channel, we recently shared a video highlighting some <a href=\"https://www.macrumors.com/2023/10/03/iphone-15-pro-action-button-tools/\">useful ways to take advantage of the customizable Action button</a> on the iPhone 15 Pro and iPhone 15 Pro Max.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/Best-Shortcuts-You-Need-to-Try-Thumb-2.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nFor example, Federico Viticci of <em>MacStories</em> came up with a way for two separate shortcuts to be assigned to the Action button. He calls this solution MultiButton, and we provide a closer look at it in our video.\r<br />\n\r<br />\n<h3>MacRumors Newsletter</h3>\r<br />\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r<br />\n\r<br />\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/oct-5-2023\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/07/top-stories-iphone-15-pro-overheating-fix/\">Top Stories: iPhone 15 Pro Overheating Fix, Apple Watch Double Tap, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-iphone-15-pro-overheating-fix-apple-watch-double-tap-and-more.2406703/\">Discuss this article</a> in our forums<br /><br />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f790f26f0fa734c33c8039b77eea051e37c3a589daa48ed737dd87dec31b0bc3","category":"Apple"}