{"title":"354 Zinc supplementation prior to transit and transit duration effects on feedlot performance and muscle fatigue of beef steers: Part II – Feeding Behavior","link":"https://academic.oup.com/jas/article/102/Supplement_3/368/7757504?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This study assessed the effects of supplemental Zn on cattle feeding behavior after varying transit duration. Angus crossbred steers (80; 265 ± 18 kg) were used in a 2 × 2 factorial design. Steers were assigned to a dietary Zn treatment (DIET) and transit duration (DUR; d 0): Zn0 (no supplemental Zn) or Zn100 (100 mg Zn/kg DM; supplemented as ZnSO<sub>4</sub>, starting d -42 relative to transit) and short duration (8H; 8 h transit; 707 km) or long duration (18H; 18 h transit; 1608 km). Steers were fed ad libitum via GrowSafe bunks (GrowSafe Systems Ltd., Airdrie, AB, Canada), and steer was experimental unit (n = 1 bunk/pen; n = 5 steers/pen). On d 0, steers were stratified to trailer compartments across diets. The 8H and 18H groups departed at 1000 and 1300 h and returned at 1800 and 0700 h to pre-transit pens, respectively. Following transit, all steers received Zn100. Utilizing GrowSafe Behavior module, a feed event was characterized as a reading with &lt; 300 s interruption with head down (FE-HD; recorded in seconds) and count (number of HD events). Intake rate (g/s) was feed consumed per FE-HD divided by FE-HD duration. Data for the 6-d post transit were analyzed as a complete randomized design utilizing PROC MIXED of SAS 9.4 (SAS Inst. Inc., Cary, NC) with fixed effects DIET, DUR, and DAY as repeated. Pre-transit values served as a covariate. During the week prior to transit, there was a DUR effect for FE-HD average and intake rate (<span>P</span> ≤ 0.03) where 8H had longer FE-HD but reduced intake rate than 18H. There was also a tendency for Zn100 to consume more feed per FE pre-transit (<span>P</span> = 0.07). Post-transit, both average intake and FE-HD average increased with days post-transit (DAY; <span>P</span> ≤ 0.01). Additionally, a DIET × DUR effect was observed for FE-HD count (<span>P</span> = 0.01) where 100 was greater than 0 within 18H and 0 was greater than 100 in 8H. A tendency for a TRT × DAY effect was noted for FE-HD count (<span>P</span> = 0.07) driven by Zn0 decreasing from d 3 to 4. A DUR × DAY effect (<span>P</span> = 0.02) was also noted for FE-HD count where 18H was greater on d 2, 4, and 5. A DUR × DAY effect was observed for FE-HD average (<span>P</span> = 0.01) driven by a d 3 difference where 8H was greater than 18H. Conversely, a DUR × DAY effect was observed for intake rate (<span>P</span> = 0.01) where 18H was greater on d 2, 3, and 6. These data indicate both transit duration and dietary Zn concentration influenced animal behavior post-transit.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f793e060c7f622687c1fb0c5e37dd6176765bd99dbab5f8cac6afc5deb4edb25","category":"Environment"}