{"title":"Immunohistochemical Analysis of Dentigerous Cysts &amp; Odontogenic Keratocysts Associated with Impacted Third Molars: A Systematic Review","link":"https://www.preprints.org/manuscript/202405.1457/v1","date":1716425726000,"content":"Objective: This systematic review investigates the diagnostic, prognostic, and therapeutic implications of immunohistochemical markers in dentigerous cysts (DC) and odontogenic keratocysts (OKC) associated with impacted third molars. Materials and Methods: A comprehensive search strategy was employed across major databases including MEDLINE/PubMed, EMBASE, and Web of Science, from the inception of the databases to March 2024. Keywords and Medical Subject Heading (MeSH) terms such as \"dentigerous cysts,\" \"odontogenic kerato-cysts,\" \"immunohistochemistry,\" \"Ki-67,\" and \"p53\" were used. The PRISMA 2020 guidelines were followed to ensure methodological rigor. Inclusion criteria encompassed studies on humans and animals providing de-finitive diagnoses or specific signs and symptoms related to DC and OKC, with results on protein expression derived from immunohistochemistry, immune antibody, proteomics, or protein expression methods. Results: Of the 159 studies initially identified, 138 met the inclusion criteria. Our analysis highlighted sig-nificantly higher expressions of Ki-67 (22.1% ± 4.7 vs. 10.5% ± 3.2, p &lt; 0.001), p53 (15.3% ± 3.6 vs. 5.2% ± 1.9, p &lt; 0.001), and Bcl-2 (18.4% ± 3.2 vs. 8.7% ± 2.4, p &lt; 0.001) in OKCs compared to DCs, indicating a higher proliferative index, increased cellular stress, and enhanced anti-apoptotic mechanisms in OKCs. Ad-ditionally, PCNA levels were higher in OKCs (25.6% ± 4.5 vs. 12.3% ± 3.1, p &lt; 0.001). Genetic mutations, particularly in the PTCH1 gene, were frequently observed in OKCs, underscoring their aggressive behavior and potential malignancy. Conclusion: The findings emphasize the significant role of immunohistochemical markers in distinguishing between DCs and OKCs, with elevated levels of Ki-67, p53, Bcl-2, and PCNA in OKCs suggesting a higher potential for growth and recurrence. Genetic insights, including PTCH1 mutations, further support the need for personalized treatment approaches. These markers enhance diagnostic accuracy and inform targeted thera-peutic strategies, potentially transforming patient management in oral and maxillofacial surgery.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f7984e9c4a6b57e6ef65d55ab875305d1c614a5769cf369b544ac892657214c4","category":"Interdisciplinary"}