{"title":"The Big Issue: life as a plus-size female cyclist","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-big-issue-life-as-a-plus-size-female-cyclist","date":1628100756000,"content":"\n      <p><span>I don’t remember a time when I wasn’t overweight. My weight has never defined me, though — the numbers on my clothes that determine what ‘size’ society thinks I am aren’t important to me. They don’t make me a better or worse person, but they’ve made me feel like I was unworthy and undeserving of exercise.</span></p>\n<p><span>Growing up, I adored cycling. I remember squealing with pleasure as a child when my parents removed my stabilisers for the first time, and pushed me off. My love affair continued on into my studies for my A-Levels, where I used to cycle to the nearest country park to clear my head of the encroaching demons. </span></p>\n<div></div>\n<p><span>I’ve never seen my bike as just a two-wheeled transportation device, I’ve seen it as key to human contact. To me, it has been about making new friendships – and strengthening the old ones. It’s been about pedalling towards someone injured on the side of the dirt track to help them back to their feet, and even about fleeing from heartbreak or grief. Cycling felt like pure unadulterated freedom.</span></p>\n<p><span>Except, to other people my weight was seen as a hindrance — and, to an extent, it still is. The first time I was met with fat-phobia in cycling was when I signed up for a 60-mile charity bike ride as a teenager. Eyes darted up and down my size 14 body, with thick thighs and a 34DD chest, in sheer disbelief. “Are you sure you’ll manage?” they’d laugh. While training, I’d be regularly reminded just how far 60 miles was. My slim friend who was doing the ride with me never received the same treatment.</span></p>\n<p><span>On the day, I felt like I was woefully unprepared. Thinking back, I truly believe that the comments I got from other people – however harmless they were supposed to be – were branded onto my brain, and for the first time I felt like I couldn’t do it.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Roleur_Life-as-a-Plus-Sized-Female-Cyclist_Illu-1_Aleyna-Moeller_adjusted-03.12.2020_f1182e16-1511-4cb2-830c-d0040e854b1d_1024x1024.jpg?v=1628070273\" /></span></p>\n<p><span>On the first hill, within half an hour, I was battling against the wind and my race number blew off. As it danced away into the distance, I wanted to give up. I pulled over and went to call my dad to come and pick me up – but I saw my friend cycling back down the hill towards me in a whirlwind of colour and sheer ecstasy. Suddenly, I had an overwhelming urge to get back on my bike to experience that powerful childish fun of overcoming something difficult on two wheels. </span></p>\n<p><span>I would be lying if I said the race was easy; it was probably the hardest thing I’ve ever done. We experienced extremes in weather – from blazing sunshine to torrential rain on a miserable stretch of dual carriageway – and ended up sacrificing a good finishing time to help someone hurt by the side of the road.</span></p>\n<p><span>I was so proud of my body for enduring such gruelling treatment, but my head ended up winning. I couldn’t shake off the raised eyebrows and the slack jaws of surprise. The boggling eyes of strangers at the sight of my chunky thighs in cycling shorts followed me everywhere. As did the whispers or the sound of suppressed laughter as I cycled past groups of both men and (sadly) women. It was the same if I ever fancied a jog to clear my head – I’d be told by strangers in passing cars that I was fat. Mums with prams cocked their heads at me, as if in sympathy, encouraging me to keep going.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/desire-journal/the-best-womens-summer-cycling-jerseys\">Related: best women's summer cycling jerseys</a></em></strong></p>\n<p><span>I’m ashamed to say it, but I gave up. I was sick of being treated differently. I was defeated and resigned to the fact that I simply shouldn’t exercise because I was just too big. I locked my bike up in the family shed and it has never resurfaced. The pool of memories from childhood, my teenage friendships (and love affairs) was left to dry up.</span></p>\n<p><span>In the following years, I would say that my relationship with exercise was toxic. I binged food when I was in extreme emotional states and then became addicted to intense workout sessions before my poor self-esteem overwhelmed me in order to start the vicious circle again. </span></p>\n<p><span>Whenever I got back on exercise bikes in the gym, I was transported back to my teenage years. I was convinced that people were staring at me – scrutinising my form, what I was wearing and if it was too tight; or whether I was trying too hard, or not hard enough. I was worried about breathing too loud incase people thought I was unfit or leaving damp patches on the seat.</span></p>\n<p><span>I lived by and practised the belief that big girls like me simply shouldn't exercise, that it was unnatural. That there was absolutely no way that people who are deemed overweight by society's standards can enjoy a bike ride, or any form of exercise, without being judged. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Roleur_Life-as-a-Plus-Sized-Female-Cyclist_Illu-2_Aleyna-Moeller_adjusted-01.12.2020_3ac47680-8155-419e-abc4-2a166c106900_1024x1024.jpg?v=1628070297\" />That continued up until the summer of 2019, when I was on my honeymoon. My husband and I hired bikes in Vancouver and San Francisco after being told that the cycling tracks there were astoundingly beautiful. On both occasions, I got offered what they had labelled a man's bike because of the shop worker's assumption of my weight. I was gently reminded that I needed low-to-medium fitness because there were “a few tricky inclines”. I remember smiling and biting my tongue at the time, but inside I was mortified. On the surface they acted like they meant well, but it hurt. I felt their eyes boring into my body, while they welcomed my slim husband with open arms.</span></p>\n<p><span>It’s only been recently that I realised that other people’s expectations of me weren’t going to change. The notion that being plus-sized, or over the deemed average weight, is wrong has been ingrained in us since childhood — for decades.</span></p>\n<p><span>We’re led to believe that people who are indeed bigger choose to be, and they don’t deserve any form of exercise unless it is to lose weight to fit into the mould that has been cast for us by years of ill judgement and prejudice. Therefore, I needed to change the belief that I held for myself because no one was going to do it for me. I thought of myself as a child, teetering on the back of a bike and being blissfully unaware of what life had planned for me. I wanted to get back to unashamedly riding my bike — and do it for me.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-v-word\">Related: The V-Word, why we need to talk about saddle discomfort</a></em></strong></p>\n<p><span>In lockdown, due to the pandemic, I’ve had the courage to own a bike again — a Pendleton Somerby Hybrid Bike, with a 17” mint green frame. And she is beautiful. I’ve loved every minute turning the pedals and settling into my brown leather seat. A smile spreads across my face as I kick off and rush through the air. </span></p>\n<p><span>My return to cycling has helped me cope with my mental health. It has lifted me up after a bad day, it’s helped me (safely) link up with friends who are just that little too far away. I’ve fallen in love with it all over again, aged 27.</span></p>\n<p><span>Yes, I still get the odd looks if I cycle in shorts, or if I’m red-faced and sweating, but instead of lowering my eyes, I smile. I’ve reached my own version of happiness, and I’m sure they still have a long way to go to achieve theirs.</span></p>\n<p><span>Now, I have a beautiful bike to match how I think of myself, of my body, and I see many young girls pointing at it as I cycle past. I see them tapping their mums on the leg, whispering to them and smiling. I hope it makes them realise that when they grow up they can be “big” and cycle, too. Just like the little squealing girl I used to be and the grown female cyclist I am now. </span></p>\n<p><em><span>The Big Issue first appeared in Rouleur Issue 101, available to purchase <a href=\"https://www.rouleur.cc/collections/rouleur-magazine/products/issue-101-womens-special\">here</a></span></em></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f7a20a746fea9f2e5704dc7efaed15efcd14d3ba95a976deae58a04d4e056622","category":"Cycling"}