{"title":"Model-Free Adaptive Sliding Mode Control of Shape Memory Alloy Actuated Parallel Platform","link":"https://www.preprints.org/manuscript/202404.0596/v1","date":1712653271000,"content":"This paper addresses the input coupling problem for the shape memory alloy (SMA) actuated parallel platform with completely unknown nonlinear dynamics. The problem means that in a parallel platform with multiple SMA actuators acting together, the displacement of one of the actuators will simultaneously affect the remaining actuators to change. Due to the coupling problem and nonlinear characteristics of the SMA actuators, it is not easy to control the platform to achieve bi-directional swing with completely unknown nonlinear dynamics. Therefore, a model-free adaptive sliding mode control method is proposed to improve the control accuracy of the complex motion of the platform, avoiding the complex modeling process of the SMA actuated parallel platform. Based on the model-free adaptive control (MFAC) theory, a multiple input and multiple output (MIMO) dynamic linearized mathematical model of the parallel platform is established using the online input and output data of the system. Then, a sliding mode controller is designed based on the dynamic model. A rigorous theoretical analysis proves that the proposed model-free adaptive sliding mode controller is able to stably control the SMA actuated parallel platform, and its tracking error is uniformly ultimately bounded (UUB). Finally, experiments are conducted on the established SMA actuated parallel platform. The results show that the proposed model-free controller is feasible and effective, and can control the system well to achieve the complex motion of bi-directional swing.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f7ab16e1678a7f3b005cd6895f99becf743a9a68e8b2328c1976510bc672fd7b","category":"Interdisciplinary"}