{"title":"Finding an Unique and &ldquo;Natural&rdquo; Extension of the Expected Value That Takes a Finite Value for All Functions in Prevalent Subset of the Set of All Functions","link":"https://www.preprints.org/manuscript/202307.0560/v9","date":1702458775000,"content":"Suppose for n∈ ℕ, set A⊆ℝⁿ and function f∶A→ℝⁿ. If set A, using the Hausdorff outer measure, is measurable in the sense of Carathèodory; we want to find an extension of the expected value, w.r.t the Hausdorff measure, that's unique, finite and \"natural\" (defined on §2.3 &amp; §2.4) for all f in a prevalent subset of ℝᴬ. The issue is current extensions of the expected value are finite for all functions in only a shy subset of ℝᴬ. The reason this issue wasn't resolved is mathematicians have not thought of the problem, focusing on application rather than generalization. Despite the lack of potential use, we'll attempt to solve the problem by defining a choice function---this shall choose a unique set of equivalent sequences of sets (Fₖ***) , where the set-theoretic limit of Fₖ*** is the graph of f; the measure Hʰ is the ℎ-Hausdorff measure, such for each k∈ℕ, 0 &lt; Hʰ(Fₖ***) &lt; +∞; and (fₖ*) is a sequence of functions where {(x,fₖ*(x))∶x∈ dom(Fₖ***)}=Fₖ***. Thus, the extended expected value of or E**[f,Fₖ***] is: ∀(ε&gt;0)∃(N∈ℕ)∀(k∈N)(k≥N⇒1/Hʰ(dom(Fₖ***))∫dom(Fₖ*** )fₖ* dHʰ - E**[f,Fₖ***]&lt;ε ) which should be unique, finite, and \"natural\" (defined on §2.3 &amp; §2.4) for all f in a prevalent subset of ℝᴬ. Note we guessed the choice function using computer programming but we don’t use mathematical proofs due to the lack of expertise in the subject matter. Despite this, the biggest use of this research is the extension of the expected value is finite for \"almost all\" functions: this is easier to use in application when finding the \"average\" of functions covering an infinite expanse of space.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f7aefdc0f54b311f263b582b5cc23186d05f2ea6c569d66f82b15b63cd1983cb","category":"Interdisciplinary"}