{"title":"Effects of Adding Sphingomonas Z392 to Drinking Water on Growth Performance, Intestinal Histological Structure and Microbial Community of Broiler Chickens","link":"https://www.preprints.org/manuscript/202405.0735/v1","date":1715492662000,"content":"Probiotics have emerged as a prominent alternative to antibiotics in antimicrobial-free broiler farming. To assess the effect of the probiotics Sphingomonas sp. Z392 isolated and identified by this this laboratory on broiler growth, we conducted a study to examine the changes in broiler body weight, EPI, intestinal histological structure and gut microbiota. The results showed that supplementation of broiler drinking water with 4 × 105 CFU/mL of Sphingomonas resulted in an increase in the relative abundance of Lactobacillus, Bacteroides, Lachnospiraceae, Aminobacterium, Oribacterium, Christensenellaceae, Faecalibacterium, Barnesiella, Ruminococcus, Parabacteroides, Phascolarctobacterium, Butyricicoccaceae, and Caproiciproducens, which were reported to be positively correlated with the digestion and absorption of broiler chickens. The relative abundance was increased of Odoribacter, Alistipes, Parabacteroides, and Rikenellaceae, which were reported to be negatively correlated with the occurrence of intestinal diseases. The relative abundance was decreased of Campylobacter, Shigella Castellani, Bilophila, Campylobacter, Clostridia, and Anaerotruncus, which were reported positively correlated with the occurrence of intestinal diseases. At the same time, it was increased in the integrity of small intestinal villus morphology, the number of goblet cells in small intestinal epithelial cells, the health of mitochondria in the cytoplasm of jejunal villous epithelial cells, and the number of lysosomes in the cytoplasm of goblet cells in small intestinal epithelium, ileal villous epithelial cells, mitochondria in the cytoplasm of large intestinal villous epithelial cells, the VH/CD of the ileum, digestive, absorption, and defense capabilities. Especially the final weight was increased by 4.33% and the EPI increased by 10.10%. Therefore, the supplementation of broiler drinking water with Sphingomonas generated better economic benefits for the broiler chickens.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f7b342ce905263f39a07e210a6963f13d5687dec7a69b4da2d0d94bacdaac310","category":"Interdisciplinary"}