{"title":"Appeal for a Responsible (Sustainably Intensive) Agriculture","link":"https://www.preprints.org/manuscript/202403.1094/v1","date":1710834756000,"content":"In politics and society, organic farming is widely seen as the ideal way to address the many challenges facing agriculture and food security. In order to examine the extent to which this view is realistic, the impact of organic and conventional farming is compared on the basis of relevant criteria such as land requirements, greenhouse gas emissions, biodiversity, food quality, production and environmental costs, reduced meat consumption, the need for agricultural imports and the global expansion of arable land. Land is considered to be a central factor. Such a comprehensive analysis is necessary to assess the impact of different influencing factors and to provide important suggestions for targeted decision making. Although organic farming has a positive impact on land use in many ways, it quickly reaches its limits. The low yields and high production costs resulting from the limited choice of means of production make organic farming an unsuitable model for the future in a world with limited arable land, a high and growing demand for food, and low incomes for large sections of the population. It can, however, provide significant impetus and contribute important technological knowledge for the further development of agriculture as a whole to meet the complex objectives of sustainability, greenhouse gas mitigation, biodiversity and global food security by incorporating all available technologies. Based on this, a model for responsible, sustainable intensive agriculture is outlined and proposals for an eco-social framework to support this model are put forward.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f7bd92fee9b918beee5bb66432012074d09a5d82519c9c986e20b04009a82bb9","category":"Interdisciplinary"}