{"title":"Extraperitoneal Open Radical Cystectomy: A New Standard in Frail Patients with Muscle-Invasive Bladder Cancer?","link":"https://www.preprints.org/manuscript/202410.1452/v1","date":1729243561000,"content":"Background/Objectives: Radical cystectomy (RC) represents one of the most complex and morbid surgical procedures in Urology. Extraperitoneal open RC has emerged as an alternative to traditional transperitoneal approach for the treatment of muscle-invasive bladder cancer. Frailty is one of the most important risk factors for perioperative morbidity and mortality and this category of patients can benefit the most with the extraperitoneal approach. The purpose of this study was to evaluate the feasibility and the safety of extraperitoneal open RC in our experience; Methods: We retrospectively collected the data of 75 frail patients who underwent extraperitoneal open RC, performed by a single experienced surgeon. We assessed the frailty status using the simplified frailty index (sFI). We recorded data regarding general characteristics, intraoperative, pathological, postoperative complications and mortality (within 90 days); Results: We analyzed 61 men and 14 females with sFI equal or higher than 3. The median age was 77 years. Fifty-one patients had ASA score of 3 or more. Sixty procedures were with radical intention, while fifteen were palliative. Cutaneous ureterostomy was performed in 70 cases and extraperitonized ileal conduit in five cases. The median operative time was 150 minutes. The median blood loss was 400 mL. The median time up to flatus was 2 days. The median postoperative stay was 7 days. Thirteen patients had Clavien-Dindo 3 or 4 complications. Two patients died in first 90 days postoperatively; Conclusions: The extraperitoneal open RC in frail patients demonstrated to be a feasible and safe alternative approach in definitive or palliative setting in our experience.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f7be7837961030cfda1144511cd2054cbb4a74b745127ddcaba64d9445fca7c1","category":"Interdisciplinary"}