{"title":"X-ray “light echoes” hint at outburst from Milky Way’s central black hole","link":"https://arstechnica.com/?p=1949885","date":1687552749000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/05/eventTOP-800x800.jpg\" alt=\"This is the first image of Sgr A*, the supermassive black hole at the centre of our galaxy. It’s the first direct visual evidence of the presence of this black hole. It was captured by the Event Horizon Telescope (EHT).\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/05/eventTOP.jpg\">Enlarge</a> <span>/</span> This is the first image of Sgr A*, the supermassive black hole at the center of our galaxy. It’s the first direct visual evidence of the presence of this black hole. It was captured by the Event Horizon Telescope (EHT). (credit: EHT Collaboration)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It's probably not realistic to call a supermassive black hole \"quiet.\" But, as far as these things go, the one at the center of our galaxy is pretty quiet. Yes, it emits enough energy that <a href=\"https://arstechnica.com/science/2022/05/feast-your-eyes-on-the-first-image-of-the-black-hole-at-the-center-of-our-milky-way/\">we can image it</a>, and it occasionally gets a bit more active as it rips something nearby to shreds. But supermassive black holes in other galaxies power some of the brightest phenomena in the Universe. The object at the center of the Milky Way, Sgr A<sup>*</sup>, is nothing like those; instead, people get excited about <a href=\"https://arstechnica.com/science/2011/12/the-milky-ways-black-hole-may-spring-to-life-in-2013/\">the mere prospect</a> that it might wake from its apparent slumber.</p>\n<p>There's a chance that it was more active in the past, but any light from earlier events swept past Earth before we had observatories to see it. Now, however, scientists are suggesting they've seen echoes of light that might be associated with an Sgr A<sup>*</sup> outburst that took place about 200 years ago.</p>\n<h2>Looking for echoes</h2>\n<p>Audible echoes are simply the product of sound waves reflected off some surface. Light travels as a wave, as well, and it can reflect off objects. So, the basic idea of light echoes is a pretty straightforward extrapolation of these ideas. They may seem counterintuitive because, unlike sonic echoes, we never experience light echoes in normal life—light travels so fast that any echoes from the world around us arrive at the same time as the light itself. It all gets indistinguishable.</p></div><p><a href=\"https://arstechnica.com/?p=1949885#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1949885&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f7c4adbe10447392ad2d7d559b433b1b1c9aa8d342097f79287635c9afebc9a6","category":"Tech"}