{"title":"Amazon shifts launch of its first Internet satellites to Atlas V rocket","link":"https://arstechnica.com/?p=1959224","date":1691423951000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/atlas501-800x533.jpg\" alt=\"United Launch Alliance's Atlas 5 rocket, seen here in its &quot;501&quot; configuration without any solid rocket boosters. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/atlas501.jpg\">Enlarge</a> <span>/</span> United Launch Alliance's Atlas 5 rocket, seen here in its \"501\" configuration without any solid rocket boosters.  (credit: United Launch Alliance)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Amazon has confirmed it now plans to launch the first two test satellites for the company's Kuiper broadband network on a United Launch Alliance Atlas V rocket as soon as next month, shifting the payloads off of the inaugural flight of ULA's new Vulcan rocket.</p>\n<p>The shift has been rumored for several weeks after ULA delayed the first flight of its Vulcan rocket from the summer until the fourth quarter of the year. The delay will allow time for ULA to <a href=\"https://arstechnica.com/space/2023/07/ula-finds-root-cause-of-vulcan-failure-sets-path-toward-debut-launch/\">beef up the structure of the Vulcan upper stage's liquid hydrogen tank</a>, which sprang a leak that resulted in a destructive fireball on a test stand in March.</p>\n<p>The first Vulcan rocket was slated to launch the first two prototype satellites for Amazon's Kuiper constellation, a network of more than 3,200 broadband satellites that the retail and tech giant plans to deploy over the next few years. The Kuiper network is similar to SpaceX's Starlink \"mega-constellation,\" which already has more than 4,000 satellites in orbit.</p></div><p><a href=\"https://arstechnica.com/?p=1959224#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1959224&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f7c6eea7dd05e8005e9cbf8afa5f2c16e69bced3c17c3d4a0d4299ebb4369bba","category":"Tech"}