{"title":"Cutting‐edge technologies for detecting and controlling fish diseases: Current status, outlook, and challenges","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13051?af=R","date":1712550638000,"content":"<h2>Abstract</h2>\n<p>Aquaculture is now the main source of seafood in human diets and is one of its fastest-growing industries worldwide. However, the industry is facing several difficulties, including infectious diseases, the most significant limiting factor for aquaculture expansion. The impact of diseases on aquaculture growth, fecundity, mortality rates, and marketability is profound. Hence, the ability to predict disease outbreaks is crucial to overcoming these challenges. Various infectious agents such as bacteria, viruses, fungi, and parasites can cause significant losses of fish in intensive aquaculture practices. In an aquaculture environment, the high host density coupled with restricted water flow promotes pathogen spread. Early detection of disease is crucial for farmers as mortality rates can reach as high as 100% if left untreated. Therefore, new techniques and technical solutions for disease management in aquaculture are required. In this context, data analytics technologies, such as internet of things (IoT) sensors, artificial intelligence, and machine learning, allow farmers to proactively monitor their farms and detect potential disease outbreaks before they strike. Here, we highlighted the potential of machine learning algorithms in early pathogen detection and the possibilities of intelligent aquaculture in controlling disease outbreaks at the farm level. IoT is currently a popular study topic for smarter and sustainable aquaculture, as seen by the growing interest and broad overall assumptions. Therefore, this review aims to provide comprehensive information on the various aspects and challenges associated with modern technologies for controlling pathogenic microorganisms, as well as the potential benefits of using the IoT to improve fish health and welfare in aquaculture.</p>","author":"Sk Injamamul Islam, \nFoysal Ahammad, \nHaitham Mohammed","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"f7c93e8da84cdc00f79907fe95af71f774ff370d168b14adac179165fdfee7f9","category":"Environment"}