{"title":"Use of Coal Mining Wastes in the Construction Industry to Promote a Circular Economy: A Systematic Literature Review","link":"https://www.preprints.org/manuscript/202408.1621/v1","date":1724378763000,"content":"The coal mining process generates wastes such as overburden and tailings, the disposal of which is a significant environmental challenge. The circular economy model of eliminat-ing waste and regenerating the economy and ecosystems can minimise the impact of coal mining wastes. Another resource-intensive industry is the construction industry, which is responsible for significant resource consumption, waste generation, and emissions. Reus-ing and recycling coal mining wastes as secondary or value-added building materials in the construction industry per circular economy principles will help minimise the impact and have environmental and economic benefits. Several studies have demonstrated the use and reuse of coal mining wastes in the construction industry. This article conducts a systematic literature review to understand the state-of-the-art utilisation of coal mining waste in the construction industry. After a series of refinements using the PRISMA approach, 54 articles were included in the review. The articles were further divided based on using coal mining wastes in the construction industry as end products/application areas. The review results show that coal mining waste has been successfully used to make bricks and aggregates (fine and coarse), replace cement, and develop geopolymers, concrete, roads, and embankments. The studies suggest the utilisation of coal mining waste primarily in non-structural components, with very few studies suggesting using coal mining waste in structural applications. The systematic literature review helped in understanding the knowledge development related to the possible application of coal mine wastes in the construction industry, identifying the gap in the field, and suggesting future research directions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f7d1c78d86cb562d3d2b541ce7979bd22a60ac15715e3542508a83612c2fc0d7","category":"Interdisciplinary"}