{"title":"The Development of an Oral Health Nursing Tool in Patients with a Psychotic Disorder: A Human-Centered Design with a Feasibility Test","link":"https://www.preprints.org/manuscript/202403.1746/v1","date":1711636654000,"content":"Patients with a psychotic disorder frequently report oral health problems, while mental health nurses (MHNs) seem not to be fully aware of these problems and the risk factors. Therefore, this study aims to develop supportive tools for MHNs regarding oral health to increase sensitization among MHNs and to provide MHNs with knowledge to recognize (potential) oral health problems in patients with a psychotic disorder. We used a human-centered design in which the user, MHNs as well as experts by experience, were placed in the centre of the research process. Problems and needs in MHNs working with patients with a psychotic disorder were addressed. To identify key issues of problem as well as the needs in terms of resources, we started with focus groups (n = 9). We analysed the data thematically based on context of patients and MHNs in practice regarding oral health, preferred oral health tools focused on MHN, and intended outcomes of tools. A Multi Criteria Decision Matrix was developed and analysed (n = 9) to identify the most optimal and viable solution based on established criteria and issues that are prevalent in the work of MHNs. Most promising result was the development of a brochure with an awareness screener. The brochure with awareness screener was developed as a low-fidelity prototype for MHNs regarding oral health in patients with a psychotic disorder, based on the latest scientific evidence. After testing it, the feasibility was tested through semi-structured interviews (n=19). MHNs and experts by experience were satisfied with the tool and provided recommendations for adjustments to the content. Significant augmentations to the brochure include a clinical lesson and a toothbrush with toothpaste for patients. We can conclude that a brochure with an awareness screener is feasible for MHNs. Future steps aiming to further refine and optimize care processes for oral health tools in MHNs, should take refining eligibility criteria for psychiatric populations and the language level of the target group of a tool into account.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f7d9d0ef9f1f82aad513828f43585f5b3f8203caf2c46758b84abc1ce12451dd","category":"Interdisciplinary"}