{"title":"Influence of acclimatization time on parameters of barometric whole-body plethysmography in healthy adult cats","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299252","date":1710252000000,"content":"<p>by Petra Benz, Yury Zablotski, Bianka Schulz</p>\r\nBackground <p>Pulmonary function testing by barometric whole-body plethysmography (BWBP) is a long-established and well-accepted, non-invasive investigative procedure in cats.</p> Hypothesis/Objectives <p>To evaluate, if different acclimatization times influence the measurement parameters of BWBP in healthy adult cats.</p> Animals <p>48 healthy adult cats.</p> Methods <p>In the prospective observational study, healthy cats were placed in a measuring chamber and BWBP was performed over 30 minutes. Parameters obtained during the three measurement units of 10 minutes each (T1, T2 and T3) were compared.</p> Results <p>All measurement parameters except for tidal volume per body weight changed significantly (p&lt;0.05) over the three time periods. From T1-T2, the parameters minute volume per body weight (p&lt;0.001), peak inspiratory flow per body weight (p&lt;0.001), peak expiratory flow per body weight (p = 0.002), pause (p = 0.03), enhanced pause (p = 0.03) and quotient of peak expiratory flow divided by expiratory flow at end expiratory volume plus 50% tidal volume (p = 0.03) changed significantly. From the time interval T2-T3, only respiratory rate (p = 0.02), inspiratory time (p = 0.02), expiratory time (p = 0.04), and relaxation time (p = 0.01) changed significantly. All measurement parameters except for tidal volume per body weight changed significantly (p&lt;0.05) between T1 and T3. Age had a significant influence on all parameters except for peak expiratory flow per body weight and peak inspiratory flow per body weight. The parameters were not influenced by sex.</p> Conclusion and clinical importance <p>All measurement parameters except tidal volume per body weight were significantly affected by acclimatization time. Controlling for age and sex, there was still a significant influence of acclimatization time on all parameters except for tidal volume per body weight. Standardization of the acclimatization time for future studies would be appropriate in order to maintain comparability.</p>","author":"Petra Benz","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f7ea2ccd4bcd3ee4be3b02e4eadb8a3a5548549ef5aa23bef6d46ee1bdcbe2a1","category":"Interdisciplinary"}