{"title":"Concentrated microalgal biomass as a substitute for fresh microalgae produced on site at hatcheries","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16072?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>Microalgae are essential for most aquaculture hatcheries as first-feed for larvae. Even so, high labour costs and risk of production crashes have encouraged the search for fresh culture substitutes, such as microalgae concentrates. Despite their importance as a commodity for the aquaculture sector, the concentrates are not available worldwide, and consolidated knowledge is scarce. Therefore, this bibliographic study aimed review microalgae products available for hatcheries, identifying research gaps and suggesting opportunities for development. In most studies, microalgae cultures were harvested by centrifugation, and biomass was stored chilled, frozen or dried (heat-, spray- or freeze-dried). The shelf life of microalgae products was dependent on the method of storage and microalgae species since robust species maintained their nutritional value for a longer period compared to more fragile ones, which would be sensitive to harvesting and storage. Thus, the use of concentrates in some feeding trials resulted in poor zootechnical performance. These results have four possible explanations: cell ingestion difficulty, low feed digestibility by phytoplanktivores animals, biomass degradation or inadequate choice of microalgae species. However, these limitations can be overcome by fractionating feed portions and adapting the culture tanks and aeration systems, but mainly by determining the ideal method for storing biomass and shelf life for each microalgae species. Taken together, our findings show that the application of microalgae concentrates can enhance the efficiency and profitability of aquaculture hatcheries.</p>","author":"Rafael Sales, \nRafael Garcia Lopes, \nRoberto Bianchini Derner, \nMônica Yumi Tsuzuki","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"f7f26269377268844e4cb6234062f57bad43cb9969a7fd2fcc2f5facb957c89b","category":"Environment"}