{"title":"Sportful and Peter Sagan announce a ten year partnership","link":"https://cyclingtips.com/2021/12/sportful-and-peter-sagan-announce-a-ten-year-partnership/","date":1638836619000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Screen-Shot-2021-12-07-at-12.33.13-pm-650x401.jpg\" /></div><h2>Sportful and Peter Sagan announce a ten year partnership</h2><p></p><p>Peter Sagan and Sportful have signed a ten year partnership. The three time world champion, one of the most victorious athletes in modern cycling, and the Italian cycling apparel brand will continue their long time relationship into 2022 and beyond for the next decade.</p>\n<p>The far-reaching partnership between Peter Sagan and Sportful is founded both on a personal and professional level. The Italian brand has worked closely with Peter during most of his incredible career achievements – his World Championship titles, the unforgettable victories at Flanders and Roubaix, the Ciclamino jersey at the Giro d’Italia and of course his multiple Green Jerseys at the Tour de France. Sportful is proud to continue this collaboration with Peter as he dons the Team TotalEnergies jersey for 2022.</p>\n<p><em>“The relationship with Peter has always been above all on a human level rather than just a professional one. Bound with him for ten more years is by any means an important step but definitely a natural one for those who know what type of connection Peter has with the company owners and employees. It’s always a pleasure to greet him and have him with us, and knowing that we will be able to do it for the next ten years – along with many other initiatives we have in store – is a motive of pride as well as an outstanding privilege”.</em> – Dario Cremonese (Sportful)</p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/sportful-and-peter-sagan-announce-a-ten-year-partnership/\">Read More</a>","author":"Sportful","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f7f8aa3754502086208162eb9896d4023e8c42ff467250b2a1e2beac073001d8","category":"Cycling"}