{"title":"Impact of a collaborative model on community clinician confidence in child and adolescent mental health care, wellbeing, and access to child psychiatry expertise","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310377","date":1727100000000,"content":"<p>by Elise D’Abaco, Sonia Khano, Al Giles-Kaye, Jag Dhaliwal, Ric Haslam, Chidambaram Prakash, Harriet Hiscock</p>\r\nBackground <p>The COVID-19 pandemic was associated with an increase in child and adolescent mental health disorders, with subsequent worsening of patient access to specialist mental health care. Clinicians working in the community were faced with increased demands to diagnose and manage pediatric mental health disorders, without always having the confidence and knowledge to do so. We therefore developed COnnecting Mental-health PAediatric Specialists and community Services (COMPASS)—a collaborative model designed to upskill community clinicians in child and adolescent mental health care and provide them with better access to child and adolescent psychiatry expertise. COMPASS comprises (1) an online Community of Practice (CoP) with fortnightly one-hour sessions covering: anxiety; aggression and challenging behaviours; depression; self-harm and suicidality; eating disorders; and autism spectrum disorder/complex cases and (2) primary and secondary consultations for general practitioners and paediatricians with an experienced child psychiatrist. We aimed to assess the impact of COMPASS on community clinician self-reported confidence in: managing common child and adolescent mental health disorders (Objective 1, primary outcome); navigating the mental health care system (i.e. knowing how services are organised, accessed, and how to refer patients, Objective 2); diagnosing conditions (Objective 3); prescribing psychotropic medications (Objective 4) as well as the impact on, clinician practice and wellbeing (Objective 5) and outcomes of patients referred by COMPASS clinicians to the child psychiatrist (Objective 6).</p> Methods <p>We evaluated COMPASS in its first year, with COMPASS running from March to July 2021. Participating clinicians completed pre-post surveys evaluating change in Objectives 1 to 4 above, using study-designed measures. A purposive sample of clinicians was then invited to a semi-structured interview to understand their experience of COMPASS and its impacts on practice and wellbeing (Objective 5). We adopted an inductive approach to the qualitative analysis using the Framework Method. This involved selecting five random transcripts which were double coded and categorized, to generate an initial framework against which all subsequent transcripts were analysed. Themes and subthemes were generated from the data set, by reviewing the matrix and making connections within and between clinicians, codes and categories One child psychiatrist completed a 2-week logbook of the nature and outcomes of primary and secondary consultations (Objective 6).</p> Findings <p>51 (86%) clinicians attended CoP sessions and completed pre-post surveys, with 92% recommending COMPASS to peers. Clinicians reported increased confidence in the pharmacological and non-pharmacological management of all conditions, most notably for management of self-harm. They also reported increased knowledge of how to navigate the mental health system and prescribe medications. Qualitative analysis (n = 27 interviews) found that COMPASS increased clinician wellbeing and reduced feelings of professional isolation and burnout. Over the 2-week snapshot, the child psychiatrist consulted on 22 patients and referred all back to the community clinician.</p> Conclusions <p>COMPASS is associated with improved clinician confidence to manage child and adolescent mental health concerns, navigate the mental health system, improved clinician wellbeing, and reduced need for ongoing mental health care by specialists.</p>","author":"Elise D’Abaco","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f7fa67d61a75241fcdb62e52c5af9446911bf4a83bbe5f2c14fe2356b30fd046","category":"Interdisciplinary"}