{"title":"Who are the favourites for the 2021 Vuelta a Espana?","link":"https://www.cyclist.co.uk/in-depth/9968/who-are-the-favourites-for-the-2021-vuelta-a-espana","date":1628615267000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>13 Aug 2021</span></div>    </div></div><p>\nWith the battle for the red jersey beginning on Saturday, we assess the riders with the best shot at the overall title</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2019/09/roglicvuelta.jpeg?itok=-hNe9LDt\" />  </div>\n<div>\n      <p> Finally, the <a href=\"/news/2104/vuelta-a-espana-route-race-reports-tv-guide-and-all-you-need-to-know\" target=\"_self\">Vuelta a España</a>, the best of the Grand Tours, is back and it's set to be a stunner. Scorching temperatures and brutal climbs are but days away and at <em>Cyclist </em>we couldn't be more excited.<i> </i></p>\n<p>With the most dominant rider we've seen in a number of years deciding to stay at home and a mass of in-form and well rested riders taking part, 2021's race for the <em>maillot rojo </em>is shaping up to be the most competitive three-week race of the year.</p>\n<p>So, who should you be on the lookout for over the next few weeks, starting with Saturday's time-trial in Burgos and finishing with another time-trial to Santiago de Compostela, and who is expected to be challenging for the podium?</p>\n<p>To help answer that question, we've ranked the top riders contending to be the winner of the 2021 Vuelta a España.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/913/tour-of-britain-route-riders-live-tv-guide-all-you-need-to-know\">Tour of Britain 2021: Route, teams and all you need to know</a></div>      <div><a href=\"/news/2104/vuelta-a-espana-route-race-reports-tv-guide-and-all-you-need-to-know\">Vuelta a Espana 2021: Route, start list, live TV guide and all we know so far</a></div>      <div><a href=\"/reviews/667/the-best-turbo-trainers-a-buyers-guide\">Best smart turbo trainers: Top Zwift compatible indoor trainers</a></div>    </div></div><h3>Vuelta a España 2021 favourites ranked</h3>\n<h4>1. Primož Roglič</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/08/roglic_offside.jpg?itok=tr6f-lIK\" />  </div>\n</div>\n<p>It's <a href=\"/tags/primoz-roglic\" target=\"_self\">Primož Roglič</a>'s race to lose, there can be no doubt about that. Not only has he won the last two editions, but provided he is fully recovered from his Tour de France injuries, he'll be arriving in Spain fresher than ever.</p>\n<p>With no Tour fatiguing his legs and the confidence of absolutely dominating the Olympics time-trial, it's not beyond the realms of possibility that the Slovenian dominates the Vuelta like 2021's other Grand Tour winners.</p>\n<h4>2. Egan Bernal</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/06/giro2021-stage9-8.jpg?itok=TxD-KkpB\" />  </div>\n</div>\n<p>Speaking of, <a href=\"/tags/egan-bernal\" target=\"_blank\">Egan Bernal</a> will be taking on the Vuelta for the first time and will be looking to complete his set of Grand Tours at just 24 years old. That is no mean feat.</p>\n<p>Although he struggled at the 2020 Tour de France with back issues, he looked to be in imperious form in the Giro, constantly attacking his rivals and producing some truly memorable displays – even if they weren't all televised.</p>\n<h4>3. Mikel Landa</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/05/giro2021-stage4-7.jpg?itok=OyxBTv_l\" />  </div>\n</div>\n<p>It's been a tough one for Mikel Landa, but that may work in his favour. Crashing out early in the Giro d'Italia, Landa's biggest opportunity to truly challenge for an overall victory looked to have been cruelly taken from him. </p>\n<p>However with plenty of time to heal up, he's back for more and has just won the Vuelta a Burgos. Undoubtedly the home favourite, Landa is backed by the strongest team in the race and, with the potential of injury flare-ups for Roglič and Bernal, maybe it's his turn for some luck.</p>\n<h4>4. Miguel Ángel López</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/08/lopez_offside.jpg?itok=vpHstoV-\" />  </div>\n</div>\n<p>Superman was a pre-race favourite going into the Tour de France, he had a strong 2020 and with a switch of teams from Astana to <a href=\"/tags/movistar\" target=\"_self\">Movistar</a>, looked set to have the team to back up his talents.</p>\n<p>Sadly he lost time early due to a crash and was left to work for Enric Mas. What that means though is that he should still have plenty left in the tank for the Vuelta and he has the pedigree to do real damage in the mountains.</p>\n<p>He just has to hope Movistar are focussed on helping him and not hindering a certain Ecuadorian.</p>\n<h4>5. Hugh Carthy</h4>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/06/giro2021-stage9-17.jpg?itok=-uyqV9kX\" />  </div>\n</div>\n<p>Who could forget Hugh Carthy's performance at last year's Vuelta? Third on GC, winning the stage up the Angliru, impressive is an understatement.</p>\n<p>Although he couldn't quite hit the same heights at the Giro he looks to be finding form, winning the final stage of the Vuelta a Burgos, distancing both Bernal and Landa. It'll be tough to top his 2020 race but he's certain to put in a dig or two when the climbing begins.</p>\n<h4>6. Aleksandr Vlasov</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/05/giroditalia2021-stage17-10.jpg?itok=Cior3T36\" />  </div>\n</div>\n<p>Someone who got the best of Carthy at the Giro is Aleksandr Vlasov, who bagged himself a fourth overall. The Russian, who will be switching allegiances to <a href=\"/tags/bora-hansgrohe\" target=\"_self\">Bora-Hansgrohe</a> next year, finished second to Carthy on the Angliru last time out and will be looking to go one step further in 2021.</p>\n<p>He clearly has the ability, it's just a case of carrying that over the full three weeks and while it's unlikely he ends up in red a podium isn't out of reach. It also depends on if his team want to help him given his impending exit.</p>\n<h4>7. Max Schachmann</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2020/03/cauldphoto-parisnice-stage5-9724.jpg?itok=Ie7tYk3K\" />  </div>\n</div>\n<p>Max Schachmann is a tough one. He's clearly a great one week and one day racer, winning Paris-Nice twice has to count for something, even if they weren't in the most normal of circumstances, but he's never done it in a Grand Tour.</p>\n<p>However chances to do so have been rare and with several potential GC hopes moving to his Bora-Hansgrohe squad for 2022, he has to take his opportunity at the Vuelta. Expect him to watch future teammate Vlasov like a hawk.<em> </em></p>\n<p>He's very much this year's dark horse.</p>\n<h4>8. Giulio Ciccone</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/05/giro2021-stage9-9.jpg?itok=Zcvseujz\" />  </div>\n</div>\n<p>Giulio Ciccone finally stepped out of the shadow of Vincenzo Nibali at the Giro and looked a genuine contender for the podium before dropping out late on.</p>\n<p>If he can show that form again Ciccone is absolutely one to watch in the mountains, we can expect at least a crack at a stage win.</p>\n<h4>9. Romain Bardet</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/05/giroditalia2021-stage19-5_0.jpg?itok=OMUlQOmv\" />  </div>\n</div>\n<p>It's been a bumpy road for Romain Bardet, he came so close to being the hero France needed but tailed off the past few seasons before joining Team DSM.</p>\n<p>That may have been a wise move though as he seems to have found his legs again, after a slow start to the Giro he looked strong at the business end and finished seventh on GC and with his only racing since coming at the Vuelta a Burgos, where he looked strong and won a stage, his legs should be as fresh as any.</p>\n<h4>10. The domestiques</h4>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2019/06/richardcarapaz.jpg?itok=-aeQXRDD\" />  </div>\n</div>\n<p>Forgetting someone? Ah yes, we can't forget that there are a startling number of 'domestiques' lining up on Saturday that will either provide a two/three-pronged attack or step up if their leaders can't do the business.</p>\n<p>Of those that could genuinely contend, most are split between Bahrain Victorious or Ineos Grenadiers. At Bahrain, Landa is backed up by Damiano Caruso, Jack Haig, Gino Mäder, Mark Padun and Wout Poels, who can all do a job. While Ineos will struggle to go wrong with Richard Carapaz and Adam Yates as safety nets. Oh and did somebody say <a href=\"/tags/tom-pidcock\" target=\"_self\">Tom Pidcock</a>? </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/cyclists\">Cyclists</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"f7fd04ce22b5b8127772cb11f75ea8ce293da5b5a463d158e4e9e6ac0953936e","category":"Cycling"}