{"title":"Anti‐allergic effect of vitamin C through inhibiting degranulation and regulating TH1/TH2 cell polarization","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13419?af=R","date":1709903725000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Food allergy has become a global public health problem. This study aimed to explore the possible anti-allergic effect of vitamin C (VC). A rat basophilic leukemia (RBL)-2H3 cell degranulation model was used to assess the effect of VC on degranulation <i>in vitro</i>, and an ovalbumin (OVA)-induced BALB/c mouse allergy model was used to assess the anti-allergy effect of VC <i>in vivo</i>.</p>\n<h2>RESULTS</h2>\n<p><i>In vitro</i>, VC significantly attenuated the release of β-hexosaminidase, tryptase and histamine, and also reduced cytokine production (interleukins 4 and 6, tumor necrosis factor α) significantly (<i>P</i> &lt; 0.05), with the inhibitory effect demonstrating a positive correlation with VC dose. <i>In vivo</i>, compared with the OVA group, the levels of serum immunoglobulins E and G<sub>1</sub> of the VC low-dose (VCL) group (50 mg kg<sup>−1</sup>) and high-dose (VCH) group (200 mg·kg<sup>−1</sup>) were significantly reduced (<i>P</i> &lt; 0.05). Furthermore, the plasma histamine level was also significantly decreased (<i>P</i> &lt; 0.05). Moreover, T<sub>H</sub>2 cell polarization in mice of the VCL and VCH groups was significantly inhibited (<i>P</i> &lt; 0.05), promoting the T<sub>H</sub>1/T<sub>H</sub>2 cell polarization balance. Additionally, VC treatment enhanced the expression of CD80 (<i>P</i> &lt; 0.05) in spleen and small intestine tissues, while significantly inhibiting the expression of CD86 (<i>P</i> &lt; 0.05); notably, high-dose VC treatment was more effective.</p>\n<h2>CONCLUSION</h2>\n<p>VC exerted an anti-allergic effect through inhibiting degranulation and regulating T<sub>H</sub>1/T<sub>H</sub>2 cell polarization balance. © 2024 Society of Chemical Industry.</p>","author":"Qian Li, \nXinlei Tang, \nLu Huang, \nTao Wang, \nYutong Huang, \nSongsong Jiang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"f8087561809c66c65ff80b6d8650f465ab07d644376aed75405dcebeed31ca32","category":"Environment"}