{"title":"Disentangling the drivers of urban bird diversity in the non‐breeding season: A general synthesis","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17421?af=R","date":1721637837000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/45910653-9025-40fc-90c4-f63c568b5a00/gcb17421-toc-0001-m.png\" alt=\"Disentangling the drivers of urban bird diversity in the non-breeding season: A general synthesis\" />\n<p>The impact of urbanisation on bird assemblages has mainly been studied in the breeding season, whereas recent climatic conditions have been changing faster in winter, driving a reorganisation of non-breeding avifauna. We used worldwide surveys conducted in the non-breeding season to investigate the environmental factors shaping multiple dimensions (taxonomic, phylogenetic, and functional) of urban bird diversity. We found that bird diversity in urban environments is predominantly determined by temperature, productivity and city age, with different effects in the non-breeding season. Our results suggest that the impacts of urbanisation on biodiversity should be re-evaluated in the context of seasonality.</p>\n<br />\n<h2>Abstract</h2>\n<p>Current knowledge about the impacts of urbanisation on bird assemblages is based on evidence from studies partly or wholly undertaken in the breeding season. In comparison, the non-breeding season remains little studied, despite the fact that winter conditions at higher latitudes are changing more rapidly than other seasons. During the non-breeding season, cities may attract or retain bird species because they offer milder conditions or better feeding opportunities than surrounding habitats. However, the range of climatic, ecological and anthropogenic mechanisms shaping different facets of urban bird diversity in the non-breeding season are poorly understood. We explored these mechanisms using structural equation modelling to assess how urbanisation affects the taxonomic, phylogenetic and functional diversity of avian assemblages sampled worldwide in the non-breeding season. We found that minimum temperature, elevation, urban area and city age played a critical role in determining taxonomic diversity while a range of factors—including productivity, precipitation, elevation, distance to coasts and rivers, socio-economic (as a proxy of human facilitation) and road density—each contributed to patterns of phylogenetic and functional diversity. The structure and function of urban bird assemblages appear to be predominantly shaped by temperature, productivity and city age, with effects of these factors differing across seasons. Our results underline the importance of considering multiple hypotheses, including seasonal effects, when evaluating the impacts of urbanisation on biodiversity.</p>","author":"Israel Moreno‐Contreras, \nJukka Jokimäki, \nMarja‐Liisa Kaisanlahti‐Jokimäki, \nLucas M. Leveau, \nJukka Suhonen, \nJoseph A. Tobias, \nPiotr Tryjanowski","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"f80b04597318e91dfcff5727ad7f7ffe014257bfefd6fab57132e193261c2ed7","category":"Environment"}