{"title":"Union pedal marks Hope’s entry to clipless market, with new cleat design","link":"https://www.bikeradar.com/news/hope-union-pedals/","date":1627977629000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/FotoJet-25aeb85.jpg?quality=45&amp;resize=620,413\" />                                            <p>Hope Technology has joined the clipless pedal game with three ‘Union’ pedals aimed at XC, trail and DH riders, joining the <a href=\"https://www.bikeradar.com/reviews/components/pedals/hope-f20-pedals-review/\">F20 flat pedal</a> and F12 kids’-flat pedals already in its range.</p>\n<p>The XC-focused Union RC pedal comes with a minimal pedal body, holding just the mechanism, while the trail-orientated Union TC and downhill-focused Union GC have a supportive platform around the main mechanism, with the TC receiving four replaceable pins per side and the GC seven per side.</p>\n<p>The platform is there to provide more support for slightly flexier trail and DH shoes, while the pins should help lock the feet into the pedals for improved feel and control.</p>\n<ul><li><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-pedals-13-of-our-favourites/\">Best mountain bike pedals</a></li>\n<li><a href=\"https://www.bikeradar.com/advice/buyers-guides/flat-or-clipless-pedals-which-is-right-for-you/\">Flat or clipless pedals – which is right for you?</a></li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> With four pins per side and a smaller platform, the TC sits between the RC and GC.</span></figcaption><span> <i>Hope</i></span></div>\n<p>As you’d expect from the masters of CNCing, the main pedal bodies are CNC’d from aluminium billet and will come in a range of colour options: silver, black, red, blue, purple, and orange.</p>\n<section><div>\n        <h3>What is a clipless pedal?</h3>\n<p>Clipless pedals were originally developed when pedal toe clips were still commonly in use (buckled straps that effectively strapped shoes to the pedals over the top of the toes), so when pedals did away with the toe ‘clip’ they became known as clipless.</p>\n<p>However, in the present day, confusion with this term is understandable because shoes ‘clip in’ to the pedals.</p>\n<p>\n\n    </p></div>\n    </section><h2>Hope Union pedal details</h2>\n<p>The pedals spin on the same axles found in the F20, giving a Q-factor of 55mm (distance from the outer crank edge to the middle of the pedal mechanism), and three sealed bearings and a Norglide bushing should keep the pedals spinning freely.</p>\n<p>These are held around a Cr-Mo axle on the TC and GC pedal, while the lighter RC pedal gets a titanium axle as standard. This titanium axle will be offered as an upgrade for the other two pedals, though.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Union RC is the lightweight, race-focused pedal from Hope.</span></figcaption><span> <i>Hope</i></span></div>\n<p>The clip mechanism is built from stainless steel, which won’t corrode, and Hope claims it will keep its looks throughout its product life.</p>\n<p>The mechanism is sprung at the front and back of the clip, which is said to aid entry and release from the pedal. Release tension is adjustable with an Allen key, similar to <a href=\"https://www.bikeradar.com/brand/shimano/\">Shimano’s</a> pedals.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Hope’s cleat isn’t compatible with other manufacturers’ pedals, according to the brand.</span></figcaption><span> <i>Hope</i></span></div>\n<p>Pedals will be supplied with two stainless steel cleat options. The ‘Number 4’ cleat will have four degrees of float and a 12-degree release angle, while the ‘Number 5’ cleat will have five degrees of float and a 13-degree release angle. The ‘Number 5’ cleat will also be a touch stiffer to release, to give a more secure hold. Both cleats are said to give 2mm of lateral float.</p>\n<p>Interestingly, Hope is going its own way with cleat design, saying: “The Hope mechanism uses a specific cleat and is not cross-compatible with other systems.”</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Union GC is the big-platform, gravity-orientated pedal, with seven pins per side for masses of traction.</span></figcaption><span> <i>Hope</i></span></div>\n<p>Many pedal manufacturers opt to use Shimano’s <a href=\"https://www.bikeradar.com/advice/buyers-guides/shimano-spd-vs-spd-sl/\">SPD design</a> – such as <a href=\"https://www.bikeradar.com/reviews/training/power-meters/garmin-rally-rs200-power-meter-pedals-review/\">Garmin’s Rally XC pedals</a>, <a href=\"https://www.bikeradar.com/reviews/components/pedals/nukeproof-horizon-cs-pedal-review/\">Nukeproof’s Horizon</a>, and <a href=\"https://www.bikeradar.com/reviews/components/pedals/dmr-v-twin-clipless-pedal-review/\">DMR’s V-Twin</a> – and for consumers, this makes spares easier to come by and means you can use the same shoes across multiple pedals, or vice versa.</p>\n<h2>Hope Union pedal claimed weights and prices</h2>\n<h3>Hope Union RC</h3>\n<ul><li>324g</li>\n<li>£150 / €185 / $190</li>\n</ul><h3>Hope Union TC</h3>\n<ul><li>437g</li>\n<li>£150 / €185 / $190</li>\n</ul><h3>Hope Union GC</h3>\n<ul><li>498g</li>\n<li>£160 / €195 / $200</li>\n</ul><p>All three pedal models can be ordered now for delivery in September and once we’ve given ours a thrashing, we’ll bring you full reviews.</p>","author":"Tom Marvin","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"f80ec29395bb0aa3f486e3308f600a9f9e11520ba77f79b42ab133379f612e2c","category":"Cycling"}