{"title":"Apple Music’s Year in Review vs. Spotify Wrapped","link":"https://www.theverge.com/2021/12/1/22812079/apple-music-year-in-review-spotify-wrapped-social-media","date":1638981991000,"content":"\n<p>Chaim Gartenberg, writing last week for The Verge:</p>\n\n<blockquote>\n  <p><a href=\"https://www.theverge.com/2019/12/5/20997218/spotify-wrapped-year-end-decade-review-apple-music-streaming-audio-service\">Spotify has been eating Apple’s lunch</a> for <em>years</em> now with\nWrapped, which has practically become its own internet holiday\neach year. And yet, it took Apple four full years to even launch\nits bare-bones Replay feature, <a href=\"https://www.theverge.com/2019/11/13/20963520/apple-music-replay-listening-history-view-share-albums-songs\">which debuted in 2019</a> and\nhasn’t been meaningfully updated since. (I’ve been using kludged\ntogether Smart Playlists on iTunes for years to try to poorly\nreplicate the Spotify experience.)</p>\n\n<p>2021 is no exception, with Spotify offering what feels like its\nmost lavish recaps yet. My wife (who is a Spotify user) spent the\nmorning showing off her bespoke playlist to me, which included\n(among other things) specially curated songs for specific moods,\nrankings of where she placed among global Doja Cat listeners, a\ncolor-changing “audio aura,” and an interactive quiz. All of it is\ndesigned to be shared and shown off on other social media\nplatforms.</p>\n</blockquote>\n\n<p>I’m a surprised Apple hasn’t upped its year-in-review game for Apple Music, for the simple reason Gartenberg cites: Spotify Wrapped gets a <em>ton</em> of authentic social media action each year. Me, personally, I wouldn’t care a whit about it. My music taste is old and boring — I neither need to be reminded of what I liked this year, nor want to share it. But it’s quite obvious that many people — especially younger people, whose taste actually does reflect popular trends in new music — absolutely love it.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/12/08/gartenberg-apple-music-spotify-wrapped\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"f80fb0d887636c589969a05bc92b4106539466d935d5bd088bc23b23bc889daf","category":"Tech"}