{"title":"Stage three reflections: Le Retour de France","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/stage-three-reflections-le-retour-de-france","date":1688416676000,"content":"\n      <p><span>The Treaties of Bayonne, signed and ratified between 1856 and 1868, formally completed the process of defining the border between France and Spain. Given that the Pyrenees formed such a natural boundary line, it’s surprising that it took so long – the first steps were taken with the Treaty of the Pyrenees in 1659, two centuries earlier. Then again, given the history of Europe, maybe it’s not. Nonetheless, the 19th century geographer Élisé Reclus described the border set in the Treaties as “one of the most perfect political boundaries in the world”.</span></p>\n<div></div>\n<div></div>\n<p><span>The 2023 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> crossed the border between Spain and France at around 3:45pm, just under 60km from the finish in stage three, as the riders traversed the Puente de Santiago across the Bidasoa river from Irun to Hendaye. The first rider back into France was Breton Laurent Pichon, and he was followed two minutes later by the peloton. The stage finish was won in a bunch sprint by Jasper Philipsen. As the Tour returned to its home country, it seemed like as good a time as any to contemplate what has gone before, and what is to come. </span></p>\n<p><span>There’s a lot of talk about there being no clear hierarchy in bunch sprinting at the moment. However, Philipsen’s victory in Bayonne was the third Tour bunch sprint in a row won by the Belgian, following his wins in Carcassonne and Paris in 2022. If Christophe Laporte had not surprised the Tour by attacking with a kilometre to go in Cahors on stage 19 last year and just holding off the bunch sprint led in by… Jasper Philipsen, it would have been four. The Belgian’s somewhat lackadaisical approach to suitcase organisation and absent-mindedness regarding shoes has earned him <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/jasper-disaster-no-more-the-burgeoning-dominance-of-jasper-philipsen\">the nickname ‘Jasper Disaster’</a>, but his recent sprinting record at the Tour is anything but disastrous. With Philipsen’s win in Bayonne, normality has been restored, and perhaps the 2023 Tour can settle down.</span></p>\n<p><span>However, the S-shaped trajectory with which Philipsen approached the finish line in Bayonne, a choice more or less forced upon him by the Tour organisers who put the final 200m of the stage on a bend in the road, also served as a reminder that life is not always simple. The Tour did indeed cross from Spain to France during stage three, but no matter how perfect that border is in theory, it’s also true that the Tour remained entirely within the Basque Country. The riders went from one country to another, yet they also stayed in the same region, and if they wanted any more tangible evidence of how strange the liminal space between Spain and France is, they could have looked right from the Puente de Santiago to Konpantzia, or Pheasant Island, a tiny tract of land in the middle of the Bidasoa that is jointly owned by Spain and France, the management of which has been switching between the two countries every six months for over 300 years.</span></p>\n<p><span>Even when the Franco-Spanish border was settled by the Treaties of Bayonne, nobody really knew exactly where it was, because the frontier was not a linguistic one. The authorities set down boundary stones along the border, but as reported by Martyn Lyons in his book </span><i><span>The Pyrenees in the Modern Era</span></i><span>, these were not permanent. “The stones got buried in snow, pushed over by livestock or were deliberately uprooted by zealous Basque nationalists,” he wrote. It’s a blurring of lines that modern cycling fans might appreciate – we are now several years into the era in which GC riders win cobbled Classics, sprinters win time trials and ski jumpers win Grand Tours.</span></p>\n<p><span>In the early days of the Tour de France and between the World Wars, the organisers used the race to make geopolitical statements, taking the race as far up against the German border as they could. The Tour has always been conscious of the borders of its home countries. These days, the Tour makes a point of crossing borders, and though the race owners ASO do this primarily for money, the Tour also celebrates the modern spirit of internationalism. Good things happen when people make friends across borders.</span></p>\n<p><span>However, there’s still always a psychological as well as a physical barrier passed when the Tour enters into France for the first time after a foreign Grand Départ. Grands Départs by their nature are different, even other-worldly, and operate on their own logic. This was true in Denmark in 2022, when huge crowds carried the Tour peloton around for three days on a breaking wave of noise and cheering. The Belgian stages in 2019 were an incongruous mix of hot summer and blue skies, and Classics territory. Düsseldorf 2017 was urban, grey, dark and rain soaked. And it’s been true of the Basque Country stages, which have combined tough racing and GC action, incredible coastal scenery, huge crowds and an atmosphere all of their own. </span></p>\n<p><span>Last year, riders and managers talked of the Tour starting once the race had left Denmark, a perception that was reinforced by the fact that apart from the small time gaps opened up in the Copenhagen time trial, there wasn’t any movement in the GC, just two bunch sprints; also that the transfer between Denmark and France was so long that ASO gave the riders an extra rest day for it. This time around, there has been no opportunity to wait until the race returned to France. The line between the early stages and the main part of the 2023 Tour is not such a perfect one.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f80ff91aeddadc3fb6884a46fac64712001986ba47711a23a098ef8272c743f4","category":"Cycling"}