{"title":"New genetic analysis of Ötzi the Iceman yields some surprising findings","link":"https://arstechnica.com/?p=1963228","date":1692994416000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/otziTOP-800x533.jpg\" alt=\"Otis mummified skeleton on a laboratory table\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/otziTOP.jpg\">Enlarge</a> <span>/</span> Study reveals that compared to other contemporary Europeans, Ötzi’s genome had an unusually high proportion of genes in common with those of early farmers from Anatolia. He was also likely bald (or nearly so) when he died. (credit: South Tyrol Museum of Archaeology/Eurac/Marco Samadelli-Gregor Staschitz)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In 1991, a group of hikers found the mummified remains of <a href=\"https://en.wikipedia.org/wiki/%C3%96tzi\">Ötzi the Iceman</a> emerging from a melting glacier in the Alps—likely murdered, judging by the remains of an arrowhead lodged in his shoulder. The mummy's genome was first sequenced in 2012, whereby the world learned that he likely had brown eyes, type O blood, blocked arteries, Lyme disease, and lactose intolerance. That first genetic analysis also determined that Ötzi was descended from Steppe Herders hailing from Eastern Europe who migrated to the region some 4,900 years ago.</p>\n<p>However, according to a <a href=\"https://www.sciencedirect.com/science/article/pii/S2666979X2300174X?via%3Dihub\">recent paper</a> published in the journal Cell Genomics, Ötzi actually has more common ancestry with early farmers who migrated from Anatolia roughly 8,000 years ago, and the earlier findings were the result of modern DNA contaminating the original sample. The authors also used the latest advanced sequencing technology to paint a more accurate picture of the Iceman’s appearance and other genetic traits. Most notably, his skin was probably much darker than previously assumed, and he was likely bald, or nearly so, when he died. </p>\n<p>As <a href=\"https://arstechnica.com/science/2022/11/study-otzi-the-iceman-probably-thawed-and-refroze-several-times/\">previously reported</a>, archaeologists have spent the last 30 years studying the wealth of information about Copper Age life that Ötzi brought with him into the present. Studies have examined his genome, skeleton, last meals, tattoos, and the microbes that lived in his gut. For instance, in 2016, scientists <a href=\"http://dx.doi.org/%2010.1038/srep31279\">used DNA sequencing</a> to identify how Ötzi's clothing was made and found that most of it was made from domesticated cattle, goats, and sheep, although his hat was made from brown bear hide and his quiver from a wild roe deer.</p></div><p><a href=\"https://arstechnica.com/?p=1963228#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1963228&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f8145c605cb95290f19e16a1cca5231d1c09e77b3b07e36c4aba256132b6a4b1","category":"Tech"}