{"title":"[ลือ] Health ใน iOS 17 เพิ่มระบบโค้ชให้คำแนะนำ, แบบประเมินสภาพอารมณ์, เพิ่มแอปใน iPad","link":"https://www.blognone.com/node/133559","date":1682466992000,"content":"<div><div><div><p>ถึงแม้ก่อนหน้านี้จะมี<a href=\"https://www.blognone.com/node/132177\">รายงานข่าวลือ</a>ว่า iOS 17 ระบบปฎิบัติอัพเดตประจำปีของ iPhone ตลอดจน iPadOS 17 ของ iPad จะไม่มีฟีเจอร์ใหม่ที่โดดเด่นมากนัก เนื่องจากแอปเปิลโฟกัสที่ xrOS ระบบปฏิบัติการของเฮดเซต Mixed Reality มากกว่า แต่รายงานล่าสุดของ Mark Gurman แห่ง Bloomberg คนเดิม บอกว่าแอปสุขภาพหรือ Health ใน iOS 17 จะเพิ่มลูกเล่นใหม่ที่น่าสนใจ</p>\n<p>ฟีเจอร์ใหม่ของ Health ตัวแรกคือระบบโค้ชให้คำแนะนำ ซึ่งมีโค้ดเนมภายในว่า Quartz โดยจะให้คำแนะนำต่าง ๆ เช่น สร้างแรงจูงใจให้ออกกำลังกายมากขึ้น ปรับปรุงการกิน การนอนหลับ โดยอาศัยข้อมูลจาก Apple Watch เป็นคำแนะนำของผู้ใช้งานแต่ละคน</p>\n<p>ฟีเจอร์ต่อมาเป็นเครื่องมือประเมินสภาพอารมณ์ (Mood Tracker) โดยผู้ใช้งานจะตอบคำถาม และแอปจะนำมาเรียนรู้พร้อมกับให้คำแนะนำในแต่ละวัน แอปนี้จะทำงานแยกส่วนกับบันทึกชีวิตประจำวัน (Journaling App) ที่มีรายงานก่อนหน้าว่าจะเพิ่มเข้ามาใน iOS 17 เช่นกัน</p>\n<p>แอป Health ยังมีข้อมูลว่าจะเพิ่มเข้ามาใน iPadOS 17 เป็นครั้งแรกด้วย ทำให้แอปนี้สามารถใช้งานได้ผ่าน iPad เนื่องจากผู้ใช้งานบางคนอาจพบข้อจำกัดเรื่องขนาดหน้าจอ อีกทั้งข้อมูลบางอย่างต้องการจอที่ใหญ่ขึ้นในการดูรายละเอียด</p>\n<p>สุดท้าย MacRumors มีข้อมูลการเปลี่ยนแปลงทั่วไปของ iOS 17 อ้างข้อมูลจากผู้โพสต์ใน Weibo ที่เคย<a href=\"https://www.blognone.com/node/132886\">ให้ข้อมูล iPhone 14 สีเหลือง</a>ตรงมาแล้ว รายละเอียดได้แก่ ปรับขนาดฟอนต์หน้าจอล็อกได้, แชร์การออกแบบหน้าจอล็อกได้, ดูเนื้อเพลง Apple Music ในหน้าจอล็อกได้, App Library แก้ชื่อโฟลเดอร์ได้ และปรับระดับไฟแฟลชได้</p>\n<p>ที่มา: <a href=\"https://www.bloomberg.com/news/articles/2023-04-25/apple-aapl-developing-ai-health-coaching-service-ipados-17-health-app\">Bloomberg</a>, <a href=\"https://www.macrumors.com/2023/04/25/ios-17-lock-screen-apple-music-rumors/\">MacRumors</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ce5ffacdde9378bbf1cd03e430eea523.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/rumors\">Rumors</a></div><div><a href=\"/topics/apple-health\">Apple Health</a></div><div><a href=\"/topics/ios-17\">iOS 17</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f817f7937331e9fd1ff67714bf54d166f253a0f884491891ed09446ed9788da8","category":"Thai"}