{"title":"Behold the likely face of a 7th-century Anglo-Saxon teenage girl","link":"https://arstechnica.com/?p=1948715","date":1687536157000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/anglo-TOP-800x533.jpg\" alt=\"(left) Skull of teenaged girl from 7th century CE. (right) Facial reconstruction as she might have looked in life.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/anglo-TOP.jpg\">Enlarge</a> <span>/</span> (left) Skull of teenage girl from 7th century CE. (right) Facial reconstruction as she might have looked in life. (credit: University of Cambridge Archaeological Unit/Hew Morrison ©2023)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Earlier this week, archaeologists unveiled the facial reconstruction of the remains of a seventh-century CE Anglo-Saxon teenage girl found in a <a href=\"https://en.wikipedia.org/wiki/Trumpington_bed_burial\">rare \"bed burial\"</a> in 2012. It's part of a new exhibit at the University of Cambridge's Museum of Archaeology and Anthropology called \"<a href=\"https://www.museums.cam.ac.uk/events/beneath-our-feet-archaeology-cambridge-region\">Beneath Our Feet: Archaeology of the Cambridge Region</a>.\" In addition to the reconstruction, scientists also analyzed the young woman's bones and teeth to learn more about her diet and geographical region of origin.</p>\n<p>The girl is believed to have been about 16 years old when she died. The grave was discovered at a site near a village called Trumpington just outside Cambridge. It is one of only 18 so-called \"bed burials\"—a rare Anglo-Saxon practice, usually reserved for high-status women, in which the deceased was buried on an ornamental bed—discovered thus far in the United Kingdom. Nearby were three other graves holding two younger women and an older person. This particular bed had a wooden frame held together by metal brackets and looped metal to fix the cross-slats, most likely topped with a straw mattress.</p>\n<p>Among the grave goods buried with the girl were an iron knife, a chatelaine (decorative belt), glass beads, gold and garnet pins, and most significantly, an ornate gold pectoral cross inlaid with garnets, now known as the Trumpington Cross. Archaeologists believe it may have been sewn onto the robe she wore when she died. Such crosses are very rare, and its presence indicated the young woman was likely a member of Anglo-Saxon nobility, particularly when combined with the evidence of the bed burial. The cross indicates she was a Christian, but the grave goods are a pagan practice, so <a href=\"https://www.cam.ac.uk/research/news/mystery-of-anglo-saxon-teen-buried-in-bed-with-gold-cross\">archaeologists view</a> the find as representative of a pivotal period in British history when Christianity had just begun to spread through the land.</p></div><p><a href=\"https://arstechnica.com/?p=1948715#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1948715&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f81c436989860256fc66b461520043784068421cb9356ad45f451c62fba0decd","category":"Tech"}