{"title":"Amstel Gold Race 2023 - contenders and predictions","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/amstel-gold-race-2023-contenders-and-predictions","date":1681397721000,"content":"\n      \n<p>The <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/amstel-gold-race\">Amstel Gold Race</a> is back on Sunday April 16, 2023. The men's WorldTour will take on a 253 kilometre route through the province of Limburg in the Netherlands, marking the first race in the Ardennes Classics. A race that is defined by its short but punchy climbs, the route is packed full of steep ascents that'll keep the race interesting from start to finish, including the mighty <span>Cauberg. </span> </p>\n<div></div>\n<p>Last year's race came down to a photo finish between Michał Kwiatkowski (Ineos Grenadiers) and Benoît Cosnefroy (AG2R Citreön Team), with Kwiatowski just pipping Cosnefroy to the post. Both riders will be back this year, alongside one of the biggest names in cycling at the moment. But who will be on top of the podium this year, drinking the mammoth glass of Amstel Gold? We look at the top contenders. </p>\n<h3><span>Tadej Pogačar</span></h3>\n<p>How every other contender lining up at Amstel Gold must resent Tadej Pogačar. Not content with already having won a stage race at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice\">Paris-Nice</a> and a cobbled Monument at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a>, the Slovenian now turns his attention to the hilly Classics, with participations at Flèche Wallonne and Liège-Bastogne-Liège also set to follow. And the way he’s been riding this season, you wouldn’t bet against him becoming the first rider since Philippe Gilbert in 2011 to win the Ardennes Classic hat-trick. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1479079673-2.jpg?v=1681376557\" alt=\"Tadej Pogacar\" /><em>Pogačar celebrating his monumental Tour of Flanders win (Getty Images)</em></p>\n<p><span>If there are any doubts about his chances, it’s that the subtlety of Amstel Gold’s parcours may play against his usual strategy of using brute force to drop everyone else, and fatigue might have caught up with him having raced hard since February. But with Pogačar, it always feels like you’re clutching at straws when thinking of reasons why he might not win.</span></p>\n<h3><span>Tom Pidcock</span></h3>\n<p>Some conspiracy theorists would have it that Tom Pidcock is already a winner of Amstel Gold, after his being deemed to have finished second-place behind Wout van Aert in an imperceptibly close photo finish at the 2021 edition sparked controversy on social media. Though that race is missing from his palmarès, he did add the similarly prestigious title of <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a> earlier this season, a result that makes him a top favourite this Sunday.</p>\n<p><span>He’ll have a strong Ineos Grenadiers line-up to support him, including defending champion Michał Kwiatkowski, but he’s likely to be the main man in a punchy race that is ideally suited to his characteristics. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/10piccock02_strade_bianche_2023_09f67a15-a304-4b79-9fdf-d75186584066.jpg?v=1681376784\" alt=\"Tom Pidcock\" /><em>Tom Pidcock dominated Strade Bianche this year with a solo victory (James Startt)</em></span></p>\n<h3><span>Tiesj Benoot</span></h3>\n<p>This being a spring Classic, at least one Jumbo-Visma rider must be considered among the top contenders, and in the absence of riders like Wout van Aert, Christophe Laporte and Primož Roglič, the team are backing Tiesj Benoot to deliver the goods.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/its-very-sad-and-disappointing-jumbo-visma-react-to-the-cruelty-of-paris-roubaix\"><em><strong>Read more: Cruel Paris-Roubaix leaves Jumbo-Visma rueing missed opportunity</strong></em></a></p>\n<p><span>Since winning Kuurne-Brussels-Kuurne and placing third at Strade Bianche towards the start of the spring, the Belgian has resorted back to his usual domestique role, but will get another chance to lead Jumbo-Visma in what is a home classic for the team. His punchy style and capable climbing make him a good fit for this race, and he placed third here last year, but to win he will likely have to reach the line solo rather than rely on his sprint. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-04071.jpg?v=1681376945\" alt=\"Tiesj Benoot\" /></div>\n<p><em>Tiesj Benoot came 13th at this year's Tour of Flanders (SWPix.com)</em></p>\n<h3><span>Benoît Cosnefroy</span></h3>\n<p>Second at last year’s Amstel Gold in a close photo finish last year, and third at Brabantse Pijl on Wednesday, a race he had already twice finished on the podium at — surely the time has come for Benoît Cosnefroy (AG2R Citroën) to win an elite Classic? </p>\n<p><span>The Frenchman has established himself as the nearly-man of the hilly Classics, someone who almost seems cursed in his quest to make the top step of the podium. But he has picked up some decent Classic wins in recent years, including the GP de Québec last season and the 2021 Bretagne Classic. Amstel Gold would be a significant step up from those races, but he has the talent if he can just find a little more luck. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1390665331_3da28456-29e1-4ebc-8d36-faaf1f68dd17.jpg?v=1681377021\" alt=\"Benoît Cosnefroy\" /><em>Will 2023 be Benoît Cosnefroy's year? (Getty Images)</em></span></p>\n<h3><span>Neilson Powless</span></h3>\n<p>High placings at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2023-everything-you-need-to-know\">Milan-Sanremo</a> (seventh), <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/dwars-door-vlaanderen-preview-route-predictions-and-contenders\">Dwars door Vlaanderen</a> (third) and the Tour of Flanders (fifth) has seen Neilson Powless (EF Education-EasyPost) attract lots of hype this spring, and expectations are high as he begins the series of races that he is apparently best suited to. Though he hasn’t actually ridden Amstel Gold before, his light frame means he should be better suited to the climbs of this race than the cobbled ones of the Belgian Classic. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-00483.jpg?v=1681377106\" alt=\"Neilson Powless\" /><em>Neilson Powless impressed at the Tour of Flanders this year, placing fifth in his De Ronde debut (SWPix.com) </em></p>\n<p>Victory at the 2021 San Sebastian lives long in the memory as a statement of what the American is capable of, while the subsequent eighth-place he managed at Liège-Bastogne-Liège and 12th overall at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> the following year underlined his credentials. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/crashes-a-lost-computer-and-no-idea-how-long-there-was-to-go-inside-nielson-powless-impressive-tour-of-flanders-debut\"><em><strong>Read more: Inside Neilson Powless's impressive Tour of Flanders debut</strong></em></a></p>\n<h3>Mauro Schmidt</h3>\n<p>After such a disappointing run in the cobbled Classics, Soudal - Quick-Step are relying on some results in the hilly Classics of Ardennes week to redeem their spring. But with key man Julian Alaphilippe missing out due to injury, their preparations have already been compromised. </p>\n<p>Remco Evenepoel is not racing until Liège-Bastogne-Liège, leaving it up to the team’s junior riders to deliver at Amstel Gold, of which Mauro Schmidt stands out as the most likely candidate. The Swiss rider caught the eye at the recent <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/itzulia-basque-country-2023-preview-route-predictions-and-contenders\">Itzulia Basque Country</a>, where he used his punchy sprint to register a couple of podium finishes and briefly threatened to infiltrate the top of the GC with a bold long-range attack on the final stage. He’s never before been a contender at the Ardennes Classics, but has the skill set. </p>\n<h3>Other contenders</h3>\n<p><span>With its punchy terrain, and place in the calendar just over a week before Amstel Gold, Itzulia Basque Country is a useful guide for who will go well during Ardennes Classics week. </span><strong>Ide Schelling </strong><span>(Bora-Hansgrohe) managed to win a stage there, while </span><strong>Mattias Skjelmose </strong><span>(Trek-Segafredo), </span><strong>Alex Aranburu </strong><span>(Movistar) and Schmidt’s Soudal - Quick-Step teammate </span><strong>Andrea Bagioli </strong><span>were all also up there in the sprint finishes.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1480615421.jpg?v=1681377384\" alt=\"Andrea Bagioli\" /><em>Andrea Bagioli during stage five of Itzulia Basque Country (Getty Images)</em></span></p>\n<p><span>Amstel Gold is a tough race however and does tend to be very selective, with small groups of either two or three riders generally contesting for victory at the finish. The parcours is therefore better suited to puncheurs who can get away on the climbs, in which case both Israel PremierTech with </span><span><strong>Michael Woods</strong> </span><span>and </span><strong>Dylan Teuns </strong><span>and Groupama-FDJ with </span><strong>David Gaudu </strong><span>and </span><strong>Valentin Madouas </strong><span>are well stocked.</span></p>\n<p><span>In terms of Amstel Gold pedigree, both </span><span><strong>Max Schachmann</strong> </span><span>(Bora-Hansgrohe) and </span><strong>Simon Clarke</strong><span> (Israel-Premier Tech) have both placed on the podium here in the past, but their recent form suggests they’re not in a position to do so again this year.</span></p>\n<p><span>With no Mathieu van der Poel, </span><strong>Søren Kragh Andersen </strong><span>has the chance to emerge from the Dutchman’s shadow for Alpecin-Deceuninck, and forms part of a dangerous double-headed attack with <strong>Quinten Hermans</strong>. </span><strong>Matej Mohorič </strong><span>(Bahrain-Victorious) is among the contenders, as he has been for so many races this spring, but may be beginning to tire now having raced hard since February.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1475872068.jpg?v=1681377704\" alt=\"Søren Kragh Andersen\" /><em>Søren Kragh Andersen at E3 Saxo Classic, where he finished in ninth place (Getty Images)</em></span></p>\n<p><span>By contrast, last year’s fifth-place finisher </span><strong>Alexander Kamp </strong><span>(Tudor Pro Cycling) could be coming into form in time having placed sixth at Brabantse Pijl, and the two riders who surprisingly placed first and second at that race, </span><strong>Dorian Godon </strong><span>(AG2R Citroën) and </span><strong>Ben Healy</strong><span> (EF Education-EasyPost), must now also be viewed as outside contenders. </span></p>\n<h3><span>Men's Amstel Gold Race 2023 prediction </span></h3>\n<p><span>It’s unusual for riders who do well at the cobbled Classics to go on and compete for victory at Amstel Gold and the Ardennes Classic, but Tour of Flanders winner </span><strong>Tadej Pogačar </strong><span>is no ordinary rider. </span></p>\n<p><span>As recent victories from Wout van Aert (2021) and Mathieu van der Poel (2019) attest to, as well as the run of success enjoyed here by four-time winner and former Classics great Philippe Gilbert, Amstel Gold is a selective enough classic to ensure that the cream generally rises to the top; in which case, it’s hard to envision anyone staying with Pogačar whenever he decides to launch his bid for victory. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f828f541b2770b5c6f674b449ff0fc3fc85fa12f80fcdda440f1ae28290ff04f","category":"Cycling"}