{"title":"ย้อนอดีต 30 ปี วทท. 2.0 จุดกำเนิดมาตรฐานกลางภาษาไทยบนคอมพิวเตอร์","link":"https://www.blognone.com/node/125249","date":1634115613000,"content":"<div><div><div><p>การใช้งานภาษาไทยบนคอมพิวเตอร์มีมานาน 54 ปีแล้ว แต่ในยุคแรกเริ่มเป็นต่างคนต่างทำ ข้อมูลภาษาไทย (คำในแง่เทคนิคคือ รหัสอักขระภาษาไทย) ในคอมพิวเตอร์แต่ละระบบไม่สามารถอ่านข้ามกันได้ง่ายนัก</p>\n<p>ดร.ทวีศักดิ์ กออนันตกูล อดีตผู้อำนวยการสำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ (สวทช.) ได้โพสต์เล่าเบื้องหลังการแก้ปัญหาข้างต้น และวางมาตรฐานภาษาไทยเป็นมาตรฐานกลางให้ทุกฝ่ายใช้งานร่วมกันได้</p>\n<p>งานเรื่องการพัฒนามาตรฐานอักขระภาษาไทยเริ่มในปี 2527 โดย ดร.ทวีศักดิ์ สำรวจรหัสอักขระที่ใช้กันในสมัยนั้น และพบว่ามีรหัสอักขระถึง 35 แบบ ทำให้สำนักงานมาตรฐานผลิตภัณฑ์อุตสาหกรรม (สมอ.) กำหนดมาตรฐานกลาง (แบบไม่บังคับให้ใช้) ขึ้นมาในปี 2529</p>\n<p>หลังจากนั้นเพียงหนึ่งปี ผู้ขายคอมพิวเตอร์ในไทยก็รองรับมาตรฐานของ สมอ. แต่ยังขาดมาตรฐานเรื่องแป้นพิมพ์ หรือวิธีการแก้ไขข้อความบนจอ ฯลฯ ทำให้กลุ่มผู้ขายคอมพิวเตอร์ภาคเอกชน ร่วมกับหน่วยงานภาครัฐ ก่อตั้งกลุ่ม Thai Application Programming Interface หรือ TAPIC (Thai API Consortium) ขึ้นมา</p>\n<p>ผลงานของกลุ่ม TAPIC คือข้อกำหนด วทท. 2.0 “อักขรวิธีสำหรับภาษาไทยสำหรับคอมพิวเตอร์” ที่ตีพิมพ์อย่างเป็นทางการในวันที่ 10 ตุลาคม 2534 (วทท ย่อมาจาก \"วิ่งทุกที่\") ซึ่งกลายเป็นมาตรฐานกลางที่อุตสาหกรรมคอมพิวเตอร์นำไปใช้งานจนถึงปัจจุบัน (เริ่มใช้ใน MS-DOS 6.0 เป็นต้นมา)</p>\n<p>ตัวเอกสาร วทท. 2.0 ฉบับเต็มสามารถดาวน์โหลดได้จาก<a href=\"https://www.nstda.or.th/home/knowledge_post/computers-and-the-thai-language/\">หน้าเว็บของ สวทช.</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a5fae9964ae7468225d43f1a0cbbcc2e.png\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/953deeac0a4fd24a897bfdef163b5a8f.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/thailand\">Thailand</a></div><div><a href=\"/topics/localization\">Localization</a></div><div><a href=\"/topics/nstda\">NSTDA</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f8323c27b5941000c3277db94598bbd510a9e1f73b0cdb04f9e7b697f204a0aa","category":"Thai"}