{"title":"The Impact of EMI Dependency on Household Financial Stability in India: A Risk Analysis in the Face of Global Economic Uncertainty","link":"https://www.preprints.org/manuscript/202410.1203/v1","date":1729009020000,"content":"India’s increasing reliance on equated monthly installments (EMIs) has reshaped household financial behavior in ways that pose significant risks to long-term economic stability. This paper examines the growing trend of EMI-driven debt accumulation, highlighting its detrimental effect on household savings and the rising financial vulnerability across demographic groups. Leveraging data from the Reserve Bank of India (RBI), CRISIL, and the National Statistical Office (NSO), the study delves into how debt dynamics are shifting within Indian households, particularly in the context of broader economic trends. Retail credit has expanded rapidly, growing from 12.1% of GDP in 2017 to 19.4% by 2023, with housing loans now making up nearly half of all retail loans. Concurrently, the growth of unsecured loans, such as credit card debt, has surged at an annual rate of 21.3% between 2021 and 2024, reflecting the increasing ease of borrowing for consumers. However, this boom in credit has coincided with a marked drop in household financial savings, which fell to a 47-year low of 5.3% in FY22, underscoring a troubling shift from saving to borrowing. The younger population, particularly those under 35, have been the most active in taking on debt, with loans to this group nearly doubling between 2015 and 2021 due to the rise of fintech platforms and non-banking financial companies. This shift has contributed to a steep rise in debt-service-to-income ratios, amplifying the financial risks for these households in the face of potential economic shocks. By connecting these micro-level household debt trends to broader macroeconomic risks, this paper reveals how India’s EMI culture could deepen the impact of future financial crises, leading to widespread defaults and destabilizing the economy. The study calls for proactive regulatory measures and enhanced financial literacy programs to curb the growing reliance on consumer credit and mitigate the risks of a broader financial collapse.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f837125c8fab5cf360c5d8ae1e8cb313f8f362fa5a59b870bc3313c21976bb66","category":"Interdisciplinary"}