{"title":"Mountainous Floodplain Connectivity in Response to Hydrological Transitions","link":"https://onlinelibrary.wiley.com/doi/10.1029/2024WR037162?af=R","date":1719639671000,"content":"<h2>Abstract</h2>\n<p>In mountainous watersheds, floodplain sediments are typically characterized by gravel bed layers capped by an overlying soil unit that serves as a hotspot for biogeochemical reactivity. However, the influence of soil biogeochemistry on gravel bed underflow composition remains unclear, especially during hydrological transitions that alter the vertical connectivity between overlaying soils and the underlying gravel bed. This study investigates these dynamics by measuring hydraulic gradients and water compositions over three hydrological years in a typical mountainous, low-order stream floodplain in the Upper Colorado River Basin. Results indicate that the timing of hydrological conditions strongly influences the vertical exchanges that control water quality. Specifically, during flooding events such as beaver ponding, that induce downward flushing of the soil, anoxic conditions prevalent in the biogeochemically active soil are transferred downstream via gravel bed underflow. Conversely, snowmelt and drought conditions increase oxic conditions in the gravel bed due to diminished hydrological connectivity with the overlying soil. To compare water quality response to hydrological transitions across similar floodplain environments, we propose a conceptual model that quantifies the inundation-induced flushing of soil porewater to measure solute exchange efficiency with the gravel bed solute convergence efficiency (SCE). This model provides a framework for quantifying biogeochemical processes in hydrological underflow systems, which is critical for water and elemental budgets in these globally important mountainous ecosystems.</p>","author":"Tristan Babey, \nZach Perzan, \nSam Pierce, \nBrian Rogers, \nLijing Wang, \nRosemary W. H. Carroll, \nJohn R. Bargar, \nKristin Boye, \nKate Maher","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"f84501ea5285528282f67b351ef3c12ce995cf5771de471559ecbcee18d6fc2d","category":"Environment"}