{"title":"Forecasting extremely high ischemic stroke incidence using meteorological time serie","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310018","date":1726063200000,"content":"<p>by Lucia Babalova, Marian Grendar, Egon Kurca, Stefan Sivak, Ema Kantorova, Katarina Mikulova, Pavel Stastny, Pavel Fasko, Kristina Szaboova, Peter Kubatka, Slavomir Nosal, Robert Mikulik, Vladimir Nosal</p>\r\nMotivation <p>The association between weather conditions and stroke incidence has been a subject of interest for several years, yet the findings from various studies remain inconsistent. Additionally, predictive modelling in this context has been infrequent. This study explores the relationship of extremely high ischaemic stroke incidence and meteorological factors within the Slovak population. Furthermore, it aims to construct forecasting models of extremely high number of strokes.</p> Methods <p>Over a five-year period, a total of 52,036 cases of ischemic stroke were documented. Days exhibiting a notable surge in ischemic stroke occurrences (surpassing the 90th percentile of historical records) were identified as extreme cases. These cases were then scrutinized alongside daily meteorological parameters spanning from 2015 to 2019. To create forecasts for the occurrence of these extreme cases one day in advance, three distinct methods were employed: Logistic regression, Random Forest for Time Series, and Croston’s method.</p> Results <p>For each of the analyzed stroke centers, the cross-correlations between instances of extremely high stroke numbers and meteorological factors yielded negligible results. Predictive performance achieved by forecasts generated through multivariate logistic regression and Random Forest for time series analysis, which incorporated meteorological data, was on par with that of Croston’s method. Notably, Croston’s method relies solely on the stroke time series data. All three forecasting methods exhibited limited predictive accuracy.</p> Conclusions <p>The task of predicting days characterized by an exceptionally high number of strokes proved to be challenging across all three explored methods. The inclusion of meteorological parameters did not yield substantive improvements in forecasting accuracy.</p>","author":"Lucia Babalova","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f84783b1f60537c5d35734741373bfd02ae1d4784f843bda90692ac57b26e834","category":"Interdisciplinary"}