{"title":"Flamingos as ecosystem engineers: flock size and foraging behaviors linked to nutrient availability","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae062/7726170?rss=1","date":1722556800000,"content":"<span><div>Abstract</div>In wetland ecosystems, birds play a crucial role in nutrient cycling through various activities such as excrement deposition, sediment disturbance during foraging, and utilization of mud and vegetation for nesting. Particularly noteworthy are species exhibiting colonial breeding or high sociability, as they can significantly influence waterbody communities and act as ecosystem engineers in these habitats. Flamingos (Phoenicopteridae) possess all these characteristics, making them potential ecosystem engineers. In this study, we aim to test the hypothesis that Chilean Flamingos (<span>Phoenicopterus chilensis</span>) exert such effects on an important non-breeding wetland. Moreover, we seek to elucidate the underlaying reasons for these effects and their relationship with flock size and foraging behavior. To accomplish this, we conducted a year-long study on the flock of Chilean Flamingos at Lagoa do Peixe National Park in southern Brazil. We collected environmental and behavioral data, including nitrogen, phosphorus, and dissolved oxygen levels, water turbidity, salinity, and temperature, from areas both with and without flamingos. Our findings suggest a significant role of Chilean Flamingos in maintaining the nutrient cycle within wetland ecosystems. This is attributed not only to the high levels of guano deposition but also to the bioturbation caused by their foraging behaviors. Furthermore, we observed a significant correlation between flock size, the mean duration of foraging behaviors, and the magnitude of these effects. This study points to the likely effects of flamingos on wetlands ecosystems, emphasizing the intricate interplay between these birds and their habitats and highlighting the importance of conserving both the species and their ecosystems.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"f84c3d9b8ed9b7c07fa82c700ed9be2f604d37c15cfe21b97385b3bb564b632e","category":"Environment"}