{"title":"A refinement to eRNA and eDNA-based detection methods for reliable and cost-efficient screening of pathogens in Atlantic salmon aquaculture","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312337","date":1729519200000,"content":"<p>by Ottavia Benedicenti, Marit Måsøy Amundsen, Saima Nasrin Mohammad, Trude Vrålstad, David A. Strand, Simon Chioma Weli, Sonal Patel, Hilde Sindre</p>\r\n\r\nFinfish aquaculture is one of the fastest-growing food production sectors in the world, and numerous infectious diseases are a constant challenge to the fish farming industry, causing decreased fish health and, consequently, economic losses. Specific and sensitive tools for pathogen detection are crucial for the surveillance of environmental samples to prevent the spread of fish pathogens in farms. Monitoring of waterborne pathogens through filtration of water and subsequent molecular detection of target-specific DNA or RNA sequence motifs is an animal-friendly method. This approach could reduce or even replace the sacrifice of fish for monitoring purposes in aquaculture and allow earlier implementation of disease control measures. Sampling methods might be a bottleneck, and there is a need for simple sampling methods that still ensure the best detection probability. In this study, we tested different filtration methods with spiked freshwater and seawater for a panel of fish pathogens to discern a suitable procedure that can be easily applied on-site by farm personnel without compromising detection probability. Specifically, we tested combinations of different filtration flow rates, lysis buffers, and filters for the detection of some of the pathogens relevant to the aquaculture industry. The results showed that a “sandwich” filtration method using two different filters and a flow rate of up to 4.0 L/min ensured good pathogen detection. The filters, consisting of a hydrophilic glass fibre filter with binder resin on the top and a hydrophilic mixed cellulose esters membrane at the bottom, achieved the best concentration and qPCR detection of both viral and bacterial fish pathogens. This up-and-coming tool allows the detection of very different fish pathogens during a single filtration step, and it can be combined with one single automated total nucleic acid extraction step for all the investigated pathogens, reducing both analysis costs and time.","author":"Ottavia Benedicenti","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f84d2781b986405094c14428d4c30b9c145d3f866b46cf8f8bf9d99962326f92","category":"Interdisciplinary"}