{"title":"The embodiment of the neighborhood socioeconomic environment in the architecture of the immune system","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae253/7700173?rss=1","date":1719446400000,"content":"<span><div>Abstract</div>There is growing recognition of the importance of immune health for understanding the origins of ageing-related disease and decline. Numerous studies have demonstrated consistent associations between the social determinants of health and immunosenescence (i.e. ageing of the immune system). Yet few studies have interrogated the relationship between neighborhood socioeconomic status (nSES) and biologically specific measures of immunosenescence. We used data from the US Health and Retirement Study to measure immunosenescence linked with neighborhood socioeconomic data from the National Neighborhood Data Archive to examine associations between indicators of nSES and immunosenescence. We found associations between both the ratio of terminally differentiated effector memory to naïve (EMRA:Naïve) CD4+ T cells and cytomegalovirus (CMV) immunoglobulin G (IgG) levels and nSES. For the CD4+ EMRA:Naïve ratio, each 1% increase in the neighborhood disadvantage index was associated with a 0.005 standard deviation higher value of the EMRA:Naïve ratio (95% CI: 0.0003, 0.01) indicating that living in a neighborhood that is 10% higher in disadvantage is associated with a 0.05 higher standardized value of the CD4+ EMRA:Naïve ratio. The results were fully attenuated when adjusting for both individual-level SES and race/ethnicity. For CMV IgG antibodies, a 1% increase in neighborhood disadvantage was associated a 0.03 standard deviation higher value of CMV IgG antibodies (<span>β</span> = 0.03; 95% CI: 0.002, 0.03) indicating that living in a neighborhood that is 10% higher in disadvantage is associated with a 0.3 higher standardized value of CMV. This association was attenuated though still statistically significant when controlling for individual-level SES and race/ethnicity. The findings from this study provide compelling initial evidence that large, nonspecific social exposures, such as neighborhood socioeconomic conditions, can become embodied in cellular processes of immune ageing.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"f85762ee8946c7300f28cf91118f997036202208208fb633189f7216fa7e175b","category":"Interdisciplinary"}