{"title":"Use of antimicrobials and other medical products in an ethnic minority context of South-Central Vietnam: A qualitative study of vulnerability","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002982","date":1712671200000,"content":"<p>by Maya Ronse, Thuan Thi Nguyen, Xa Xuan Nguyen, Brecht Ingelbeen, Mira Leonie Schneiders, Duong Thanh Tran, Joan Muela Ribera, Charlotte Gryseels, Koen Peeters Grietens</p>\r\n\r\nDespite the global threat of antimicrobial resistance (AMR), evidence on the use and quality of medicines at community level is limited, particularly in impoverished, rural areas where prevalence of (bacterial) infections is high. To better understand the processes that drive vulnerability to AMR’ effects, this study aimed to assess social factors underpinning access to–and use of–medical products and healthcare, among people from the Raglai ethnic minority in Ninh Thuan Province, Vietnam. We conducted ethnographic research in eight villages in 2018–2019, using interviewing and participant observation methods for data collection. Different types of informants (including community members and healthcare providers) were selected using purposive sampling strategies and analysis was retroductive. Our findings show that, despite the existence of a government-funded health insurance scheme, Raglai people’s flexible therapeutic itineraries did not systematically start with formal healthcare. Different types of care (private/informal, public, shamanic) were combined in parallel or in alternation, determined by distance to the provider, cost, workload, perceived diagnostic capacity, perceived severity and aetiology of the illness, and trust in the provider. Available medicines were often tablets dispensed in plastic bags containing labelled tablets, unlabelled tablets (in bulk) or tablets ground to powder. Treatment was often considered effective when it relieved symptoms, which led to abandonment of the treatment course. When symptoms did not speedily abate, the illness aetiology would be reinterpreted, and “stronger” medicines would be sought. The precarious socio-economic status of some Raglai drove them in cycles of severe poverty when additional unforeseen factors such as illness, animal disease or loss of crops arose, hampering access to (in)formal healthcare providers and/or appropriate diagnosis and treatment. We conclude that Raglai communities are structurally unable to buffer themselves against the threat and consequences of AMR. Despite this vulnerability, they are among the least targeted by efforts to optimize antibiotic use, which are concentrated in secondary and tertiary healthcare facilities targeted at urban populations.","author":"Maya Ronse","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"f85e9a2e914e3b9fb10b35b3825dc4f7437c2615d5124f6602bc9fe455137ecd","category":"Environment"}