{"title":"Aridity threshold for alpine soil nitrogen isotope signature and ecosystem nitrogen cycling","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17357?af=R","date":1717138800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/08353b90-c056-458e-98a5-12237fa9eb64/gcb17357-toc-0001-m.png\" alt=\"Aridity threshold for alpine soil nitrogen isotope signature and ecosystem nitrogen cycling\" />\n<p>Using an aridity gradient across a 3000-km transect of drylands on the Qinghai–Tibetan Plateau, we found that the effect of increasing aridity on soil δ<sup>15</sup>N values shifted from negative to positive in both topsoil and subsoil layers. We further found different mechanisms driving soil <sup>15</sup>N isotopes in different aridity regions. In wetter regions, high soil δ<sup>15</sup>N mainly result from <sup>15</sup>N fractionation during soil N cycling, whereas, in drier regions, high soil δ<sup>15</sup>N might be attributed to other mechanisms.</p>\n<br />\n<h2>Abstract</h2>\n<p>Determination of tipping points in nitrogen (N) isotope (δ<sup>15</sup>N) natural abundance, especially soil δ<sup>15</sup>N, with increasing aridity, is critical for estimating N-cycling dynamics and N limitation in terrestrial ecosystems. However, whether there are linear or nonlinear responses of soil δ<sup>15</sup>N to increases in aridity and if these responses correspond well with soil N cycling remains largely unknown. In this study, we investigated soil δ<sup>15</sup>N and soil N-cycling characteristics in both topsoil and subsoil layers along a drought gradient across a 3000-km transect of drylands on the Qinghai–Tibetan Plateau. We found that the effect of increasing aridity on soil δ<sup>15</sup>N values shifted from negative to positive with thresholds at aridity index (AI) = 0.27 and 0.29 for the topsoil and subsoil, respectively, although soil N pools and N transformation rates linearly decreased with increasing aridity in both soil layers. Furthermore, we identified markedly different correlations between soil δ<sup>15</sup>N and soil N-cycling traits above and below the AI thresholds (0.27 and 0.29 for topsoil and subsoil, respectively). Specifically, in wetter regions, soil δ<sup>15</sup>N positively correlated with most soil N-cycling traits, suggesting that high soil δ<sup>15</sup>N may result from the “openness” of soil N cycling. Conversely, in drier regions, soil δ<sup>15</sup>N showed insignificant relationships with soil N-cycling traits and correlated well with factors, such as soil-available phosphorus and foliage δ<sup>15</sup>N, demonstrating that pathways other than typical soil N cycling may dominate soil δ<sup>15</sup>N under drier conditions. Overall, these results highlight that different ecosystem N-cycling processes may drive soil δ<sup>15</sup>N along the aridity gradient, broadening our understanding of N cycling as indicated by soil δ<sup>15</sup>N under changing drought regimes. The aridity threshold of soil δ<sup>15</sup>N should be considered in terrestrial N-cycling models when incorporating <sup>15</sup>N isotope signals to predict N cycling and availability under climatic dryness.</p>","author":"Jinhua Mao, \nJunxiao Pan, \nLei Song, \nRuiyang Zhang, \nJinsong Wang, \nDashuan Tian, \nQuancheng Wang, \nJiaqiang Liao, \nJinlong Peng, \nShuli Niu","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"f86f9fe16e9936b269b2775eb842b39f0b6c3f9fd9ec30d4a5da943ff0edfae1","category":"Environment"}