{"title":"A cheap PC buyer’s hellish journey triggers the Macalope’s PCSD","link":"https://www.macworld.com/article/344511/macalope-cheap-pc-buyer-dell-hidden-costs-components-cards-power-supply.html","date":1619519400000,"content":"\n<div>\n<section><div></div></section><p>We interrupt this site’s Apple news and commentary to bring you breaking news from the other side: Sometimes PC purchases go horribly wrong.</p>\n\n\n\n<p>Yes, if you like this column then you will probably enjoy this thread on Twitter from Eypatch Wolf about his recent purchase of a high-end desktop computer from Dell. It is also painful but amusing.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/EyePatchWolf/status/1382355450050580486&amp;xcust=1-1-344511-0-0-0&amp;sref=https://www.macworld.com/feed\">“Buying a PC with Dell: My Journey Into Hell”</a></p>\n\n\n\n<p>Suffice it to say, <em>it did not go well</em>. Some of it is his fault, he recognizes, but much more of it is Dell’s. While he could have been more careful checking the configuration, it turns out the machine he bought could only take specific proprietary components that were not included and was not the powerhouse it looked like without them.</p>\n\n\n\n<p>Yeah, you read that right. “Proprietary components.” In a PC. Turns out irony isn’t dead.</p>\n\n\n\n<p>Eventually, after making him miserable for a number of weeks, Dell offered to make the problem go away. Don’t try this yourself, though, because it was probably only slid across the table because Eyepatch Wolf has over a million followers on YouTube. Your mileage may vary significantly.</p>\n\n\n\n<p>The Macalope doesn’t know how much of this story is literally true and how much is fancifully exaggerated for effect. He probably wouldn’t even mention it except he’s had similar experiences with hidden PC costs, so it rings as familiar and expected as a sax solo in an ‘80s ballad. For a guy with a Classic Mac as a head, the Macalope has used more Windows PCs than you might imagine. He’s had a variety of experiences but one thing that is consistent is that there is a cost to swimming in the PC pool that rarely gets calculated.</p>\n\n\n\n<p>The Macalope fondly remembers overhearing two men talking on a train. One was describing the new computer he just bought. He didn’t buy a Mac, of course, because “they’re too expensive”. The sage nodding they both conducted at that was like spending a day at the Adlai Stevenson Cosplay Camp. It was slightly whiplash-inducing, then, when the purchaser went on to describe how he paid another $100-plus to have a clean install of Windows put on to get rid of all the crapware. Something tells the horny one that additional cost didn’t go into his calculation when comparing it to a Mac.</p>\n\n\n\n<p>Yes, Apple removes choice. And sometimes you want or even need choice. But Apple also removes confusion.</p>\n\n\n\n<p>The Macalope recently inherited a PC from someone. It didn’t have a dedicated graphics card but the manual had helpful pictures of how to install one. Cool, the Macalope though, being an idiot. I can play games on this!</p>\n\n\n\n<p>Haha. You <em>dope</em>.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>IDG</p></div>\n\n\n\n<p>After some further research, he realized the slot was low-profile, so most graphics cards wouldn’t fit. But some would. Which ones? Glad you asked! No idea. The manufacturer was apparently under some kind of blood oath not to reveal which ones because other than cartoon of someone putting a mythical graphics card into this machine, no other information you’d actually need to have in order to do so appeared in the documentation or on their web site. Okay, the Macalope’s made deals with bog witches before. He gets it. They’re notoriously secretive! That’s why they live in bogs!</p>\n\n\n\n<p>The Macalope almost just bought a card and tried it but he’s glad he didn’t because, as it turns out, problem number two was that the power supply isn’t strong enough to run almost any graphics card you’d actually want to install. There are a few it will run, but it’s unclear if they’d offer much, if any, of an advantage over the Intel graphics on the CPU. You can, theoretically, upgrade the power supply to get more juice, but if you think the manufacturer is willing to divulge which ones might work, then the Macalope will simply refer you to the aforementioned bog witch terms of service and end-user license agreement which are <em>very</em> specific about not divulging such information.</p>\n\n\n\n<p>Now, you can point out that you couldn’t even attempt this on any Mac other than the Mac Pro which is in a way higher price class. This is true, but the Macalope will point out back to you that you effectively can’t attempt this on the PC he has, either, without a lot of tears, cursing as in swearing and cursing as in bog witches. Sometimes “choice” exists as more of a theoretical construct instead of anything actually tangible.</p>\n\n\n\n<p>That’s not to say that you should never buy a PC. Again, there are times when <em>only</em> a PC makes sense. And some people prefer a PC. That’s OK! Just remember that not all the costs of buying one appear on the price sheet.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f871fac10c1ab4da1971dfc5bd97a2f1af14e432e4dd8bdc50a8c0fa5db720a6","category":"Apple"}