{"title":"MetMo Pocket Driver: An Innovative Take on Ratcheting Multitools","link":"https://bikerumor.com/metmo-pocket-driver-ratcheting-multitool/","date":1685368831000,"content":"<p>Watching the Kickstarter video for the MetMo Pocket Driver, I couldn’t help but think of the LEGO movies. </p>\n\n\n\n<p>For me, there’s a clear parallel between increasingly flexible <a href=\"https://bikerumor.com/milkit-hassleoff-multitool-under-bike-bottle-cage/\">multitools</a>, and the “Master Builders” of those family films, who assemble spaceships and Batmobiles in seconds using only colorful toy blocks. (And wouldn’t you know it, an enterprising designer just created a <a href=\"https://ideas.lego.com/projects/2a1cf71b-5f5c-4bf1-9a83-b3007367a997\">LEGO multi-tool</a> in December.)</p>\n\n\n\n<p>MetMo’s Pocket Driver, however, aims for real-world Master Builders who want a ratchet tool they can take anywhere. It’s an attempt to capitalize on the success of the larger Metmo Driver, which the U.K.-based company released on <a href=\"https://www.indiegogo.com/projects/metmo-driver-the-world-s-most-satisfying-driver#/\" target=\"_blank\">IndieGogo</a> last year. </p>\n\n\n\n<p>That two-handed ratchet tool raked in £1.3 million — and its smaller successor may bring in even more support. The one-handed Pocket Driver has already raised nearly a million dollars on <a href=\"https://www.kickstarter.com/projects/metmo/metmo-pocket-driver/\" target=\"_blank\">Kickstarter</a>, with 30 days left in the campaign, as of May 26. </p>\n\n\n\n<p>Whether you’re looking for an on-the-go ratchet tool for your bike, a handy tool for spur-of-the-moment repairs, or “a fun toy to fiddle with,” the Pocket Driver can drive the distance, MetMo says. </p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<h2>MetMo Pocket Driver: Details</h2>\n\n\n\n<p>Both the original Driver from last year and the newer Pocket are a hybrid design of “the hand braces of old (the pre-cursors to electric drills) and modern ratchet screwdrivers,” MetMo explained on its IndieGogo page last year. </p>\n\n\n\n<p>The company’s designers took inspiration from Conrad Baumann’s ratchet driver from the 1950’s and what they called its “mesmerising exposed ratchet mechanism.” They ended up with what they called “the most powerful and compact driver in existence.” </p>\n\n\n\n<p>With the Pocket, MetMo is essentially offering the <a href=\"https://www.kickstarter.com/projects/metmo/metmo-pocket-driver/posts/3810548\" target=\"_blank\">same tool in a smaller size</a>. The Pocket works with any 1/4 inch hex bit and can store 2 x 25mm bits internally. Its flexible metal arm can be arranged into four different grips, and the makers say its smaller size makes it ideal for handling screws in hard-to-reach places. </p>\n\n\n\n<p>It’s perfect for “light/ medium duty tasks like assembling furniture or tightening up a loose bike seat,” MetMo said. </p>\n\n\n\n<p>MetMo offers eight different versions for those interested in buying the tool on Kickstarter. The most basic version, in black, costs £89, or about $110. A version completely in solid stainless steel costs £165 ($204). And if you need to have the most bling of all the Master Builders, you can fork over £350 ($432) for a version plated with 24k gold. </p>\n\n\n\n<p>Now that’s screwing in style. </p>\n\n\n\n<p><a href=\"https://www.metmo.co.uk/\" target=\"_blank\">MetMo.co.uk</a></p>\n<p>The post <a href=\"https://bikerumor.com/metmo-pocket-driver-ratcheting-multitool/\">MetMo Pocket Driver: An Innovative Take on Ratcheting Multitools</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Andrew McLemore","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"f873b9a72778c2dc7cc22dc82cb99899bf7047fbae6c03fb3d2ec4394c63c9d4","category":"Cycling"}