{"title":"DT Swiss has a new faster, wider, Arc 1100 Dicut Disc","link":"https://cyclingtips.com/2021/08/dt-swiss-has-a-new-faster-wider-arc-1100-dicut-disc/","date":1628751633000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/DT-Swiss-ARC-1100-Dicut-Disc-11-650x366.jpg\" /></div><h2>DT Swiss has a new faster, wider, Arc 1100 Dicut Disc</h2><p>\n</p><p>DT Swiss has unveiled its new Arc 1100 Dicut Disc wheel, a wheel it says is the completion of its aero wheel range. DT Swiss designed the Arc 1100 to meet the requirements of the modern time trial frames and racers with disc brake only compatibility and a tubeless-ready, 20mm wide internal rim. </p>\n\n\n\n<p>DT Swiss says the Arc 1100 Disc is its fastest aero wheel for time triallists (and triathletes), incorporating the most recent trends, optimised for wider tyres, with a customised design. The whole shebang is engineered, designed and assembled in Switzerland.  </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/DT-Swiss-ARC-1100-Dicut-Disc-6-1340x754.jpg\" /><figcaption>The 20mm internal rim width is, they presume, the widest disc wheel rim on the market.  </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/DT-Swiss-ARC-1100-Dicut-Disc-8-1340x754.jpg\" /><figcaption>No more stickers! DT Swiss includes a tool-free wheel-specific vale hole cover for the new disc.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/DT-Swiss-ARC-1100-Dicut-Disc-7-1340x754.jpg\" /><figcaption>That valve hole cover has the wheel’s maximum tyre pressures for various setups printed on the inside. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/DT-Swiss-ARC-1100-Dicut-Disc-1-1340x754.jpg\" /><figcaption>The wheel contruction features carbon pieces and an internal foam plate for increased stiffness. </figcaption></figure></li></ul></figure>\n\n\n\n<p>Developed in partnership with aero experts SwissSide, DT Swiss claims the new wheel maximises performance on flat to undulating terrain. The new wheel weighs in at 1100g, a relatively competitive weight for a disc brake and tubeless-ready disc wheel. Although the addition of disc brake compatibility usually results in a slight weight penalty, DT Swiss claims shifting to disc brakes allows the brand to use less heat-sensitive resins in the rim construction, negating some of the weight gain. </p>\n\n\n\n<p>DT Swiss has optimised the rim for use with 28 mm tyres, in keeping with the trend towards wider tyres said to offer lower rolling resistance and increased comfort. While optimised for that 28 mm width, DT Swiss says the new wheel is compatible within a range of tyre sizes from 25-32 mm. </p>\n\n\n\n<p>DT Swiss claims the decreased rolling resistance offered by a wider tyre at lower pressures outweighs any aero penalty you might expect, since the rear tyre’s placement is less exposed to wind. DT Swiss uses a 20mm inner rim width to accommodate these wider tyres, which it says is “assumedly” the widest internal width disc wheel currently on the market. (<a href=\"https://www.hedwheels.com/product-page/vanquish-disc-wheel-disc-brake-2020\">HED</a> might beg to differ) </p>\n\n\n\n<p>The new Arc 1100 Disc wheel features a hooked rim profile, a design DT Swiss says it is convinced is “technically the optimal rim construction in terms of safety for bikes that require a relatively high pressure in combination with relatively wide tyres.” DT Swiss designed and engineered the new rim in house, and the wheel is composed of eight equally sized and symmetrically aligned glued carbon pieces and an internal foam plate. The woven carbon layup is said to strengthen the structure, while the foam plate provides high lateral and torsional stiffness. </p>\n\n\n\n<p>The designers have left no stone unturned with the new wheel, going as far as to design a tool-free valve hole cover specifically for the wheel to create an uninterrupted smooth wheel surface. The valve is accessed by simply rotating the valve cover 90°. Inside that valve hole cover, DT Swiss has helpfully indicated the maximum tyre pressures for various tyre sizes and types. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/DT-Swiss-ARC-1100-Dicut-Disc-v-Zipp-1340x754.jpg\" /><figcaption>Wind tunnel data comparing the new disc wheel paired with a DT Swiss Arc 1100 Dicut 80 front wheel compared to the same 80mm wheel front and rear and a Zipp wheel combination.</figcaption></figure>\n\n\n\n<p>But what does all this mean on the results sheet? DT Swiss has provided wind tunnel results suggesting the new Arc 1100 Disc, paired with an Arc 1100 Dicut 80 front wheel, saves the rider two watts at 45 kph when compared to a Zipp 808 front wheel paired with a Zipp Super 9 disc wheel on the rear. DT Swiss used a Canyon Speedmax and Continental GP5000 TL tyres for the test and observed similar savings for the 80/Disc setup compared to DT Swiss’s own Arc 1100 80 mm front and rear setup. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/DT-Swiss-ARC-1100-Dicut-Disc-5-1340x754.jpg\" /></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/DT-Swiss-ARC-1100-Dicut-Disc-9-1340x754.jpg\" /></figure></li></ul></figure>\n\n\n\n<p>DT Swiss has built its 180 Dicut hub with the <a target=\"_blank\" href=\"https://cyclingtips.com/2021/05/dt-swiss-acknowledges-ratchet-exp-hub-problems-in-new-service-bulletin/\">Ratchet EXP System</a> and Sinc ceramic bearings into the Arc 1100. DT Swiss claims the Sinc ceramic bearings provide “optimal rolling behaviour” and longer bearing life thanks to the EXP System and increased bearing distance. </p>\n\n\n\n<p>With new black and red decals, the Arc 1100 Disc aesthetics are aligned with the brand’s other aero wheels. For those who like some customisation options, DT Swiss also includes gold, chrome, and black decals with every wheel.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/DT-Swiss-ARC-1100-Dicut-Disc-2-1340x754.jpg\" /><figcaption>DT Swiss provides black, gold, and chrome decals for an element of customisation. </figcaption></figure>\n\n\n\n<p>The Arc 1100 Dicut Disc is available now, priced at US$2,966 / AU$3,499 / £2,199 / €2,239 .</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/DT-Swiss-ARC-1100-Dicut-Disc-3-1340x754.jpg\" /></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/08/dt-swiss-has-a-new-faster-wider-arc-1100-dicut-disc/\">Read More</a>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f882faa32749a73ff4edf1efe4fad93289a5bd06ea2ac8fcbe432e82bc8f1c87","category":"Cycling"}