{"title":"Distinct communities under the snow: describing characteristics of subnivium arthropod communities","link":"https://academic.oup.com/ee/article/53/3/383/7637145?rss=1","date":1712188800000,"content":"<span><div>Abstract</div>Arthropods are active during the winter in temperate regions. Many use the seasonal snowpack as a buffer against harsh ambient conditions and are active in a refugium known as the subnivium. While the use of the subnivium by arthropods is well established, far less is known about subnivium community composition, abundance, biomass, and diversity and how these characteristics compare with the community in the summer. Understanding subnivium communities is especially important given the observed and anticipated changes in snowpack depth and duration due to the changing climate. We compared subnivium arthropod communities with those active during the summer using pitfall trapping in northern New Hampshire. We found that compositions of ground-active arthropod communities in the subnivium differed from those in the summer. The subnivium arthropod community featured moderate levels of richness and other measures of diversity that tended to be lower than the summer community. More strikingly, the subnivium community was much lower in overall abundance and biomass. Interestingly, some arthropods were dominant in the subnivium but either rare or absent in summer collections. These putative “subnivium specialists” included the spider <span>Cicurina brevis</span> (Emerton 1890) (Araneae: Hahniidae) and 3 rove beetles (Coleoptera: Staphylinidae): <span>Arpedium cribratum</span> Fauvel, 1878, <span>Lesteva pallipes</span> LeConte, 1863, and <span>Porrhodites inflatus</span> (Hatch, 1957). This study provides a detailed account of the subnivium arthropod community, establishes baseline information on arthropod communities in temperate forests of northeastern North America, and explores the idea of subnivium specialist taxa that are highly active in winter and might be especially vulnerable to climate change.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"f88ae8336bc2cdc75241c1959043c3dd9981c7a641e5edc3d703050e53fa9cea","category":"Environment"}