{"title":"PSIX-23 Evaluation of number of goats grazing grass-based pasture for estimation of methane emission using GreenFeed system","link":"https://academic.oup.com/jas/article/102/Supplement_3/801/7757928?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The objective of this study was to evaluate the number of goats in pasture grazing on methane (CH<sub>4</sub>) emissions estimates using the GreenFeed system (GFS). The study involved growing meat goats, approximately 1.2 yr old and body weight (BW) of 23.9 ± 0.63 kg, over seven 2-wk periods. In periods 1, 2, and 3, 24 goats were used (Treatment 1: G-24), while periods 4 and 5 involved 18 goats (Treatment 2: G-18), and periods 6 and 7 used 12 goats (Treatment 3: G-12). The pasture area was divided into three paddocks for grazing, except during gas measurements in a stationary respiration calorimetry system (SCS) room for 2 d, where goats were fed fresh forage from the same pastureland. The GFS was programmed to dispense pellets and measured gas at specific intervals of the day (i.e., at 0700-0800 h, 1300-1400 h, 1900-2000 h, and 0100-0200 h), provided 120 g/d of concentrate pellets to attract goats for gas measurements. Statistical analysis using mixed model procedures of SAS included SCS data from preceding and succeeding periods as covariates for GFS gas data analysis. Daily dry matter (DM) intake was greater (<span>P</span> &lt; 0.001) in G-12 compared with G-24 and G-18, but when expressed g/kg BW, intakes were similar (<span>P</span> = 0.081) across treatments. Conversely, digested DM and gross energy intakes were greater (<span>P</span> &lt; 0.001) in G-24 than in G-18 and G-12 (494, 509, and 577 g/d and SE = 21.3 and 7.91, 8.10, and 9.20 MJ/d and SE = 0.359 for G-24, G-18, and G-12, respectively). Daily CH<sub>4</sub> production was unaffected (<span>P</span> = 0.254) by treatment (26.6, 25.2, and 26.1 g/d; SE = 0.819), despite variations in daily GFS visits by goats (3.26, 2.61, and 2.53 visits/d and SE = 0.106 for G-24, G-18, and G-12, respectively; <span>P</span> &lt; 0.001). However, CH<sub>4</sub> emissions in g/kg DM intake or digestible DM intake differed among treatments, with G-18 intermediate between G-24 and G-12 (35.6, 33.4, and 32.0 g/kg DM intake, SE = 1.02, <span>P</span> = 0.024; 54.1, 51.2, and 48.9 g/kg digestible DM intake, SE = 1.71, and <span>P</span> &lt; 0.001 for G-24, G-18, and G-12, respectively). Carbon dioxide production, expressed in g/d and g/kg DM intake, was greater in G-12 and G-18 compared with G-24. Heat production ranked greatest in G-12, followed by G-18 and G-24. Regardless of treatment, CH<sub>4</sub> emissions in g/d, g/kg DM intake or g/kg digestible DM intake were greater in GFS than in SCS (25.5 and 9.56 g/d, 33.8 and 14.4 g/kg DM intake, and 51.2 and 23.8 g/kg digestible DM intake for GFS and SCS, respectively; <span>P</span> &lt; 0.001). In conclusion, differences in CH<sub>4</sub> emissions in g/kg DM intake and digestible DM intake among treatments suggests that number of animals in grazing pasture may influence CH<sub>4</sub> emission estimates in goats.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f88c4aa79dc36add8d9a48b473e3705a40c187826fa8560375c0dc10e704214a","category":"Environment"}