{"title":"Evolution of FLOWERING LOCUS T-like genes in angiosperms: a core Lamiales-specific diversification","link":"https://academic.oup.com/jxb/article/75/13/3946/7655440?rss=1","date":1713571200000,"content":"<span><div>Abstract</div>Plant life history is determined by two transitions, germination and flowering time, in which the phosphatidylethanolamine-binding proteins (PEBPs) FLOWERING LOCUS T (FT) and TERMINAL FLOWER1 (TFL1) play key regulatory roles. Compared with the highly conserved <span>TFL1-like</span> genes, <span>FT-like</span> genes vary significantly in copy numbers in gymnosperms, and monocots within the angiosperms, while sporadic duplications can be observed in eudicots. Here, via a systematic analysis of the PEBPs in angiosperms with a special focus on 12 representative species featuring high-quality genomes in the order <span>Lamiales</span>, we identified a successive lineage-specific but systematic expansion of <span>FT-like</span> genes in the families of core <span>Lamiales</span>. The first expansion event generated <span>FT1-like</span> genes mainly via a core <span>Lamiales</span>-specific whole-genome duplication (cL-WGD), while a likely random duplication produced the <span>FT2-like</span> genes in the lineages containing <span>Scrophulariaceae</span> and the rest of the core <span>Lamiales</span>. Both <span>FT1-</span> and <span>FT2</span>-<span>like</span> genes were further amplified tandemly in some families. These expanded <span>FT-like</span> genes featured highly diverged expression patterns and structural variation, indicating functional diversification. Intriguingly, some core <span>Lamiales</span> contained the relict <span>MOTHER OF FT AND TFL1 like</span> 2 (<span>MFT2</span>) that probably expanded in the common ancestor of angiosperms. Our data showcase the highly dynamic lineage-specific expansion of the <span>FT-like</span> genes, and thus provide important and fresh evolutionary insights into the gene regulatory network underpinning flowering time diversity in <span>Lamiales</span> and, more generally, in angiosperms.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"f898ad44512b0fae4882cb856bb077c2ca295b82936c892f40a8677b2117d6c7","category":"Environment"}