{"title":"Patterns of diabetes mellitus by age, sex, and province among Iranian Hajj pilgrims and health care delivery during 2012–2022: A retrospective study of 469,581 participants","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311399","date":1728396000000,"content":"<p>by Pirhossein Kolivand, Peyman Saberian, Hossein Saffari, Taher Doroudi, Ali Marashi, Masoud Behzadifar, Fereshteh Karimi, Soheila Rajaei, Behzad Raei, Seyed Jafar Ehsanzadeh, Arash Parvari, Samad Azari</p>\r\nObjective <p>Hajj is among the oldest pilgrimages in the world, there is a limited study that evaluates the epidemiological pattern of Diabetes Mellitus [1] and the medical care required and provided to pilgrims. The present study assessed the prevalence and pattern of DM in Iranian pilgrims from 2012–22.</p> Method <p>All demographic information, risk factors, and the prevalence of DM were extracted from the database and medical records of the Hajj Pilgrimage Medical Centre, Iranian Red Crescent Society through file reading. Also, to investigate the effect of the risk factors considered in the study, the multiple logistic regression model was used.</p> Results <p>The present study included data from 469,581 Hajj pilgrims. Most pilgrims were in the age group of 45 to 70 years (73.25%). The prevalence of diabetes in patients over 70 years old was the highest (16.73%). The prevalence of DM was estimated at 14.64% in women and 12.51% in men. The lowest DM prevalence was in Lorestan (7.81%), North Khorasan (9.07%), Sistan and Baluchistan (9.29%), and Hamedan (9.41), respectively. The highest prevalence rate was in Khuzestan (20.12%), Yazd (19.14), and Mazandaran (17.55), respectively. Our analysis reveals that, for instance, with each yearly increase in the age of the pilgrims (assuming other variables remain constant), the odds of having DM increase by 0.04. For the gender, the odds of having DM among women is 0.33 higher than among men, when the other variable is constant.</p> Conclusions <p>The study results show a significant difference in the prevalence of diabetes in age, gender, and distribution in different provinces. Therefore, appropriate screening, diagnosis, and management by primary care physicians are necessary to prevent adverse health outcomes and reduce the economic burden of mortality and morbidity.</p>","author":"Pirhossein Kolivand","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f8a5456272375a1dea5f6fc13d117b1be2c74102989882e8ba81285980656771","category":"Interdisciplinary"}