{"title":"Learn Secure Access Management with Boundary","link":"https://www.hashicorp.com/blog/learn-secure-access-management-boundary","date":1621526400000,"content":"<p>One of HashiCorp's latest offerings is <a href=\"https://boundaryproject.io/\">Boundary</a>, an access management tool that provides secure management for dynamic infrastructure.</p>\n<p>Boundary provides an easy way to access all of your hosts and services through a single workflow based on trusted identity. It lets you create granular, role-based access controls for any networked resource that can be used to extend or even replace a VPN or firewall.</p>\n<p>Since the initial <a href=\"https://www.hashicorp.com/resources/secure-access-management-with-hashicorp-boundary\">product announcement</a>, several exciting new features have been released, including:</p>\n<ul>\n<li>Integration with <strong>Open-ID Connect</strong> (OIDC) providers like Auth0 and Okta, allowing you to use your favorite authentication methods natively.</li>\n<li><strong>Worker filters</strong> that enable granular session routing to avoid latency and private access concerns in multi-cloud and datacenter environments.</li>\n<li>The <strong>Boundary Desktop</strong> app for macOS, enabling end-users to find, manage, and connect to targets through a UI-driven workflow.</li>\n</ul>\n<h2><a href=\"#get-started\">»</a><a></a>Get Started</h2>\n<p>If you haven't checked out Boundary yet, <a href=\"https://learn.hashicorp.com/boundary\">HashiCorp Learn</a> is a great place to explore the project. The <a href=\"https://learn.hashicorp.com/collections/boundary/getting-started\">Getting Started collection</a> will provide a jump-start for installing and running Boundary in a dev environment and getting a sense for how Boundary enables access based on user identity.</p><img src=\"https://www.datocms-assets.com/2885/1620846422-learn-boundary-featured-tutorials-1.png\" /><h2><a href=\"#featured-tutorials\">»</a><a></a>Featured Tutorials</h2>\n<p>If you've been keeping up with the project, the new <a href=\"https://learn.hashicorp.com/boundary\">Featured Tutorials</a> section showcases the latest and greatest Boundary has to offer. Since the 0.2.0 release several new tutorials have been published that offer workflows for new features, including:</p>\n<ul>\n<li><a href=\"https://learn.hashicorp.com/tutorials/boundary/oidc-auth\"><strong>OIDC Authentication</strong></a>: Authenticate to Boundary with your external identity provider (IDP) of choice, including Azure Active Directory, Okta, and many others that support Open ID Connect.</li>\n<li><a href=\"https://learn.hashicorp.com/tutorials/boundary/target-aware-workers\"><strong>Target-Aware Workers</strong></a>: Specify filters against worker tags to control which workers are allowed to handle a given target’s session, effectively \"tying\" a worker to a given target.</li>\n<li><a href=\"https://learn.hashicorp.com/tutorials/boundary/getting-started-desktop-app\"><strong>The Boundary Desktop App</strong></a>: Connect to remote targets and view active session details, all from a convenient macOS desktop application. Windows support will be added in a future update.</li>\n</ul>\n<h2><a href=\"#resource-management-tutorials\">»</a><a></a>Resource Management Tutorials</h2>\n<p>Once you've mastered the basics of running Boundary in Dev Mode, explore the <a href=\"https://learn.hashicorp.com/collections/boundary/basic-administration\">Resource Management Workflows</a> to understand more about how access to hosts is managed with role-based access controls (RBAC).</p>\n<p>This workflow explains the basic workflows associated with managing users and groups, hosts, scopes, roles, and sessions are essential to understanding resource management operations.</p>\n<h2><a href=\"#advanced-learning\">»</a><a></a>Advanced Learning</h2>\n<p>The <a href=\"https://github.com/hashicorp/boundary-reference-architecture/\"><strong>Boundary reference architectures</strong></a> are provided for users looking for more advanced examples of deploying Boundary on popular platforms, including <a href=\"https://github.com/hashicorp/boundary-reference-architecture/tree/main/deployment/kube\">Kubernetes</a>, <a href=\"https://github.com/hashicorp/boundary-reference-architecture/tree/main/deployment/aws\">Amazon Web Services (AWS)</a>, <a href=\"https://github.com/hashicorp/boundary-reference-architecture/tree/main/deployment/azure\">Microsoft Azure</a>, <a href=\"https://github.com/hashicorp/boundary-reference-architecture/tree/main/deployment/gcp\">Google Cloud</a>, and <a href=\"https://github.com/hashicorp/boundary-reference-architecture/tree/main/deployment/docker\">Docker</a>.</p>\n<p>If you're familiar with the basics of managing Boundary resources, the reference architectures are a great place to explore deploying Boundary using common tools and workflows for non-dev environments. This example also makes use of the <a href=\"https://registry.terraform.io/providers/hashicorp/boundary\">Boundary Terraform provider</a> for users looking to automate the deployment and management of Boundary.</p>\n<h2><a href=\"#jump-in\">»</a><a></a>Jump In</h2>\n<p>To learn more about Boundary, please visit the project website at <a href=\"https://boundaryproject.io/\">boundaryproject.io</a>, <a href=\"https://github.com/hashicorp/boundary\">github.com/hashicorp/boundary</a> for the source code, and <a href=\"https://learn.hashicorp.com/collections/boundary/getting-started\">HashiCorp Learn</a> to find our step-by-step tutorials to get started with Boundary.</p>\n<p><em>For even more news about our latest tutorials being added to HashiCorp Learn, follow @HashiCorp on Twitter.</em></p>","author":"Robin Beck","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"f8a8d54bc23725de65ea5f5e7614ecb941e2b8d1214adc17802cbf55da3590ae","category":"Tech"}