{"title":"Water quality, pesticides, and phytotoxicity in seeds of Lactuca sativa, Solanum lycopersicum, and Eruca sativa","link":"http://link.springer.com/10.1007/s13762-023-05381-y","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Among the many emerging contaminants, pesticides are increasingly present in surface water sources. In this sense, phytotoxicity tests help to verify adverse effects on plants. The present study aimed to analyze the quality of the water, concomitantly with the presence of pesticides, and whether the analyzed concentrations cause phytotoxicity. The water samples were assessed for physical, chemical, and microbiological parameters, in addition to the presence of 73 active ingredients of pesticides. The phytotoxicity was ascertained regarding the inhibition of germination and radicle growth of vegetable seeds of lettuce (<em>Lactuca sativa</em>), tomato (<em>Solanum lycopersicum</em>), and arugula (<em>Eruca sativa</em>) through the concentrations: Treatment 1 (control—mineral water), Treatment 2 (10%), Treatment 3 (30%), Treatment 4 (50%), Treatment 5 (70%), and Treatment 6 (100%) of water samples were collected. The use and occupation of the soil and climatic conditions may have altered the water quality at the two points analyzed. There was the presence of 17 active ingredients of pesticides in at least one collection and at one point; however, compared to regulations and based on predefined values, none of the concentrations were above the recommended maximum. In the case of the phytotoxicity test, all the seeds studied, at point 1 of collection at a given time, generally showed a significant difference in the average radicle length, while for point 2, there was no significant difference between the treatments and the control.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"f8acadf24488a599e8b617bf2725cc7f1fdf6e8a32ee15301146dee896f7c816","category":"Environment"}