{"title":"Leadership dynamics in musical groups: Quantifying effects of musical structure on directionality of influence in concert performance videos","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300663","date":1712152800000,"content":"<p>by Sanket Rajeev Sabharwal, Matthew Breaden, Gualtiero Volpe, Antonio Camurri, Peter E. Keller</p>\r\n\r\nMusic ensemble performance provides an ecologically valid context for investigating leadership dynamics in small group interactions. Musical texture, specifically the relative salience of simultaneously sounding ensemble parts, is a feature that can potentially alter leadership dynamics by introducing hierarchical relationships between individual parts. The present study extended previous work on quantifying interpersonal coupling in musical ensembles by examining the relationship between musical texture and leader-follower relations, operationalised as directionality of influence between co-performers’ body motion in concert video recordings. It was hypothesised that the directionality of influence, indexed by Granger Causality, would be greater for ‘homophonic’ textures with a clear distinction between melody and accompaniment parts than for ‘polyphonic’ textures with less distinction between melody and accompaniment. This hypothesis was tested by using pose estimation algorithms to track instrumentalists’ body movements in a string quartet and a clarinet quintet, and then applying Granger Causality analysis to their head motion to estimate directional influence between instrumentalist pairs for sections of the pieces that varied in texture. It was found that Granger Causality values were generally higher (indicating greater directionality of influence) for homophonic than polyphonic textures. Furthermore, considering melody and accompaniment instrument roles revealed more evidence for the melody instrument influencing accompanying instruments than vice versa, plus a high degree of directionality among accompanying instruments, in homophonic textures. These observed patterns of directional information flow in co-performer body motion are consistent with changing leader-follower relations depending on hierarchical relations between ensemble parts in terms of the relative salience of melodic material in the musical texture. The finding that automatic pose estimation can detect modulations of leadership dynamics in standard video recordings under naturalistic performance conditions has implications for investigating interpersonal coordination in large-scale music video datasets representing different cultural traditions, and for exploring nonverbal communication in group activities more generally.","author":"Sanket Rajeev Sabharwal","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f8ade6b5595eae24946f44f4db959f9042d48f7666d518276b9e61d25bac8cec","category":"Interdisciplinary"}