{"title":"Study on the anti-slide mechanism of double-row circular pile by model test using PIV, transparent soil material and 3D printing technology","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309727","date":1727272800000,"content":"<p>by Lu Cong, Yanchao Wang, Yaohu Hao, Xuanyu Yang, Xuekai Gao, Bichang Zhang</p>\r\n\r\nLandslides are common geological hazards that cause significant losses. Anti-slide piles are commonly used in landslide engineering, and model testing is one of the means to study pile-supported structures. However, model tests face several challenges, including difficulty in controlling the experimental process, challenges in repeated tests, and difficulty in monitoring soil deformation around piles. To address these issues, this study presents a model test method using particle image velocimetry (PIV), transparent soil, and 3D printing technology. Using this method, a series of model tests were conducted, including single-row and double-row anti-slide piles. The experimental results indicate that, compared with single-row piles, double-row piles exhibit better supporting effects. In the pile‒soil interaction, the displacement of the extrusion of soil between piles was controlled under the combined action of the front and back rows of piles. The inclination angle of a single-row pile after the test was 8°, whereas that of a double-row pile was reduced by 62.5%. With respect to the displacement of the soil behind the piles, the phenomenon of a “displacement triangle” behind the piles was observed. An analysis of the change process in this area revealed that the relative displacement caused by pile‒soil interactions is mainly distributed in the surface layer of the soil. The experiments demonstrate that this system is suitable for pile-supported structure model tests.","author":"Lu Cong","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f8b4139a2b1b779e1c476dd445d71a58aaddb847ea43b6b23dc76baa68d2dfac","category":"Interdisciplinary"}