{"title":"Apple Warns Against Non-Certified Apple Watch Chargers","link":"https://www.macrumors.com/2023/12/15/non-certified-apple-watch-charger-warning/","date":1702673928000,"content":"Apple today <a href=\"https://support.apple.com/en-us/HT213854\">published a support document</a> that warns customers against using non-certified Apple Watch chargers, which could cause slow charging, repeated chimes, and reduced battery span.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/09/apple-watch-charger-s7.jpg\" width=\"1397\" height=\"786\" />\r<br />\nAccording to Apple, customers should only use chargers made by Apple or chargers that have Made for <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> (MFi) certification with the Made for Apple Watch badge.\r<br />\n\r<br />\nApple provides images of genuine Apple Watch chargers and explains the text and regulatory markings that may be on the cable. \"Chargers that are not made by Apple might have different colors, text, or other designs on the surface of the charging connector,\" reads the support document.\r<br />\n\r<br />\nApple also provides a list of model numbers for all of the cables that it has produced to date, and gives instructions for checking the manufacturer of a charger using a Mac.\r<br />\n\r<br />\nTo use this method, the Apple Watch needs to be connected to the Mac. When connected, go to System Settings and then Click on General. Choose About, and then System Report. Under USB, choose the Apple Watch charger to view the details. Watch chargers created by Apple will list Apple Inc. as the manufacturer.\r<br />\n\r<br />\nApple says that customers can ensure they are using a certified third-party charger by looking for the Made for Watch labeling or searching Apple's <a href=\"https://mfi.apple.com/account/accessory-search\">public database of MFi accessories</a>.<br />This article, \"<a href=\"https://www.macrumors.com/2023/12/15/non-certified-apple-watch-charger-warning/\">Apple Warns Against Non-Certified Apple Watch Chargers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f8bca95f8d015366230074c5556e9f5d8f6ff1673404c9c27a40c03550d38c65","category":"Apple"}