{"title":"Genetic merit of sires for <i>ad libitum</i> residual feed intake affects feed efficiency of restricted-fed heavy pigs but not body weight gain tissue composition","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312307","date":1729173600000,"content":"<p>by Chiara Mondin, Sara Faggion, Diana Giannuzzi, Luigi Gallo, Stefano Schiavon, Paolo Carnier, Valentina Bonfatti</p>\r\n\r\nThe study aimed at evaluating how sires, classified for their additive genetic effects on residual feed intake (RFI) of <i>ad libitum</i>-fed progeny, influence growth performance, tissue accretion, and gain composition in restricted-fed offspring (96–168 kg body weight, BW). A total of 416 purebred C21 Goland pigs, offspring of 23 sires, were randomly allocated to three feeding groups: <i>ad libitum</i>, restricted medium-protein, or restricted low-protein. Empty BW, body lipid mass and body protein mass were estimated from individual BW and backfat measures using literature equations. Residuals of a linear regression of average daily feed intake on average empty BW, body lipid and protein daily gains were used as estimates of individual RFI in <i>ad libitum</i>-fed pigs. Additive genetic effects of sires on RFI of <i>ad libitum</i>-fed pigs were estimated with a linear animal model and solutions of the model were used to allocate the sires to low- (LRFI), medium- (MRFI), or high-RFI (HRFI) groups. Restricted-fed progeny of LRFI sires exhibited reduced average daily feed intake (-3%) compared to MRFI and HRFI progeny. This indicates that LRFI progeny make a more efficient use of energy intake and implies that variation in RFI across families, assessed under <i>ad libitum</i> feeding, is related to the across-family variation in feed efficiency detected under restricted feeding. LRFI progeny exhibited also a lower feed conversion ratio (-11%), partially resulting from of a 3% increase in growth rate compared with HRFI. Thus, LRFI progeny consumed less feed, while growing at a similar or slightly higher rate than MRFI or HRFI. No significant differences across sire classes were observed for daily tissue accretion and gain composition. Hence, we can hypothesise that efficient sires would not affect carcass leanness of heavy pig progeny fed restricted.","author":"Chiara Mondin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f8bfcffc75d0b2b503a0c9a4d300f7ba11057376617e87aeea9bd23094b78709","category":"Interdisciplinary"}