{"title":"Implementation of gender-based violence screening guidelines in public HIV treatment programs: A mixed methods evaluation in Uganda","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003185","date":1717509600000,"content":"<p>by Dorothy Thomas, Alisaati Nalumansi, Mira Reichman, Mine Metitiri, Florence Nambi, Joseph Kibuuka, Lylianne Nakabugo, Brenda Kamusiime, Vicent Kasiita, Grace K. Nalukwago, Timothy R. Muwonge, Jane Simoni, Elizabeth T. Montgomery, Andrew Mujugira, Renee Heffron</p>\r\nBackground <p>HIV and gender-based violence (GBV) intersect to threaten population health. The Uganda Ministry of Health recommends routine GBV screening alongside HIV care but evidence detailing its implementation in HIV care settings is limited. We evaluated screening practices in public HIV clinics to generate evidence supporting GBV screening optimization.</p> Methods <p>To evaluate GBV screening implementation in antiretroviral therapy (ART) clinics, we extracted client data from GBV registers at 12 public ART clinics in Uganda (January 2019-December 2021). We concurrently evaluated perceptions of GBV screening/referral practices by conducting in-depth qualitative interviews with providers (N = 30) and referral partners (N = 10). We contextualized quantitative findings with interview data which were analyzed using a thematic analysis approach.</p> Results <p>During the evaluation period, &gt;90% of providers in participating health facilities implemented GBV screening. Among 107,767 clients served in public ART clinics, providers identified 9,290 (8.6%) clients who experienced past-year physical, sexual and/or emotional GBV of whom 86% received counseling and 19% were referred to support services—most commonly to legal services. Key factors influencing GBV screening implementation included awareness of screening guidelines; client volume; and client’s level of engagement in HIV care. Providers and referral partners identified important benefits to clients (e.g., pursuit of justice and removal from violent environments) when referrals were successful. Key factors influencing referrals included financial constraints that limited referral partners’ ability to provide services at no cost to clients and socio-cultural norms that inhibited client willingness to pursue support services.</p> Conclusions <p>GBV screening implementation in ART clinics supports identification and referral of clients exposed to violence. The effectiveness of GBV screening may be limited by socio-cultural factors that inhibit client capacity to pursue referrals and fragmented and resource-constrained referral networks. Providers and referral partners identified allocating funds to support referrals and collaborative networking meetings as important opportunities for strengthening GBV referrals.</p>","author":"Dorothy Thomas","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"f8c289ceb454802e71c49c6fd0ef1078a9eec6c5a25d3b2f6e828db20b6c12db","category":"Environment"}