{"title":"AWS Local Zones Are Now Open in Las Vegas, New York City, and Portland","link":"https://aws.amazon.com/blogs/aws/aws-local-zones-are-now-open-in-las-vegas-new-york-city-and-portland/","date":1635275017000,"content":"<p>Today, we are opening three new <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/localzones\">AWS Local Zones</a> in Las Vegas, New York City (located in New Jersey), and Portland metro areas. We are now at a total of 14 Local Zones in 13 cities since <a href=\"https://aws.amazon.com/blogs/aws/aws-now-available-from-a-local-zone-in-los-angeles/\">Jeff Barr announced the first Local Zone</a> in Los Angeles in December 2019. These three new Local Zones join the ones in full operation in Boston, Chicago, Dallas, Denver, Houston, Kansas City, Los Angeles, Miami, Minneapolis, and Philadelphia.</p> \n<p>Local Zones are one of the ways we bring select AWS services much closer to large populations and geographic areas where major industries come together. By having this proximity, you can deploy latency-sensitive workloads such as real-time gaming platforms, financial transaction processing, media and entertainment content creation, or ad services. Using Local Zones for migrations or hybrid strategies are two additional use cases allowing you to migrate your applications to a nearby AWS Local Zone while still meeting the low-latency requirements of hybrid deployments.</p> \n<p>Local Zones support the deployment of workloads using <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a>, <a href=\"https://aws.amazon.com/ebs/\">Amazon Elastic Block Store (EBS)</a>, <a href=\"https://aws.amazon.com/fsx/windows/\">Amazon FSx for Windows File Server</a> and <a href=\"https://aws.amazon.com/fsx/lustre/\">Amazon FSx for Lustre</a>, <a href=\"https://aws.amazon.com/elasticloadbalancing\">Elastic Load Balancing</a>, <a href=\"https://aws.amazon.com/rds/\">Amazon Relational Database Service (RDS)</a>, and <a href=\"https://aws.amazon.com/vpc/\">Amazon Virtual Private Cloud (VPC)</a>. Local Zones provide a high-bandwidth, secure connection between local workloads and those running in the parent AWS Region, while offering the full range of services found in a Region through the same APIs, console and tool sets. <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/localzones/features/\">This page lists the exact AWS services and features available in each Local Zone</a>.</p> \n<p>Local Zones are easy to use and <a href=\"https://aws.amazon.com/blogs/aws/aws-local-zones-are-now-open-in-boston-miami-and-houston/\">can be enabled in only three clicks</a>! This article will help you <a href=\"https://aws.amazon.com/blogs/aws/aws-now-available-from-a-local-zone-in-los-angeles/\">learn how to provision infrastructure in a Local Zone</a>, which is very similar to creating infrastructure in an Availability Zone. Once enabled, Local Zones appear as additional Availability Zones in your <a href=\"https://console.aws.amazon.com\">AWS Management Console</a> or <a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (CLI)</a>.</p> \n<p><strong><span>Local Zones in Action<br /> </span></strong>Examples of workloads that our customers run in Local Zones include:</p> \n<p><a href=\"https://www.dish.com\">Dish</a> Wireless is building the US-telecom’s first cloud-native 5G network. They are unleashing 5G connectivity with better speed, better security, and better latency. DISH is leveraging AWS Regions, AWS Local Zones, and <a href=\"https://aws.amazon.com/outposts/\">AWS Outposts</a> to extend AWS infrastructure and services to wherever they – or their customers – need it.</p> \n<p><a href=\"https://integralads.com/\">Integral Ad Science</a> (IAS) is a global leader in digital media quality. Every millisecond counts when it comes to delivering actionable insights for its advertiser and publisher customers. Leveraging AWS Regions and AWS Local Zones, IAS ensures rapid response times in milliseconds when analyzing data and delivering insights.</p> \n<p><a href=\"https://esportsengine.gg/\">Esports Engine</a> (a Vindex company) is a turnkey esports solutions company working with gaming publishers, rights holders, brands, and teams to provide production, broadcast, tournament, and program design. Their graphic-intensive streaming content is live-fed from the locations where the games are recorded and then broadcast from the studios to viewers. AWS Local Zones replace their previous on-premises data centers to reduce the need for support for the physical data center buildings.</p> \n<p><a href=\"https://prooftrading.com/\">Proof Trading</a> is a financial services company looking forward to taking advantage of AWS Local Zones to bring trading workloads closer to the major trading venues located in Chicago and New Jersey. <a href=\"https://aws.amazon.com/blogs/industries/new-aws-local-zones-deliver-lower-latency-in-chicago-and-new-york-city/\">Our industry blog has a detailed article that provides more context on trading-related workloads</a>.</p> \n<p><a href=\"https://ubitus.net/\">Ubitus</a> is a cloud gaming technology leader. They deploy latency-sensitive game servers all over the world to be closer to gamers. An important part of having a great gaming experience is to have consistent low-latency game plays. AWS Local Zones are a game changer for them. Now, they can easily deploy and test clusters of game servers in many cities across the US, ensuring that more customers get a consistent experience regardless of where they are located.</p> \n<p><span><b>What’s Next?<br /> </b></span>In 2019 when we launched our first Local Zone at AWS re:Invent 2019, we said we were just getting started. In addition to today’s announcement, we are working on opening three additional Local Zones in Atlanta, Phoenix, and Seattle by the end of the year, and we keep expanding. If you would like to express your interest in a particular location, please let us know by filling out the <a href=\"https://pages.awscloud.com/local-zones-signup-form.html\">AWS Local Zones Interest</a> form.</p> \n<p>We are also listening to your feedback on additional services that we should add to Local Zones, such as more <span>EC2</span> instance types to give you even more flexibility.</p> \n<p>Build and <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/localzones/locations/#GA\">deploy your workload on a Local Zone</a> today.</p> \n<a href=\"https://twitter.com/sebsto\">-- seb</a>","author":"Sébastien Stormacq","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"f8c6ca2b5b07d430b882cf1326782fa5b880cd9ce1d3adc6d45b8affcd439197","category":"Tech"}