{"title":"Reliable Leaker Known as 'Kang' Hit With Warning From Apple","link":"https://www.macrumors.com/2021/06/24/reliable-leaker-kang-hit-with-warning/","date":1624538720000,"content":"The highly reliable Apple leaker known as \"Kang\" and a number of other unspecified leakers have reportedly received warnings from lawyers representing Apple.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/09/AppleEventLogoFeature.jpg\" />\r\n<br />\r\nAccording to posts on <a href=\"https://weibo.com/withkang?is_all=1#_loginLayer_1624533146549\">Kang's Weibo account</a>, Apple recently commissioned a law firm to send admonitory letters to a number of leakers.\r\n<br />\r\n\r\n<br />\r\nThe letter purportedly cautioned leakers that they must not disclose information about unreleased Apple projects because it may give Apple's competitors valuable information and \"mislead customers, because what is disclosed may not be accurate.\"\r\n<br />\r\n\r\n<br />\r\nApple purportedly grabbed screenshots of Kang's Weibo as evidence, which included him talking about problems he experienced with the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, product release dates, and purchase suggestions for his followers, as well as more casual posts.\r\n<br />\r\n\r\n<br />\r\nKang went on to give his personal opinion on the situation. Kang explained that since \"I have never published undisclosed product pictures\" or sold his information, Apple must take exception to \"riddles and dreams\" about its undisclosed projects. Apple leaks vaguely characterized as \"dreams\" have been popularized in recent years by leakers such as \"L0vetodream,\" providing some insiders with a fun mechanism to hint at Apple's future plans without giving too much away.\r\n<br />\r\n\r\n<br />\r\nEven \"dreaming will violate their confidentiality mechanism,\" according to Kang, who said that under Apple's logic \"if I have a dream, Apple's competitors will obtain effective information.\" \"Without sending pictures or leaking pictures, I am still used as a target,\" he said.\r\n<br />\r\n\r\n<br />\r\nKang commented that \"I won't post riddles and dreams in the future,\" suggested that he will be deleting some previous posts on social media, and expressed the need to \"tone back\" posting about Apple since \"talking will be audited.\"\r\n<br />\r\n\r\n<br />\r\nKang argued that he had not misled consumers and said that he was still within his right to make his feelings known about Apple's smartphone experience, remarking that \"your company should not interfere with my Weibo.\"\r\n<br />\r\n\r\n<br />\r\nHe also warned other bloggers, saying that if they do not want to \"cause trouble... then don't post anything they don't want to tell the public.\" Even if \"you haven't signed any agreement... they think it is infringement and abuse of commercial information.\"\r\n<br />\r\n\r\n<br />\r\nKang has been among the most reliable Apple leakers, with successive detailed leaks about Apple's future product and software plans that turned out to be correct. Kang leaked the full details of the <a href=\"https://www.macrumors.com/2020/10/09/full-details-of-iphone-12-lineup-allegedly-leaked-ahead-of-next-weeks-apple-event/\">iPhone 12 lineup</a> and the <a href=\"https://www.macrumors.com/2020/10/09/leaker-homepod-mini-will-cost-99-next-month/\">HomePod mini</a> before they launched. According to <em><a href=\"https://appletrack.com/kang/\">AppleTrack</a></em>, Kang also correctly leaked a plethora of information about the 2020 <a href=\"https://www.macrumors.com/roundup/iphone-se/\">iPhone SE</a>, <a href=\"https://www.macrumors.com/roundup/apple-watch-se/\">Apple Watch SE</a>, <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a>, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> 8, and <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a> 4 prior to launch. In addition, Kang leaked extensive details about Apple's software updates for WWDC in 2020.<div>Tag: <a href=\"https://www.macrumors.com/guide/kang/\">Kang</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/24/reliable-leaker-kang-hit-with-warning/\">Reliable Leaker Known as 'Kang' Hit With Warning From Apple</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/reliable-leaker-known-as-kang-hit-with-warning-from-apple.2302120/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=MT8clX4O6xg:d165_3_5hSM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=MT8clX4O6xg:d165_3_5hSM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/MT8clX4O6xg\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f8d2f147b256fad2534cb90f9b0991f53f7bd5c5e3b12716472449208c842ff8","category":"Apple"}