{"title":"Gender preference and fertility behavior among married women: A community based study from far western Nepal","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0001080","date":1717682400000,"content":"<p>by Pratima Dawadi, Aarati Sharma Bhatta, Laxmi Rajbanshi, Rajendra Gautam</p>\r\n\r\nGender preference often results in low use of contraceptives and parity progression, which can increase the risks of morbidity and mortality for women. This study aimed to identify gender preference and fertility behavior, including contraceptive use and the desire for additional children, among married women. A cross-sectional descriptive study was conducted using systematic random sampling to select280 household, with one respondent interviewed from each household using a semi-structured interview schedule. Descriptive and inferential statistical analysis were performed on the collected data. Of 280 respondents, 44.6% were aged 26–35 years (mean30.23±7.39 years). Most (74.3%) were literate, and 70% were paid worker. Son preference was reported by 53%, with support in old age (87.2%) being the main reason. Gender preference was 60.5% less likely among Bramhin/Chhetri ethnic groups (p = 0.033) and 71.3% less likely if husbands were literate (p = 0.002). Contraception use was 90.7%, but 31.8% desired additional children. Permanent contraceptive method use was 9.387 times more likely above age 30 years (p = &lt;0.001), independent of respondents’ and husbands’ education, sex composition of children, and having a preferred child. Desire for more children was 6.813 times more likely below age 30 years (p = &lt;0.001) and 5.875 times more likely with 1–2 living children (p = 0.001), independent of respondents’ and husbands education.The study concludes that son preference persisted among the illiterate. Contraceptive use was lower among respondents below 30 years. Enhancing educational status may reduce gender bias. Targeting family planning to women below 30 years could improve contraceptive utilization in this age group.","author":"Pratima Dawadi","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"f8d3ceacfb29cdaa9d767c42c27b04efa2649e2049b9dc95ce8ea509925fa017","category":"Environment"}