{"title":"How to pick adapters or docks extend your Mac to other displays","link":"https://www.macworld.com/article/542822/how-to-pick-adapters-docks-mac-displays.html","date":1634634000000,"content":"<div>\n<section><div></div></section><p>Apple has long made it a point of pride that it’s easy to add monitors for mirroring or extending the desktop to Macs. But with the multiplication of model types and limitations, you might feel stymied when you’re ready to plug your Mac with USB-C connectors that support USB 3 or 4 and Thunderbolt 3 or 4 into external displays.</p>\n\n\n\n<p>Let’s start with device limitations and then move into adapters.</p>\n\n\n\n<h2>Add displays to an Intel Mac</h2>\n\n\n\n<p>Apple allows Intel Macs with USB-C to support one, two, or four 4K monitors plus one additional; or if there’s an HDMI port, as on the Mac mini, one via Thunderbolt 3 or USB-C and one via HDMI. That works out as follows:</p>\n\n\n\n<ul><li><strong>MacBook Air 2017 to 2020 and later:</strong> two Thunderbolt 3 ports; two 4K displays</li><li><strong>MacBook Pro 2016 to 2020:</strong> four Thunderbolt 3 ports; four 4K displays</li><li><strong>MacBook 2015 to 2017:</strong> one USB 3-only USB-C port; one 4K display</li><li><strong>iMac 2017 to 2020:</strong> two Thunderbolt 3 ports; two 4K displays</li><li><strong>iMac Pro 2017:</strong> four Thunderbolt 3 ports; four 4K displays</li><li><strong>Mac mini 2018:</strong> four Thunderbolt 3 ports, one HDMI port; two 4K displays</li><li><strong>Mac Pro 2019:</strong> four Thunderbolt 3 ports, but a very large number of options for video cards and configurations, with the maximum allowing up to 12 displays at 4K</li></ul><p>Those numbers change for 5K or 6K monitors on Macs that can handle two or more 4K displays over Thunderbolt 3. Usually, you halve the number of 4K displays to get the maximum number of 5K or 6K monitors you can attach.</p>\n\n\n\n<h2>Add displays to an M1, M1 Pro, or M1 Max Mac</h2>\n\n\n\n<p>Basic M1 Macs have significant display limits:</p>\n\n\n\n<ul><li><strong>24-inch iMac 2021, 13-inch MacBook Pro 2020, MacBook Air 2020:</strong> Two or more USB 4/Thunderbolt 3 ports; one display up to 6K/60Hz</li><li><strong>Mac mini 2020:</strong> Two USB 4/Thunderbolt 3 ports, one HDMI port; one 4K display plus one up to 6K</li></ul><p>Even if you attach a Thunderbolt 3 dock with multiple display connections, you still cannot drive more than one external display over USB 4/Thunderbolt 3 on any of these devices. (But see “Extend with DisplayLink” below.)</p>\n\n\n\n<p>The M1 Pro and M1 Max chips announced Oct. 18, 2021, give new MacBook Pro models expanded options. All models have three USB 4/Thunderbolt 4 ports and one HDMI port. The chip is what makes the difference for external displays:</p>\n\n\n\n<ul><li><strong>M1 Pro:</strong> Up to two 6K displays via Thunderbolt 3, or one 6K display over Thunderbolt 3 and one 4K display over HDMI</li><li><strong>M1 Max<span>:</span></strong><span> Up to three 6K displays via Thunderbolt 3 plus one 4K display via HDMI</span></li></ul><p>All 6K support is up to 60 Hz and over a billion colors.</p>\n\n\n\n<h2>Find the right adapter or dock</h2>\n\n\n\n<p>Fortunately, both USB-C and HDMI connectors require little extra effort or expense (sometimes at zero expense) to connect to displays.</p>\n\n\n\n<ul><li><strong>Native cable:</strong> Some monitors have USB-C built in and can plug in directly. For Macs with an HDMI port, you just plug in an HDMI cable, often included with the display.</li><li><strong>4K HDMI:</strong> An HDMI port on a Mac mini or on a USB-C or Thunderbolt 3 mini-dock or full-sized dock provides an HDMI-to-HDMI connection to a monitor. If your monitor has a DisplayPort output, you can use a DisplayPort-to-HDMI cable or add a DisplayPort-to-HDMI adapter to an HDMI-to-HDMI cable. Something like this <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.monoprice.com/product?p_id=24440&amp;xcust=1-1-542822-1-0-0&amp;sref=https://www.macworld.com/feed\">Monoprice USB Type C to HDMI</a> works, or any of a large number of multi-port adapters and docks of all sizes.</li><li><strong>5K and higher HDMI:</strong> While seemingly any HDMI adapter or cable will pass 4K/60Hz signals, if you want to attach a 5K or 6K display, you need to find an adapter rated to support more than 4K. These cost about $20 to $40, but are strangely hard to find because you need to search on <strong>8K</strong>: most of these adapters sell themselves as rated up to that resolution, instead of included 5K or 6K in the description. See <a href=\"https://www.amazon.com/Cable-Matters-DisplayPort-Aluminum-Compatible/dp/B07F17ZHJY?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Cable Matters USB C to DisplayPort 1.4 Adapter</a>, as one example.</li></ul><p>One complexity you might find on certain models, particularly in the Intel generations, is that you are already using all your Thunderbolt 3 ports for power and displays or other purposes, and thus need additional USB-C connections to add monitors. In that case, a mini-dock or full-sized dock with multiple HDMI connections is the best bet.</p>\n\n\n\n<p>One inexpensive option is <a href=\"https://www.macworld.com/article/234651/owc-thunderbolt-3-mini-dock-review.html\">the OWC Thunderbolt 3 mini Dock</a>, which I reviewed last October, and which sports pass-through power up to 85 watts and has two HDMI ports for 4K displays.</p>\n\n\n\n<h2>Add displays using DisplayLink</h2>\n\n\n\n<p>Synaptic’s DisplayLink technology allows connecting additional displays via USB to Macs, PCs, and other devices. The company licenses it to third parties and releases driver support for macOS, Windows, and other operating systems.</p>\n\n\n\n<p>An <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.synaptics.com/products/displaylink-graphics/downloads/macos&amp;xcust=1-1-542822-1-0-0&amp;sref=https://www.macworld.com/feed\">updated driver</a> in February 2021 supports M1 Macs running macOS 11 Big Sur, allowing M1 Macs to expand beyond Apple’s hardware limitations. Updates later in 2021 added support for the beta releases of macOS 12 Monterey; the latest release was at the end of August 2021.</p>\n\n\n\n<p>There are <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.synaptics.com/products/displaylink-graphics/displaylink-products-list?field_displaylink_category_value=usb_adapters&amp;xcust=1-1-542822-1-0-0&amp;sref=https://www.macworld.com/feed\">a host of different adapters and docks available</a>, plus some monitors with DisplayLink built-in. Many DisplayLink devices only list support for Windows support, but they also offer a macOS driver download. Read reviews to ensure how a given adapter or dock works with Macs in general and the release of macOS you’re running.</p>\n\n\n\n<p>If you opt for DisplayLink, consider that you may need to delay upgrading to Monterey if there are any compatibility issues between the production release of that upcoming macOS update and the current state of DisplayLink drivers.</p>\n\n\n\n<p>All the adapters listed on Synaptics’s products page show a USB 3 Type-A connector, but these can be connector via an adapter to USB-C or through a dock that has Type-A connectors. Some docks that incorporate DisplayLink have USB-C connectors.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Jason.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f8e09aadb5fe9f5ecf8ad73543c47dbaa593d270bb42e189502cf331ee3ba37a","category":"Apple"}