{"title":"Cardiomyocyte Regeneration in Human Myocarditis","link":"https://www.preprints.org/manuscript/202407.0642/v1","date":1720526654000,"content":"Background : Newly generated cardiomyocytes (NGC) concur to recovery of human myocarditis. However, \nMethods: We retrospectively assessed NGC  in 213 consecutive patients with endomyocardial biopsy denoting acute myocarditis, with normal coronaries and valves. Tissue samples were processed for histology (H&amp;E), immunohistochemistry for the evaluation of inflammatory infiltrates, immunostaining for alpha-sarcomeric-actin, junctional connexin-43, Ki-67, phosphorylated STAT3 (p-STAT3) and Western Blot (WB) for HMGB1. Frozen samples were analyzed with polymerase chain reaction (PCR) for cardiotropic viruses. Controls included 20 normal surgical biopsies. \nResults: NGCs were defined as small myocytes (diameter &lt; 10 µm) with nuclear positivity to Ki-67 and p-STAT3, positive immunostaining for cytoplasmic α-sarcomeric actin and connexin 43. Their number/mm2 in relation with age and pathway of integration were evaluated. NGCs crossed the membrane and grew integrated within the empty necrotic myocytes. NGC mean diameter was 6.6 ± 3.34 vs 22.5 ± 3.11 µm adult cells; their number, in comparable LVEF, was 86.3 ± 10.3/mm2 in patients between 10 and 40 years; 50.4 ±13.8/mm2 in those between 41 and 60; 15.1 ± 5.7/ mm2 in those between 61 and 80; control NGC mean diameter was 0.2± 0.2/mm2. PCR was positive for viral genomes in 16% of cases; NGCs were not statistically different in viral and non-viral myocarditis. WB analysis revealed a higher expression of HMGB1 in myocarditis compared to myocardial controls. \nConclusions: NGCs are constantly recognizable in acute human myocarditis. Their number declines with age. Their integration within necrotic myocytes consents preservation of cardiac structure and function.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f8e250172b6d291bc26bbda22d5e36572c1a3eb503477ab771ffaebbba17a7ce","category":"Interdisciplinary"}