{"title":"Zwift Coffee Stops, Teleportation Coming Soon","link":"https://bikerumor.com/zwift-updates-2023-summer/","date":1682950409000,"content":"<p>Talk about your headlines that bury the lead.</p>\n\n\n\n<p>Can you soon teleport, <a href=\"https://www.youtube.com/watch?v=wRb-N6dbrgs\" target=\"_blank\">Seth Brundle style</a>, with Zwift (ideally without morbidly gross results)? No. But, your in-game avatar can.</p>\n\n\n\n<p>That’s thanks to one of a slew of new features the training platform will launch throughout this summer. It’s a bid to sprinkle yet more spice on stationary indoor cycling which, <a href=\"https://bikerumor.com/every-indoor-training-platform-compared-zwift-vs-kinomap-vs-rouvy-vs-sufferfest-vs-veloton-vs-bkool-vs-cvrcade-and-more/\" target=\"_blank\">up until recently</a>, was pretty much nobody’s favorite thing to do.</p>\n\n\n\n<p>Rider Teleport, Coffee Stop, Climb Portal — they’re all on their way, among a raft of updates. Here’s the lowdown on a few of our favorites.</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<h2>Coffee Stop</h2>\n\n\n\n<p>There’s no way around it. Sometimes on a ride, you just crater. We’re all familiar with the sudden feelings that accompany it, which usually follow a pattern like desperation, exasperation, anger, and, finally, an intense requirement for sugar or caffeine.</p>\n\n\n\n<p>Zwift Coffee Stop is here to save the (virtual) day. If you’re kicking the bucket on a Zwift ride, there’s no need to toss in the towel. That’s because you can take a three-minute break with zero penalty in your peloton. When you hop back on, you’ll find yourself right behind the same wheel — maybe, newly imbued with the juice for an overtake.</p>\n\n\n\n<h2>Rider Teleport</h2>\n\n\n\n<p>“Riding with friends is one of the best things about cycling.” There are few boilerplate marketing quotes I genuinely enjoy broadcasting, but that’s one.</p>\n\n\n\n<p>Rider Teleport gives you the best chance in Zwift to pedal alongside pals. Say you’re toiling along, lonely and frightened, in whatever Zwift world you’ve chosen today, and a friend hops into that same world. Now without stopping your current activity, you can “teleport” your avatar right to their location.</p>\n\n\n\n<p>It’s in the action bar — virtual cyclists, be lonesome no more.</p>\n\n\n\n<h2>Climb Portal</h2>\n\n\n\n<p>If you’ve ridden long enough, it’s highly likely that you dote on a dream climb. There’s a similarly high chance you don’t have easy access to it. Living in, say, South Dakota is not conducive to cycling in the Pyrenees.</p>\n\n\n\n<p>But now, there’s Zwift Climb Portal. Ride through it, and you’ll be transported to one of many of the planet’s most famous climbs. The Col du Tourmalet and Col d’Aspin are on tap, among other revered punishers.</p>\n\n\n\n<h2>Keep Everyone Together (Broadened Availability)</h2>\n\n\n\n<p>Keep Everyone Together is nice for indoor days when you want to get the gang together for a no-drop ride. The deal is, the platform keeps the peloton tight, no matter each rider’s power output.</p>\n\n\n\n<p>Previously available only in select events, it’s now at the disposal of any club administrator.</p>\n\n\n\n<h2>Everything Else</h2>\n\n\n\n<p>There’s plenty more going on this summer. Don’t worry — Zwift is doing all it can to keep you inside during what’s traditionally Earth’s most popular season to play outside. Catch the rest in the <a href=\"https://news.zwift.com/en-WW/224428-zwift-releases-new-products-and-experiences-for-spring-and-summer\" target=\"_blank\">Zwift newsroom</a>. See you on the road (of the internet).</p>\n<p>The post <a href=\"https://bikerumor.com/zwift-updates-2023-summer/\">Zwift Coffee Stops, Teleportation Coming Soon</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Sam Anderson","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"f8e99da856541df9f916518cf4f2d8c96a4515c9800b2aa09f442680342c2de7","category":"Cycling"}