{"title":"220 Litter performance, serum collagen, and hormone concentrations in prolapsed and non-prolapsed sows","link":"https://academic.oup.com/jas/article/102/Supplement_2/225/7664942?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Pelvic organ prolapse is one of the top leading causes of sow mortality today and widely considered a multifactorial issue. Previous reports observed prolapsed sows having decreased serum concentrations of various trace minerals and increased tumor necrosis factor-alpha compared with non-prolapsed sows. Additionally, collagen, hormones, and previous litter performance are other factors proposed to be associated with POP. A study was completed to determine differences in serum collagen type 1 (COL1), matrix metalloproteinase 1 (MMP-1), tissue inhibitor of metalloproteinase 1 (TIMP-1), as well as relaxin and estradiol differences in the serum concentration between prolapsed and non-prolapsed sows. Furthermore, previous litter performance, lactation days, pigs born, stillborns, mummified, and pigs weaned on prolapse rate were evaluated. The study utilized 44 prolapsed sows and 44 non-prolapsed sows of similar parity, location, management, and stage of production. Blood was collected from the prolapsed and non-prolapsed sows upon discovery. Serum samples were analyzed using radioimmunoassay for estradiol content. Additionally, COL1, MMP-1, TIMP-1, and relaxin concentrations were determined from the serum using ELISA testing. Data were analyzed using the PROC GLIMMIX procedure in SAS. Prolapsed sows had decreased (<span>P</span> &lt; 0.05) COL1 and TIMP-1 concentrations in the serum compared with the non-prolapsed sows. Prolapsed sows had marginally greater (<span>P</span> &lt; 0.10) MMP-1 concentration compared with non-prolapsed sows. There were no differences (<span>P</span> &gt; 0.10) between prolapsed and non-prolapsed serum concentraions of sows for estradiol and relaxin. Prolapsed sows had longer lactation days (<span>P</span> &lt; 0.05) in the litter before prolapsing compared with non-prolapsed sows. Additionally, stillborns in the previous litter were marginally greater (<span>P</span> = 0.06) in prolapsed sows when compared with the non-prolapsed sows. There were no differences (<span>P</span> &gt; 0.10) in pigs born, mummified, or pigs weaned between prolapsed and non-prolapsed sows. This study suggests that there is a reduced concentration of serum COL1 and TIMP-1 found in prolapsed sows compared with non-prolapsed sows and a marginally increased MMP-1 concentration in prolapsed sows. This could influence the structural integrity of the connective tissue that supports the pelvic organs. We found no differences in serum estradiol or relaxin levels. Additionally, lactation days and stillborn pigs in the litter prior to prolapsing could be contributing factors to prolapse. This work further supports the idea that prolapse is a multifactorial issue.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f8f45442ad93d7a8c91871f1d431cefb8a056e8a0ed70e4c7afcc76e22752da1","category":"Environment"}