{"title":"Hannah Barnes has some training advice: “You’ve got to make it really personal”","link":"https://www.cyclingtips.com/2023/03/hannah-barnes-has-some-training-advice-youve-got-to-make-it-really-personal/","date":1678363243000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-1388560067.jpeg?width=1200\" alt=\"Hannah Barnes has some training advice: “You’ve got to make it really personal”\" /></figure><p><span>When <a href=\"http://velonews.com/tag/Hannah-Barnes\" target=\"_blank\">Hannah Barnes</a>’s sister and fellow pro, Alice, told her about a new venture she was joining – an all-female coaching company with an emphasis on training around the menstrual cycle – and asked if she wanted to be part of it, the concept piqued her interest. </span></p>\n<p><span>“The idea of it not just being a coaching company, it’s doing something different. And it’s women’s specific, I liked,” Barnes tells me. The company, <a href=\"https://www.synrgycycling.com/\">Synrgy</a>, is the brainchild of former pro-turned-coach Will Harper, working alongside his partner, retired ex-WorldTour pro Abi van Twisk. For Barnes, it seemed like the perfect way to make use of her more than 10 years of experience in the peloton.</span></p>\n<p><strong>Also read: </strong><a href=\"https://www.cyclingtips.com/2023/03/trailblazer-marianne-martin/\" target=\"_blank\">Trailblazer: Marianne Martin</a></p>\n<p><span>“I’ve been coached for a long time now, with a lot of different coaches,” she says. “So I know what works, what doesn’t work, and what makes a good coach. I know so much about it. I think that’s the thing, I just want to share.”</span></p>\n<p><span>Barnes is backed up by plenty of knowledgeable colleagues such as Harper and fellow coach Zoe Armstrong who has a degree in sports science and extensive experience in the sport. To that end, joining the coaching team has been an education for Barnes when it comes to her own training as well. </span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-674889960.jpeg?width=730\" alt width=\"1024\" height=\"683\" /><span>Hannah Barnes, right, at the Tour of Yorkshire 2017 </span><span>(Photo: KT/Tim De Waele/Corbis via Getty Images)</span></figure>\n<p><span>“I’ve actually never really thought about it [the effect of the menstrual cycle] until Synrgy and just doing all this research. Sometimes I’d come in from a ride, and I’ll do this session probably two to three times a week, [and] one day I’m great and then like two days later, it’s not great. And I’m like, ‘oh, I guess I didn’t eat right or something yesterday,’ or there’s something up,” she says. </span></p>\n<p><span>“And now I’ve gone into this stuff I’m like ‘oh actually, it wasn’t that, it was something else. It was actually my body’.” </span></p>\n<p><span>At the heart of Synrgy is the aim to optimize training around the menstrual cycle by tracking metrics and catering to the individual athlete’s cycle. The nuances of the menstrual cycle are an under researched area within science as a whole, including sports, and many athletes miss out by fighting their bodies’ natural ebbs and flows. </span></p>\n<p><span>The aim, says Barnes, is to “use phases where you’re feeling super good to do hard, intense days. And then, for example, on week three, just try and focus on endurance days and recovery. Just trying to work that out, not just do three days on, one day off, just like the standard [but to] put recovery in areas where there should be recovery and longer rides when there should be longer rides.”  </span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-1388560067.jpeg?width=730\" alt width=\"1024\" height=\"683\" /><figcaption><span>WAREGEM, BELGIUM – MARCH 30: (L-R) Hannah Barnes of United Kingdom and Uno-X Women Cycling Team and Megan Jastrab of United States and Team DSM compete during the 10th Dwars door Vlaanderen 2022. </span>(Photo: Luc Claessen/Getty Images).</figcaption></figure>\n<p><span>Simple enough if you can afford to dictate your own schedule, but, admits Barnes, it’s much harder for a pro. “I mean it’s quite hard to do you’ve got team training camps or the Giro or something it’s pretty hard to just say, ‘oh, no, guys I can’t.’” she says. “But when you actually do have control, especially over the offseason and winter months, it’s a pretty good tool to have, like adding gym sessions when it’s useful and then taking them out when it’s not.” </span></p>\n<p><span>Barnes admits that tracking her menstrual cycle hadn’t been on her radar until recently: “I was using the pill for like 12 years and then went off it and then just never really thought about it. I guess I just didn’t want to because I didn’t really have any control over when I could train or when I could race,” she says.  </span></p>\n<p><span>“But now it’s been pretty interesting. I spoke to my coach about it a couple of times and just said, can we just make the recovery in between these intervals a little bit longer, or the intervals not as hard?”</span></p>\n<p><span>“I think now you have to, especially when the coaches are working on a women’s team, you have to look into that because that is who we are.” </span></p>\n<p><strong>Also read: <a href=\"https://www.cyclingtips.com/2023/03/places-of-cycling-a-woman-by-the-sea-the-poetry-of-sophia-de-mello-breyner-andresen/\" target=\"_blank\">Places of cycling: A woman by the sea — the poetry of Sophia de Mello Breyner Andresen</a></strong></p>\n<p><span>Having an all-female coaching team removes the potential awkwardness that some female athletes may have around discussing the menstrual cycle with a male coach. Has Barnes ever felt this herself?  </span></p>\n<p><span>“I don’t think I’ve had it, but you do feel a lot more comfortable when you’re talking to a woman, I think. We have a few discussions about it around the dinner table. I know quite a few people that wouldn’t be comfortable being coached by a male coach trying to do that and talk about that. So that’s the thing that we really want to push, that it’s women coaches, for women cyclists.” </span></p>\n<p><span>Between them, the two Barnes sisters have decades of experience in the sport, including with different coaches (they have never shared a coach) “and we’ve also got pretty different ideas of how to train,” Barnes says. “So I think that’s been really cool to listen to each other. We’ve all got the same Training Peaks platform, so all our sessions have been put in there, and little notes that each of us are doing that everyone can see.” </span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-852229404.jpeg?width=730\" alt width=\"1024\" height=\"681\" /><figcaption><span>British Champion Hannah Barnes of MG-Maxifuel Pro Cycling celebrates on Whitehall as she wins the Johnson Health Tech Westminster Grand Prix ahead of the final stage of the 2013 Tour of Britain in London. (Photo by Tim Ireland/PA Images via Getty Images).</span></figcaption></figure>\n<p><span>The plans are not just for pros or serious racers, Barnes emphasizes, “it could be anyone. Even if it’s like a little de-stress after work or something, or you just want to do some local races or a sportive.” Nor are they generic: “I think between us we’ve probably got over 60 sessions in the plan now. So it’s going to be pretty easy I think to just mix it up for everyone and just fit it into what everyone needs… you’ve got to make it really personal and have a good relationship with each of the clients.”</span></p>\n<p><span>The need to adjust training is something Barnes has first-hand experience of, and for anyone under the illusion that pros never take it easy: “some rides I’ll say to my coach like I just want this to be a long day. I don’t want to go up and down the same climb over and over again,” she says.</span></p>\n<p><span>She may be winding down when it comes to racing, but Barnes is still passionate about what she can offer the sport in other ways: “I know so much about it. I think that’s the thing, I just want to share.”  </span></p>","author":"Amy Jones","siteTitle":"CyclingTips","siteHash":"3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"f8fe0c7512c25181698be68a952bdafd4d5fc2ddd1f50648cc60ee","category":"Cycling"}