{"title":"<i>“I always know she cannot betray me</i>.<i>”</i> Disclosure of abortion and methods of abortion used in informal settlements in Nairobi, Kenya","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003252","date":1721224800000,"content":"<p>by Ramatou Ouedraogo, Shelmith Wanjiru, Moussa L. Zan, Clementine Rossier, Onikepe Owolabi, Sherine Athero, Clement Oduor, Martin Bangha, the N-MAS team </p>\r\n\r\nDespite abortion being stigmatized and legally restricted in Kenya, women still disclose their abortions within their network. Evidence has shown how stigma can influence and regulate individual abortion disclosure decisions and behaviors. This paper seeks to understand why and how women make the decisions to disclose their abortion and the associated methods used. The data are from a qualitative formative study and a respondent-driven sampling survey conducted between 2020 and 2021 in two informal settlements in Nairobi, Kenya. The data were analyzed using a descriptive analysis approach for the quantitative data, and thematic analysis for the qualitative data. Our findings reveal that information sharing about abortion is enclosed in a social dynamic of secrecy. This dynamic contributes to making abortion a secret that respondents decided to share with confidants in 81% of the abortion cases. These confidants include intimate relationships such as trusted friends (62%), followed by female relatives. Information was shared in many cases either to get support (i.e. method to use), or because participants had close ties with the confidants. Regarding the methods used, unidentified pills were the most used regardless of the confidant; followed by traditional methods especially among those who sought help with their mothers/aunts/grandmothers (33%), while Medical Abortion and Manual Vacuum Aspiration were rarely used, mostly by those who confided in friends or sisters/cousins. Our findings show that the disclosure of abortion is a complex process embedded in existing codes regarding the circulation of information on sensitive issues and “help” seeking. Our findings show that the need for information on safe abortion and lack of financial resources frequently empowers them to overcome the fear of stigma and disclose their abortion. However, this often resulted in use of unsafe procedures. The findings suggest the need for strengthening the circulation of information on safe methods within communities, using community champions and intermediaries to increase the likelihood of women being directed through safe methods to enhance their use.","author":"Ramatou Ouedraogo","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"f902ff4ee4a3a075a1fa983fafb614f92c1cc5efbf7b7d7128f828d851a08354","category":"Environment"}