{"title":"ทวิตเตอร์แต่งตั้งผู้รับเรื่องร้องเรียนในอินเดีย เพื่อทำตามคำขอรัฐบาลได้ไวตามกฎหมายไอทีใหม่","link":"https://www.blognone.com/node/123666","date":1626076256000,"content":"<div><div><div><p>จากประเด็นอินเดียออกกฎควบคุมเนื้อหาบนโซเชียลมีเดียเข้มงวดขึ้น บังคับบริษัทโซเชียลต้องดำเนินการตามคำขอทางกฎหมายอย่างรวดเร็ว เพื่อลบโพสต์และเปิดเผยว่าเนื้อหามาจากไหน ซึ่งกดดันบริษัทโซเชียลมีเดียอย่างมาก</p>\n<p>ล่าสุด ทวิตเตอร์ ยอมทำตามกฎใหม่ แต่งตั้ง Vinay Prakash หรือผู้ที่จะมารับเรื่องร้องเรียนเพื่อปฏิบัติตามกฎไอทีใหม่ในประเทศ บังคับต้องเป็นคนที่อาศัยในอินเดียเท่านั้น และต้องจัดทำ \"รายงานเพื่อความโปร่งใส\" เกี่ยวกับการจัดการข้อร้องเรียนจากผู้ใช้ในอินเดียระหว่างวันที่ 26 พ.ค.-25 มิ.ย. 2021 ตามข้อกำหนดอื่นภายใต้กฎหมายไอทีฉบับใหม่ด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2fad25d2c099e925a83a49edb7e09d30.png\" /><br />\nภาพจาก <a href=\"https://about.twitter.com/\">About Twitter</a></p>\n<p>ความตึงเครียดระหว่างทวิตเตอร์และรัฐบาลอินเดียเพิ่มขึ้นในปีนี้ นับตั้งแต่มีการประท้วงโดยกลุ่มเกษตรกร และมีหลายบัญชีที่รัฐบาลอยากให้ลบออก ซึ่งทวิตเตอร์ยอมลบให้บางบัญชี หลังจากนั้น อินเดียก็ได้แนะนำกฎไอทีฉบับใหม่ที่บริษัทโซเชียลแต่งตั้งบุคคลสามตำแหน่งคือ เจ้าหน้าที่กำกับดูแลการปฏิบัติตามกฎระเบียบที่จะรับรองว่าบริษัทของตนปฏิบัติตามกฎหมายท้องถิ่น เจ้าหน้าที่รับเรื่องร้องทุกข์ ที่จะจัดการกับข้อร้องเรียนจากผู้ใช้ชาวอินเดียเกี่ยวกับแพลตฟอร์มของตน และบุคคลติดต่อที่ต้องพร้อมให้บริการแก่รัฐบาลตลอดเวลา ซึ่งทวิตเตอร์แต่งตั้งแล้ว ส่วนกูเกิลระบุว่ากำลังอยู่ระหว่างดำเนินการ และ เฟซบุ๊กคาดว่าจะทำตามเช่นกัน</p>\n<p>อย่างไรก็ตาม ที่ผ่านมาบริษัทโซเชียลแสดงความกังวลต่อกฎใหม่อินเดีย ออกแถลงการณ์ว่ากฎใหม่เป็นภัยต่อเสรีภาพการพูด <a href=\"https://www.blognone.com/node/122868\">WhatsApp ของเฟซบุ๊ก ถึงกับฟ้องรัฐบาลอินเดียกลับด้วย</a></p>\n<p>ที่มา - <a href=\"https://www.reuters.com/world/india/twitter-appoints-grievance-officer-india-comply-with-new-rules-2021-07-11/\">Reuters</a>, <a href=\"https://indianexpress.com/article/india/twitter-names-vinay-prakash-as-new-resident-grievance-officer-7399014/\">India Express</a>, <a href=\"https://edition.cnn.com/2021/07/09/tech/twitter-india-strategy-intl-hnk/index.html\">CNN</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/twitter\">Twitter</a></div><div><a href=\"/topics/india\">India</a></div><div><a href=\"/topics/politics\">Politics</a></div><div><a href=\"/topics/freedom-information\">Freedom of Information</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f91ecece3fc9fa63b4f23b1bb679db2e4d84650c1d59777f18a88de7da182842","category":"Thai"}