{"title":"How to connect an Apple LED Cinema Display to a new MacBook","link":"https://www.macworld.com/article/229510/connecting-an-apple-led-cinema-display-to-a-usb-c-macbook-or-macbook-pro-here-are-the-adapters-you.html","date":1627110900000,"content":"<div>\n<section><div></div></section><p>Apple rarely releases sales figures on particular models of products they offer, but I have to imagine they shipped at least hundreds of thousands of its two Apple LED Cinema Displays (<a href=\"https://www.macworld.com/article/193804/apple-led-cinema-displ.html\">24-inch</a>, 2008 to 2010, and <a href=\"https://www.macworld.com/article/208652/apple_led_cinema_display_2010.html\">27-inch</a>, 2010 to 2013) based on the number of people who have reached out and want to connect them to a USB-C equipped MacBook.</p>\n\n\n\n<p>I purchased several adapters and cables that can take the LED Cinema Display’s Mini DisplayPort (not Thunderbolt) and convert it into something that passes over USB-C in a compatible chain that allows you to connect to a USB-C equipped MacBook. My testing shows three affordable and viable options, plus a reasonable option for a full-featured USB-C dock that requires just a simple adapter.</p>\n\n\n\n<p>Apple made multiple generations of its displays: the first used DVI (in single-link and dual-link flavors); the second, Mini DisplayPort; the third, Thunderbolt 2. I’m interested here in the second connector type, Mini DisplayPort, which is distinct from Thunderbolt 2, even though both standards use the same connector type. (You can find some options for DVI, but we opted to not test them given the smaller number, display quality, and age of those that remain usable.)</p>\n\n\n\n<p>Note that Apple says its <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/MMEL2AM/A/thunderbolt-3-usb-c-to-thunderbolt-2-adapter&amp;subid1=1-1-229510-1-0-0\" target=\"_blank\">Thunderbolt 2 to Thunderbolt 3 adapter</a> does not work with DisplayPort and Mini DisplayPort displays, including the Apple LED Cinema Display.</p>\n\n\n\n<p>While there are a variety of USB-C docks on the market that accept external video, nearly all of them only have an HDMI jack, and there is not, say, a female Mini-DisplayPort to male HDMI adapter available. (Don’t make a mistake and order one of the male Mini-DisplayPort to female HDMI adapters on the market.)</p>\n\n\n\n<p>I searched across Amazon, product manufacturers’ sites, and other retailers for potential adapters, read reviews, and settled on four adapters to test. Some of the adapters tested go in and out of stock rapidly, which is why I provide a few alternatives.</p>\n\n\n\n<p>To cut to the chase, the clear winner on features is the <a href=\"https://www.amazon.com/UPTab-USB-C-Type-DisplayPort-Adapter/dp/B01N4FQNYW?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">UPTab USB-C to Mini-DisplayPort adapter</a> ($35). Its secret weapon? A pass-through USB-C power jack.</p>\n\n\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<h4>\n\t\t\t\t\t\t\t\t\t</h4>\n\t\t\t</div>\n\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>UPTab USB-C Type C to Mini DisplayPort Adapter 4K@60Hz</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images-na.ssl-images-amazon.com/images/I/41em5PtX7ML.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\tMSRP:\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t$34.95\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B01N4FQNYW?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$34.95 at Amazon</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</div>\n\t\t</div>\n\n\t\t\n\n\n<p></p>\n\n\n\n<p>If you’re looking for a full-scale USB-C dock, look for one like the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=http://shop.caldigit.com/us/USB-C-Dock-US&amp;xcust=1-1-229510-1-0-0&amp;sref=https://www.macworld.com/feed\">CalDigit USB-C Dock</a>. I discuss it below and in a <a href=\"http://www.macworld.com/article/3162727/macbook-accessories/caldigit-usb-c-dock-review-a-full-featured-usb-c-dock-with-both-displayport-and-hdmi-ports.html\" target=\"_blank\">separate review</a>, but it has both HDMI and full-sized DisplayPort jacks, and requires just a sub-$10 Mini-DisplayPort female to full-sized DisplayPort male adapter to work with an LED Cinema Display.</p>\n\n\n\n<h2>The limitations</h2>\n\n\n\n<p>Not everything works perfectly over USB-C with the Apple LED Cinema Display, but it’s a pretty close match. I tested on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/kb/sp597?locale=en_US&amp;xcust=1-1-229510-1-0-0&amp;sref=https://www.macworld.com/feed\">a 27-inch model</a>.</p>\n\n\n\n<p>Plugging in just a Mini DisplayPort adapter gets you the following with the products tested:</p>\n\n\n\n<ul><li>External 1440p (2560×1440 pixel resolution) display</li><li>External audio via the display’s speakers and control of audio volume from the laptop</li><li>Power (but not data) to the USB 2.0 ports in the display’s back</li></ul><p>The only glitch seems to be a small line of missing pixels in the upper right corner of the display when connected through the CalDigit dock, but that’s nearly unnoticeable.</p>\n\n\n\n<p>The missing piece, however, is brightness and USB 2.0 data passthrough. I didn’t find the default brightness level distracting or glaring, but that’s a very individual judgement.</p>\n\n\n\n<p>You need to use a USB-C to Type-A adapter to connect the monitor’s USB Type-A plug, and then you can control brightness via a keyboard, Touch Bar, or Displays system preference pane, as well as plug in a keyboard, mouse, and other low-data-speed devices.</p>\n\n\n\n<p>Plugging in USB also enables a built-in iSight (640×480 pixel resolution) camera and microphone, which are redundant to a Mac laptop’s mic and FaceTime support.</p>\n\n\n\n<p>For a MacBook Pro, using USB 2.0 means giving up two ports to get brightness and other features: one for the Mini-DisplayPort adapter and one to connect a USB plug. However, if you’re using a USB-C hub or dock with multiple Type-A ports, that can take care of that problem.</p>\n\n\n\n<h2>What to buy</h2>\n\n\n\n<p>I found four distinct options that worked perfectly well.</p>\n\n\n\n<p><strong>UPTab USB-C to Mini-DisplayPort adapter.</strong> This <a href=\"https://www.amazon.com/dp/product/B01N4FQNYW?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">UPTab adapter</a> has great advantage of supporting pass-through USB-C power. It’s attractively made and seems solidly constructed. The $35 price tag may seem excessive compared to adapters and cables that cost $10 to $15, but the engineering and components for power pass-through of the wattage level used to charge a Mac laptop comes with a cost.</p>\n\n\n\n<p>For a MacBook owner, the power port is supremely useful, letting you use the adapter without draining power. However, with the laptop’s single USB-C jack in use, you’re stuck if you need to connect other USB devices, like a wired keyboard or mouse, an external drive, or SD Card reader.</p>\n\n\n\n<p><strong>Itanda Type-C adapter.</strong> The robustly made, attractive, $20 <a href=\"https://www.amazon.com/ITANDA-DisplayPort-Aluminium-resolution-ChromeBook/dp/B01N2ORP84?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Itanda</a> is probably the best choice for a MacBook Pro owner. It’s inexpensive and occupies a port compactly.</p>\n\n\n\n<p><strong>A pair of adapters.</strong> If a direct adapter, like the Itanda, isn’t available and you want an alternative that works just as well in my testing, you can pair two adapters.</p>\n\n\n\n<p>I tried both the <a href=\"https://www.amazon.com/Cable-Matters-DisplayPort-Female-Adapter/dp/B014DV2RGG?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Cable Matters DisplayPort to Mini-DisplayPort Male to Female Adapter</a> ($9) and the <a href=\"https://www.amazon.com/StarTech-com-DP2MDPMF6IN-DisplayPort-Video-Adapter/dp/B003N3DTKY?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">StarTech DisplayPort to Mini-DisplayPort adapter</a> ($6.50) with the <a href=\"https://www.amazon.com/gp/product/B017OVBUHO?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Benfei USB-C to DisplayPort 4K Adapter</a> ($15 when I purchased it). The Cable Matters and StarTech adapters both accept the male Mini-DisplayPort connector from the Apple display, and have a male full-sized DisplayPort plug. That plugs into the Benfei’s female DisplayPort jack, and then the Benfei plugs into a MacBook or MacBook Pro via USB-C.</p>\n\n\n\n<p>At $21.50 or $24 together, both are more expensive than the Itanda, but I had no trouble getting the same crisp performance and support.</p>\n\n\n\n<p>Some readers tried more complicated options, involving a female-to-female inline Mini DisplayPort adapter, but given the two-adapter option, that’s no longer necessary.</p>\n\n\n\n<p><strong>Why not HDMI?</strong> You might ask why I didn’t try some kind of HDMI situation, where I converted Mini DisplayPort to an HDMI plug or adapter jack, and then plugged that into the HDMI port available in several USB-C docks. I tried a few variations of this, and it didn’t work, although others have had different luck.</p>\n\n\n\n<p>DisplayPort is a video standard that works over its own proprietary connector styles (DisplayPort and Mini DisplayPort), and can be embedded as a data standard inside of Thunderbolt 2, Thunderbolt 3, and USB-C. Although DisplayPort can also be routed via an HDMI cable—HDMI being its own set of standards—it doesn’t seem to survive the passage with multiple adapters and an Apple LED Cinema Display.</p>\n\n\n\n<p>The only reason to want this option is if you have a dock without a spare USB-C data port that might allow DisplayPort passage and that has an HDMI jack.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"f91e482f4278c91db3c946a13dc04ec95efc682b6a30874aa8e2bdfff5806c40","category":"Apple"}