{"title":"Tim Berners-Lee makes an NFT from World Wide Web’s Objective-C","link":"https://arstechnica.com/?p=1773576","date":1623779768000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/TBL-CERN-Tubes-800x537.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/TBL-CERN-Tubes.jpg\">Enlarge</a> <span>/</span> Tim Berners-Lee showing off the early World Wide Web at CERN. (credit: Courtesy Sotheby's)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Next week, Sir Tim Berners-Lee will auction an NFT of the original source code he used to create the World Wide Web.</p>\n<p>The centerpiece of the digital collectible will be 9,555 lines of time-stamped source code split among files created by Berners-Lee between October 3, 1990, and August 24, 1991. That code, mostly written in Objective-C, served as the early foundation for much of the modern Internet, including this very site. The files cover implementations of HTML, HTTP, and URIs, along with the original HTML documents that Berners-Lee wrote as a sort of “read me” for the early web.</p>\n<p>The NFT will also include a letter recently written by Berners-Lee containing his musings on the original Web code. The letter is written in Markdown, making it Github-ready. The NFT will also come with an animated 30-minute black-and-white visualization of the code being written. Lastly, the lucky winner will receive an SVG “poster” of Berners-Lee’s code, which the man himself made using a Python script. The poster also includes his vectorized signature in the lower right.</p></div><p><a href=\"https://arstechnica.com/?p=1773576#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1773576&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f92147f6a1846cb82a2c99f727541f2d926f3a510471e514e0a4ad17f7b999a8","category":"Tech"}