{"title":"Elucidating key immunological biomarkers and immune microenvironment dynamics in aging‐related intracranial aneurysm through integrated multi‐omics analysis","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24117?af=R","date":1713272355000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>The exact cause of intracranial aneurysms (IA) is still unclear. However, pro-inflammatory factors are known to contribute to IA progression. The specific changes in the immune microenvironment of IAs remain largely unexplored.</p>\n<h2>Methods</h2>\n<p>This study analyzed single-cell sequencing data from a male mouse model of brain aneurysm, focusing on samples before and after elastase-induced Willis aneurysms. The data helped identify eight distinct cell subpopulations: fibroblasts, macrophages, NK cells, endothelial cells, B cells, granulocytes, and monocytes. The study also involved bulk RNA sequencing of 97 IA samples, utilizing ssGSEA and CIBERSORT algorithms for analysis. Intercellular communication among these cells was inferred to understand the immune dynamics in IA.</p>\n<h2>Results</h2>\n<p>The study found that fibroblasts and macrophages are predominant in various disease states of IA. Notably, the onset of IA was marked by a significant increase in fibroblasts and a decrease in macrophages. There was a marked increase in cellular interactions, especially involving macrophages, at the onset of the disease. Through enrichment analysis, 12 potential immunogenic biomarkers were identified. Of these, Rgs1 emerged as a critical molecule in IA formation, confirmed through secondary validation in a single-cell sequencing dataset.</p>\n<h2>Conclusion</h2>\n<p>This comprehensive analysis of immune cell composition and intercellular communication in IA tissues highlights the significant roles of macrophages and the molecule Rgs1. These findings shed light on the physiological and pathological conditions of IA, offering new insights into its immune microenvironment.</p>","author":"Kai Wang, \nYangyang Xiao, \nWenjia Zhang, \nHaiguang Yang, \nChaoqun Li, \nJia Wang, \nGuoshu Li","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"f92ce3b8be509036ce18be2f4573cbac42b35c42f9f752b518b9db50d4a4324d","category":"Environment"}