{"title":"กูเกิลปล่อยโมเดล Gemini 1.5 Pro รองรับอินพุตขนาดใหญ่ 1 ล้านโทเคน, ความสามารถเทียบเท่า Gemini Ultra","link":"https://www.blognone.com/node/138226","date":1708011373000,"content":"<div><div><div><p><a href=\"https://www.blognone.com/node/138115\">กูเกิลเพิ่งเปิดตัว Gemini Ultra</a> ไปหมาดๆ วันนี้ปล่อยของต่อเนื่องด้วยโมเดลเวอร์ชันอัพเดต Gemini 1.5 Pro ซึ่งเป็นการอัพเกรดโมเดลระดับกลาง (Pro) ที่มีความสามารถระดับเดียวกับ Gemini 1.0 Ultra แต่ใช้พลังประมวลผลน้อยกว่า</p>\n<p>ฟีเจอร์เด่นของ Gemini 1.5 Pro ที่น่าสนใจคือการรองรับอินพุตขนาดใหญ่ถึง 1 ล้านโทเคน ซึ่งถือว่ามากที่สุดในบรรดาโมเดลภาษาขนาดใหญ่ทุกวันนี้ (<a href=\"https://www.blognone.com/node/136880\">Anthropic Claude 2.1 รองรับ 2 แสนโทเคน</a>) เปิดโอกาสให้ใช้งานโมเดล LLM กับงานที่หลากหลายขึ้นอีกมาก กูเกิลเทียบให้เห็นภาพว่าเท่ากับคลิปเสียงยาว 11 ชั่วโมง, วิดีโอ 1 ชั่วโมง, เอกสาร 700,000 คำ, โค้ด 30,000 บรรทัด</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/9f278b4044d2b9b532735aa33a4a8c65.jpeg\" /></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/51ef4bff41f3051b4decb009c10ce12c.png\" /></p>\n<p>เบื้องหลังของ Gemini 1.5 เป็นสถาปัตยกรรมใหม่ที่เรียกว่า Mixture-of-Experts (MoE) ซึ่งอิงจาก<a href=\"https://arxiv.org/abs/1701.06538\">งานวิจัยของกูเกิลในปี 2017</a> แนวคิดของมันคือการสร้างเครือข่าย neural network ขนาดเล็กที่เชี่ยวชาญเฉพาะเรื่องมาต่อกัน แทนการสร้างเครือข่าย neural network ใหญ่อันเดียว แบบที่ใช้ในโมเดลรุ่นก่อน พอถึงเวลาใช้งาน ก็จะหยิบเฉพาะเครือข่ายที่เกี่ยวข้องมาทำงาน ช่วยให้ประสิทธิภาพของการรันโมเดลดีขึ้นกว่าเดิมมาก</p>\n<p>กูเกิลโชว์การรัน Gemini 1.5 โดยให้อ่านบันทึกการสนทนาทั้งหมดของนักบินอวกาศในภารกิจ Apollo 11 ไปดวงจันทร์ ที่ถอดเป็นเอกสารยาว 402 หน้า ผลคือ Gemini สามารถเข้าใจรายละเอียดต่างๆ ของภารกิจได้เป็นอย่างดี</p>\n<p>อีกตัวอย่างคือการเอาหนังเงียบเรื่อง Sherlock Jr. (1924) ความยาว 44 นาทียัดเข้าไปใน Gemini ให้ดูหนัง (ที่ไม่มีเสียงพูด) แล้ววิเคราะห์เหตุการณ์ต่างๆ ในเรื่องได้เช่นกัน</p>\n<p>ตอนนี้ Gemini 1.5 ยังเปิดทดสอบแบบ early testing โดยยังเปิดให้ใช้งานแบบ 128,000 โทเคนเป็นมาตรฐาน แต่นักพัฒนาและลูกค้าองค์กรบางรายจะได้ทดสอบเวอร์ชัน 1 ล้านโทเคนก่อนใคร</p>\n<p>ที่มา - <a href=\"https://blog.google/technology/ai/google-gemini-next-generation-model-february-2024\">Google</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/gemini\">Gemini</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/llm\">LLM</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f92dc35bae3c7466fd943aef0f5ba91e002ca7c5337ac4e3398118ac57f3f6f0","category":"Thai"}