{"title":"Grape seed proanthocyanins protect fluoride-induced hepatotoxicity via the Nrf2 signaling pathway in male rats","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae039/7630123?rss=1","date":1710460800000,"content":"<span><div>Abstract</div><div>Background</div>Fluoride is a necessary element for human health, but excessive fluoride intake is found toxic to the liver. Previous studies confirmed that Grape seed procyanidin extract (GSPE) protects against fluoride-induced hepatic injury. However, the mechanism underlying this protective effect remains obscure. To evaluate the protective effect of GSPE against fluoride-induced hepatic injury and explore the possible hepatoprotective role of the Nrf2 signaling pathway to find effective strategies for the treatment and prevention of fluoride-induced hepatotoxicity. This study aims to explore the mechanisms by which GSPE attenuates fluoride-induced hepatotoxicity through a rat drinking water poisoning model.<div>Methods</div>Hepatic injury was determined by serum biochemical parameters, oxidative parameters, HE, and TUNEL analysis. The protein expression levels of apoptosis-related proteins like Bax, B-cell lymphoma-2 (Bcl-2), and Caspase-3 and the nuclear factor, erythroid 2 like 2 (Nrf2) were analyzed by Western blot.<div>Resluts</div>Our results showed that GSPE administration reduced fluoride-induced elevated serum ALT and AST and enhanced the antioxidant capacity of the liver. In addition, GSPE mitigated fluoride-induced histopathological damage and reduced the liver cell apoptosis rate. Furthermore, GSPE significantly up-regulated the expression and nuclear translocation of the Nrf2 and decreased apoptosis-related proteins like Bax and caspase-3 in the hepatic.<div>Conclusion</div>Taken together, GSPE exerts protective effects on the oxidative damage and apoptosis of fluoride-induced hepatic injury via the activation of the Nrf2 signaling pathway. This study provides a new perspective for the mechanism study and scientific prevention and treatment of liver injury induced by endemic fluorosis.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"f9334c86bcbfe27b2f368f344ae14fbb750997833cd9ff884600ef747ff3041d","category":"Environment"}