{"title":"Assessment of Wet Season Precipitation in the Central United States by the Regional Climate Simulation of the WRFG Member in NARCCAP and Its Relationship with Large-Scale Circulation Biases","link":"http://link.springer.com/10.1007/s00376-023-2353-x","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Assessment of past-climate simulations of regional climate models (RCMs) is important for understanding the reliability of RCMs when used to project future regional climate. Here, we assess the performance and discuss possible causes of biases in a WRF-based RCM with a grid spacing of 50 km, named WRFG, from the North American Regional Climate Change Assessment Program (NARCCAP) in simulating wet season precipitation over the Central United States for a period when observational data are available. The RCM reproduces key features of the precipitation distribution characteristics during late spring to early summer, although it tends to underestimate the magnitude of precipitation. This dry bias is partially due to the model’s lack of skill in simulating nocturnal precipitation related to the lack of eastward propagating convective systems in the simulation. Inaccuracy in reproducing large-scale circulation and environmental conditions is another contributing factor. The too weak simulated pressure gradient between the Rocky Mountains and the Gulf of Mexico results in weaker southerly winds in between, leading to a reduction of warm moist air transport from the Gulf to the Central Great Plains. The simulated low-level horizontal convergence fields are less favorable for upward motion than in the NARR and hence, for the development of moist convection as well. Therefore, a careful examination of an RCM’s deficiencies and the identification of the source of errors are important when using the RCM to project precipitation changes in future climate scenarios.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"f9373b2197420b95e6a88ad6201273c476ec9e5b2b6a29b39ce326abf3eb8dd2","category":"Environment"}