{"title":"Assessing the Impact of Drug-Eluting Bead Transarterial Chemoembolization on Liver Fibrosis in Patients with Hepatocellular Carcinoma: Insights from a Propensity Score Matched Retrospective Analysis","link":"https://www.preprints.org/manuscript/202410.1572/v1","date":1729504605000,"content":"Objective:This study aims to evaluate the impact of drug-eluting bead transarterial chemoembolization (DEB-TACE) compared to conventional transarterial chemoembolization (cTACE) in patients with hepatocellular carcinoma (HCC), with a specific focus on liver fibrosis progression. By utilizing propensity score matching (PSM), the study seeks to examine the effects of both treatments on liver fibrosis and survival rates, providing evidence to inform clinical decision-making. Methods:This retrospective analysis included HCC patients who underwent DEB-TACE or cTACE at Xuzhou Cancer Hospital between October 2020 and September 2023. Propensity score matching (PSM) was employed to ensure comparability between the two groups based on baseline characteristics, with a 1:1 matching ratio. The primary endpoints included liver fibrosis markers (such as hyaluronic acid, type III procollagen, type IV collagen, and laminin), liver function trends (ALT, AST, TBIL, ALB), and adverse events. Kaplan-Meier methods were used to evaluate progression-free survival (PFS) and overall survival (OS). Results:After PSM, 92 patients were included (46 in the DEB-TACE group and 46 in the cTACE group). Results demonstrated that the DEB-TACE group showed superior outcomes in reducing liver fibrosis markers (e.g., PC-III, IV-C, and LN) compared to the cTACE group. Additionally, the incidence of nausea, vomiting, and postoperative pain was significantly lower in the DEB-TACE group (p &lt; 0.001). Kaplan-Meier analysis revealed that PFS and OS were significantly longer in the DEB-TACE group compared to the cTACE group (p &lt; 0.05). Multivariate logistic regression analysis further confirmed the independent protective effect of DEB-TACE in reducing liver fibrosis progression (OR = 2.39, p = 0.044). Conclusion:This study confirms the advantages of DEB-TACE in treating patients with intermediate to advanced HCC, particularly in slowing liver fibrosis progression and improving survival outcomes. The use of propensity score matching enhances the reliability of these findings. Future studies should continue to explore the potential of DEB-TACE in broader patient populations to optimize treatment strategies for HCC.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f9379a4802d9a864efbb50985dcdc66e081ed0e74afbc3671f5ee27df1bd2825","category":"Interdisciplinary"}