{"title":"Effectiveness of PCSK9 inhibitors: A Target Trial Emulation framework based on Real-World Electronic Health Records","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309470","date":1724335200000,"content":"<p>by Giulia Barbati, Caterina Gregorio, Arjuna Scagnetto, Carla Indennidate, Chiara Cappelletto, Andrea Di Lenarda</p>\r\n\r\nLow-Density Lipoprotein (LDL) cholesterol is one of the main target for cardiovascular (CV) prevention and therapy. In the last years, Proprotein Convertase Subtilisin–Kexin type 9 inhibitors (PCSK9-i) has emerged as a key therapeutic target to lower LDL and were introduced for prevention of CV events. Recently (June 2022) the Italian Medicines Agency (AIFA) modified the eligibility criteria for the use of PCSK9-i. We designed an observational study to estimate the prevalence of eligible subjects and evaluate the effectiveness of PCSK9-i applying a Target Trial Emulation (TTE) approach based on Electronic Health Records (EHR). Subjects meeting the eligibility criteria were identified from July 2017 (when PCSK9-i became available) to December 2020. Outcomes were all-cause death and the first hospitalization. Among eligible subjects, we identified those treated at date of the first prescription. Inverse Probability of Treatment Weights (IPTW) were estimated including demographic and clinical covariates, history of treatment with statins and the month/year eligibility date. Competing risk models on weighted cohorts were used to derive the Average Treatment Effect (ATE) and the Conditional Average Treatment Effect (CATE) in subgroups of interest. Out of 1976 eligible subjects, 161 (8%) received treatment with PCSK9-i. Treated individuals were slightly younger, predominantly male, had more severe CV conditions, and were more often treated with statin compared to the untreated subjects. The latter exhibited a higher prevalence of non-CV comorbidities. A significant absolute and relative risk reduction of death and a lower relative risk for the first hospitalization was observed. The risk reduction for death was confirmed in CATE analysis. PCSk9-i were prescribed to a minority of eligible subjects. Within the TTE framework, the analysis confirmed the association between PCSK9-i and lower risk of events, aligning with findings from randomized clinical trials (RCTs). In our study, PCSK9-i provided protection specifically against all-cause death, expanding upon the evidence from RCTs that had primarily focused on composite CV outcomes.","author":"Giulia Barbati","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f94e05095de8a0d4fc762b8cc6999c92bd85397411a52a40614776b754fdd9f2","category":"Interdisciplinary"}