{"title":"Fall 2021 Apple Event Rumors: iPhones in September, MacBook Pros in Late October, and More","link":"https://www.macrumors.com/2021/08/12/2021-fall-apple-event-rumor-roundup/","date":1628798673000,"content":"This year, Apple has already released several new products, including new iPads, the 24-inch <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a>, the new <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a>, and of course, <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a>. Looking ahead to the next few weeks, the list of 2021 Apple products will grow even longer as Apple prepares to reveal the next iPhones, MacBook Pros, and more.\r\n<br />\r\n\r\n<br />\r\nThere has been an avalanche of rumors about this year's fall season and what Apple has planned for the remainder of 2021. The cloud of product rumors can make it hard to stay updated with what new devices to expect and when. To help, we've created this guide for <em>MacRumors'</em> readers that outlines what events we could see and what we should expect.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/cook-april-2021-event-hype.jpg\" />\r\n<br />\r\nApple's last event was the Worldwide Developers Conference in June, which focused on upcoming updates to iOS, iPadOS, macOS, tvOS, and watchOS. Before that, the company's first event of 2021 focused on new products was held on April 20 and included the <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a>, ‌iMac‌, and more.\r\n<br />\r\n\r\n<br />\r\nDue to the global health crisis, both 2021 and all events of 2020 have been held virtually online. Under normal circumstances, Apple would have held standalone events at the Steve Jobs Theater in <a href=\"https://www.macrumors.com/guide/apple-park/\">Apple Park</a>, with a live audience consisting of Apple employees, members of the media, special guests, and others. While some may have hoped that the 2021 <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> event would be held in person following five virtual online events, that's highly unlikely to be the case.\r\n<br />\r\n\r\n<br />\r\n<h2>iPhone 13 Apple Event</h2>\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/iPhone-13-Dummy-Thumbnail-2.jpg\" />\r\n<br />\r\nThe global health crisis last year not only required Apple to hold its typically in-person events online, but it also delayed the launch of the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> to October, one month behind the usual schedule. Every September, Apple has released its new iPhones, but lockdowns and suppliers' restrictions meant that timeframe wasn't met. This year, though, things are looking different. \r\n<br />\r\n\r\n<br />\r\nMultiple reports from credible outlets and journalists have pointed to Apple releasing its new iPhones on time in September this year. Apple last released its flagship ‌iPhone‌ in September 2019, with an event at ‌Apple Park‌ on September 10. Apple tends to have its events on Tuesdays, previously to give members of the audience sufficient time to travel to California to attend the product announcement. Still, even now, with digital events requiring no such travel, Apple has stuck to a preference of Tuesday.\r\n<br />\r\n\r\n<br />\r\nKnowing that, we can make some educated guesses as to when Apple will hold its ‌iPhone‌ event this year. This September, Tuesdays will land on the 7, 14, 21, and 28. Looking at Apple's pattern of holding events towards the middle of the month, it's a reasonable guess to assume that the 2021 ‌iPhone‌ event could be held on Tuesday, September 14.\r\n<br />\r\n\r\n<br />\r\nOf course, this is all speculation. However, Apple is one to stick to a strict routine when it comes to scheduling events, and such predictions based on the company's previous event planning behavior have proven accurate. With the date possibly set, here's what we can expect:\r\n<br />\r\n\r\n<br />\r\n<ul>\r\n<br />\r\n\t<li><a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> mini, ‌iPhone 13‌, ‌iPhone 13‌ Pro, and ‌iPhone 13‌ Pro Max: Expect significant new camera features, more advanced displays, improved performance, battery life, and smaller hardware changes.</li>\r\n<br />\r\n\t<li>Apple Watch Series 7: May include a complete redesign featuring smaller display bezels and flat edges, more advanced health tracking capabilities, and bolstered internals.</li>\r\n<br />\r\n\t<li>Third-Generation <a href=\"https://www.macrumors.com/guide/airpods/\">AirPods</a>: The next generation of the standard ‌AirPods‌ could feature a design more in-line with the <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> with silicone ear tips, a redesigned charging case, and improved connectivity. The new ‌AirPods‌ have been rumored for some time, with recent reporting suggesting a launch alongside the new ‌iPhone 13‌.</li></ul>\r\n<br />\r\n\r\n<br />\r\nApple could, ultimately, decide to include more in its September event. However, given the event's mainstream coverage, it may want to focus on its more popular products rather than reveal other new devices such as upcoming Apple silicon Macs.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple Silicon Mac Event</h2>\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/16-inch-macbook-pro-m2-render.jpg\" />\r\n<br />\r\nThis year, one of the most rumored and highly anticipated product releases is the redesigned 14 and 16-inch MacBook Pro. The new laptops are expected to feature the most radical redesign to the MacBook Pro since 2016, with new ports, the death of the Touch Bar, a brand-new display based on mini-LED technology, and a powerful Apple silicon chip.\r\n<br />\r\n\r\n<br />\r\nTo anyone who follows the Apple news and rumor cycle, it will feel as if these MacBook Pros have been rumored for an eternity, but their long-awaited reveal is close. Last year, Apple announced its first Apple silicon chip, the ‌M1‌, and an updated 13-inch <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a>, MacBook Pro, and <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a> at a November event.\r\n<br />\r\n\r\n<br />\r\nApple is likely to follow a similar path this year, separating its ‌iPhone‌ and Apple Watch announcements from these new MacBook Pros. All credible reports suggest a launch before the end of the year. While it's harder to pinpoint a specific date for this event compared to the September ‌iPhone‌ event, there is a relative timeframe we can look into.\r\n<br />\r\n\r\n<br />\r\nAn account that goes by the name of \"Dylan,\" which has shared accurate information in the past regarding Apple's plan, including details about the 24-inch ‌iMac‌ weeks before its launch, has stated the new MacBook Pros are <a href=\"https://twitter.com/dylandkt/status/1405545069059338243\">set to launch in late October to early November</a>. Here are the possibilities for when we could see an Apple silicon Mac event this year, based on that information:\r\n<br />\r\n\r\n<br />\r\n<ul>\r\n<br />\r\n\t<li>Tuesday, October 19</li>\r\n<br />\r\n\t<li>Tuesday, October 26</li>\r\n<br />\r\n\t<li>Tuesday, November 9</li>\r\n<br />\r\n</ul>\r\n<br />\r\nAn unlikely possibility is that Apple releases the new MacBook Pros through a press release on its website, similar to how it released the ‌AirPods Pro‌ in 2019 and updated ‌iPad Pro‌ in 2020. That, however, is highly unlikely as Apple will likely want to tout in an elegant way the new MacBook Pros, their design, and their powerful performance aimed at high-end professional users.\r\n<br />\r\n\r\n<br />\r\n<h2>Surprise Third Event?</h2>\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/iPad-mini-pro-feature-2.jpg\" />\r\n<br />\r\nIn 2020, Apple held three separate events in the fall, with one focusing entirely on the redesigned <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a>, 10.8-inch <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and Apple Watch. This year, Apple is working on a less significant round of updates to its ‌iPad‌ family. Rather than update two ‌iPad‌ models, Apple is expected to <a href=\"https://www.macrumors.com/2021/07/12/sixth-generation-ipad-mini-this-fall/\">release only an updated iPad mini this fall</a>. \r\n<br />\r\n\r\n<br />\r\nGiven this, it's unlikely Apple will hold an entire event dedicated to just a single ‌iPad‌ model. Instead, it may decide to include the <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a> at its Apple silicon or ‌iPhone‌ event or none and release it via a press release.\r\n<br />\r\n\r\n<br />\r\n<h2>What else is in store for 2021?</h2>\r\n<br />\r\nWith new iPhones, Apple Watches, MacBook Pros, and ‌AirPods‌ all possibly awaiting a launch this fall, is there anything else? In short, probably not. While Apple is continuing to work on several other products, such as a larger Apple silicon ‌iMac‌, they're <a href=\"https://www.macrumors.com/2021/07/26/larger-imac-rumored-launch-2022/\">not expected to be released until early 2022</a>. Apple is also working on a redesigned ‌Mac mini‌, <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a>, and ‌MacBook Air‌, all expecting a release next year.\r\n<br />\r\n\r\n<br />\r\nFor a more comprehensive roundup of what else Apple is working on, be sure to check out our <a href=\"https://www.macrumors.com/guide/apple-event/\">full 2021 Apple product guide</a>. <div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini 5</a>, <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a>, <a href=\"https://www.macrumors.com/roundup/macbook-pro-13/\">MacBook Pro 13\"</a>, <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">MacBook Pro 16\"</a>, <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/apple-event/\">Apple event</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPad_Mini\">iPad Mini (Don't Buy)</a>, <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Caution)</a>, <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_13\">13\" MacBook Pro (Don't Buy)</a>, <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_16\">16\" MacBook Pro (Don't Buy)</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ipad.137\">iPad</a>, <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a>, <a href=\"https://forums.macrumors.com/forums/macbook-pro.90\">MacBook Pro</a>, <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/12/2021-fall-apple-event-rumor-roundup/\">Fall 2021 Apple Event Rumors: iPhones in September, MacBook Pros in Late October, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/fall-2021-apple-event-rumors-iphones-in-september-macbook-pros-in-late-october-and-more.2307380/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PgYxRJyuuoM:j9tMaHBmVag:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PgYxRJyuuoM:j9tMaHBmVag:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/PgYxRJyuuoM\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f951b1c313a8a6e4e2f270a974ae604e11dcf916ff3d3a4dfafc2b082a0ce838","category":"Apple"}