{"title":"Land consolidation impacts the abundance and richness of natural enemies but not pests in small‐holder rice systems","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14671?af=R","date":1716868861000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/e1f3ac5e-6c64-4608-be4d-764c07f439a8/jpe14671-toc-0001-m.png\" alt=\"Land consolidation impacts the abundance and richness of natural enemies but not pests in small-holder rice systems\" />\n<p>Land consolidation can have negative impacts on the abundance and richness of natural enemies, but not pests in small-holder rice systems, and these impacts are independent from insecticide application and proportion of semi-natural habitat in the landscape. We recommend the implementation of agri-environmental measures or re-establishing field margin vegetation during the consolidation process to mitigate these potential negative effects, although trade-off between enhancing crop yields and preserving rice arthropod biodiversity should be considered. We encourage future research to focus on the detailed assessment of the function of linear habitats for a better understanding of the impact of land consolidation.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nTraditional small-holder agricultural landscapes in southern China are being consolidated to increase mechanisation levels in agriculture, but it is unclear how this influences rice arthropod communities in these landscapes.\n\nHere, based on a six-year study in 20 rice fields, we evaluated the impact of land consolidation on arthropod communities, crop damage, and rice yield. We also analysed how effects of land consolidation were moderated by the proportion of large semi-natural habitat patches and insecticide use.\n\nWe found that, compared to consolidated fields, rice fields in traditional farmlands had a higher abundance and family richness of natural enemies, but a similar abundance of rice pests. Land consolidation did not significantly interact with the proportion of large semi-natural habitat patches or insecticide application, in terms of affecting arthropods. The proportion of semi-natural habitat reduced the negative effect of insecticide application on key rice pests, but no equivalent interaction occurred for natural enemies.\n\n<i>Synthesis and applications</i>: Land consolidation can have negative impacts on the abundance and richness of natural enemies, but not pests in small-holder rice systems, and these impacts are independent from insecticide application and proportion of semi-natural habitat in the landscape. We recommend the implementation of agri-environmental measures or re-establishing field margin vegetation during the consolidation process to mitigate these potential negative effects, although trade-off between enhancing crop yields and preserving rice arthropod biodiversity should be considered. We encourage future research to focus on the detailed assessment of the function of linear habitats for a better understanding of the impact of land consolidation.\n</p>\n<h2>摘要</h2>\n<p>\n\n为了提升农业生产机械化水平，中国南方的传统小规模农田景观正经历规模化农田整治。但是，农田景观变化过程中稻田节肢动物群落受到怎样影响仍不明确。\n\n我们在20个梯度景观的水稻样地中进行了为期6年的系统研究，评估了标准化农田整治对节肢动物群落、作物受害率以及水稻产量的影响，并分析了大斑块半自然生境比例变化和农田施用杀虫剂对土地整治影响节肢动物的调节功能。\n\n研究结果表明，相较于标准化农田整治地块，传统地块的稻田拥有更高的天敌个体丰度和科级水平丰富度，但是在两种田块的水稻害虫丰度与丰富度均相当。规模化土地整治对节肢动物的影响，并未与大型半自然生境斑块比例变化和稻田施用杀虫剂影响形成交互作用。\n\n半自然生境的比例降低了农田农药施用对重要水稻害虫的负面影响，但对天敌并没有显著的交互作用。\n\n总结与应用:在小规模农田生态系统中，规模化土地整治对天敌的丰度和丰富度有显著负面影响，但对害虫的影响则不显著，且这些影响与稻田杀虫剂的使用和景观中半自然生境的比例无关。我们建议在规模化土地整治过程中实施农业环境调节措施或恢复田埂植被以缓解规模化土地整治对天敌的负面影响，并系统地考虑提高作物产量和保护稻田节肢动物多样性之间的权衡。为更好地理解规模化农田整治对生物多样性的影响，未来的研究应鼓励进一步系统评估线性生境的生态功能。\n</p>","author":"Shanxing Gong, \nYulin Zhu, \nDaomeng Fu, \nFelix J. J. A. Bianchi, \nWopke van der Werf, \nJenny A. Hodgson, \nHaijun Xiao, \nYi Zou","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"f953c901446078f4d88ad56f16c2a61cfe5bc42c86e4d74aaa7693972e7cd8d9","category":"Environment"}