{"title":"PSI-12 Dietary isoacids modulate nutrient digestibility and fermentation products in ileal digesta and feces of growing pigs fed corn-soybean meal diets","link":"https://academic.oup.com/jas/article/102/Supplement_2/279/7664939?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Branched-chain fatty acids, or isoacids, are the product of branched-chain amino acid fermentation and have been associated with benefits on the productivity of ruminants, primarily by positively modulating gut microbes and promoting gastrointestinal health. The objective of this study was to determine the optimal inclusion level of isoacid blend product based on apparent ileal digestibility (AID), apparent total tract digestibility (ATTD) of nutrients, and fermentation products in growing pigs fed corn-soybean meal diets. Twelve cannulated pigs [body weight (BW) = 20.9 + 0.6 kg] were used in a 5-period switch-back design with 6 diets and 2 replicate pigs in each period (n = 10 observations per dietary treatment). Experimental diets consisted of increasing levels (0%, 0.5%, 0.75%, 1%, 1.25%, and 1.5%) of an isoacid blend (isobutyrate, isovalerate, and 2-methyl butyrate, 1:1:1) added to a corn-soybean meal basal diet containing titanium dioxide as an indigestible marker. Each experimental period lasted 14 d: 10 d for acclimatization to the diets, 2 d for fecal collection, and 2 d for digesta collection. Diets, fecal, and ileal digesta samples were analyzed for gross energy (GE), crude protein (CP), fiber composition, amino acids (AA), and titanium. The concentration of short-chain fatty acids and ammonia were analyzed in digesta and fecal samples. Orthogonal polynomial contrasts were used to determine the linear and quadratic effects of increasing levels of isoacids. Dietary supplementation of isoacids improved (<span>P</span> &lt; 0.1, linear and/or quadratic) AID of crude fiber and hemicellulose and most of the indispensable AA (except Met+Cys, Trp, and Val) as well as ATTD of CP, GE, neutral detergent fiber, and hemicellulose. In addition, ATTD of Arg, His, Ile, Leu, Met+Cys, Phe, Thr, Trp, and Val increased quadratically (<span>P</span> &lt; 0.1). Collectively, 1% isoacid inclusion promoted the greatest responses in most measured variables (% increase: unsupplemented vs. 1%): AID of Lys (9.3%), Met (5.7%), Thr (17.8%), Leu (7.4%), Ile (9.2%), Phe (7.8%), His (5.9%), Arg (4.9%); ATTD of CP (2.1%), GE (1.3%), NDF (3.9%), hemicellulose (&gt;50%), overall indispensable AA (9.5%), overall dispensable AA (8.6%). On the other hand, the inclusion of isoacids quadratically increased <span>(P</span> = 0.071) the concentration of ammonia and decreased (<span>P</span> &lt; 0.1) the concentration of acetic acid, iso-valeric acid, and total VFA in ileal digesta samples. In fecal samples, the proportion of acetic acid decreased (<span>P</span> &lt; 0.05) quadratically while the proportion of propionic, valeric, and caproic acids increased (<span>P</span> &lt; 0.1). In conclusion, dietary supplementation of isoacids at 1% can improve dietary nutrient digestibility, particularly ileal AA digestibility. Based on the changes in fermentation products, the modulation of intestinal microbiota through the gastrointestinal tract could be potentially related to the effects of isoacids on nutrient digestibility. However, the effects of isoacids supplementation on intestinal microbiota must be determined.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f954bea6df9b8772312c6bd2d90bc8edfc31acae33d137fa8778348fdba56eaf","category":"Environment"}