{"title":"Activision เผยแบนผู้เล่น Call of Duty ที่โกงเกมไปมากกว่า 6,000 บัญชีช่วงกลางเดือน ก.พ. ที่ผ่านมา","link":"https://www.blognone.com/node/138367","date":1708692082000,"content":"<div><div><div><p>Activision เปิดเผยตัวเลขการแบน Call of Duty รอบใหม่จากการตามรายงานการโกงของชมชุนในเกมภาค Modern Warfare 3 และ Warzone โดยแบนบัญชีผู้เล่นไปมากกว่า 6,000 บัญชีที่โกงและแฮ็กตัวในช่วงวันที่ 16 ถึง 20 กุมภาพันธ์ที่ผ่านมา</p>\n<p>Activision ได้ปิดการใช้งานโค้ดในเกมที่บางตัวที่ให้ผู้เล่นได้ Perks พิเศษในเวลาจำกัด (เช่น Perks ที่ทำให้เคลื่อนที่เร็วกว่าผู้เล่นอื่น) และอัปเดตความปลอดภัยของตัวเกมอย่างต่อเนื่อง ทีมงานได้ปิดระบบ Telemetry (ใช้ในการวัดค่า และส่งข้อมูลทางไกลเพื่อติดตามข้อมูลแบบเรียลไทม์) ไปเพื่ออัปเกรดระบบในช่วงสัปดาห์ที่ผ่านมา ผู้พัฒนาโปรแกมโกง RICOCHET จึงออกมาอ้างว่าการปิดระบบ Telemetry ไปทำให้ระบบต้านโปรแกรมโกงของเกมไม่ทำงาน</p>\n<p>แต่ความจริงไม่ใช่แบบนั้น เพราะทีมงานติดตามกิจกรรมผู้เล่นตลอดสุดสัปดาห์ที่ผ่านมา และเปิดใช้งานระบบ Telemetry ที่ได้รับการอัพเกรดแล้ว ทำให้สามารถระบุและแบนผู้เล่นที่โกง และแฮ็คเกมได้มากกว่า 6,000 บัญชี</p>\n<p>Call of Duty Modern Warfare 3 และ Warzone Season 2 เพิ่งปล่อยอัปเดตใหม่ให้เล่นเมื่อต้นเดือนกุมภาพันธ์ที่ผ่านมา เพิ่ม 3 ด่านสำหรับโหมดผู้เล่นหลายคนแบบ 6v6, แผนที่ใหม่ของ Warzone, ภารกิจใหม่ของโหมดซอมบี้ และการครอสโอเวอร์กับแฟรนไชส์ Walking Dead</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/a20ff8c4eb1b9814c3ea30fa78640081.jpeg\" /></p>\n<p>ที่มา - <a href=\"https://www.callofduty.com/patchnotes/2024/02/call-of-duty-mwiii-warzone-season-2-patch-notes\">Call of Duty Patch Note</a> via <a href=\"https://www.videogameschronicle.com/news/activision-says-it-has-banned-6000-call-of-duty-accounts-following-a-spike-in-cheating-reports/\">VGC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/call-of-duty\">Call of Duty</a></div><div><a href=\"/topics/activision-blizzard\">Activision Blizzard</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"f95970d38c3ddfd69c9fa7c8d11eb84627ef87a7b9493b95a9c1b8e7550fe0b4","category":"Thai"}