{"title":"Transcriptomic analysis of the antibacterial mechanism of ε‐polylysine‐functionalized magnetic composites against Alicyclobacillus acidoterrestris and its application in apple juice","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13700?af=R","date":1720528019000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p><i>Alicyclobacillus acidoterrestris</i> is a common microorganism in fruit juice. It can produce off-odor metabolites and has been considered to be an important factor in juice contamination. Thus, the development of new strategy for the control of <i>A. acidoterrestris</i> has important practical significance. The primary objective of this work was to assess the antibacterial performance of ε-polylysine-functionalized magnetic composites (Fe<sub>3</sub>O<sub>4</sub>@MoS<sub>2</sub>@PAA-EPL) in apple juice and its effect on juice quality. Moreover, the molecular mechanism of Fe<sub>3</sub>O<sub>4</sub>@MoS<sub>2</sub>@PAA-EPL against <i>A. acidoterrestris</i> was explored by RNA sequencing (RNA-Seq).</p>\n<h2>RESULTS</h2>\n<p>Experimental results indicated that the synthesized composites possessed the ability to inhibit the viability of <i>A. acidoterrestris</i> vegetative cells and spores. Besides, investigation on the quality of apple juice incubated with Fe<sub>3</sub>O<sub>4</sub>@MoS<sub>2</sub>@PAA-EPL implied that the fabricated composites displayed negligible adverse effects on juice quality. In addition, the results of RNA-Seq demonstrated that 833 differentially expressed genes (DEGs) were identified in Fe<sub>3</sub>O<sub>4</sub>@MoS<sub>2</sub>@PAA-EPL-treated <i>A. acidoterrestris</i>, which were associated with translation, energy metabolism, amino acid metabolism, membrane transport and cell integrity.</p>\n<h2>CONCLUSION</h2>\n<p>These results suggested that the treatment of Fe<sub>3</sub>O<sub>4</sub>@MoS<sub>2</sub>@PAA-EPL disrupted energy metabolism, repressed cell wall synthesis and caused membrane transport disorder of bacterial cells. This work provides novel insights into the molecular antibacterial mechanism for ε-polylysine-functionalized magnetic composites against <i>A. acidoterrestris</i>. © 2024 Society of Chemical Industry.</p>","author":"Hang Jia, \nRui Cai, \nTianli Yue, \nYanli Xie","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"f95b6640565421789182806916a202fb75315deaba3ee3318af61d5a4b9896b0","category":"Environment"}