{"title":"Comparative pathogenicity and histopathological analysis of Edwardsiella anguillarum intraperitoneal infection in milkfish (Chanos chanos), Nile tilapia (Oreochromis niloticus) and Asian seabass (Lates calcarifer)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13982?af=R","date":1723123610000,"content":"<h2>Abstract</h2>\n<p><i>Edwardsiella anguillarum</i>, a highly virulent species within the <i>Edwardsiella</i> genus, causes significant mortality in milkfish farms in Taiwan. This study aimed to investigate the comparison of milkfish susceptibility, a newly identified host species in Taiwanese aquaculture, with other species Nile tilapia (<i>Oreochromis niloticus</i>) and Asian seabass (<i>Lates calcarifer</i>), to <i>E. anguillarum</i>, elucidating its pathogenicity across both seawater and freshwater aquaculture environments. The results showed milkfish exhibited the highest mortality rate of 85% within 48 h of infection, whereas Nile tilapia exhibited a mortality rate of 70% between the second- and tenth-day post challenge, and seabass exhibited a mortality rate of 25% between the second- and sixth-day post challenge. Gross lesions observed in milkfish included splenomegaly and haemorrhage, whereas Nile tilapia exhibited signs of ascites, exophthalmia and brain haemorrhage. Seabass displayed spleen granulomas and haemorrhage at the injection site. Histopathological analysis revealed common features across all three species, including multifocal necrosis, bacterial presence in the necrotic areas, serositis and oedema. Asian seabass also exhibited chronic lesions in the form of splenic granulomas. This study highlights the high susceptibility of milkfish and Nile tilapia to <i>E. anguillarum</i>, emphasizing the urgent need for further investigation into targeted vaccine development for these fish species. These results not only deepen our understanding of the differing levels of pathogenicity among the three species but also offer valuable insights for improving disease prevention and management strategies in aquaculture, including those applied within polyculture systems and for the maintenance of aquaculture water environments.</p>","author":"Atiek Rahmawaty, \nLi‐Wu Cheng, \nPei‐Chi Wang, \nShih‐Chu Chen","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"f95cb39a96a1549aac67820a58540c0c86bbf6ef28bb77ab805a6a8ecb6f3b51","category":"Environment"}