{"title":"Apple's Relocated Tysons Corner Store to Open on May 19","link":"https://www.macrumors.com/2023/05/11/apple-tysons-corner-may-19/","date":1683815625000,"content":"Apple has been in <a href=\"https://www.macrumors.com/2023/05/01/apple-tysons-corner-relocating/\">the process of relocating</a> its first-ever <a href=\"https://www.macrumors.com/guide/apple-store/\">Apple Store</a> in Fairfax, Virginia, and the <a href=\"https://www.apple.com/retail/tysonscorner/\">redesigned Tysons Corner store</a> is set to open on Friday, May 19. May 19 will mark the 22nd anniversary of the date that the store originally opened on May 19, 2001. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/apple-tysons-corner-logo.jpg\" alt width=\"1716\" height=\"965\" />\r<br />\nThe store is in Tysons, Virginia, a Washington, D.C. suburb, and it is inside a shopping mall. Apple is moving to a different location within the mall, and the company says the new store will feature inclusive, innovative, and sustainable design enhancements that \"reflect Apple's values.\"<blockquote>Since opening our first-ever Apple Store here 22 years ago, we’re proud to be opening this newly reimagined space. It’s a celebration of how far we’ve come. And we couldn’t have done it without the community</blockquote>Back in 2001, Steve Jobs did a tour of Tysons Corner, showing off the store design. While Tysons Corner was the first ‌Apple Store‌ to open because it is on the East Coast, Apple Glendale Galleria followed just a few hours later. \r<br />\n\r<br />\n<div></div>\r<br />\nThe store is set to open at 10:00 a.m. Eastern Time. Apple often celebrates new store openings with t-shirt giveaways and postcards for the first people to visit. \r<br />\n\r<br />\n<br />This article, \"<a href=\"https://www.macrumors.com/2023/05/11/apple-tysons-corner-may-19/\">Apple's Relocated Tysons Corner Store to Open on May 19</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-relocated-tysons-corner-store-to-open-on-may-19.2389267/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f95fef8d40be5f587175b37880dbebc639389326cf454139061e4e6759695df8","category":"Apple"}