{"title":"A network-based transcriptomic landscape of HepG2 cells uncovering causal gene-cytotoxicity interactions underlying drug-induced liver injury","link":"https://academic.oup.com/toxsci/article/198/1/14/7453382?rss=1","date":1701129600000,"content":"<span><div>Abstract</div>Drug-induced liver injury (DILI) remains the main reason for drug development attritions largely due to poor mechanistic understanding. Toxicogenomic to interrogate the mechanism of DILI has been broadly performed. Gene coregulation network-based transcriptome analysis is a bioinformatics approach that potentially contributes to improve mechanistic interpretation of toxicogenomic data. Here we performed an extensive concentration time course response-toxicogenomic study in the HepG2 cell line exposed to 20 DILI compounds, 7 reference compounds for stress response pathways, and 10 agonists for cytokines and growth factor receptors. We performed whole transcriptome targeted RNA sequencing to more than 500 conditions and applied weighted gene coregulated network analysis to the transcriptomics data followed by the identification of gene coregulated networks (modules) that were strongly modulated upon the exposure of DILI compounds. Preservation analysis on the module responses of HepG2 and PHH demonstrated highly preserved adaptive stress response gene coregulated networks. We correlated gene coregulated networks with cell death onset and causal relationships of 67 critical target genes of these modules with the onset of cell death was evaluated using RNA interference screening. We identified <span>GTPBP2</span>, <span>HSPA1B</span>, <span>IRF1</span>, <span>SIRT1</span>, and <span>TSC22D3</span> as essential modulators of DILI compound-induced cell death. These genes were also induced by DILI compounds in PHH. Altogether, we demonstrate the application of large transcriptome datasets combined with network-based analysis and biological validation to uncover the candidate determinants of DILI.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"f9600363d107cf4a32a094c3b47527a41dbb845663624c4a6ee442f82cb89b04","category":"Environment"}