{"title":"Using de novo transcriptomes to decipher the relationships in cutthroat trout subspecies (Oncorhynchus clarkii)","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13735?af=R","date":1720681200000,"content":"<h2>Abstract</h2>\n<p>For almost 200 years, the taxonomy of cutthroat trout (<i>Oncorhynchus clarkii</i>), a salmonid native to Western North America, has been in flux as ichthyologists and fisheries biologists have tried to describe the diversity within these fishes. Starting in the 1950s, Robert Behnke reexamined the cutthroat trout and identified 14 subspecies based on morphological traits, Pleistocene events, and modern geographic ranges. His designations became instrumental in recognizing and preserving the remaining diversity of cutthroat trout. Over time, molecular techniques (i.e. karyotypes, allozymes, mitochondrial DNA, SNPs, and microsatellite arrays) have largely reinforced Behnke's phylogenies, but have also revealed that some relationships are consistently weakly supported. To further resolve these relationships, we generated de novo transcriptomes for nine cutthroat subspecies, as well as a Bear River Bonneville form and two Colorado River lineages (blue and green). We present phylogenies of these subspecies generated from multiple sets of orthologous genes extracted from our transcriptomes. We confirm many of the relationships identified in previous morphological and molecular studies, as well as discuss the importance of significant differences apparent in our phylogenies from these studies within a geological perspective. Specific findings include three distinct clades: (1) Bear River Bonneville form and Yellowstone cutthroat trout; (2) Bonneville cutthroat trout (<i>n</i> = 2); and (3) Greenback and Rio Grande cutthroat trout. We also identify potential gene transfer between Bonneville cutthroat trout and a population of Colorado River green lineage cutthroat trout. Using these findings, it appears that additional groups warrant species-level consideration if other recent species elevations are retained.</p>","author":"Andrea L. Kokkonen, \nPeter C. Searle, \nDennis K. Shiozawa, \nR. Paul Evans","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"f9621a7c3032815ca48b4ffaffc6c4e2504f83aa83695c5bd6d7934045c61d0b","category":"Environment"}