{"title":"NASA loses, and then recovers, contact with its historic Mars helicopter","link":"https://arstechnica.com/?p=1997771","date":1705934087000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/05/FSHZlQxVsAA1X_t-800x596.jpg\" alt=\"NASA's Mars &lt;em&gt;Ingenuity&lt;/em&gt; helicopter has been flying across the red planet for nearly three years.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/05/FSHZlQxVsAA1X_t.jpg\">Enlarge</a> <span>/</span> NASA's Mars <em>Ingenuity</em> helicopter has been flying across the red planet for nearly three years. (credit: NASA)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The US space agency prompted widespread dismay in the spaceflight community on Friday evening when it announced that communication had been lost with the Mars <em>Ingenuity</em> helicopter during its most recent flight on Thursday, January 18.</p>\n<p>\"During its planned descent, communications between the helicopter and rover terminated early, prior to touchdown,\" <a href=\"https://mars.nasa.gov/technology/helicopter/status/508/flight-72-status-update/\">according to a statement</a> from NASA's Jet Propulsion Laboratory. \"The <em>Ingenuity</em> team is analyzing available data and considering next steps to reestablish communications with the helicopter.\"</p>\n<p>This seemed like a bad sign for the plucky little helicopter, which has vastly outperformed its planned lifetime of a handful of test flights since it landed on Mars in February 2021 and began flying two months later. Rather, the communications loss occurred on the 72nd flight of the 4-pound flying machine—the first on another planet.</p></div><p><a href=\"https://arstechnica.com/?p=1997771#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1997771&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"f9648357848656ded38e654ee489c63d560ec2587cb41e413d1076fd6331c797","category":"Tech"}