{"title":"Precision Defect Engineering in 2D Materials via Automated STEM Atomic Fabrication","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.163/7719489?rss=1","date":1721779200000,"content":"<span>Future generations of science and technology call for ever improving levels of precision in how materials are fabricated, pushing the development of manufacturing techniques. A promising tool to achieve the ultimate level of matter manipulation is the sub-Å sized electron (e<sup>-</sup>) beam of a scanning transmission electron microscope (STEM). Previous works have used such techniques to fabricate unique nanostructures with monolayers of 2D materials such as transition metal dichalcogenides (e.g. MoS<sub>2</sub>) [<a href=\"#ozae044.163-B1\">1-4</a>]. These types of 1D-2D edge and internal nanostructures are desired for their ability to locally alter the functional properties (e.g. electronics, magnetic, optical, and catalytic) [<a href=\"#ozae044.163-B5\">5-7</a>]. While previous work has shown that control over the e<sup>-</sup> beam scanning pathways has an impact on the formation of defect structures [<a href=\"#ozae044.163-B7\">7-8</a>], more precise controls systems are needed for feasible fabrication. In this study, the formation of the metallic Mo<sub>6</sub>S<sub>6</sub> nanowire-type (MoS-NW) nanopore edge structures, that have been shown to locally alter functional properties within the semiconducting monolayer, are investigated. While the formation of these structures has been achieved stochastically with simple beam placement or heating, more localized control over the formation of these structures can lead to reliable direct writing of metallic structures within monolayer MoS<sub>2</sub>.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"f96944b8b5eacd2f5a57bb9dc22ee7be753605cbadb1b9af27cac4fe04bb4408","category":"Environment"}