{"title":"AWS Cloud Adoption Framework (CAF) 3.0 is Now Available","link":"https://aws.amazon.com/blogs/aws/aws-cloud-adoption-framework-caf-3-0-is-now-available/","date":1637683501000,"content":"<p>The <a href=\"https://aws.amazon.com/professional-services/CAF/\">AWS Cloud Adoption Framework</a> (AWS CAF) is designed to help you to build and then execute a comprehensive plan for your digital transformation. Taking advantage of AWS best practices and lessons learned from thousands of customer engagements, the AWS CAF will help you to identify and prioritize transformation opportunities, evaluate and improve your cloud readiness, and iteratively evolve the roadmaps that you follow to guide your transformation.</p> \n<p><span><strong>Version 3.0 Now Available</strong></span><br /> I am happy to announce the version 3.0 of the AWS CAF is now available. This version represents what we have learned since we released version 2.0, with a focus on digital transformation and an emphasis on the use of data &amp; analytics.</p> \n<p>The framework starts by identifying six groups of foundational perspectives (Business, People, Governance, Platform, Security, and Operations), totaling 47 discrete capabilities, up from 31 in the previous version.</p> \n<p>From there it identifiers four transformation domains (Technology, Process, Organization, and Product) that must participate in a successful digital transformation.</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/11/04/caf_v3_3.png\" /></p> \n<p>With the capabilities and the transformation domains as a base, the AWS Cloud Adoption Framework then recommends a set of four iterative and incremental cloud transformation phases:</p> \n<p><strong>Envision</strong> – Demonstrate how the cloud will accelerate business outcomes. This phase is delivered as a facilitator-led interactive workshop that will help you to identify transformation opportunities and create a foundation for your digital transformation.</p> \n<p><strong>Align</strong> – Identify capability gaps across the foundational capabilities. This phase also takes the form of a facilitator-led workshop and results in an action plan.</p> \n<p><strong>Launch</strong> – Build and deliver pilot initiatives in production, while demonstrating incremental business value.</p> \n<p><strong>Scale</strong> – Expand pilot initiatives to the desired scale while realizing the anticipated &amp; desired business benefits.</p> \n<p>All in all, the AWS Cloud Adoption Framework is underpinned by hundreds of <a href=\"https://aws.amazon.com/professional-services/\">AWS offerings and programs</a> that help you achieve specific business and technical outcomes.</p> \n<p><span><strong>Getting Started with the AWS Cloud Adoption Framework</strong></span><br /> You can use the following resources to learn more and to get started:</p> \n<p><strong>Web Page – </strong>Visit the <a href=\"https://aws.amazon.com/professional-services/CAF/\">AWS Cloud Adoption Framework</a> web page.<strong><br /> </strong></p> \n<p><strong>White Paper</strong> – Download and read the <a href=\"https://docs.aws.amazon.com/whitepapers/latest/overview-aws-cloud-adoption-framework/welcome.html\">AWS CAF Overview</a>.</p> \n<p><strong>AWS Account Team</strong> – Your AWS account team stands ready to assist you with any and all of the phases of the AWS Cloud Adoption Framework.</p> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"f971618614c108a58782a6b4a10918c9c78fccf5127c6ac44396a826c562d595","category":"Tech"}