{"title":"Colorado Supreme Court Rules Trump Ineligible for President Under 14th Amendment","link":"https://managingeditor.substack.com/p/the-mile-high-snub","date":1703122616000,"content":"\n<p>Dave Pell, writing at NextDraft:</p>\n\n<blockquote>\n  <p>Donald Trump has been kicked out of the mile high club. In a 4-3 \ndecision, <a href=\"https://apnews.com/article/trump-insurrection-14th-amendment-2024-colorado-d16dd8f354eeaf450558378c65fd79a2\">the Colorado Supreme Court has ruled that Trump is \nineligible to be on the ballot</a> in the state under Section \n3 of the 14th Amendment. “The decision from a court whose \njustices were all appointed by Democratic governors marks the \nfirst time in history that Section 3 of the 14th Amendment has \nbeen used to disqualify a presidential candidate.” For now, the \ndecision is stayed, giving the Supreme Court time to weigh in on \nthe matter. [...] </p>\n\n<p>Why 14th Amendment bars Trump from office: <a href=\"https://theconversation.com/why-14th-amendment-bars-trump-from-office-a-constitutional-law-scholar-explains-principle-behind-colorado-supreme-court-ruling-219763\">A constitutional law \nscholar explains principle behind Colorado Supreme Court \nruling</a>. In Slate, Lawrence Lessig explains why the 14 \nAmendment actually doesn’t do that at all: “<a href=\"https://slate.com/news-and-politics/2023/12/supreme-court-trump-ballot-removal-colorado-wrong.html\">The Supreme Court \nMust Unanimously Strike Down Trump’s Ballot Removal</a>”. Once \nyou’re done reading the analysis, you might want to shift your \nfocus to the 21st Amendment, because you’re gonna need a drink. </p>\n</blockquote>\n\n<p>I dislike the AP’s emphasis on the fact that the justices on Colorado’s supreme court court were all nominated by Democratic governors — it emphasizes partisanship in the branch of government that ought to be least partisan. (After serving an initial term, Colorado supreme court justice must stand for statewide election; the four of them who have served that long <a href=\"https://ballotpedia.org/Colorado_Supreme_Court\">have been retained by voters overwhelmingly</a>.) The AP does not use such language when describing the decisions of the United States Supreme Court, of which 6 of 9 justices were nominated by Republican presidents — and who   never stand for retention by voters. (This, despite the fact that voters have, in the aggregate popular vote, <a href=\"https://en.wikipedia.org/wiki/List_of_United_States_presidential_elections_by_popular_vote_margin\">overwhelmingly favored Democratic candidates for president over the last 30 years</a>. The only Republican candidates to win the popular vote after Reagan were George H.W. Bush in 1988 (7.7% margin) and George W. Bush in 2004 (2.5%).)</p>\n\n<p>The argument that the 14th Amendment bars Trump from running again for federal office — and that it’s self-executing — <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4532751\">was first put forth in a paper</a> by two law professors, William Baude and Michael Stokes Paulsen, who are members of the <em>very</em> conservative Federalist Society. It’s not some crackpot left-wing plot.</p>\n\n<p>To Pell’s list of reading material, I’ll add George Conway, <a href=\"https://www.theatlantic.com/ideas/archive/2023/12/dont-read-the-colorado-ruling-read-the-dissents/676920/\">also writing at The Atlantic</a>:</p>\n\n<blockquote>\n  <p>But last night changed my mind. Not because of anything the \nColorado Supreme Court majority said. The three <em>dissents</em> were \nwhat convinced me the majority was right. </p>\n\n<p>The dissents were gobsmacking — for their weakness. They did not \nwant for legal craftsmanship, but they did lack any semblance of a \nconvincing argument. </p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/12/20/pell-colorado-trump\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"f972fe94e53ff16bc2f214432f1129554fca3d8fae5a7472214fd267c1a99818","category":"Tech"}