{"title":"Opera One Browser Launches With Native AI, Modular Design, Tab Islands, and More","link":"https://www.macrumors.com/2023/06/20/opera-one-browser-ai-launches/","date":1687253381000,"content":"<a href=\"https://www.opera.com/one\">Opera One</a>, the new version of Opera browser, got its official public release today, boasting native artificial intelligence integration as the standout feature among its rivals.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/opera-one-browser3.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nOpera One introduces Aria, \"the first truly native browser AI,\" according to the developers. Aria can be invoked via a command line, as well as from the browser sidebar, and leverages OpenAI's GPT technology to optimize web search. From the press release: \r<br />\n<blockquote>Aria is both a web and browser expert that allows users to collaborate with AI while looking for information on the web, generating text or code, or getting their product queries answered. When it comes to customer support, Aria is knowledgeable about Opera's entire database of support documentation and uses the company's current product knowledge to answer users' questions. </blockquote>Opera One users on Mac can use a Command-/ keyboard shortcut to display an overlay and interact with Aria. Whenever a question comes to mind, they can use the command line to ask Aria a question and either interact with the browser AI's response immediately in the sidebar or go back to browsing. Opera One also includes access to ChatGPT in the browser sidebar.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/opera-one-browser2.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nElsewhere, in what would be the 100th version of Opera, a new Tab Islands feature aims to change how users relate to browser tabs. Tab Islands keep associated tabs together based on context, and users can move tabs around, collapse islands to make them small and come back to them later, or save them into bookmarks or pinboards.\r<br />\n\r<br />\nIn addition, Opera One also features a new modular design that the developers say is \"ready for a generative AI-based future,\" allowing the browser to dynamically adapt to users' needs by bringing only the key features to the foreground. There's also a new multithreaded compositor under the hood that aims to deliver a faster and smoother user interface layer.\r<br />\n\r<br />\nOpera One is available today for free from the <a href=\"https://www.opera.com/one\">company's website</a>, which includes download links for macOS, Windows, and Linux versions.<div>Tag: <a href=\"https://www.macrumors.com/guide/opera-browser/\">Opera Browser</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/20/opera-one-browser-ai-launches/\">Opera One Browser Launches With Native AI, Modular Design, Tab Islands, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/opera-one-browser-launches-with-native-ai-modular-design-tab-islands-and-more.2393596/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f974cdc103d3079360a8ad9e2c2409cf8770666aa1739841617af5db9fa4cd35","category":"Apple"}