{"title":"Design and Development of a Self-Sufficient Riding Reaper Machine","link":"https://www.preprints.org/manuscript/202409.1412/v1","date":1726653856000,"content":"Harvesting is the collection of mature crops from the field. A harvesting procedure involves cutting, installation, collecting, transferring, and then stacking the cut produce. Mechanization of harvesting operations is critical to lowering harvesting costs, crop production costs, crop loss, turnaround time, weather risk, and increasing benefit through proper technology. To achieve the desired purpose, a manually operated reaper machine is created and developed to assist farmers by lowering the cost of crop cutting and collection in the field while achieving the best efficiency possible within the limits.\nResearch technique is a set of acts or procedures that must be completed in order to do research properly, as well as the intended sequence of these steps. Identify the problem statement. Studying the current design of the reaper machine Review the literature. Product development general design process steps for reaper harvester’s machine include planning, concept development, system-level design, detail design, testing and refining, and product ramp-up. In this step, the material properties are defined based on design. To simulate the reaper machine using Catia software, Prototyping, testing for validation, Interpret and report.\nMaterial is chosen based on the strength requirements of the different parts of the Reaper machine. The machine is built with locally accessible materials. This self-propelled reaper moves at a forward speed of 2.54 m/s. The cutting bar measures 120 cm in length and the bundling mechanism is dropped. The field capacity is 0.306 ha/hour, respectively. The needed manpower for harvesting one hectare of wheat and rice reaper harvesting field operation is two man-hours per ha. The amount of fuel required to completely fill the tank after harvesting the plot was measured to determine the amount of fuel consumed for reaping the test plot, which was 1.17 l/h.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f9776d924b2eb94aab26a1d7c7149a7d165392db92de11670f7675cfc7e183f5","category":"Interdisciplinary"}