{"title":"Dillen From Baphomet Bicycles’ “Left Hand Path” Singlespeed 29er – john watson","link":"https://theradavist.com/2021/08/dillen-from-baphomet-bicycles-left-hand-path-singlespeed-29er/?utm_source=rss&utm_medium=rss&utm_campaign=dillen-from-baphomet-bicycles-left-hand-path-singlespeed-29er","date":1630324841000,"content":"<p><em>We took a look at <a href=\"https://www.baphometbicycles.com/\" target=\"_blank\">Baphomet Bicycles</a> earlier this year and in that post, we discussed the ideology surrounding the iconography of this unique framebuilding operation, nestled in the mountain town of Taos, New Mexico. If you haven’t read that piece, <a href=\"http://theradavist.com/2021/03/balance-and-perfect-social-order-inside-taos-based-baphomet-bicycles/\" target=\"_blank\">you really should check it out first</a>.</em></p>\n<p>Yesterday I caught up with Dillen from Baphomet Bicycles, as he came to town to ride the <a href=\"http://nm-es.weebly.com/santa-fe-big-friggin-loop.html\" target=\"_blank\">BFL</a>, an event Sincere Cycles throws each year, offering a classic 55 mile loop with over 10,000′ elevation gain and a “B” loop with 38 miles and 6,400′ elevation. Both take you deep into the Sangre de Cristo mountains at the terminus of the mighty Rocky Mountains. Doing either singlespeed is quite the undertaking!</p>\n<p>Dillen finished this build right before the event and drove in from Taos for the day. We pedaled together briefly and then his chain exploded about 10 miles into the ride, sending him back down to town. Later in the day, we caught up to shoot his new 29er hardtail, aptly named the “Left Hand Path”, so let’s check it out in detail below!<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/Dillen-From-Baphomet-Bicycles-Singlespeed-29er-2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I love rowdy hardtails. Absolutely love them. I also really enjoy seeing framebuilders experiment, which is what this bike is. From the angles, the details, parts kit, and yes, the finish, this bike is not your ordinary hardtail. For starters, it has a 70mm bottom bracket drop, a 63º head angle, a 77º seat angle, 165mm cranks, and a 140mm fork. <a href=\"http://www.darkmatterfinishing.com/\" target=\"_blank\">Dark Matter Finishing</a> nailed the splatter paint job and the keystone of the build has got to be the <a href=\"https://www.doombars.com/\" target=\"_blank\">DOOOOOOOOM Bars</a>, which are 800mm wide and have a 66.6mm rise.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/Dillen-From-Baphomet-Bicycles-Singlespeed-29er-56.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/08/Dillen-From-Baphomet-Bicycles-Singlespeed-29er-57.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Dillen, who is a wheel builder by trade, decided to give Industry Nine’s Backcountry wheels a go with this build and the purple anodizing really compliments the green and magenta theme it’s got going on.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/Dillen-From-Baphomet-Bicycles-Singlespeed-29er-17.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/08/Dillen-From-Baphomet-Bicycles-Singlespeed-29er-15.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>That cool <a href=\"https://shop.mashsf.com/tags/top-caps/\" target=\"_blank\">MASH Donut stem cap</a> has been on every single mountain bike Dillen has owned. It was on his Megatower, which he sold to pay some bills because he felt like it didn’t have enough soul to merit keeping it in his stable and now it lives on the Left Hand. I asked Dillen about this very thing, if a bike has character or a soul, and he chimed in with this quote:</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/Dillen-From-Baphomet-Bicycles-Singlespeed-29er-52.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<blockquote><p><em>“This bike was quite a few experiments for me. It will eventually have gears but with the shortages in the industry figured might as well get back to the single-speed roots with some spare parts lying around. This bike is replacing a Santa Cruz Megatower which I loved but didn’t have enough personality. This bike is definitely not as fast but makes me smile way more. I measure the success of a bike by how much it makes me giggle.”</em></p></blockquote>\n<p>I think that’s a beautiful outlook from a framebuilder.</p>\n<p>As Dillen mentions here, the bike industry is in the midst of major parts shortages. He plans to put a GX Eagle kit on it eventually but right now, he’s familiarizing himself with the bike as a singlespeed.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/Dillen-From-Baphomet-Bicycles-Singlespeed-29er-45.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/08/Dillen-From-Baphomet-Bicycles-Singlespeed-29er-49.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>For someone who has shot a lot of bikes over the years, I’m always impressed with what Dillen brings to the table with his builds. Take for example these angle-steel brake and chainstay bridges and the bi-directional bends he added to the seatstays. I’ve never seen a stiffener stay bridge on the drive-side either. When I asked Dillen about this, he mentioned that he probably could have gotten away with just one bridge and could have left the angle steel out but again, this is a design project.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/Dillen-From-Baphomet-Bicycles-Singlespeed-29er-6.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/08/Dillen-From-Baphomet-Bicycles-Singlespeed-29er-7.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Perhaps what is my favorite thing about the bike is the unity formed with New Mexico makers. He’ll be taking this bike on the <a href=\"https://theradavist.com/2021/04/the-dangerbird-returns-to-las-cruces-on-october-23-2021/\" target=\"_blank\">Dangerbird</a> in Las Cruces this year and I’m sure it’ll be flossed out with <a href=\"https://www.buckhornbags.com/\" target=\"_blank\">Buckhorn Bags</a> for that trip. DOOM and Baphomet go hand in hand too.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/08/Dillen-From-Baphomet-Bicycles-Singlespeed-29er-42.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>This was a real joy documenting this unique ride. Dillen loves the geometry and commented on how well it climbs. It’s pretty close to <a href=\"http://theradavist.com/2020/12/from-coil-back-to-air-johns-pumpkin-spice-starling-murmur-29er/\" target=\"_blank\">my Starling Murmur</a>, so I can attest to its ascending and descending prowess. I can’t wait to see more of it in action!</p>\n<p>Thanks to Dillen for being a solid human and for injecting a bit of fun into the content here on the Radavist.</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"f98c1616d97acbfaf4985e2b0c3cc2e3c1259bdd00eaac4b67d196dab8e98c6c","category":"Cycling"}