{"title":"A high‐resolution inter‐annual framework for exploring hydrological drivers of large wood dynamics","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4242?af=R","date":1705987292000,"content":"<h2>Abstract</h2>\n<p>Rivers with alluvial bars store more wood than those without, supplied through channel shifting. However, wood dynamics (arrival or new deposits, departure or entrainment, and stable or immobile pieces) can vary substantially over time in response to critical hydrological drivers that are largely unknown. To evaluate them, we studied the dynamics of large wood pieces and logjams along a 12-km reach of the lower Allier River using six series of aerial images of variable resolution acquired between 2009 and 2020, during which maximum river discharge fluctuated around the dominant flood discharge (Q<sub>1.5</sub>) that is potentially the bankfull discharge along this well-preserved not incised reach. Individual wood departure was best correlated with water levels exceeding dominant flood discharge. The duration of the highest magnitude flood was best correlated with wood depositions, with shorter floods resulting in a higher number of deposits. Finally, most of the wood remained stable when river discharge did not exceed 60% of Q<sub>1.5</sub> over a long period of time. Changes in inter-annual wood budget (reach-scale) depend on the duration over which discharge exceeded 60% of Q<sub>1.5</sub>. Hydrological conditions driving jam build-up and removal were similar to those controlling individual wood piece dynamics. The results suggest that specific hydrological conditions influence the dynamics of large wood and log jams in the Allier River. Understanding the dynamics of large wood and its impact on river morphology is fundamental for successful river management and habitat restoration initiatives.</p>","author":"Borbála Hortobágyi, \nStéphane Petit, \nBaptiste Marteau, \nGabriel Melun, \nHervé Piégay","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"f99033de278a5a57cd9ac7ca065d1c3811a6d5574021af9824ec3b6bf3280408","category":"Environment"}