{"title":"113 Investigation of differences in pregnancy associated glycoproteins due to different fetal parameters (sex and number) using commercial tests in multiparous ewes","link":"https://academic.oup.com/jas/article/102/Supplement_1/104/7618029?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Pregnancy detection is an extremely valuable practice in animal production systems as it allows for identification of pregnant or nonpregnant females and thus contributes to informed management decisions. Unfortunately, blood pregnancy tests simply provide a yes or no answer to pregnancy status. Multiparous ewes (n = 20) at the Arkansas State University Teaching and Research Center were enrolled in a study to evaluate whether lamb number or sex would impact commercial blood pregnancy test results. Weekly blood samples were collected, for a total of 5 blood samples during the breeding season (11/14/22, 11/21/22, 11/28/22, 12/5/22, and 12/12/22) ewes were followed through lambing to determine lamb number and sex. Whole blood samples were centrifuged at 2,000 x g and plasma harvested and stored at -20 C until analysis for pregnancy associated glycoproteins was completed. Plasma samples were analyzed using two commercially available blood pregnancy tests, Rapid Visual Pregnancy Test (RV plate) and OnFarm Pregnancy Test (SNAP). The RV Plate is a 96-well ELISA test that is designed to be interpreted visually by comparison with the positive (PC) and negative (NC) control wells. The RV Plate and SNAP tests were completed, and results interpreted by two technicians blind to pregnancy status using a scoring system (0 = same or less color than NC; 1 = slightly more color than NC; 2 = slightly less color than PC; 3 = same or more color than PC; 0 and 1 = not pregnant, 2 and 3 = pregnant) or by manufacturer’s instructions (SNAP). Lambing revealed a total of 18 female lambs and 13 male lambs born to the 20 ewes, furthermore, there were 6 singleton, 11 twins, and 1 set of triplets. Total score count results from the RV Plate indicate that as gestational age increased the number of 3 scores increased (11/14/22 = zero scores of ‘3’; 12/12/22 = 55 scores of ‘3’), however, overall, there were no statistical differences in pregnancy status across ewes (P = 0.78). All SNAP test results were immediate and positive for pregnancy for all collections apart from one ewe, 9113, with a conception date of 10/19/22. Ewe 9113 SNAP test result for the first collection was “not pregnant”, and for the second collection date, a positive result did not appear until 5 min and 43 sec. Lambing revealed that 9113 had a singleton female lamb. Based on the present study, sex and number of lamb offspring could not be determined by commercial blood pregnancy tests. In the present study, the earliest confirmed pregnancy determined retrospectively by subtracting average ewe gestation length (152 d) from the lambing date was determined to be September 28<sup>th</sup> but blood sampling and testing for PAGs did not begin until November 14<sup>th</sup>, therefore, further studies are needed that initiate blood sampling sooner.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"f99cb5d070b95c122bcf5e1e835871a3f52ea01bdc9bcd4fc72eba35792732e0","category":"Environment"}