{"title":"Losses and destabilization of soil organic carbon stocks in coastal wetlands converted into aquaculture ponds","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17480?af=R","date":1725260400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/008e4dac-caaf-4324-b15f-aedac212aaad/gcb17480-toc-0001-m.png\" alt=\"Losses and destabilization of soil organic carbon stocks in coastal wetlands converted into aquaculture ponds\" />\n<p>In the last decades a lot of area of natural wetland vegetation, primarily mangroves and marshes, have been converted to pond farms in South east Asia. In this study, we analyzed how soil carbon have changes in this conversion along 11 of the most important coastal wetland areas in China, observing that this conversion has been linked to a great lost of soil quality and soil organic carbon.</p>\n<br />\n<h2>Abstract</h2>\n<p>Coastal-wetlands play a crucial role as carbon (C) reservoirs on Earth due to their C pool composition and functional sink, making them significant for mitigating global climate change. However, due to the development and utilization of wetland resources, many wetlands have been transformed into other land-use types. The current study focuses on the alterations in soil organic-C (SOC) in coastal-wetlands following reclamation into aquaculture ponds. We conducted sampling at 11 different coastal-wetlands along the tropical to temperate regions of the China coast. Each site included two community types, one with solely native species (<i>Suaeda salsa</i>, <i>Phragmites australis</i> and Mangroves) and the other with an adjacent reclaimed aquaculture pond. Across these 11 locations we compared SOC stock, active OC fractions, and soil physicochemical properties between coastal wetlands and aquaculture ponds. We observed that different soil uses, sampling sites, and their interaction had significant effects on SOC and its stock (<i>p</i> &lt; .05). Reclamation significantly declined SOC concentration at depths of 0–15 cm and 15–30 cm by 35.5% and 30.3%, respectively, and also decreased SOC stock at 0–15 cm and 15–30 cm depths by 29.1% and 37.9%, respectively. Similar trends were evident for SOC stock, labile organic-C, dissolved organic-C and microbial biomass organic-C concentrations (<i>p</i> &lt; .05), indicating soil C-destabilization and losses from soil following conversion. Soils in aquaculture ponds exhibited higher bulk density (BD; 11.3%) and lower levels of salinity (61.0%), soil water content (SWC; 11.7%), total nitrogen (TN) concentration (23.8%) and available-nitrogen concentration (37.7%; <i>p</i> &lt; .05) than coastal-wetlands. Redundancy-analysis revealed that pH, BD and TN concentration were the key variables most linked with temporal variations in SOC fractions and stock between two land use types. This study provides a theoretical basis for the rational utilization and management of wetland resources, the achievement of an environment-friendly society, and the preservation of multiple service functions within wetland ecosystems.</p>","author":"Shaoying Lin, \nYaxin Zhou, \nWeiqi Wang, \nJordi Sardans, \nYuan Li, \nChuancheng Fu, \nFanjiang Zeng, \nZhaoliang Song, \nAkash Tariq, \nJosep Peñuelas","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"f9a55a5165594d4d16cb19741ead20309ab295e55b5cd60749f2918ca0b92725","category":"Environment"}