{"title":"Controlled Hypoxia Acutely Prevents Physical Inactivity-Induced Peripheral BDNF Decline","link":"https://www.preprints.org/manuscript/202406.1449/v1","date":1718881142000,"content":": Background: Brain-derived neurotrophic factor (BDNF) is a crucial mediator of neuronal plasticity. Here, we investigated the effects of controlled normobaric hypoxia (NH) combined with physical inactivity on BDNF blood levels and executive functions. Methods: Twenty-five healthy adults (25.8±3.3 years, 15 female) were analyzed in a randomized, controlled cross-over study. Each intervention began with a 30 min resting phase under normoxia (NOR), followed by a 90 min continuation of NOR or NH (peripheral oxygen saturation [SpO2] 85-80%). Serum and plasma samples were collected every 15 min. Heart rate and SpO2 were continuously measured. Before and after each exposure, cognitive tests were performed and after 24 h another follow-up blood sample was taken. Results: NH decreased SpO2 (p&lt;.001, ηp²=.747) and increased heart rate (p=.006, ηp²=.116) significantly. The 30-min resting phase under NOR led to a significant BDNF reduction in serum (p &lt;.001, ηp²=.581) and plasma (p &lt;.001, ηp²=.362). Continuation of NOR further significantly reduced BDNF after another 45 min (p=.018) in serum and after 30 min (p=.040) and 90 min (p=.005) in plasma. There was no significant BDNF decline under NH. 24 h Follow-up examination showed a significant decline of serum BDNF, both after NH and NOR. Conclusion: Our results show that NH has the potential to counteract physical inactivity-induced BDNF decline. Therefore, our study emphasizes the need for a physically active lifestyle and its positive effects on BDNF. This study also demonstrates the need for a standardized protocol for future studies to determine BDNF in serum and plasma.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"f9aa9f6ea5a4ea509bb282700bc5b362ce595c0eb8175fd7941bbce1127d7b65","category":"Interdisciplinary"}