{"title":"A fractional perspective on the transmission dynamics of a parasitic infection, considering the impact of both strong and weak immunity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0297967","date":1713967200000,"content":"<p>by Tao-Qian Tang, Rashid Jan, Zahir Shah, Narcisa Vrinceanu, Ciprian Tanasescu, Asif Jan</p>\r\n\r\nInfectious disease cryptosporidiosis is caused by the cryptosporidium parasite, a type of parasitic organism. It is spread through the ingestion of contaminated water, food, or fecal matter from infected animals or humans. The control becomes difficult because the parasite may remain in the environment for a long period. In this work, we constructed an epidemic model for the infection of cryptosporidiosis in a fractional framework with strong and weak immunity concepts. In our analysis, we utilize the well-known next-generation matrix technique to evaluate the reproduction number of the recommended model, indicated by R 0. As R 0 &lt; 1, our results show that the disease-free steady-state is locally asymptotically stable; in other cases, it becomes unstable. Our emphasis is on the dynamical behavior and the qualitative analysis of cryptosporidiosis. Moreover, the fixed point theorem of Schaefer and Banach has been utilized to investigate the existence and uniqueness of the solution. We identify suitable conditions for the Ulam-Hyers stability of the proposed model of the parasitic infection. The impact of the determinants on the sickness caused by cryptosporidiosis is highlighted by the examination of the solution pathways using a novel numerical technique. Numerical investigation is conducted on the solution pathways of the system while varying various input factors. Policymakers and health officials are informed of the crucial factors pertaining to the infection system to aid in its control.","author":"Tao-Qian Tang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f9af41bccca950a91aa5dc296520747369302447da3239044a7317da005e467a","category":"Interdisciplinary"}