{"title":"Work for No22 Bicycles!","link":"https://theradavist.com/2021/09/work-for-no22-bicycles/?utm_source=rss&utm_medium=rss&utm_campaign=work-for-no22-bicycles","date":1630511955000,"content":"<p><img src=\"https://media.theradavist.com/uploads/2021/09/Drifter-Pump_3-4rear-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><a href=\"https://22bicycles.com/\" target=\"_blank\">No. 22</a> is looking for a finishing and fabrication specialist to join our small and growing team of framebuilders in our Johnstown, NY production facility. A great candidate will be passionate about craftsmanship at the highest level and will have previous bicycle manufacturing experience.</p>\n<p>The role can be tailored to suit the right candidate, but at its core would involve masking, painting, anodizing, and other finishing-related tasks, as well as ancillary tasks such as packing, shipping, workstation cleaning, and inventory control. Opportunities in fabrication, machining, assembly, and other facets of the framebuilding process can be added to the role for the right candidate.</p>\n<p>An ideal applicant will have demonstrated experience with crafting boutique or custom bicycles, outstanding attention to detail, and above all a pride in building bikes to the highest possible standards. The following skills will be helpful in the role:</p>\n<p>-Strong interpersonal skills and the ability to work with a collaborative team<br />\n-Strong attention to detail<br />\n-Previous experience with the manufacturing or finishing of bicycles and components, including masking, bead blasting, polishing, anodizing or painting<br />\n-Experience with titanium framebuilding a definite asset<br />\n-Comfortable safely working with hand tools and light manufacturing equipment<br />\n-Interest in developing own skills and knowledge<br />\n-Familiarity with graphic design programs and particularly Adobe Illustrator is an asset<br />\n-Bicycle knowledge and mechanical experience is helpful but not required</p>\n<p>Please send your resume and cover letter to <a href=\"mailto:info@22bicycles.com\" target=\"_blank\">info@22bicycles.com</a></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"f9b3285d5d71e42b74fb6eb2269012a57d866db394ed4963e910cd39e20bacba","category":"Cycling"}