{"title":"Love Stories: An Ode to Audiobooks and Long Rides – Travis Engel","link":"https://theradavist.com/audiobooks-and-long-bike-rides/","date":1699374034000,"content":"<p><em>On the heels of his <a href=\"https://theradavist.com/tag/bike-hacks/\" target=\"_blank\">Bike Hack</a> about carrying a pair of <a href=\"https://theradavist.com/bike-hacks-prism-reading-glasses-for-bikepacking/\" target=\"_blank\">prism reading glasses</a> while bikepacking, <a href=\"https://theradavist.com/tag/travis-engel/\">Travis Engel</a> now suggests bringing your books from the tent to the trail. His short treatise on the merits of audiobooks on all-day rides might inspire you to revisit a classic, or seek out the source material behind your favorite movie to find out if the book is actually any better.</em><span></span></p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/RAD07161.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/RAD07161.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/RAD07161.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/RAD07161.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/RAD07161.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/RAD07161.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/RAD07161.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/RAD07161.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>I don’t listen to music when I ride. I guess maybe if I’m in the mood to go sprint around the neighborhood on a warm summer night, I’ll fill my ears with something appropriately cathartic. But not when I’m gonna be on the bike for hours on end. After a while, music just starts to feel like noise. Like feeding my brain sugar when it really wants a meal. That’s why I usually listen to podcasts. I couldn’t live without ‘em.</p>\n<p>Sitting in traffic, doing dishes, or pedaling up Mount Lukens Fire Road will go from excruciating to entertaining if there’s a new episode of <em>Blank Check, Get Played,</em> or <em>No Such Thing as a Fish</em> to keep me company. But sometimes, engaging with podcast demands more brainpower than I feel like using. I need something I don’t have to pay <i>too much</i> attention to. I still want it to have some sort of narrative structure, but one that I can drift in and out of without getting lost. That’s when I turn to audiobooks.</p>\n<p><img loading=\"lazy\" src=\"https://media.theradavist.com/uploads/2023/11/IMG_7895-e1699311412154.png?resize=150,150&amp;quality=75\" width=\"150\" height=\"150\" /> <img loading=\"lazy\" src=\"https://media.theradavist.com/uploads/2023/11/IMG_7896-e1699294623687.png?resize=150,150&amp;quality=75\" width=\"150\" height=\"150\" /> <img loading=\"lazy\" src=\"https://media.theradavist.com/uploads/2023/11/IMG_7897-e1699294583499.png?resize=150,150&amp;quality=75\" width=\"150\" height=\"150\" /> <img loading=\"lazy\" width=\"750\" height=\"1210\" src=\"https://media.theradavist.com/uploads/2023/11/IMG_785A99069375-1-e1699311566238.jpeg?resize=150,150&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/IMG_785A99069375-1-e1699311566238.jpeg?w=750&amp;quality=75 750w, https://media.theradavist.com/uploads/2023/11/IMG_785A99069375-1-e1699311566238.jpeg?resize=700,1129&amp;quality=75 700w\" /></p>\n<p>And not just any audiobook. It has to be one I’ve already read, or at least one that’s been made into a movie I’ve already seen. My goal is to replicate the experience of getting sucked into re-watching <em>Princess Bride</em> or <em>Ferris Bueller</em> or <em>The Fifth Element.</em> You know, back when putting on a movie didn’t involve a lengthy, stressful selection process. For me, having <em>Shawshank Redemption</em> playing in the background was the perfect way to make a Sunday of productive housework feel like a lazy day in front of the tube.</p>\n<p>That’s exactly what a well-read audiobook does for me when it’s playing underneath a long solo pedal. I’m being told a story that I already know, but haven’t heard in a while. I don’t have to process and retain all the events and images as they come at me. It’s more like having pleasant memories pulled off the shelf, dusted off a bit, and then put right back a little clearer than they were. My mind might wander like it often does when I’m reading a printed page, but I’m not missing anything if I just let the pages keep turning. In fact, those distractions keep me from checking my distance from the peak or thinking about what my cadence should be. There’s no rush. Books are long. For most of the time you spend in them, you’re nowhere near the end. Keeping that in mind makes me a more patient rider. I’m not bothered that a climb is taking forever, or that it hurts when I try to go quicker. The top will come when it comes.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/11/RAD07021.jpg?fit=1024,9999&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2023/11/RAD07021.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/11/RAD07021.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/11/RAD07021.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/11/RAD07021.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/11/RAD07021.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/11/RAD07021.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/11/RAD07021.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>There’s another perk to all this, but I may have an unfair advantage: I’m a big fantasy geek. There will always be part of me that wishes I lived on Pandora or Tatooine. Or, of course, in Middle Earth. I’ve listened to <em>The Lord of the Rings</em> at least four times since I started integrating audiobooks into my long-ride regimen. Regardless of the setting or scene, it adds gravity to a story if you’re hearing it while alone in the mountains. But when the characters you’re hearing about are <i>also</i> alone in the mountains, it’s hard not to have a sort of out-of-body experience.</p>\n<p>It’s like 4-D storytelling. Any plotline that involves a journey will feel especially vivid. And journeys are common in fantasy and sci-fi. Of course, that’s not all I listen to. I’ve dipped into classics I didn’t appreciate enough in high school, or comedies read aloud by their charismatic author. But the nerdy stuff is my comfort food. And when I’m on my bike for eight or nine hours, a little comfort goes a long way.</p>\n<p>The post <a href=\"https://theradavist.com/audiobooks-and-long-bike-rides/\">Love Stories: An Ode to Audiobooks and Long Rides</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"Travis Engel","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"f9b7613034d8342cbba5fb3d8eecf385af4dd683e640c60f604afb5bcd60f165","category":"Cycling"}