{"title":"Retiring the AWS Documentation on GitHub","link":"https://aws.amazon.com/blogs/aws/retiring-the-aws-documentation-on-github/","date":1684366018000,"content":"<p>About five years ago I announced that <a href=\"https://aws.amazon.com/blogs/aws/aws-documentation-is-now-open-source-and-on-github/\">AWS Documentation is Now Open Source and on GitHub</a>. After a prolonged period of experimentation we will archive most of the repos starting the week of June 5th, and will devote all of our resources to directly improving the AWS documentation and website.</p> \n<p>The primary source for most of the AWS documentation is on internal systems that we had to manually sync with the GitHub repos. Despite the best efforts of our documentation team, keeping the public repos in sync with our internal ones has proven to be very difficult and time consuming, with several manual steps and some parallel editing. With 262 separate repos and thousands of feature launches every year, the overhead was very high and actually consumed precious time that could have been put to use in ways that more directly improved the quality of the documentation.</p> \n<p>Our intent was to increase value to our customers through openness and collaboration, but we learned through customer feedback that this wasn’t necessarily the case. After carefully considering many options we decided to retire the repos and to invest all of our resources in making the content better.</p> \n<p>Repos containing code samples, sample apps, CloudFormation templates, configuration files, and other supplementary resources will remain as-is since those repos are primary sources and get a high level of engagement.</p> \n<p>To help us improvement the documentation, we’re also focusing more resources on your feedback:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/05/02/doc_feedback_1.png\" alt width=\"279\" height=\"151\" /></p> \n<p>We watch the thumbs-up and thumbs-down metrics on a weekly basis, and use the metrics as top-level pointers to areas of the documentation that could be improved. The incoming feedback creates tickets that are routed directly to the person or the team that is responsible for the page. I strongly encourage you to make frequent use of both feedback mechanisms.</p> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"f9b815283db94ff45636b024154483f8d131e170387bdb6f8cbb8c90270bd1fd","category":"Tech"}