{"title":"Characterizing mobility patterns and malaria risk factors in semi-nomadic populations of Northern Kenya","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002750","date":1710338400000,"content":"<p>by Hannah R. Meredith, Amy Wesolowski, Dennis Okoth, Linda Maraga, George Ambani, Tabitha Chepkwony, Lucy Abel, Joseph Kipkoech, Gilchrist Lokoel, Daniel Esimit, Samuel Lokemer, James Maragia, Wendy Prudhomme O’Meara, Andrew A. Obala</p>\r\n\r\nWhile many studies have characterized mobility patterns and disease dynamics of settled populations, few have focused on more mobile populations. Highly mobile groups are often at higher disease risk due to their regular movement that may increase the variability of their environments, reduce their access to health care, and limit the number of intervention strategies suitable for their lifestyles. Quantifying the movements and their associated disease risks will be key to developing interventions more suitable for mobile populations. Turkana, Kenya is an ideal setting to characterize these relationships. While the vast, semi-arid county has a large mobile population (&gt;60%) and was recently shown to have endemic malaria, the relationship between mobility and malaria risk in this region has not yet been defined. Here, we worked with 250 semi-nomadic households from four communities in Central Turkana to 1) characterize mobility patterns of travelers and 2) test the hypothesis that semi-nomadic individuals are at greater risk of malaria exposure when migrating with their herds than when staying at their semi-permanent settlements. Participants provided medical and travel histories, demographics, and a dried blood spot for malaria testing before and after the travel period. Further, a subset of travelers was given GPS loggers to document their routes. Four travel patterns emerged from the logger data, Long Term, Transient, Day trip, and Static, with only Long Term and Transient trips being associated with malaria cases detected in individuals who carried GPS devices. After completing their trips, travelers had a higher prevalence of malaria than those who remained at the household (9.2% vs 4.4%), regardless of gender and age. These findings highlight the need to develop intervention strategies amenable to mobile lifestyles that can ultimately help prevent the transmission of malaria.","author":"Hannah R. Meredith","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"f9b94b01a1bfde17bf02bd62615a98b6140997ffc1a9f3f29096d33a7aa8215c","category":"Environment"}