{"title":"High levels of metacercarial infestation (family: Diplostomidae) do not affect host energetics and swimming performance in the Epaulette goby (Coryogalops sordidus, Gobiidae)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15657?af=R","date":1705569803000,"content":"<h2>Abstract</h2>\n<p>Parasites have deleterious effects on their hosts, often resulting in altered host behavior or increased energy expenditure. When organisms are exposed to suboptimal environments, parasite loading may increase. Microbialite pools along the warm temperate South African coastline have been hypothesized as refugia for Epaulette gobies (<i>Coryogalops sordidus</i>, Gobiidae) when they are outside of their previously known subtropical distribution. The aim of this study was to determine if <i>C. sordidus</i> individuals infected with metacercarial cysts display higher metabolic rates or different swimming behavior compared to noninfected individuals. We measured each goby's swimming performance using a critical station-holding speed (<i>U</i>\n<sub>crit</sub>) test (<i>n</i> = 60) and visually scored their swimming behavior (<i>n</i> = 52) during these measurements. Also, we measured the metabolic rate of gobies using an intermittent flow respirometer system to determine standard metabolic rate (SMR) and maximum metabolic rate (MMR) from gobies at 21°C before and after swimming trials. Metacercarial load carried by infected gobies seemingly had no impact on the host's energetics (SMR or MMR), swimming ability (as repeated <i>U</i>\n<sub>crit</sub> tests), or swimming behavior compared to noninfected gobies. Thus, the metacercarial intensity observed in gobies in the current study appeared to have no impact on host swimming performance or behavior. Furthermore, the swimming capacity observed for <i>C. sordidus</i>, in general, suggests that this goby is a poor swimmer compared to other gobiid species.</p>","author":"Hendrik D. du Toit, \nGavin M. Rishworth, \nNadine A. Strydom, \nShaun Welman","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"f9bd95baff5fe480faa877ed19e53fcc121230a75794fd0719e3cb2a5cc83605","category":"Environment"}