{"title":"Deepening the Decade: Collaborative Action for Advancing Deep‐Ocean Science and Policy in the United Nations Decade of Ocean Science for Sustainable Development","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lob.10662?af=R","date":1728468529000,"content":"<h2>Abstract</h2>\n<p>The current United Nations Decade of Ocean Science for Sustainable Development (2021–2030; hereafter, the Decade) offers a unique opportunity and framework to globally advance ocean science and policy. Achieving meaningful progress within the Decade requires collaboration and coordination across Decade Actions (Programs, Projects, and Centres). This coordination is particularly important for the deep ocean, which remains critically under-sampled compared to other ecosystems. Despite the limited sampling, the deep ocean accounts for over 95% of Earth's habitable space, plays a crucial role in regulating the carbon cycle and global temperatures, and supports diverse ecosystems. To collectively advance deep-ocean science, we gathered representatives from 20 Decade Actions that focus at least partially on the deep ocean. We identified five broad themes that aim to advance deep-ocean science in alignment with the Decade's overarching 10 Challenges: natural capital and the blue economy, biodiversity, deep-ocean observing, best practices in data sharing, and capacity building. Within each theme, we propose concrete objectives (termed Cohesive Asks) and milestones (Targets) for the deep-ocean community. Developing these Cohesive Asks and Targets reflects a commitment to better coordination across deep-ocean Decade Actions. We aim to build bridges across deep-ocean disciplines, which encompass natural science, ocean observing, policy, and capacity development.</p>","author":"Elizabeth D. Hetherington, \nClarissa Anderson, \nLiliana Bastian, \nNaomi Boon, \nNan‐Chin Chu, \nCeci Rodriguez Cruz, \nHayley Drennon, \nAndrew Gates, \nBrandon Gertz, \nKelly D. Goodwin, \nSvenja Halfter, \nKerry Howell, \nElla Howes, \nVanessa Lopes, \nTinah Martin, \nTerrence McConnell, \nPei‐Yuan Qian, \nSarah Seabrook, \nLeslie Smith, \nGlen Snyder, \nKaren I. Stocks, \nRosalynn Sylvan, \nDawn Wright, \nLisa A. Levin","siteTitle":"Wiley: Limnology and Oceanography Bulletin: Table of Contents","siteHash":"4067ad97a51cc8dc25fbbbaa2160150c28c0da1c950424683ce4f339a8ef5bff","entryHash":"f9c82fdf5ab901054cf5eaf0536343098be96ceb58530951002ef5a46664adcf","category":"Environment"}