{"title":"The Muoverti TiltBike does exactly what its name suggests","link":"https://www.cyclist.co.uk/news/10232/muoverti-tiltbike","date":1635942034000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>4 Nov 2021</span></div>    </div></div><p>\nIndoor training bike claims to engage whole body with balancing, steering, accelerating and braking</p>\n<div>\n      <img src=\"/sites/cyclist/files/styles/article_main_image/public/2021/11/6_muoverti_tiltbikes_c_4season_collective.jpg?itok=vyxHFEUu\" />  </div>\n<div>\n      <p> Indoor cycling brand Muoverti has today unveiled a pre-production preview of its new TiltBike to be commercially available in 2022.</p>\n<p>The immersive cycling <a href=\"/reviews/667/the-best-turbo-trainers-a-buyers-guide\" target=\"_blank\">indoor trainer</a>, which is designed for riders wanting more effective exercise, allows for balancing, steering, accelerating and braking.</p>\n<p>According to the brand, lateral frame rotation combined with self-centering handlebars allow the bike to move freely under the rider to preserve the body’s natural fluidity, engaging core muscles and balancing reflexes.</p>\n<p>Motion capture is utilised through data sensors on the bike. They capture rider motions such as left-right balance and seated versus standing position.</p>\n<p>Frames can be separated from the base for alternatives such as a time-trial or mountain bike. These can then be customised with different handlebars, cranks, pedals and saddle.</p>\n<p>\nTiltBikes are said to be built for athletes of all levels looking for engaging simulations and effective exercise from essential training to e-sports to interactive gaming.</p>\n<p>Muoverti says it's computerised and accounts for physical forces such as rolling resistance, incline, weight, acceleration, deceleration and inertia in the control algorithm. This updates a thousand times per second and enables real-time simulations such as drafting and angular wind speed, and all forces can be software-controlled.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/buying-guides/10251/best-cycling-deals\">Best cycling deals 2021: Black Friday bike and kit discounts</a></div>      <div><a href=\"/buying-guides/9003/best-cycling-shoes-for-winter-buyers-guide\">Best cycling shoes for winter: buyer's guide</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 120: on sale now!</a></div>    </div></div><p>\nMuoverti – Italian for 'keep moving' – was founded by entrepreneurs Christoph Wilfert and Alex Caccia and is based in London, UK. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"rdavidson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"f9d68c5210878fd4b7303a6ba682bacbd543a1acfbbe17d6e5894ee38fe30096","category":"Cycling"}