{"title":"The Tigrayan dream","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-tigrayan-dream","date":1685097582000,"content":"\n      <p><a href=\"https://www.rouleur.cc/pages/subscribe\"><em>This article was originally published in Issue 119 of Rouleur magazine. Subscribe today and get the world’s finest road cycling journal to your door eight times a year.</em></a></p>\n<p><span>It’s a March Sunday afternoon in Spain, and the ladies of the World Cycling Centre team are relaxing after a demanding couple of days at their first stage race of the year, the Vuelta Extremadura Femininas. Selam Amha Gerefiel and her team-mates have raced well, and can celebrate her 10th place in the general classification. She hopes to build on a foundation laid last year, where her best result was seventh on a stage of the Tour de l’Ardèche. Win or lose, this is a strongly bonded team where the young riders train together, race together, celebrate together and commiserate together.</span></p>\n<div></div>\n<p><span>The team are putting into practice and reaping the benefits of what they have learned on the WCC training programme at Aigle, Switzerland, for riders from emerging nations – those countries where there are limited opportunities to develop a career as a cycle racer. These riders from far-flung parts of the world are hungry for success.</span></p>\n<p><span>Selam Amha is one of them. Since 2021, Aigle has been home to the 26-year-old Ethiopian. This has been her only choice, as she was not able to return to her home region of Tigray which was gripped by a civil war in late 2020. Hostilities subsided last year, though the population is still grappling with the fallout. </span></p>\n<p><span>Managers at the UCI had deemed it too unsafe for Selam Amha to travel to Tigray, so she remained at the WCC accommodation, while her team-mates were able to travel to their respective countries in other parts of Africa, Central Europe, South America or Asia. </span></p>\n<p><span>Times have been tough for Selam Amha given that communication lines to the area were patchy, and there was no internet. </span></p>\n<p><span>“It was very hard to be without my family because I could not reach them and I didn’t know if they were alive,” says Selam Amha. “It is still hard, but now when I need to speak to them I can call.”</span></p>\n<p><span>Fortunately she was able to visit her mother in Ethiopia in January this year, thanks to the WCC. Sadly, one person she couldn’t see was the cycling coach who helped her when she was starting out in Tigray. He was killed in the conflict. </span></p>\n<p><span>Despite all of this, Selam Amha is determined to pursue her dream of racing for a WorldTour team. </span></p>\n<p><span>Such dreams are a relatively new aspiration among young Ethiopians. Cycle racing is a popular activity in neighbouring Eritrea, but generally less so in Ethiopia, where distance running and football are more popular sports. However, in the Tigray region, in the north of the country and close to the Simien National Park, home to the highest mountains in the country, cycling is a bread-and-butter activity – as a spectator sport and at a competitive or mass participation level. For Team Jayco Alula’s Ethiopian rider Tsgabu Grmay, growing up during the noughties in his hometown of Mek’ele, Tigray, July was all about the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>.</span></p>\n<p><span>“Every restaurant or clubhouse was showing the Tour. That’s the only sport people watched,” says Grmay. “That’s always how July was for me when I was a child. We didn’t know about other big races like the Giro, Vuelta, or Roubaix. It was only in 2011 that I knew of these races other than the Tour de France.” Although there was massive enthusiasm for the world’s biggest race in his home country, Grmay never actually imagined himself there. The idea of racing in Europe seemed a world away. Nevertheless, cycle racing was still big, and glory for Tigrayan athletes was about winning local events.</span></p>\n<p><span>“The Tour de France was so far away from us that no one could ever imagine going there or even being part of that race,” says Grmay.</span></p>\n<p><span>“When I started, there was no dream of becoming a professional, because there were no professionals from here at that time. But cycling was really big at a local level. My father, Gebremaryam Grmay, was a cyclist around 40 years ago. At home I saw pictures of him racing. My brother Solomon was also a famous cyclist in the city. It inspired me to follow that path.”</span></p>\n<p><span>Solomon Grmay helped his younger brother continue the family tradition of local cycling prowess as he started out, like all Ethiopians, racing on cheap city bikes from China. When he won races in that category he then moved up to the road bike category and earned points when winning races. His success earned him the right to government funding and to join a locally sponsored team where he was paid a small salary and lived in a shared house with other cyclists. That was the aspiration of young Ethiopian cyclists in those days. </span></p>\n<p><span>Grmay did not think he would make a living from cycling in the long term, given that his father had retired and became a taxi driver, while his brother also only had a short elite career. However, he could still dare to dream, and follow the trail blazed by his brother in 2007 when he became the first Ethiopian to train at the WCC in Aigle. First, he earned himself a place at the WCC Africa, in South Africa, under the guidance of centre director, Jean-Pierre Van Zyl. Then he moved up to Aigle. As a youngster, Selam Amha was passionate about football, and focused on playing the ‘beautiful game’ around her home near Aksum. When a coach noted her potential on a bike, he encouraged her to consider professional cycling. </span></p>\n<p><span>“In the beginning, I didn’t want to do it because I just wanted to play football,” she says. “But when I saw people in my village doing cycling training, I wanted to try as well. After just four days, I did a competition and came second.” </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/UCI-SelamAmhaGerefiel_photoCelineMichel_18_8f3dab65-52e0-4b5a-afa1-059378117a2f.jpg?v=1685097307\" alt />At that, the coach introduced her to a local team in Tigray, though she had to deliberate a little because the football federation prohibited her from cycling. So it was several months before she swapped the ball for two wheels, and joined the team. Things were not straightforward for a woman trying to get into cycle racing. </span></p>\n<p><span>“I had to have a lot of discussions with my family,” says Selam Amha. “In Ethiopia, a woman is expected to stay at home and help her mother. I have a sister and a younger brother and I needed to help look after them. In the end, other people talked to my mother and explained why cycling was important to me.”</span></p>\n<p><span>After overcoming the first few of many hurdles, Selam Amha moved into a shared house with other cyclists, where she could train full-time under the government scheme. Living at more than 2,000 metres above sea level in the mountainous Tigrayan region, training 14 hours per week on the mountain passes and doing weekly races gave Selam Amha that added strength in the hills, rather like Colombian riders. She gained African Championship titles and was practically unbeatable in time-trials.</span></p>\n<p><span>Selam Amha built on her strength by doing training camps at WCC Africa, and at the Africa Rising Cycling Centre in Rwanda, run by Kimberly Coats.</span></p>\n<p><span>As with Tsgabu Grmay, Selam Amha was not necessarily thinking of racing abroad. In fact, for women it was more of a pipe dream. Fellow racer Hadnet </span><span>Asmelash, also from Aksum, and Tsgabu Grmay’s wife, hunted high and low for </span><span>a chance to race in Europe despite having had national success. Cultural barriers make it difficult for women to take up professional cycle racing, but visa requirements hamper the process further.</span></p>\n<p><span>Coats explains: “It is really costly obtaining a visa. You need to be earning around 3,500 euros a month, and the women here don’t earn that much. They could go to Europe on a 90-day tourist visa, but once they leave, they can’t go back for another 90 days, so that blows the season. You can make appeals and send extra paperwork, but the process can take months and still be unsuccessful. That’s the sad reality of African cycling across the board, and it’s harder for women.” </span></p>\n<p><span>Luckily for Selam Amha, she got her golden ticket to Aigle in 2021. Initially, her focus was on the preparation to represent her country in the road race at the Tokyo Olympics. Although she didn’t finish the race it was very important for her to show her nation’s colours around the world, and in time-honoured fashion the television cameras focused on her and Eritrea’s Mossana Debesay as they tried to catch </span><span>the breakaway. </span></p>\n<p><span>The WCC is nestled along the River Rhône, a few miles South of Lake Geneva, and its riders benefit from modern facilities, as well as hundreds of surrounding mountain passes, some of which feature in the Tour de Romandie. WCC trainees have everything provided for them and follow a full programme including all aspects of training, health and wellbeing. </span></p>\n<p><span>The 9,000CHF-per-month fee per athlete for the WCC programme includes everything needed for an athlete to develop during their stay from February to November – accommodation, food, physio, logistics, travel to races and equipment, plus on-the-bike and off-the-bike training.</span></p>\n<p><span>Athletes from emerging nations have their fees met through a mixture of the UCI, national federations, national Olympic committees, and solidarity grants. </span></p>\n<p><span>Jacques Landry, Director of the WCC, says,  “We are aligned with our 2030 agenda and the goal here is to look at the universality of the sport and globalise it through the World Cycling Centre.” </span></p>\n<p><span>It is for this reason that most of the trainee riders at the centre are from emerging nations, and the Ethiopian riders really see this as their gateway to the world. Grmay recalled the excitement when he arrived there and received his kit.</span></p>\n<p><span>“Everything they gave me was brand new. In Ethiopia I had one jersey to race with, and only got another if it was damaged. But in Aigle I received a big case full of different clothes and when I saw all that I thought, ‘What am I going to do with all this? Are you sure this is all for me?’ It was like being a pro – especially coming from Africa and seeing so much new kit. Already, being in Europe was a big thing, and having all this equipment and a good bike was like a dream.”</span></p>\n<p><span>However, when Grmay first raced with his WCC team-mates, that feeling of excitement soon dissipated and he was left wondering if he had made the right decision.</span></p>\n<p><span>“I was at Aigle in 2011, and my brother had told me a few things about what to expect when he came back in 2007. But to be honest, in the first two weeks I thought I would give up. It was February, and for the first few races it was so cold and rainy; my races went terribly. In Africa I was used to good weather, big roads and being in </span><span>a bunch with around 30 riders. So coming to Europe and riding in a peloton with at least 150 riders on small roads, crazy descents, where I had less technical skills than other kids… I said to Natnael Berhane, who was with me, ‘This is not cycling; this is not for me.’”</span></p>\n<p><span>Grmay had to dig deep to persevere, but some weeks later, during an U23 stage race in Tuscany where he managed fifth place overall and third place on a summit finish stage, his outlook changed. Hearing fellow U23 riders at the time, like Fabio Aru, say that they had signed with a team for the following year motivated him to think that he too could sign a contract. Suddenly the rainy days no longer bothered him, and he did everything he could to boost his prospects – including improving his English by watching documentaries on YouTube. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/UCI-SelamAmhaGerefiel_photoCelineMichel_01.jpg?v=1685097272\" alt />Eventually the life-changing moment arrived in 2012, when Doug Ryder gave him a contract with MTN-Qhubeka. </span></p>\n<p><span>“My family was really excited. My salary went up to 500 euros a month, which for me was a lot of money at the time. I became famous back in Mek’ele. I even bought </span><span>a new taxi for my father,” Grmay remembers fondly.</span></p>\n<p><span>However, deep down he had moments of self-doubt and wondered if he really had the talent to move up to a Continental team, still less accept an offer to join Lampre-</span><span>Merida a few years later and become the first Ethiopian to race in a WorldTour Team. The answer was yes. The time </span><span>he had spent at the WCC had prepared </span><span>him well. Grmay is forever grateful to Van Zyl, Ryder and then-Lampre manager Brent Copeland for having taken </span><span>a chance on him. Since then, he has raced for other WorldTour teams and has reunited with Copeland at Jayco Alula, alongside compatriot Welay Hagos Berhe. Grmay </span><span>has now taken part in eight Grand Tours in total, and he has also invested money into helping develop aspiring cycle racers in Ethiopia.</span></p>\n<p><span>Civil war in Tigray affected many Ethiopian cyclists. Like Grmay, Selam Amha received comprehensive training at WCC Aigle, learning everything around cycling, including climbing, descending and bike maintenance and repair. Crucially, she felt much safer there than back home where the war still raged on and life was turned upside down. It was a safe haven where she could keep her dream alive.</span></p>\n<p><span>“There is no support for cyclists in Ethiopia now, and it is dangerous,” says Selam Amha. “I also had many crashes with cars.”</span></p>\n<p><span>She was initially quite nervous, and communication was difficult, but she soon found a support network. </span></p>\n<p><span>“In the beginning, I couldn’t really speak English and I did not understand much. The other girls had to explain everything to me. All the girls in the team, the coach, the mechanics became a second family to me. They were the best.” </span></p>\n<p><span>Notably her then coach, Cristina San Emeterio, was like a foster mother and sister to her, particularly during the anxious times.</span></p>\n<p><span>Grmay can’t find the words to describe how bad the situation with the civil </span><span>war was. Recalling the time when he was separated from his family, he says: </span><span>“The war started during the second week of the Vuelta a España. The team supported me and said I could stop racing if I wanted. But leaving the race would have been worse for me mentally. After the race I was stuck in my apartment in Girona </span><span>not knowing if my family were alive. After one month I heard that they had moved to Addis Ababa, and so we made arrangements for my wife and two daughters to join me in Girona where I have residency. But it was so bad, not being able to see them for eight months.” </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/UCI-SelamAmhaGerefiel_photoCelineMichel_15.jpg?v=1685097227\" alt />Welay Hagos Berhe obtained a refugee visa, living in a centre in Switzerland, and hasn’t seen his family in the last couple of years. </span></p>\n<p><span>Jayco Alula team manager Matt White spoke of the determination and </span><span>resilience of the Ethiopian riders. “Hagos has extra things to deal with compared with riders from Europe or Australia, </span><span>like the cultural change, learning German as part of his visa requirement, and </span><span>not seeing his family,” he explains. “For every neo pro this is a massive opportunity. But for riders like Hagos and Tsgabu they have a different hunger compared to other people, as their achievements change generations of people’s lives </span><span>in Ethiopia.” </span></p>\n<p><span>Another promising female cyclist, Eyeru Tesfoam Gebru, was being supported by a non-profit cycling organisation in France, and was due to compete in the 2021 World Road Race Championships in Gent. Suddenly she vanished en route to the event, and sought asylum. After more than a year out of racing, during which time she gained refugee status, Eyeru Tesfoam has resumed racing with a French Continental team.</span></p>\n<p><span>Despite the difficulties faced by Ethiopian cyclists, budding professionals like Selam Amha, Eyeru Tesfoam and Welay Hagos are even hungrier to do well in their cycling careers. And in doing so, they can inspire future generations to follow. </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f9de266e2a8745237d370ba7d8e0ac0436aa40e65bd8e65ce4c6e9ff22077fa8","category":"Cycling"}