{"title":"MacRumors Giveaway: Win an iPhone 15 Pro Max From GRID Studio","link":"https://www.macrumors.com/2023/10/27/macrumors-giveaway-grid-studio-15-pro-max/","date":1698423732000,"content":"For this week's giveaway, we've teamed up with <a href=\"https://gridstudio.cc/\">GRID Studio</a> to offer <em>MacRumors</em> readers a chance to win a 256GB <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> Max from Apple. For those unfamiliar with <a href=\"https://gridstudio.cc/products/iphone-1st-generation\">GRID Studio</a>, the company takes old, discarded Apple devices and turns them into clever artwork.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/GRID-1.jpg\" width=\"1348\" height=\"759\" />\r<br />\nEach of GRID Studio's pieces features a deconstructed Apple device with the components laid out underneath a glass frame. There are labels for each part, along with interesting and relevant historical facts and details.\r<br />\n\r<br />\nOne of GRID Studio's most popular offerings is the GRID 1, <a href=\"https://gridstudio.cc/products/iphone-1st-generation\">priced at $400</a>. The GRID 1 features the original Apple <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> from 2007, highlighting the components that made up what has become the most popular smartphone in the world. The iconic original ‌iPhone‌ casing is positioned next to the power button, headphone socket, speaker, logic board, ear piece, and other components, and this is before the days where Apple started making its own chips.\r<br />\n\r<br />\nThe GRID 4, <a href=\"https://gridstudio.cc/products/framed-iphone-4\">available for just $99</a>, is another great piece of Apple history. It highlights the ‌iPhone‌ 4, which is the first major redesign that Apple came out with. The GRID 4 includes the popular square-style frame that dictated several generations of ‌iPhone‌ design.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/GRID-iPhone4.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nGRID Studio's <a href=\"https://gridstudio.cc/products/grid%C2%AE-5\">$139 GRID 5</a> shows off the internal components from the 2012 ‌iPhone‌ 5. The ‌iPhone‌ 5 is notable because it was the first ‌iPhone‌ that was developed under Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a>, and the last ‌iPhone‌ that Apple CEO Steve Jobs was directly involved with. Compared to the ‌iPhone‌ 4s, the ‌iPhone‌ 5 brought a taller 4-inch display and it was also the first ‌iPhone‌ to feature a Lightning port.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/GRID-iPhone-5.jpg\" width=\"1816\" height=\"1022\" />\r<br />\nFor Apple Watch fans, GRID Studio has the <a href=\"https://gridstudio.cc/products/apple-watch-series-0\">$199 GRID Watch 1st Gen</a>, which features the components from the first Apple Watch that Apple released in April 2015. Apple Watches today still use the same design that Apple introduced with the original model, though the display has grown and the bezels have been slimmed down. The original Apple Watch included the S1 chip, Apple's first system-on-a-chip, and the first Apple Watch heart rate sensor.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/GRID-APPLE-WATCH.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nIn addition to art pieces featuring torn-apart devices, GRID Studio also sells a range of fun t-shirts that are aimed at Apple fans. The <a href=\"https://gridstudio.cc/products/grid%C2%AE-command-t-shirt\">$39 GRID Command t-shirt</a>, for example, features the command key design recreated with a series of rainbow Apple devices.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/Command-Tshirt.jpg\" width=\"1600\" height=\"900\" />\r<br />\nNow is a good time to check out the <a href=\"https://gridstudio.cc/\">GRID Studio website</a> because the company is hosting its autumn sale. From October 27 to October 29, the GRID 4 is available for $99, while all Apple A-series mobile processor artwork is priced at $79. All other items are available at a 15 percent discount with the promo code A15.\r<br />\n\r<br />\nGRID Studio will be providing one lucky <em>MacRumors</em> reader with a 256GB ‌iPhone 15 Pro‌ Max. To enter to win, use the widget below and enter an email address. Email addresses will be used solely for contact purposes to reach the winner(s) and send the prize(s). You can earn additional entries by subscribing to our <a href=\"https://my.leadpages.net/leadbox/145ef7173f72a2%3A104a9fa76b46dc/5754903989321728/\">weekly newsletter</a>, subscribing to our <a href=\"https://www.youtube.com/user/macrumors\">YouTube channel</a>, following us on <a href=\"https://twitter.com/macrumors\">Twitter</a>, following us on <a href=\"https://www.instagram.com/macrumors/\">Instagram</a>, or visiting the <em>MacRumors</em> <a href=\"https://www.facebook.com/MacRumors\">Facebook page</a>.\r<br />\n\r<br />\nDue to the complexities of international laws regarding giveaways, only <strong>U.S. residents who are 18 years or older, UK residents who are 18 years or older, and Canadian residents (excluding Quebec) who have reached the age of majority in their province or territory are eligible to enter</strong>. All federal, state, provincial, and/or local taxes, fees, and surcharges are the sole responsibility of the prize winner. To offer feedback or get more information on the giveaway restrictions, please refer to <a href=\"http://forums.macrumors.com/threads/macrumors-giveaways-why-are-they-only-open-to-u-s-residents.1918337/\">our Site Feedback section</a>, as that is where discussion of the rules will be redirected.\r<br />\n\r<br />\n<div><a href=\"https://gleam.io/Y31Ww/grid-studio-giveaway\">GRID Studio Giveaway</a>\r<br />\n</div>The contest will run from today (October 27) at 9:00 a.m. Pacific Time through 9:00 a.m. Pacific Time on November 3. The winner will be chosen randomly on or shortly after November 3 and will be contacted by email. The winner will have 48 hours to respond and provide a shipping address before a new winner is chosen.<div>Tag: <a href=\"https://www.macrumors.com/guide/giveaway/\">Giveaway</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/27/macrumors-giveaway-grid-studio-15-pro-max/\">MacRumors Giveaway: Win an iPhone 15 Pro Max From GRID Studio</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/macrumors-giveaway-win-an-iphone-15-pro-max-from-grid-studio.2408901/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f9e433629474aac1b5d9ff37a65276078c1ae15abff5c7c66bc4eb90fe70452a","category":"Apple"}