{"title":"OpenAI Board Forces Out Sam Altman, for Cause, but the Reasons Are as Yet Unstated","link":"https://openai.com/blog/openai-announces-leadership-transition","date":1700265461000,"content":"\n<p>OpenAI press release:</p>\n\n<blockquote>\n  <p>The board of directors of OpenAI, Inc., the 501(c)(3) that acts as \nthe overall governing body for all OpenAI activities, today \nannounced that Sam Altman will depart as CEO and leave the board \nof directors. Mira Murati, the company’s chief technology officer, \nwill serve as interim CEO, effective immediately. [...] </p>\n\n<p>Mr. Altman’s departure follows a deliberative review process by \nthe board, which concluded that he was not consistently candid in \nhis communications with the board, hindering its ability to \nexercise its responsibilities. The board no longer has confidence \nin his ability to continue leading OpenAI. </p>\n</blockquote>\n\n<p>By corporate board standards, that statement is absolutely <a href=\"https://www.threads.net/@pkafka/post/CzwsxEYvnVu\">scathing</a>. There’s widespread speculation some sort of scandal must be a scandal at the heart of this, but no word yet what.</p>\n\n<p><a href=\"https://twitter.com/sama/status/1725631621511184771\">Altman, on Twitter/X</a>:</p>\n\n<blockquote>\n  <p>i loved my time at openai. it was transformative for me \npersonally, and hopefully the world a little bit. most of all i \nloved working with such talented people. </p>\n\n<p>will have more to say about what’s next later. </p>\n\n<p>🫡 </p>\n</blockquote>\n\n<p>That all-lowercase style is consistent for Altman’s personal tweets, but man does it look extra fucking silly in a post like this one.</p>\n\n<p>Just last week <a href=\"https://www.youtube.com/watch?v=U9mJuUkhUzk\">Altman hosted OpenAI’s first DevDay keynote</a> (where <a href=\"https://daringfireball.net/linked/2023/11/07/openai-devday-keynote\">he did great</a>), and Cade Metz reports for The New York Times, as late as <em>yesterday</em> <a href=\"https://www.nytimes.com/2023/11/17/technology/openai-sam-altman-ousted.html\">Altman was still publicly representing OpenAI</a>:</p>\n\n<blockquote>\n  <p>On Thursday evening, Mr. Altman appeared at an event in Oakland, \nCalif., where he discussed the future of art and artists now that \nartificial intelligence can generate images, videos, sounds and \nother forms of art on its own. Giving no indication that he was \nleaving OpenAI, he repeatedly said he and the company would \ncontinue to work alongside artists and help to ensure their future \nwould be bright. </p>\n\n<p>Earlier in the day, he appeared at the Asia-Pacific Economic \nCooperation CEO Summit in San Francisco with Laurene Powell Jobs, \nwho is the founder and president of the Emerson Collective, and \nexecutives from Meta and Google. </p>\n</blockquote>\n\n<p>(Altman also <a href=\"https://twitter.com/sama/status/1722766374588830101\">just publicly dunked on Elon Musk</a>. I’m sure Musk will just let it slide.)</p>\n\n<p>Lastly, Altman, despite being credited as a co-founder, <a href=\"https://finance.yahoo.com/news/sam-altman-says-doesn-t-204324251.html\">has no equity in OpenAI</a>. Meta, for example, <a href=\"https://www.businessthink.unsw.edu.au/articles/mark-zuckerberg-Meta-shareholders\">can’t fire Zuckerberg</a> — <a href=\"https://www.vox.com/2017/6/13/15788892/alphabet-shareholder-proposals-fair-shares-counted-equally-no-supervote\">same deal for Google with Larry Page and Sergey Brin</a> — but OpenAI could sack Altman with a board vote because he owns <em>none</em> of it, much less a controlling interest.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/11/17/openai-altman-sacked\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"f9e8531ec0e55c44a81d7d2f97909216c0654c14d061ccf6ea7af798d9be5e2d","category":"Tech"}