{"title":"The changing meaning of “no” in Canadian sex work","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301600","date":1712239200000,"content":"<p>by Lynn Kennedy</p>\r\n\r\nWith the migration of sex workers to online advertising in Canada, a substantial body of research has emerged on how they communicate with prospective clients. However, given the enormous quantity of archival material available, finding representative ways to identify what sex workers say is a difficult task. Numerical analysis of commonly used phrases allows for the analysis of large numbers of documents potentially identifying themes that may be missed using other techniques. This study considers how Canadian sex workers communicate by examining how the word “no” was used by online advertisers over a 15-year period. Source materials consisted of three collections of online classified advertising containing over 4.2 million ads collected between 2007 and 2022 representing 214456 advertisers. Advertisers and demographic variables were extracted from ad metadata. Common terms surrounding the word “no” were used to identify themes. The word “no” was used by 115127 advertisers. Five major themes were identified: <i>client reassurance</i> (54084 advertisers), <i>communication</i> (47130 advertisers), <i>client race</i> (32612 advertisers), <i>client behavior</i> (23863 advertisers), and <i>service restrictions</i> (8545 advertisers). The probability of there being an association between an advertiser and a major theme was found to vary in response to several variables, including: time period, region, advertiser gender, and advertiser ethnicity. Results are compared with previous work on race and risk messaging in sex work advertising and factors influencing <i>client race</i> restrictions are considered. Over time, the restriction related themes of <i>client behavior</i>, <i>service restrictions</i>, and <i>client race</i> became more prominent. Collectives, multi-regional, cis-female, and Black or Mixed ancestry advertisers were more likely to use restrictions.","author":"Lynn Kennedy","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"f9ee9b4f3c1573cbdf256016904ae0d33468567572c39702d71f888ddb2d25d7","category":"Interdisciplinary"}