{"title":"Food and social cues modulate reproductive development but not migratory behavior in a nomadic songbird, the Pine Siskin","link":"https://academic.oup.com/auk/article/doi/10.1093/ornithology/ukae006/7590656?rss=1","date":1706313600000,"content":"<span><div>Abstract</div>Many animals rely on photoperiodic and non-photoperiodic environmental cues to gather information and appropriately time life-history stages across the annual cycle, such as reproduction, molt, and migration. Here, we experimentally demonstrate that the reproductive physiology, but not migratory behavior, of captive Pine Siskins (<span>Spinus pinus</span>) responds to both food and social cues during the spring migratory-breeding period. Pine Siskins are a nomadic finch with a highly flexible breeding schedule and, in the spring, free-living Pine Siskins can wander large geographic areas and opportunistically breed. To understand the importance of non-photoperiodic cues to the migratory-breeding transition, we maintained individually housed birds on either a standard or enriched diet in the presence of group-housed heterospecifics or conspecifics experiencing either the standard or enriched diet type. We measured body condition and reproductive development of all Pine Siskins and, among individually housed Pine Siskins, quantified nocturnal migratory restlessness. In group-housed birds, the enriched diet caused increases in body condition and, among females, promoted reproductive development. Among individually housed birds, female reproductive development differed between treatment groups, whereas male reproductive development did not. Specifically, individually housed females showed greater reproductive development when presented with conspecifics compared to heterospecifics. The highest rate of female reproductive development, however, was observed among individually housed females provided the enriched diet and maintained with group-housed conspecifics on an enriched diet. Changes in nocturnal migratory restlessness did not vary by treatment group or sex. By manipulating both the physical and social environment, this study demonstrates how multiple environmental cues can affect the timing of transitions between life-history stages with differential responses between sexes and between migratory and reproductive systems.</span>","author":"","siteTitle":"Ornithology Current Issue","siteHash":"4b42e15d9ceec568e037973cb16bc8a0448c103c6eaf3f714117d3650f8eefe7","entryHash":"f9fa89400c3d827c1edd541e65ba69ba13bb97347efd7eca9c439ac09b5cce9e","category":"Environment"}