{"title":"Chronic anthropogenic disturbance mediates the biodiversity‐productivity relationship across stand ages in a large temperate forest region","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14588?af=R","date":1709702618000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/7a837128-5ca3-42f6-81c4-07ccad366591/jpe14588-toc-0001-m.png\" alt=\"Chronic anthropogenic disturbance mediates the biodiversity-productivity relationship across stand ages in a large temperate forest region\" />\n<p>Chronic human disturbance in a large temperate forest region reduces the increase in community productivity due to different facets of biodiversity, especially in young forests. The evidence suggests that the mitigation of chronic human disturbance and the conservation of biodiversity will be effective in sustaining essential ecosystem functions.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nTemperate forests, especially those in the densely populated regions of the world, are experiencing increasing levels of habitat degradation and biological impoverishment due to subtle but pervasive chronic anthropogenic disturbances including frequent and continuous grazing and extraction of non-timber forest products. However, the effects of these subtle, chronic disturbances on the biodiversity-productivity relationship have rarely been examined especially in forests at different development stages. Accordingly, this study explores how chronic anthropogenic disturbance affects the relationship between tree species diversity and forest productivity at different stand development stages in a large temperate forest region.\n\nWe used the human footprint index as a proxy for chronic human disturbance. Hierarchical Bayesian models were employed to assess the effects of chronic human disturbance on the relationship between tree diversity and forest productivity across different stand age. Several measures of diversity were employed, including taxonomic, functional and phylogenetic diversity.\n\nForest productivity consistently increased with taxonomic, functional and phylogenetic biodiversity; these biodiversity facets were the main drivers of forest productivity compared to stand age, chronic human disturbance and climate. However, the magnitude at which productivity increases with the increments of taxonomic and functional diversity diminishes with the increasing chronic disturbance, especially in younger stands. The effects of phylogenetic diversity on productivity did not vary with chronic disturbance, regardless of stand age.\n\n<i>Synthesis and applications</i>: Chronic human disturbance in a large temperate forest region reduces the increase in community productivity due to different facets of biodiversity, especially in young forests. The evidence suggests that the mitigation of chronic human disturbance and the conservation of biodiversity will be effective in sustaining essential ecosystem functions.\n</p>","author":"Senxuan Lin, \nChunyu Fan, \nJuan Wang, \nChunyu Zhang, \nXiuhai Zhao, \nKlaus von Gadow","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"f9fef1faf2ab86376e5d436f487e4101e59bc9fddd91dba2d98ba71720e4c458","category":"Environment"}