{"title":"Review: Ember's Travel Mug 2 Won't Get Lost With Find My Integration","link":"https://www.macrumors.com/review/ember-travel-mug-2/","date":1689359057000,"content":"Ember earlier this year introduced a new version of its electric Travel Mug, adding a key Apple feature - <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> support. You might be wondering, why does a mug need ‌Find My‌? I'm not sure I have a great explanation, but it's a nice-to-have add-on for a product that's positioned as a small luxury.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Ember-Mug-16x9.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nThe Ember Travel Mug 2 is $200, and the reason it's so expensive is because it's self-heating. It can keep a beverage at your desired temperature for three hours while on the go, or all day when on the included charging coaster. The temperature can be set from 120°F to 145°F, which is hot, but not likely to cause burns.\r<br />\n\r<br />\nI have no insight into coffee temperatures as a non-coffee drinker, but some internet research suggests that's an ideal coffee temperature range. I know there are some people out there who like coffee <em>really</em> hot, but if on the higher end of warm works for you, this cup will get coffee to a level you like.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/ember-mug-led.jpg\" alt width=\"2000\" height=\"1500\" />\r<br />\nWhile I don't drink coffee, I do drink tea, and because I drink green, oolong, and white varieties, I'm fairly well-versed on beverage temperatures. 150 to 160 degrees is in the burn your tongue range. For me, 145 is uncomfortably warm, and 138 is just about right. By default, the Ember Mug is set to 135, but you can turn it up to 145 or down on the cup itself or in the app.\r<br />\n\r<br />\nDesign wise, the Ember Mug looks like your average travel cup. It has a soft touch silicone exterior in black and a stainless steel interior that holds 12 ounces of liquid. 12 ounces is on the smaller side for a travel cup and I do wish that it held more, but it needs to fit in a cup holder and have space for the battery, heating elements, and other hardware.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/ember-mug-charger.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThere's a logo at the top of the Ember Mug that can be interacted with to control the mug, and a series of LEDs at the bottom that let you know the status of the cup, the temperature, whether the cup is empty, and whether the battery has died. The Ember Mug knows when liquid is inside, and it immediately detects the temperature of what's poured in.\r<br />\n\r<br />\nYou can swipe to change the temperature of the Ember on the mug itself, or in the app. It's easiest to adjust the temperature on the cup if you like to make regular changes, but if you just need to set it on your favorite temperature, it's quick to do within the app. The app is decent, and there are presets for different beverages like 135 degrees for coffee, and 131 degrees for a latte. Some of the temperature choices feel a little arbitrary, but all of the presets are editable.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/ember-mug-app.jpg\" alt width=\"2000\" height=\"1984\" />\r<br />\nThere's a tea timer in case you want to brew tea in the mug, and a recipes section that has a handful of drink options. There is a health integration feature that can estimate the amount of caffeine that you're consuming per day by how often you refill the Ember Mug.\r<br />\n\r<br />\nSince this is a travel cup, it works with a battery. The battery lasts for approximately three hours, give or take about 20 minutes. My testing was primarily at 138 degrees, and the cup was able to keep it at that exact temperature until the battery ran down. It charges via a charging base that needs to be plugged in, and if the cup is on the base, it can keep a drink warm all day.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/ember-mug-temperature.jpg\" alt width=\"4032\" height=\"2268\" />\r<br />\nIf you're using it at a desk, it's handy to have it on the charger for all-day heat, and the option to grab it and go when necessary is useful. I'm a slow drinker so I can exhaust that three hour battery life, and I appreciate the always-on charger option. The Ember Mug's charger is unfortunately not USB so I have to have a separate cable plugged in to an outlet, which I'm not a fan of. I'd prefer being able to power it through a dock/my computer but that is not an option.\r<br />\n\r<br />\nThe Ember Mug is not double walled and when the battery runs out, it's not going to keep a drink warm for long. Compared to a much cheaper tumbler with insulation, like a Yeti, the Ember Mug has pros and cons. It doesn't keep a drink warm without power and it's expensive, but it can keep a drink at a specific temperature for an extended length of time, which can't be replicated by an insulated cup.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/ember-mug-battery.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nIf I pour 175 degree tea into a Yeti, I have to open the lid and wait for it to cool down, or wait for a long time for it to be drinkable. With the Ember Mug, it gets to my preferred temperature much quicker, and stays there. The Ember Mug is also able to heat up a beverage that has cooled down, so you can pour lukewarm coffee in it to heat it back up, though this takes a lot of time and doesn't seem to be the best use case.\r<br />\n\r<br />\nIn terms of functionality, there are some things to be aware of. The Ember Mug uses a press down lid, which I like because it doesn't seem to leak at all, but is easy to drink from. If I toss the Ember Mug in a bag, it doesn't drip, which isn't always the case with travel cups. You do need to make sure not to fill it fuller than the line at the interior of the cup, but it seems to work well when filled properly.\r<br />\n\r<br />\nIf the Ember Mug has been upside down or moved around a lot, there can be some pressure build up and some tiny droplets of liquid can fly upward a bit when you press down on the lid. Ember warns about this and suggests holding it away from your face when you press the lid, but it hasn't been a huge issue over the time that I've been using the cup. There is no hole for a straw, which I do miss. I like to use a glass straw for tea and similar hot beverages to avoid teeth staining, but the no-leak lid design doesn't accommodate that feature.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/ember-mug-lid-fill-line.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nUnsurprisingly, you cannot microwave the Ember Mug 2, nor can you put it in the dishwasher. The lid can go in the dishwasher, but the mug itself needs to be hand washed. The charging base needs to be kept dry, and before you put the cup on the base, you need to make sure the bottom is dry.\r<br />\n\r<br />\nBeyond keeping a drink warm, the Ember Mug 2 has ‌Find My‌ integration as a new selling point. You can add the Ember Mug to the Items tab in the ‌Find My‌ app, where it can be tracked just like an AirTag. The ‌Find My‌ network that the Ember Mug uses takes advantage of any nearby <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> to relay the mug's position, so if it gets lost, you can track it down.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/ember-mug-find-my.jpg\" alt width=\"2000\" height=\"1984\" />\r<br />\nMisplacing a travel mug seems a lot more uncommon than losing keys or a wallet, but I guess it does happen, especially if you're taking the Ember to multiple locations on a regular basis. I let the Ember Mug's battery die and then I waited a full 48 hours to see how long the ‌Find My‌ feature would work, and ‌Find My‌ was still functional at that point.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/ember-mug-in-hand.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThe Ember Mug is designed with some power reserve, so even when the cup is no longer heating up because of a low battery, it's still locatable with ‌Find My‌. It also goes into a sleep mode when there's no liquid inside to heat up, which preserves battery. I was concerned that ‌Find My‌ would stop working when the battery was exhausted, but there seems to be a window of time where you can locate the cup with a low battery.\r<br />\n\r<br />\nI don't think ‌Find My‌ is an essential feature for a drinking vessel, but it is absolutely nice to have on a cup that costs $200. It's also not a feature you'd expect to see in a mug, so if you have it in a bag that's then stolen or misplaced, you can track it all down with no one being the wiser.\r<br />\n\r<br />\n<h2>Bottom Line</h2>\r<br />\nIt's hard to justify a $200 smart travel cup because there are \"dumb\" travel cups that do almost as much for a fraction of the price, but I do think the Ember Mug is <em>worth</em> $200 price that it sells for.\r<br />\n\r<br />\nThe actual design of the mug is solid - it fits well in a cup holder, it has a sleek look, and the lid is easy to drink from and doesn't seem to leak. It holds temperature for long enough to drink a cup of coffee or all day if you have it on the charging base, it supports touch control, and it has a ton of LEDs for status updates. Who doesn't want a cup that says Hello in the morning, lets you know the specific temperature of your beverage and adjusts with a swipe? It also won't be easy to lose with the ‌Find My‌ integration.\r<br />\n\r<br />\nMy biggest complaint about the Ember Mug is probably the size. It would be nice to have an XL version that holds more liquid, because while I do like to enjoy a hot beverage for many hours, I'd like to not have to refill as frequently. Aside from that, the Ember Mug has so many bells and whistles that it's hard to complain about anything but the price.\r<br />\n\r<br />\nIf you often lose cups, either at work or in the car, ‌Find My‌ will has the potential to be a useful feature addition. You'll either be able to track the Ember Mug or it will show its last known location so you can figure out where it's at.\r<br />\n\r<br />\nThe Ember Mug is not a device that anyone <em>needs</em>, but I think hot beverage enjoyers will get a lot out of it. It's also the type of product that you can buy for someone who has everything, and I would not hesitate to give it as a gift. I do want to point out that the desktop version of the Ember Mug is $150, so $50 less, plus it holds more. On the downside, it only works for 80 minutes off of the charger, but it is a good alternative if you plan to use the Ember primarily at a desk.\r<br />\n<h2>How to Buy</h2>\r<br />\nThe Ember Mug 2 can be <a href=\"https://ember.com/products/ember-travel-mug-2\">purchased from the Ember website</a> for $199.99.\r<br />\n\r<br />\n<em><small>Note: Ember provided MacRumors with an Ember Travel Mug 2 for the purpose of this review. No other compensation was received.</small></em><br />This article, \"<a href=\"https://www.macrumors.com/review/ember-travel-mug-2/\">Review: Ember's Travel Mug 2 Won't Get Lost With Find My Integration</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/review-embers-travel-mug-2-wont-get-lost-with-find-my-integration.2395925/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fa032eca04e711953ae4b020f4beb82497dd313183d04f12bcf3ba1c9cad7cc0","category":"Apple"}