{"title":"195 Effect of selection for growth and maternal influence on crossbred Angus heifer development","link":"https://academic.oup.com/jas/article/102/Supplement_3/348/7757049?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This multiyear experiment was designed to determine the effects of sire yearling weight (YW) and maternal influence (MILK) expected progeny differences (EPD) on production and fertility of beef replacement heifers. Sires were classified as moderate (&lt; 50th percentile) or high for YW EPD (122 ± 29; from 79 to 172) and as low (&lt; 50th percentile) or high for MILK EPD (27 ± 8; from 5 to 40). Fall-born (n = 214) and spring-born (n = 207) heifers were enrolled in the study. Birth weight (BW), weaning weight (WW), and YW of the heifers were measured. In addition, reproductive tract score (RTS), dry matter intake (DMI), and average daily gain (ADG) while consuming an unprocessed grass hay diet were determined in a subsample of enrolled heifers. Neogen Igenity Beef scores (NIBS) were also run on this subset. Pregnancy rate and conception rate at fixed timed artificial insemination (FTAI) were also determined. Adjusted BW, WW and YW and RTS were analyzed using the GLIMMIX procedure of SAS (9.4, SAS Institute Inc., Cary, NC), with YW and MILK EPD as fixed effects and year of birth as random effect. Effects of sire YW and MILK classification on the likelihood of pregnancy and successful FTAI were also analyzed using the GLIMMIX procedure of SAS. Pearson correlation coefficients between independent and dependent variables were obtained using the CORR procedure of SAS. Sire MILK EPD had no effect (<span>P</span> ≥ 0.13) on the body weight of fall- or spring-born heifers. However, fall-born heifers were 0.12 kg and 0.34 kg heavier (<span>P</span> = 0.06 and 0.001, respectively) per unit increase in sire YW EPD at weaning and yearling time, respectively. There was no effect of sire YW EPD on fall-born heifer DMI as percentage of body weight (DMI % BOW; <span>P</span> = 0.74) nor ADG (<span>P</span> = 0.90) while consuming the low-energy diet. Spring-born heifers had significantly greater (all, <span>P</span> ≤ 0.001) adjusted BW, WW, and YW (0.02, 0.23 and 0.37 kg per unit increase in sire YW EPD, respectively. Reproductive tract score was strong and negatively correlated (<span>P</span> ≤ 0.001) with DMI % BOW. Heifer YW NIBS were moderate and positively correlated (<span>P</span> &lt; 0.001) with ADG. There was a tendency (<span>P</span> = 0.09) for a weak and negative correlation between residual feed intake genetic scores and DMI % BOW. Sire genetic merit for yearling growth was transmitted to replacement heifers. However, neither ADG, nor unprocessed forage DMI % BOW was influenced by genetic potential for growth during this study. Further research is needed to assess the benefits of using genomic profile of heifers for maternal, performance and carcass traits, alongside sire EPDs, when selecting and developing beef replacement heifers.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"fa167adffe1ecb234db30dedda1f628ebc598da1f32a843516dccf1c3855a218","category":"Environment"}