{"title":"President Biden in Valley Forge: ‘Democracy Is Still a Sacred Cause, and There’s No Country in the World Better Positioned to Lead the World Than America’","link":"https://www.youtube.com/watch?v=qL-ergKmXNE","date":1704603480000,"content":"\n<p>Remarkable speech by President Biden, on the eve of the third anniversary of Trump’s Capitol insurrection:</p>\n\n<blockquote>\n  <p>Let’s be clear about the 2020 election. Trump exhausted every \nlegal avenue available to him to overturn the election. Every one, \nbut the legal path just took Trump back to the truth, that I’d won \nthe election and he was a loser. </p>\n\n<p>Well, so knowing how his mind works now, he had one, he had one \nact left. One desperate act available to him, the violence of \nJanuary the sixth. </p>\n\n<p>Since that day, more than 1,200 people have been charged with \nassault in the Capitol. Nearly 900 of them have been convicted or \npled guilty. Collectively to date, they have been sentenced to \nmore than 840 years in prison. </p>\n\n<p>What’s Trump done? Instead of calling them criminals, he’s called \nthese insurrectionists patriots. They’re patriots. And he promised \nto pardon them if he returns to office. Trump said that there was \na lot of love on January the sixth. </p>\n\n<p>The rest of the nation, including law enforcement, saw a lot of \nhate and violence. </p>\n</blockquote>\n\n<p><a href=\"https://apnews.com/article/biden-speech-valley-forge-trump-campaign-bda2293cac2b30e49157c2e6fb256d64\">The AP has a transcript</a>, but I suggest watching it. Biden gets it. Democracy <em>is</em> our sacred cause. It’s that simple. Trump lost, and he tried his ham-fisted best to stay in office anyway. Quoting Biden: “We all know who Donald Trump is. The question we have to answer is: Who are we?”</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/06/biden-valley-forge\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"fa2b83230ed87154021d4b1be9b7bbeea50046079aecdca74fe2022a6b9497c2","category":"Tech"}