{"title":"Enhancing the accuracy and efficiency of Pacific walrus (<i>Odobenus rosmarus divergens</i>) surveys: A comparison of visual and aerial imagery-based counts at coastal haulouts","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307416","date":1721138400000,"content":"<p>by Alexey V. Altukhov, Natalia V. Kryukova, Irina S. Trukhanova, Vladimir N. Burkanov</p>\r\n\r\nThis study presents a semi-automated approach utilizing unoccupied aerial vehicle (UAV) surveys to accurately estimate the abundance of Pacific walruses at large coastal haulouts in Chukotka, Russia. Seven major haulout sites were surveyed during the summers and falls of 2017–2019. Walrus counts were performed using three distinct methods: traditional visual land-based counts, complete head counts utilizing georeferenced UAV imagery, and counting walruses within model polygons within the haulout outline and employing various extrapolation techniques to predict walrus abundance across the haulout area. The results indicated that traditional visual counts neither yielded consistent results nor allowed for uncertainty estimation, unlike the site- and date-specific direct extrapolation method and the non-specific linear regression model. These latter methods consistently provided estimates, on average, within 5% of the \"true\" abundance determined through complete photo-based head counts. Beside yielding accurate estimates, these semi-automated methods significantly reduced counting time by at least 63%, in contrast to complete head counts. The non-specific model, which allowed the estimation of walrus abundance based on the type of the terrain and the haulout area was less accurate compared with site and date specific estimates, but provided a tool to estimate abundance when no field visits are conducted, e.g., by using high-resolution satellite imagery to measure haulout area. This model revealed that the haulouts located on flat sandy beaches exhibited mean walrus densities approximately 30.5% times higher than those on rocky shores surrounded by cliffs: 0.879 (SD = 0.1302) and 0.648 (SD = 0.1753) walrus per m<sup>2</sup> correspondingly. The estimated daily walrus abundance at major Chukotkan haulouts in 2017–2019 ranged between 15 and 94,660 (mean = 10,397, SD = 14,477) walruses with the maximum seasonal abundances reported at Cape Serdtse-Kamen as 94,960 on 10-Oct-2017, 26,850 on 10-Oct-2018, and 87,595 on 10-Oct-2019.","author":"Alexey V. Altukhov","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fa2cc2b1b375218d5190456c5d11e0d83da4a60a3b37e6f5e7a41a4de836b4ff","category":"Interdisciplinary"}