{"title":"Southern Ocean food-webs and climate change: A short review and future directions","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000358","date":1710165600000,"content":"<p>by José P. Queirós, Renato Borras-Chavez, Noémie Friscourt, Jasmin Groß, Candice B. Lewis, Georgia Mergard, Katie O’Brien</p>\r\n\r\nFood-webs are a critical feature of ecosystems and help us understand how communities will respond to climate change. The Southern Ocean is facing rapid and accelerating changes due to climate change. Though having evolved in an isolated and somewhat extreme environment, Southern Ocean biodiversity and food-webs are among the most vulnerable. Here, we review 1) current knowledge on Southern Ocean food-webs; 2) methods to study food-webs; 3) assessment of current and future impacts of climate change on Southern Ocean food-webs; 4) knowledge gaps; and 5) the role of Early Career Researchers (ECRs) in future studies. Most knowledge on Southern Ocean food-webs come from the pelagic environment, both at macro- and microbial levels. Modelling and diet studies of individual species are major contributors to the food-web knowledge. These studies revealed a short food-web, predominantly sustained by Antarctic Krill (<i>Euphausia superba</i>). Additionally, alternative pathways exist, involving other krill species, fish, and squid, which play equally important roles in connecting primary producers with top predators. Advantages and disadvantages of several techniques used to study Southern Ocean food-webs were identified, from the classical analyses of stomach contents, scats, or boluses to the most recent approaches such as metabarcoding and trophic-biomarkers. Observations show that climate change can impact the food-web in different ways. As an example, changes to smaller phytoplankton species can lengthen the food-web, increasing assimilation losses and/or changing nutrient cycles. Future studies need to focus on the benthic-dominated food-webs and the benthopelagic coupling. Furthermore, research during the winter season and below the ice-shelves is needed as these areas may play a crucial role in the functioning of this ecosystem. ECRs can play a significant role in advancing the study of Southern Ocean food-webs due to their willingness for interdisciplinary collaboration and proficiency in employing various methodologies, contributing to the construction of high-resolution food-webs.","author":"José P. Queirós","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"fa3059b474f60aceba9488a8b5e0bafe30b51d7b6a9b4b73c9a0f89ac8239952","category":"Environment"}