{"title":"How the effect of earthworms on soil organic matter mineralization and stabilization is affected by litter quality and stage of soil development","link":"http://link.springer.com/10.1007/s10533-024-01182-8","date":1728086400000,"content":"<h3>Abstract</h3>\n                  <p>Globally soil fauna consumes about half of the annual litter fall. An important question is how this activity affects the mineralization and stabilization of soil organic matter. Here we explore how much earthworms influence the decomposition of litter and the stabilization of organic matter in soils at various stages of soil development (various soil age) that are supplied with litter of various quality. The laboratory mesocosms consist of litter and a mineral layer. The mineral soils originated either from spruce and alder stands growing either on post-mining soils (young soils after about 50 years of soil development) or from soils in the close vicinity of post-mining sites (mature soils with several thousand years of soil development), the mineral soils were supplied by matching litter, the mesocosms were either without earthworms or with two individuals of earthworms. The earthworm effect showed statistically significant interaction with tree and soil age: earthworms increased respiration in both alder soils, but in spruce soils only in mature soil, while the opposite was true for young soils. In general, earthworms promoted the removal of litter from the soil surface and carbon accumulation in the mineral soil. Earthworms promoted C storage in mineral associated organic matter (MAOM), especially in young spruce soils. The results suggested that earthworm activity in young soils which were far from saturation (spruce on post-mining soils) promotes soil C sequestration by promoting C storage in MAOM, whereas earthworms in mature, C saturated soils tend to promote soil respiration. More broadly, earthworms effect on soil depends on stage of soil C saturation.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"fa35981014b948c870f4432ce60c498d983d673c8d37c777d2291c87f2c344cb","category":"Environment"}