{"title":"★ Margrethe Vestager Met With Tim Cook Yesterday, But I Doubt Anything Happened","link":"https://daringfireball.net/2024/01/vestager_cook","date":1705191000000,"content":"\n<p>European Commission chief Margrethe Vestager is on the West Coast meeting with U.S. tech executives. Here’s her entire statement on meeting Tim Cook at Apple Park, <a href=\"https://twitter.com/vestager/status/1745693612262953300\">posted on Twitter/X</a> (I’m surprised she posts on a U.S.-based platform, rather than one of the popular E.U. social networks):</p>\n\n<blockquote>\n  <p>2 main points from my meeting w/ @tim_cook @apple ⬇️ </p>\n\n<p>👉 compliance w/ #DMA, e.g. @Apple’s obligation to allow the \ndistribution of #apps outside the @AppStore </p>\n\n<p>👉 ongoing @EU_Competition cases e.g. @AppleMusic </p>\n</blockquote>\n\n<p>There are so many meetings and negotiations where I’d pay a veritable fortune to have been a fly on the wall. Vestager meeting with Cook this week was <em>not</em> one. My guess is that absolutely nothing interesting was said. Nothing but platitudes.</p>\n\n<p>The deadline for compliance with the DMA is March 7, and the big issue for Apple is the App Store: allowing native apps to be installed from outside the store (a.k.a. sideloading), and allowing alternative in-app payment methods. My understanding is that Apple has everything prepared for compliance, but, exactly what that’s going to look like, seemingly no one outside the company knows.</p>\n\n<p>We know nothing about how Apple plans to allow sideloading. I expect that even for users in the E.U., sideloading will be off by default. I also expect that, unlike the Mac, sideloaded apps will still need to be signed by Apple. Will apps distributed through the App Store allow third-party in-app payment processing, or will that only be available to sideloaded apps? I further presume, that just like when Apple complied with Dutch regulations specific to dating apps, third-party apps that implement their own payment processing for in-app purchases will be required to provide Apple with detailed accounting and pay Apple a 27% commission.</p>\n\n<p>Will sideloading <em>only</em> be available within the E.U., or will Apple implement the same policies worldwide? For the most part Apple tries to keep things the same worldwide, but sideloading is such an exception that I expect them to region-lock it to the E.U. Especially given that stipulation that Apple needs to permit sideloaded apps to act as app stores themselves. How is <em>that</em> going to work?</p>\n\n<p>I expect that Apple has designed sideloading in such a way that very few users will enable it. (This seems to be largely the case on Android, which has permitted off-by-default sideloading from its inception.) I also expect that Apple will still demand 27% of in-app purchase revenue from apps that choose to implement their own payment processing.</p>\n\n<p>Basically, I don’t think much will change for E.U. users, or for developers. But a lot of people — including Vestager and the European Commission — expect a <em>lot</em> to change. It’s just not clear at all exactly what Apple needs to allow to comply with the DMA, nor do any of us outside Cupertino have any idea what Apple plans to do. Complying with the <em>letter</em> of the DMA does not mean capitulating to the <em>spirit</em> of the DMA. The idea that Apple is going to roll over and give up on steering their own platform the way they feel best benefits both their own bottom line, and <a href=\"https://www.apple.com/privacy/docs/Building_a_Trusted_Ecosystem_for_Millions_of_Apps_A_Threat_Analysis_of_Sideloading.pdf\">their users’ experience/privacy/security</a>, is naive.</p>\n\n<p>The European Commission expected that the GDPR would result in websites prioritizing the privacy of E.U. users — a better web in Europe than elsewhere. Instead, the result was increased user annoyance under a nonstop daily barrage of consent popovers — a <em>worse</em> web in Europe than elsewhere. I suspect the same will prove true of the DMA and mobile platforms. Fireworks are coming, but it seems like few people know it.</p>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"fa4e11abe7f0460117a2edd24c67933461fc87e6a54de12e29be5bae990f3f24","category":"Tech"}