{"title":"Impact of persistently high sea surface temperatures on the rhizobiomes of Zostera marina in a Baltic Sea benthocosms","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17337?af=R","date":1716295708000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3acd85b8-ae1b-4bab-9fc3-0b8233296ef7/gcb17337-toc-0001-m.png\" alt=\"Impact of persistently high sea surface temperatures on the rhizobiomes of Zostera marina in a Baltic Sea benthocosms\" />\n<p>The effects of chronic heating, in <i>Zostera marina</i> microbiomes, emerged earlier in the warming treatment compared with the natural seasonal warming. There were structural and compositional variations of the associated microbiome particularly in bacteria associated with nitrogen, sulfur, and carbon cycles. Those changes were probably due to a major die-off in the plants subject to chronic heating. These major microbiome changes were registered before the major die-off. Seagrass monitoring and conservation programs should integrate results from such research to identify early warning indicators of the seagrass physiological state and prevent the extinction of vulnerable populations under a global change scenario.</p>\n<br />\n<h2>Abstract</h2>\n<p>Persistently high marine temperatures are escalating and threating marine biodiversity. The Baltic Sea, warming faster than other seas, is a good model to study the impact of increasing sea surface temperatures. <i>Zostera marina</i>, a key player in the Baltic ecosystem, faces susceptibility to disturbances, especially under chronic high temperatures. Despite the increasing number of studies on the impact of global warming on seagrasses, little attention has been paid to the role of the holobiont. Using an outdoor benthocosm to replicate near-natural conditions, this study explores the repercussions of persistent warming on the microbiome of <i>Z. marina</i> and its implications for holobiont function. Results show that both seasonal warming and chronic warming, impact <i>Z. marina</i> roots and sediment microbiome. Compared with roots, sediments demonstrate higher diversity and stability throughout the study, but temperature effects manifest earlier in both compartments, possibly linked to premature <i>Z. marina</i> die-offs under chronic warming. Shifts in microbial composition, such as an increase in organic matter-degrading and sulfur-related bacteria, accompany chronic warming. A higher ratio of sulfate-reducing bacteria compared to sulfide oxidizers was found in the warming treatment which may result in the collapse of the seagrasses, due to toxic levels of sulfide. Differentiating predicted pathways for warmest temperatures were related to sulfur and nitrogen cycles, suggest an increase of the microbial metabolism, and possible seagrass protection strategies through the production of isoprene. These structural and compositional variations in the associated microbiome offer early insights into the ecological status of seagrasses. Certain taxa/genes/pathways may serve as markers for specific stresses. Monitoring programs should integrate this aspect to identify early indicators of seagrass health. Understanding microbiome changes under stress is crucial for the use of potential probiotic taxa to mitigate climate change effects. Broader-scale examination of seagrass–microorganism interactions is needed to leverage knowledge on host–microbe interactions in seagrasses.</p>","author":"Tânia Aires, \nCatarina Cúcio, \nJanina Brakel, \nFlorian Weinberger, \nMartin Wahl, \nAna Teles, \nGerard Muyzer, \nAschwin H. Engelen","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"fa4f294b146d4fcdece457e06931ac1548b2c7f82625bf35779d82e462c3219e","category":"Environment"}