{"title":"Combining acoustic telemetry with archival tagging to investigate the spatial dynamic of the understudied pollack, Pollachius pollachius","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15750?af=R","date":1714094378000,"content":"<h2>Abstract</h2>\n<p>Combining fish tracking methods is a promising way of leveraging the strengths of each approach while mitigating their individual weaknesses. Acoustic telemetry provides presence information as the fish move within receiver range, eliminating the need for tag recovery. Archival tags, on the other hand, record environmental variables on tag retrieval, enabling continuous path reconstruction of a fish beyond coastal regions. This study capitalizes on the combination of both methods for geolocating pollack, <i>Pollachius pollachius</i>, an understudied species of the northeast Atlantic, where declining stocks are raising concern. Essential knowledge of population structure and connectivity between essential habitats is critically lacking and could help inform stock assessment and management. The aims of the study were (1) to evaluate the feasibility of double-tagging pollack, known for being challenging to tag, and (2) to track seasonal movements across the Channel to gain first insights into pollack spatial ecology. In 2022, an extensive network of acoustic receivers was been deployed in the Channel along the French, English, and Belgian coasts as part of the Fish Intel project. We tagged 83 pollack with acoustic transmitters, among which 48 were double-tagged with data storage tags. Post-tagging survival assessment, conducted on a subset of 35 individuals, revealed a successful procedure with a 97% short-term survival rate. By October 2023, the acoustic telemetry network detected 30 out of 83 pollack at least once, with no large-scale movements observed across the Channel. Presence in the network fluctuates seasonally, peaking in summer, particularly among immature fish. Integrating acoustic detections with temperature and depth time series in a geolocation model enabled trajectory reconstruction of 10 recaptured pollack, seven of which were detected by the network. This combined tracking approach revealed coastal movements along the coast of Brittany in France, highlighting the ecological significance of the Iroise Sea for pollack throughout the year, particularly in summer. The geolocation model also suggested movements towards the entrance of the western Channel. This study highlights the complementarity of acoustic telemetry and archival tagging in reconstructing fish movements in their natural environment. As data accumulate, these innovative tracking methods promise to continually unveil new insights into the spatial ecology of the understudied pollack, which is essential for the species' management.</p>","author":"Marine Gonse, \nMartial Laurans, \nJustus Magin, \nTina Odaka, \nJean‐Marc Delouis, \nStéphane Martin, \nFrançois Garren, \nColine Lazard, \nMickael Drogou, \nThomas Stamp, \nPeter Davies, \nAlice Hall, \nEmma Sheehan, \nMathieu Woillez","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"fa55143fbb9627e3f26625365e3ac3fc7eeda621fef6521db5df3d8dbefa4568","category":"Environment"}