{"title":"Department of Justice and FTC Looking Into Beeper iMessage Controversy","link":"https://www.macrumors.com/2023/12/22/doj-and-ftc-looking-into-beeper-controversy/","date":1703255745000,"content":"The United States Department of Justice (DOJ) and Federal Trade Commission (FTC) are intensifying their investigations into Apple's alleged anti-competitive practices following the recent blocking of the iMessage for Android app Beeper Mini, the <em><a href=\"https://www.nytimes.com/2023/12/22/technology/apple-iphone-beeper-mini.html\">New York Times</a></em> reports.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/Beeper-Mini-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nFollowing calls from a bipartisan group of senators for a DOJ investigation into the matter, Beeper founder Eric Migicovsky reportedly met with DOJ antitrust lawyers on Tuesday, December 12. The DOJ is currently embroiled in a four-year-long investigation into Apple's alleged anticompetitive conduct.\r<br />\n\r<br />\nThe <em>New York Times</em> also suggested that the FTC is involved, pointing to a <a href=\"https://www.ftc.gov/policy/advocacy-research/tech-at-ftc/2023/12/interoperability-privacy-security\">blog post</a> published yesterday by the commission warning that it will evaluate \"privacy and security\" justifications for refusing to interoperate with other companies' technology:<blockquote>In the face of concerns about anticompetitive conduct, companies may claim privacy and security reasons as justifications for refusing to have their products and services interoperate with other companies' products and services. As an agency that enforces both competition and consumer protection laws, the Commission is uniquely situated to evaluate claims of privacy and data security that implicate competition.</blockquote>\r<br />\n\r<br />\nBeeper <a href=\"https://www.macrumors.com/2023/12/05/beeper-mini-brings-imessage-to-android/\">launched Beeper Mini</a> earlier this month, aiming to bridge the gap between Android and iMessage. Apple quickly moved to shut down the app, <a href=\"https://www.macrumors.com/2023/12/10/apple-confirms-it-shut-down-beeper-mini/\">citing security concerns</a> and unauthorized access to its iMessage servers.\r<br />\n\r<br />\nDespite multiple attempts by Beeper to circumvent Apple's restrictions, the company has now effectively <a href=\"https://www.macrumors.com/2023/12/21/beeper-mini-jailbreak-iphone-last-effort/\">admitted defeat</a>, touting jailbroken iPhones as the final solution to keep the service up and running amid an acknowledgement of the unsustainable nature of its efforts. While Apple has consistently defended its actions as necessary for maintaining user security and the integrity of its services, increased attention from two major regulatory bodies indicates the seriousness of ongoing antitrust allegations against the company.<div>Tags: <a href=\"https://www.macrumors.com/guide/nytimes-com/\">New York Times</a>, <a href=\"https://www.macrumors.com/guide/imessage/\">iMessage</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">Apple Antitrust</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/22/doj-and-ftc-looking-into-beeper-controversy/\">Department of Justice and FTC Looking Into Beeper iMessage Controversy</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/department-of-justice-and-ftc-looking-into-beeper-imessage-controversy.2414405/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fa565fa18cbe4359f3d8e5874e0778c46973f9d1801526775fa8852eb3a63292","category":"Apple"}