{"title":"Does nuclear secrecy make us more secure? New book offers counterargument","link":"https://arstechnica.com/?p=1760295","date":1619732706000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/alexwTOP-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/alexwTOP.jpg\">Enlarge</a> <span>/</span> A \"Restricted Data\" classification stamp on a document from the US Atomic Energy Commission in the early 1950s. The document pertains to the classification of opacity calculations that were part of the work on the hydrogen bomb. The document is no longer classified and is available in the US National Archives. (credit: <a href=\"https://commons.wikimedia.org/wiki/File:Restricted_Data_stamp.jpg\">Alexander Wellerstein/CC-BY-3.0</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The revolutionary <a href=\"https://www.aps.org/publications/apsnews/200712/physicshistory.cfm\">discovery of nuclear fission</a> in December 1938 helped launch the Atomic Age, bringing with it a unique need for secrecy regarding the scientific and technical underpinnings of nuclear weapons. This secrecy evolved into a special category of proscribed information, dubbed \"<a href=\"https://en.wikipedia.org/wiki/Restricted_Data\">Restricted Data,</a>\" which is still in place today. Historian Alex Wellerstein spent over 10 years researching various aspects of nuclear secrecy, and his first book, <em><a href=\"https://press.uchicago.edu/ucp/books/book/chicago/R/bo15220099.html\">Restricted Data: The History of Nuclear Secrecy in the United States</a></em> (University of Chicago Press), was released earlier this month.</p>\n<p><a href=\"https://arstechnica.com/science/2020/12/that-time-physicist-john-wheeler-left-classified-h-bomb-documents-on-a-train/\">Wellerstein is a historian of science</a> at the Stevens Institute of Technology in New Jersey, where his research centers on the history of nuclear weapons and nuclear history. (Fun fact: he served as a <a href=\"https://io9.gizmodo.com/its-a-fine-line-between-historical-fact-and-fiction-on-1739904960\">historical consultant</a> on the short-lived TV series <a href=\"https://en.wikipedia.org/wiki/Manhattan_(TV_series)\"><em>Manhattan</em>.</a>) A self-described \"dedicated archive rat,\" Wellerstein maintains several homemade databases to keep track of all the digitized files he has accumulated over the years from official, private, and personal archives. The bits that don't find their way into academic papers typically end up as items on his blog, <a href=\"http://blog.nuclearsecrecy.com\">Restricted Data</a>, where he also maintains the <a href=\"https://nuclearsecrecy.com/nukemap/\">NUKEMAP</a>, an <a href=\"https://en.wikipedia.org/wiki/NUKEMAP\">interactive tool</a> that enables users to model the impact of various types of nuclear weapons on the geographical location of their choice.</p>\n<p>The scope of Wellerstein's thought-provoking book spans the scientific origins of the atomic bomb in the late 1930s all the way through the early 21st century. Each chapter chronicles a key shift in how the US approach to nuclear secrecy gradually evolved over the ensuing decades—and how it still shapes our thinking about nuclear weapons and secrecy today. </p></div><p><a href=\"https://arstechnica.com/?p=1760295#p3\">Read 29 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1760295&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fa5f4e87c4f9d4793dd223dd51f7817c4010f1537c124df7c3f9a53ce889d9d8","category":"Tech"}