{"title":"PSIII-14 Effect of a combined supplementation of Bacillus spp. and lactic acid bacteria probiotics on growth performance and fecal score in nursery pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/300/7664916?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>This experiment was conducted to evaluate the effect of a combined supplementation of <span>Bacillus</span> spp. and lactic acid bacteria probiotics on growth performance and fecal score in nursery pigs. <span>Bacillus</span> spp. probiotics have been shown to improve the proliferation of lactic acid bacteria in the gut of piglets. A total of 45 newly weaned piglets (initial body weight = 8.37 ± 1.38 kg; weaning age = 27.2 ± 1.05 d) were allotted to 3 treatments in 3 replicates with 5 pigs per pen based on body weight, gender, and breed for a 28-d feeding trial. Treatments were: 1) Control: no probiotic supplementation, 2) PB: <span>Bacillus</span> spp. probiotic supplementation, and 3) PBL: <span>Bacillus</span> spp. and lactic acid bacteria probiotic supplementation. The <span>Bacillus</span> spp. probiotic consisted of <span>Bacillus subtilis</span> and <span>Bacillus licheniformis</span> and was supplemented to the PB and PBL diets at the recommended level (3.2 × 10<sup>9</sup> CFU/kg diet). The lactic acid bacteria probiotic consisted of <span>Lactobacillus acidophilus</span>, <span>plantarum</span>, <span>casei</span>, and <span>Enterococcus faecium</span> strains and was supplemented to the diets at the recommended level (4 and 2 × 10<sup>7</sup> CFU/kg diet for Phase 1 and 2, respectively). Corn-soybean meal-based diets were used for d 0-15 (Phase 1) and d 15-28 (Phase 2) postweaning. Growth performance and fecal score (1 = normal, 4 = severe diarrhea) were measured in each phase. In the Phase 1 (d 0-15 postweaning), average daily gain tended to be greater in the PBL treatment compared with the Control treatment (<span>P</span> = 0.13; 0.268 and 0.210 kg/d, respectively), and average daily feed intake tended to be greater in the PBL treatment compared with the Control and PB treatments (<span>P</span> = 0.12; 0.385, 0.375, and 0.424 kg/d for the Control, PB, and PBL treatments, respectively). In the overall period (d 0-28 postweaning), average daily feed intake tended to be greater in the PBL treatment compared with the PB treatment (<span>P</span> = 0.07; 0.651 and 0.596 kg/d, respectively), and gain to feed ratio in the PB treatment tended to be greater compared with the Control and PBL treatments (<span>P</span> = 0.10; 0.618, 0.649, and 0.620 kg/d for the Control, PB, and PBL treatments, respectively). Fecal score was significantly improved in both PB and PBL treatments compared with the Control treatment from d 7 postweaning (<span>P</span> = 0.08) to the end of experiment (<span>P</span> &lt; 0.05; 1.75, 1.41, and 1.42 for the Control, PB, and PBL treatments, respectively). In conclusion, both lactic acid bacteria and <span>Bacillus</span> spp. probiotic supplementation to nursery diets may have potential to improve growth rate and feed intake in early nursery period and probiotic supplementation could improve fecal consistency of weaning pigs in the nursery period.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"fa63a45e6d4214bf36a1c62f05c087c3fa38692cdc3a7af77cb9a970d07e8ac9","category":"Environment"}