{"title":"GQ Shits the Bed","link":"https://www.washingtonpost.com/media/2023/07/05/gq-pulled-david-zaslav-article/","date":1688750340000,"content":"\n<p>Will Sommer, reporting for The Washington Post:</p>\n\n<blockquote>\n  <p>In an unusual step, GQ magazine removed an article critical of\npowerful media executive David Zaslav from its website just hours\nafter it was published Monday, following a complaint from Zaslav’s\ncamp. [...] At one point, Bailey compared Zaslav to tyrannical\n“Succession” patriarch Logan Roy. “In a relatively short period of\ntime, David Zaslav has become perhaps the most hated man in\nHollywood,” Bailey wrote.</p>\n\n<p>A Zaslav spokesman complained to GQ about the story soon after it\nwas published, according to people close to the process who spoke\non the condition of anonymity to preserve confidences. By early\nafternoon on Monday, the magazine had made extensive edits to the\nstory. [...]</p>\n\n<p>Bailey told The Washington Post that, after GQ made the changes,\nhe asked editors to remove his byline. He said an editor told him\nthat GQ would not keep an article on its website without the\nauthor’s name. By Monday afternoon, the article was removed\nentirely from the site.</p>\n</blockquote>\n\n<p>Humiliating cowardice on the part of GQ’s editors. The <a href=\"https://archive.is/ftmBd\">original article</a> was harsh but accurate. It had some zingers, yes, but it was mostly just a factual list of the actual shitty and stupid things Zaslov has done since he took the helm of new Warner Bros Discovery conglomerate. Why would GQ do this? There’s a wee bit of a bad smell with this:</p>\n\n<blockquote>\n  <p>GQ has a corporate connection to Warner Bros. Discovery. The\nmagazine’s parent company, Condé Nast, is owned by Advance\nPublications, a major shareholder in Warner Bros. Discovery.\nAdvance Publications did not respond to a request for comment.</p>\n</blockquote>\n\n<p>But over at Variety, <a href=\"https://variety.com/2023/film/news/gq-editor-david-zaslav-story-producing-movie-warner-bros-1235662109/\">Tatiana Siegel uncovers the stench</a>:</p>\n\n<blockquote>\n  <p>GQ editor-in-chief Will Welch is producing a movie at Warner Bros.\ntitled “The Great Chinese Art Heist,” which is based on a 2018 GQ\narticle by Alex W. Palmer. [...] Sources say Welch was involved in\nthe discussions surrounding the removal of Bailey’s initial story\nand made the call to pull the revamped story, which ran some 500\nwords shorter than the published version. Those same sources say\nWarner Bros. Discovery complained about the initial story to two\nGQ editors, one of whom was Welch.</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/07/07/gq-shits-the-bed\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"fa64eca6f06b47df9a99fa9b82518c5ea7e5b9096465fc6b6b4ee64dd1118257","category":"Tech"}