{"title":"What determines participation in sport for older adults in England: A multilevel analysis of Active Lives data","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301790","date":1712239200000,"content":"<p>by Andrew Brinkley, Gavin Sandercock, Ruth Lowry, Paul Freeman</p>\r\n\r\nPhysical inactivity within an ageing population is an ongoing public health concern for policymakers. Engagement in sport forms a foundation of policy designed to encourage physical activity participation and improve health and wellbeing. This study aimed to (i) understand the extent to which older adults participate in sport and the (ii) correlates that predict this involvement within an English population sample of older adults. A further aim was (iii) to examine the extent in which sports participation may vary due to the opportunity provided across Active Partnerships in England. To address this, a multi-level analysis framed through COM-B was conducted of the 2021 English Active Lives dataset (i.e., during the COVID-19 pandemic). The Active Lives survey provides population-level insight into sport, exercise, and physical activity participation across England. It samples upwards of <i>n</i> = 180,000 participants beyond the age of 16 years and asks questions on factors that influence participation. Our findings drawn from a sample of <i>n</i> = 68,808 older adults (i.e., &gt;60-years of age) indicate that when accounting for variation across regions sports participation was significantly predicted by age (<i>β</i> = -.246, <i>p</i> = .040) and multiple deprivation (<i>β</i>  = .706, <i>p</i> = .030). Further, our analysis suggests sports participation across regions is associated with changes in the perceptions of opportunity to participate (<i>β</i> = -28.70, <i>p</i> = .001). As the UK transitions from the COVID-19 pandemic, findings have implications for the promotion of sports participation for older adults, in that local, regional, and national stakeholders must do more to change perceptions of social and physical opportunity within an ageing population. This may be achieved through adaptations to the recreational sporting landscape, raising awareness, and supportive policy changes on a national level.","author":"Andrew Brinkley","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fa69a53d1019232dd20a773ac57852cdbd64b3d2624f30e78d76708eb680d25a","category":"Interdisciplinary"}