{"title":"EELS Quantification of Ca and Y Segregation Behaviors in Magnesium Aluminate Spinel","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.684/7719774?rss=1","date":1721779200000,"content":"<span>Doping in ceramic materials, even at parts per million (ppm) levels, and subsequent grain-boundary (GB) segregation can have tremendous effects on several properties such as mechanical, electronic, magnetic, and optical properties as well as sintering and annealing behaviors with grain growth [<a href=\"#ozae044.684-B1\">1</a>]. However, due to the low concentration typically used for doping to avoid secondary phase formation, the detailed characterization of the segregation behaviors can be challenging. Some aspects of interest that can help to close the knowledge gap between the segregation behaviors and the observed enhanced properties mentioned above are the segregation levels, spatial distribution of segregants and host atoms at GBs, and the exact position of individual doping atoms at the GBs. In the case of complex oxides, such as magnesium aluminate spinel (MAS, MgAl<sub>2</sub>O<sub>4</sub>), where two different types of cations sublattices are present (tetrahedral Mg<sup>2+</sup> and octahedral Al<sup>3+</sup> sites), determination of the dopant site occupancies within these two sublattices is highly important to elucidate the effect of doping on the GB properties. For example, previous studies by Cao et al. [<a href=\"#ozae044.684-B2\">2</a>] have demonstrated that the GB fracture toughness can be increased up to 30% of that in the undoped condition by doping Yb<sup>3+</sup> cations. However, when a different dopant element Eu<sup>2+</sup> is used, the change in the GB fracture toughness is negligible [<a href=\"#ozae044.684-B3\">3</a>]. Therefore, in this study, MAS was doped with two inexpensive and earth-abundant cations Y<sup>3+</sup> and Ca<sup>2+</sup> to study the segregation behaviors by quantitative electron-energy loss spectrometry (EELS), and to correlate with the mechanical behaviors.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"fa762d142fbe1682971eb1e5ed9cfd92f037537f950b4fdf24b6d6bb6209bc3d","category":"Environment"}