{"title":"Whole‐genome analysis reveals phylogenetic and demographic history of Eurasian perch","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15821?af=R","date":1718840894000,"content":"<h2>Abstract</h2>\n<p>The contemporary diversity and distribution of species are shaped by their evolutionary and ecological history. This can be deciphered with the help of phylogenetic and demographic analysis methods, ideally combining and supplementing information from mitochondrial and nuclear genomes. In this study, we investigated the demographic history of Eurasian perch (<i>Perca fluviatilis</i>), a highly adaptable teleost with a distribution range across Eurasia. We combined whole-genome resequencing data with available genomic resources to analyse the phylogeny, phylogeography, and demographic history of <i>P</i>. <i>fluviatilis</i> populations from Europe and Siberia. We identified five highly diverged evolutionary mtDNA lineages, three of which show a strong signal of admixture in the Baltic Sea region. The estimated mean divergence time between these lineages ranged from 0.24 to 1.42 million years. Based on nuclear genomes, two distinct demographic trajectories were observed in European and Siberian samples reflecting contrasting demographic histories ca. 30,000–100,000 years before the present. A comparison of mtDNA and nuclear DNA evolutionary trees and AMOVA revealed concordances, as well as incongruences, between the two types of data, most likely reflecting recent postglacial colonization and hybridization events. Overall, our findings demonstrate the power and usefulness of genome-wide information for delineating historical processes that have shaped the genome of <i>P</i>. <i>fluviatilis</i>. We also highlight the added value of data-mining existing transcriptomic resources to complement novel sequence data, helping to shed light on putative glacial refugia and postglacial recolonization routes.</p>","author":"Vitalii Lichman, \nMikhail Ozerov, \nMaría‐Eugenia López, \nKristina Noreikiene, \nSiim Kahar, \nLilian Pukk, \nOksana Burimski, \nRiho Gross, \nAnti Vasemägi","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"fa889b11bce4c74c4c16be9ed81e9fb2e3a1044135226f73d086b01a5d1a9d1b","category":"Environment"}