{"title":"Sex-specific phosphorus (P)-use and -acquisition in dioecious Populus euphratica under different soil moisture levels","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae064/7716137?rss=1","date":1721260800000,"content":"<span><div>Abstract</div>Dioecious plants show sexual dimorphism in their phosphorus (P) availability responses. However, the understanding of sex-specific strategies for P utilization and acquisition under varying soil moisture levels remains unclear. Here, we assessed a range of root functional traits, soil P properties, total foliar P concentration ([P]) and leaf chemical P fractions—inorganic P ([Pi]), metabolite P ([PM]), lipid P ([PL]), nucleic acid P ([PN]) and residual P ([PR])—as well as other leaf functional traits in female and male trees under different soil moisture levels (25% for high and 7% for low). Our results showed that females had larger specific root length under well-watered conditions, resulting in greater root foraging capacity. This led to a 36.3% decrease in soil active [Pi] in the rhizosphere and a 66.9 % increase in total foliar [P], along with all five foliar chemical P fractions ([Pi], [PM], [PL], [PN] and [PR]) compared with males. However, males exhibited significantly higher photosynthetic P utilization efficiency than females. Especially under low soil moisture levels, males exhibited a significant reduction in soil active organic P, coupled with a large increase in the exudation of soil phosphatases and carboxylates. Furthermore, the proportion of [PM] in total foliar [P] was 42.0% higher in males than in females. Mantel and Spearman correlation analyses revealed distinct coordination and trade-offs between foliar P fraction allocation and below-ground P acquisition strategies between the two sexes. Leveraging these sex-specific strategies could enhance the resilience of dioecious populations in forest plantations facing climate-induced variability.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"fa8c08f4a195962096e40f92a732ad16d77036563e9a7cbf533520e9485b865a","category":"Environment"}