{"title":"I paid AU$120 for Shimano’s 100th anniversary book and I wish I hadn’t","link":"https://cyclingtips.com/2021/09/i-paid-au120-for-shimanos-100th-anniversary-book-and-i-wish-i-hadnt/","date":1630673755000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Shimano-100-anniversary-book-4-650x366.jpg\" /></div><h2>I paid AU$120 for Shimano’s 100th anniversary book and I wish I hadn't</h2><p>\n</p><p>On March 22, 2021, Shimano’s 100th anniversary countdown clock was nearing its final hours and rumours were running rife about what might be announced when the timer reached zero. Mountain bikers swore we’d see XTR Di2, roadies thought Dura-Ace 12-speed would finally be unveiled, and the fishermen thought something reel great was to come. </p>\n\n\n\n<p>The countdown ended, and in an overhyped marketing initiative that <a href=\"https://cyclingtips.com/2019/03/cyclings-most-important-change-in-30-years-oh-trek-you-tease/\" target=\"_blank\">only Trek has managed to rival</a>, the released product was … <a href=\"https://cyclingtips.com/2021/03/shimano-unveils-ultra-limited-centennial-product/\" target=\"_blank\">a book</a>. However, it wasn’t just any book; it was a limited-edition book that you could only get by entering a lottery. Enter your details, and await the chance to buy one. </p>\n\n\n\n<p>And so I figured I’d jot my name down and see what happened. Would I be one of the select few to win the ability to pay 10,000 yen (about US$90 / AU$120) for a book? Or would I miss out and one day feel the desire to buy said book on eBay for 10x the original price? I certainly didn’t want to do that.</p>\n\n\n\n<h2>June 7, 2021</h2>\n\n\n\n<p>The day came. My email inbox went from 88 to 89 unread emails. In it, a strangely text-based email that looked like a very niche kind of spam or fraud told me I’d won the lottery and I could pre-order my limited edition Shimano book. What were the chances?!</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Shimano-100-1340x754.jpg\" /><figcaption>The email that told me my luck had arrived. A part of me thought that scam emails were getting oddly specific. </figcaption></figure>\n\n\n\n<p>I jumped in early thinking that, one day, I’d tell my grandkids about this.</p>\n\n\n\n<p>Then a transaction error stopped me from being able to give away my credit card details to a Japanese-based site. At first I took this as a sign that I was better off not spending 10,000 yen on a book I knew nothing about. I closed the browser and thought I’d do my good deed for the day by letting the fine folks at Shimano Japan know their system was broken. I expected nothing more.</p>\n\n\n\n<p>Exactly 21 minutes later I got a response telling me the system was fixed. OK, maybe one more try. Success. I had won the lottery, I’d beaten the faulty system, and I was now one of the lucky few to be waiting for my ultra-limited book to be published. </p>\n\n\n\n<p>The 10,000 yen conversion came through on my credit card. AU$122.18 with the international transaction fee. Ouch. But also, limited edition, right?</p>\n\n\n\n<p>And then the thread in the CyclingTips VeloClub Slack group began. “Anyone else win the lottery?” asked one member. Ping, ping, ping, ping, came the positive responses. </p>\n\n\n\n<p>Immediately it became clear – VeloClub members are the luckiest people in the world! </p>\n\n\n\n<p>OK, I can hear the skeptics out there. I mean, sure, it’s possible Shimano merely said the book was limited edition and then set up a lottery, and then went on to print exactly the number of pre-orders it received. Kind of like a Kickstarter product, but with more mystery and less communication. You skeptics, you. Why can’t you just believe in miracles? </p>\n\n\n\n<h2>September 1, 2021 </h2>\n\n\n\n<p>Another text-based scam-like email entered my inbox. “Your book has shipped.” Oh my, this is actually happening! And it was being shipped with DHL – “This won’t take long,” I thought to myself.</p>\n\n\n\n<h2>September 3, 2021 (today)</h2>\n\n\n\n<p>My mobile phone rings. It’s Michael, my DHL delivery guy. Like usual I go to meet him outside because we’re now on first-name basis and he no longer rings my bell. Yes, that’s his real name. Yes, I see him quite often. Yes, he’s my favourite courier. Yes, I gave him a Christmas present. </p>\n\n\n\n<p>The white unbranded box Michael hands me is far bigger than expected. I open it. I find another box within, this time black and with branding. I open it; it’s my AU$122.18 in hardcover paper form. </p>\n\n\n\n<div>\n<div>\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Shimano-100-anniversary-book-2-1340x754.jpg\" /><figcaption>A box within a box. This is going to be good. </figcaption></figure>\n</div>\n\n\n\n<div>\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Shimano-100-anniversary-book-3-1340x754.jpg\" /><figcaption>A piece of limited edition protective paper hides between the book and box. </figcaption></figure>\n</div>\n</div>\n\n\n\n<p>I flick open the book in excitement, half expecting an insignia showing how limited my limited-edition book is. Nothing. White page. Full page photo. White page. Full page photo. White page. Wait, an index page. OK, now the journey begins. </p>\n\n\n\n<p>I flick over to the next page, but yet again my eyes are greeted with a full page photo of a product with the year of its release in the top left hand corner. It looks like the cover of a Shimano dealer catalogue. There are no words. I have no words either. I flick to the next page; same theme, different product. </p>\n\n\n\n<p>This continues for another 275 pages. Product photo and year. Sometimes just a photo and no year. Sometimes nothing but a white page. And then back to product photo and year. </p>\n\n\n\n<p>Some of it is cycling and brings back a tiny tingle of nostalgia. “Cool, I don’t think I’ve ever seen that derailleur.” But before I know it I land on yet another photo of a fishing reel and once again I <a href=\"https://cyclingtips.com/2021/01/shimano-releases-2021-ultegra/\" target=\"_blank\">feel baited</a>. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Shimano-book.gif\" /><figcaption>A small example of the entire book.</figcaption></figure>\n\n\n\n<p>One hundred years of product photos and no words later I reach a dark photo of a bike built with the new <a href=\"https://cyclingtips.com/2021/08/new-shimano-dura-ace-di2-r9200-and-ultegra-di2-r8100-everything-to-know/\" target=\"_blank\">Ultegra R8100 groupset</a>. The end. </p>\n\n\n\n<p>I paid AU$122.18 for this. I wish I hadn’t. On the bright side I now own a nice double-page spread showing what new Dura-Ace looks like. That’s seemingly a whole lot closer to the new product than what a lot of bike shops can claim to be right now.</p>\n\n\n\n<p></p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/i-paid-au120-for-shimanos-100th-anniversary-book-and-i-wish-i-hadnt/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"fa91a29636232da3b07ef245d639be66dbfc5f7f0ec406200473d135eba1a7b5","category":"Cycling"}