{"title":"Early iPhone 16 Pro rumors point to the massive upgrade we’ve been waiting for","link":"https://www.macworld.com/article/1919496/iphone-16-pro-larger-display-periscope-camera-buttons.html","date":1684322100000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Now that we pretty much know everything there is to know about the <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15</a>, the rumors about the iPhone 16 are already rolling in. And once again, Apple is reportedly planning a major change to the Pro models.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://medium.com/@mingchikuo/%E9%AB%98%E5%81%89%E9%9B%BB%E5%AD%90%E7%82%BAsharp%E5%8F%AF%E8%83%BD%E9%80%80%E5%87%BAiphone-ccm%E4%BE%9B%E6%87%89%E9%8F%88-iphone-16%E6%93%B4%E5%A4%A7%E6%8E%A1%E7%94%A8%E6%BD%9B%E6%9C%9B%E9%8F%A1%E8%88%87apple-ar-mr%E4%BA%8C%E4%BB%A3%E4%B9%8B%E4%B8%BB%E8%A6%81%E5%8F%97%E7%9B%8A%E8%80%85-cowell-is-the-main-beneficiary-325b08865e24&amp;xcust=1-1-1919496-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Ming-Chi Kuo</a>, the iPhone 16 Pro’s display will be “slightly larger” than that of the 6.1-inch iPhone 15 Pro, which will allow it to gain a periscope zoom lens. The periscope lens, which will reportedly bring 6X optical zoom and up to 30X digital zoom, is expected to arrive in 2023, but only on the iPhone 15 Pro Max; a bump in size will be necessary to make room for it on the 16 Pro. For comparison, the current zoom lens on the iPhone 14 Pro and 14 Pro Max has a 3X optical zoom and 15X digital zoom.</p>\n\n\n\n<p>A previous report by DSSC CEO Ross Young claimed that the iPhone 16 Pro and 16 Pro Max would increase to <a href=\"https://www.macworld.com/article/1813308/iphone-16-pro-new-screen-size-6-2-6-8-inches.html\">6.3 inches and 6.9 inches</a> respectively. Those would be the largest Pro models since the line debuted with the introduction of the iPhone 11 Pro. Apple increased the screen sizes from 5.8 inches and 6.5 inches to 6.1 inches and 6.7 inches when the iPhone 12 arrived, but kept the same sizes for the 13 and 14 Pro, and the iPhone 15 Pro will reportedly be the same size as well.</p>\n\n\n\n<p>But with this latest rumor, the iPhone 15 Pro is suddenly a lot less appealing. Based on rumors, the iPhone 16 Pro will bring several features missing from this year’s phone, including:</p>\n\n\n\n<p><strong>Solid-state buttons:</strong> Apple reportedly scrapped the new buttons from the iPhone 15 Pro due to technical hurdles but will be bringing them to next year’s phone.</p>\n\n\n\n<p><strong>Under-display Face ID sensors:</strong> We’re not sure if the whole camera array will go under the screen just yet, but Apple will reportedly put at least some of the TrueDepth camera components under the display to decrease the size of the Dynamic Island.</p>\n\n\n\n<p><strong>Better battery life:</strong> As we saw with the Apple Watch Ultra, a few millimeters can make a huge difference in battery life. We expect the iPhone 15 Pro to use the extra room to increase the capacity of the battery and add at least an hour to our day.</p>\n\n\n\n<p>So don’t get too attached to the iPhone 15 Pro this year. There’s a good chance you’re going to want to upgrade as soon as the iPhone 16 arrives.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"fa9b4e1b5d60874a1f2f4eb6a3e5d2a3ea58158c21d1befa7f346a4e630f6eec","category":"Apple"}