{"title":"Honeycomb Cell Structures Formed in Drop-Casting CNT Films for Highly Efficient Solar Absorber Applications","link":"https://www.preprints.org/manuscript/202409.1955/v1","date":1727257540000,"content":"This study investigates the process of multi-walled carbon nanotube (MWCNT) coatings to enhance the lamp heating temperature for solar thermal absorption applications. The primary focus is studying the effects of self-organized honeycomb structures of CNTs formed on silicon substrates on different cell area ratios (CAR). The drop-casting process developed honeycomb-structured MWCNT-coated absorbers with varying CAR values ranging from ~ 60% to 17%. The optical properties were investigated within the visible (400-800 nm) and near-infrared (934-1651nm) wavelength ranges. Although fully coated MWCNT absorbers showed the lowest reflectance, honeycomb structures with a ~ 17% CAR achieved high-temperature absorption. These structures maintained  8.4% reflectance at 550 nm while dramatically increasing infrared reflection to 80.5% at 1321 nm. The performance of solar thermal was assessed throughout a range of irradiance intensities, from 0.04 W/cm² to 0.39 W/cm². The honeycomb structure with a ~17% CAR value consistently performed better than other structures by reaching the highest absorption temperatures (ranging from 52.5°C to 285.5°C) across all measured intensities. A direct correlation was observed between the reflection ratio (visible: 550 nm / infrared: 1321 nm) and temperature absorption efficiency, where lower reflection ratios were associated with higher temperature absorption. This study highlights the significant potential for the large-scale production of cost-effective solar thermal absorbers through the application of optimized honeycomb-structured absorbers coated with MWCNTs. These contributions enhance solar energy efficiency for applications in water heating and purification, thereby promoting sustainable development.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fa9bbf9712a5285feccb9bde901934e7599dd782d7ef647aa239d4910ff5001c","category":"Interdisciplinary"}