{"title":"Here’s what it’s like to charge an EV at Electrify America’s new station","link":"https://arstechnica.com/?p=2006606","date":1709143565000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/0227_EZ_flagship_charging_1250-800x533.jpg\" alt=\"A row of EVs charging at EA's flagship location in San Francisco\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/0227_EZ_flagship_charging_1250.jpg\">Enlarge</a> <span>/</span> A row of happy EVs charge with no drama, no phone calls to the support line, and no one shuffling spots. (credit: Roberto Baldwin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Bay Bridge, as usual, was a mess. The link between San Francisco and Oakland, even on the weekends, can be a source of gridlock-induced frustration. After navigating through the toll plaza and the tunnel on Yerba Buena Island (the sort of halfway point between the two cities), I checked my state of charge and made my way to Electrify America's flagship location in the City by the Bay (which is frankly both cities, but San Francisco has a better PR team).</p>\n<p>The past few months, electric vehicles have been making headlines. But not in a good way. News of major US automakers <a href=\"https://arstechnica.com/cars/2024/01/after-ditching-its-hybrids-gm-says-it-needs-to-build-more-hybrids/\">General Motors</a> and <a href=\"https://arstechnica.com/cars/2024/02/ford-rethinks-ev-strategy-is-working-on-a-smaller-cheaper-ev-platform/\">Ford</a> reducing their output goals has people screaming that electric vehicles are doomed (they're not). GM is still <a href=\"https://arstechnica.com/cars/2024/01/general-motors-is-still-struggling-with-new-evs-data-show/\">wading through manufacturing issues</a>, leading to a reduction in its ability to build EVs on its Ultium platform. Plus, there's the charging infrastructure, which, as detailed by just about every media outlet, is not great. Reliability issues are real and well-documented, and that's horrible for EV adoption. It's also bad for automakers and, more importantly, it's terrible for the planet.</p>\n<p>So it's comforting to get some good news: Electrify America has opened an indoor location in San Francisco, and it just might be the future of charging.</p></div><p><a href=\"https://arstechnica.com/?p=2006606#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2006606&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"faa7716f6ed56ef0e5e471aa07a772f5aa47d008d14098656fd09b434b04eda2","category":"Tech"}