{"title":"Assessing hypoxic respiratory failure in mechanically ventilated neonates: A comparative study of oxygen saturation index and oxygenation index","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304278","date":1717077600000,"content":"<p>by Son Bui-Binh-Bao, Dao Nguyen Thi, Linh Hoang Mai, Tam Do Ho Tinh, Thi Thanh Binh Nguyen</p>\r\nObjective <p>To investigate the correlation between oxygen saturation index (OSI) and oxygenation index (OI) for evaluating the blood oxygenation status in neonates with respiratory failure requiring mechanical ventilation support and to assess the predictive capability of OSI in determining clinically relevant OI cutoffs.</p> Methods <p>A prospective study was conducted on neonates who received invasive mechanical ventilation at the neonatal intensive care unit of tertiary hospital in Vietnam. Bland-Altman analysis was utilized to evaluate the agreement between OSI and OI.</p> Results <p>A total of 123 neonates, including both term and preterm infants, were included in the study. A high agreement rate of 94.3% within the 95% limits of agreement (between OI and OSI), with a narrow similarity value of 3.3 (95% CI: -5.1 to 11.8) and high correlation coefficient (r = 0.791, p&lt;0.001) was observed. The OSI cut-off value for predicting an OI of &gt;15 was determined to be 7.45, with a sensitivity of 100% and a specificity of 87.4% (AUC 0.955; 95% CI: 0.922–0.989, p &lt; 0.05). Similarly, an OSI cutoff value of 9.9 corresponded to an OI of 25, displaying a sensitivity of 100% and specificity of 87.4% (AUC 0.92). The receiver operating characteristic (ROC) curves for OSI exhibited statistically significant results (p &lt; 0.05).</p> Conclusion <p>The findings demonstrate a strong correlation between OSI and OI in neonates with respiratory failure. Furthermore, OSI, as a non-invasive method, can serve as a substitute for OI to evaluate the severity of hypoxic respiratory failure and lung injury in neonates.</p>","author":"Son Bui-Binh-Bao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fab1b5f895bb34a1b358335b215e1d95855ddae67278be0de62c02fbd4198eb4","category":"Interdisciplinary"}