{"title":"กูเกิลเปิดโครงการ Euphonia สร้างเสียงให้ผู้เป็นโรคกล้ามเนื้ออ่อนแรงกลับมาอีกครั้ง","link":"https://www.blognone.com/node/124499","date":1630347657000,"content":"<div><div><div><p>โรคกล้ามเนื้ออ่อนแรง (amyotrophic lateral sclerosis - ALS) เป็นโรคที่ทำให้ผู้ป่วยค่อยๆ ไม่สามารถควบคุมออกแรงกล้ามเนื้อไปเรื่อยๆ จนกระทั่ง ไม่สามารถขยับร่างกาย, พูด, ทานอาหาร, หรือหายใจได้ บุคคลหนึ่งในวงการวิทยาศาสตร์ที่เป็นโรคนี้คือ Stephen Hawking ที่ยังคงทำงานอย่างต่อเนื่องรวมถึงการบรรยายตามโอกาสต่างๆ ผ่านคอมพิวเตอร์แปลงข้อความเป็นเสียง ล่าสุดกูเกิลนำเสนอโมเดลปัญญาประดิษฐ์ใน<a href=\"https://www.blognone.com/node/109672\">โครงการ Euphonia</a> ช่วยแปลงข้อความเป็นเสียงของ Steve Gleason อดีตนักกีฬาอเมริกันฟุตบอล และผู้รณรงค์ถึงโรค ALS</p>\n<p>โมเดลที่กูเกิลนำเสนอคือ PnG NAT ที่รวมเอาสองโมเดลปัญญาประดิษฐ์ก่อนหน้านี้ คือ PnG BERT และ Non-Attentive Tacotron (NAT) เข้าเป็นโมเดลเดียวกัน</p>\n<p>โมเดลแปลงข้อความเป็นเสียงมักฝึกโดยอาศัยเสียงพูดของเจ้าของเสียงเอง แต่ปัญหาสำคัญของผู้ป่วย ALS คือเสียงที่อัดไว้มักจะเป็นช่วงที่มีอาการของโรคแล้ว ทำให้ไม่สามารถฝึกปัญญาประดิษฐ์สร้างเสียงเดิมก่อนมีอาการได้ แต่ NAT มีตัวทำนายช่วงเวลาของเสียง (phoneme duration) เปิดทางให้สามารถฝึกระยะของเสียงในแต่ละคำได้อย่างละเอียด</p>\n<p>กูเกิลสร้างเสียงพูดของ Steve Gleason โดยฝึก PnG BERT ด้วยเสียงของนักพูดมืออาชีพ 31 คน จากนั้นจูนโมเดลให้เป็นเสียง Gleason อีกครั้งด้วยเสียงของเขาเอง แต่เนื่องจากเสียงเป็นเสียงที่อัดไว้หลัง Gleason เริ่มมีอาการ ALS กูเกิลจึงฝึกโมเดลส่วน NAT ให้ใช้ช่วงเวลาของเสียงจากนักพูดมืออาชีพ เสียงสุดท้ายที่ได้จึงออกมาเป็นเสียง Gleason ที่แทบไม่แสดงอาการ ALS เลย</p>\n<p>กูเกิลระบุว่าใช้เทคโนโลยี PnG NAT ในบริการ Google Cloud Custom Voice สำหรับสร้างเสียงเฉพาะสำหรับลูกค้าแต่ละรายด้วย</p>\n<p>ที่มา - <a href=\"https://ai.googleblog.com/2021/08/recreating-natural-voices-for-people.html\">Google AI Blog</a></p>\n<p>วิดีโอเสียง Steve Gleason ทวนคำปาฐกถา \"ชายผู้โชคดีที่สุดในโลก\" ของ Lou Gehrig ผู้ป่วย ALS เมื่อปี 1939</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/google\">Google</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"fab60c8292ca73c68ce31219ccf7fcb6a8e637b730532cc322f7619bb4d87941","category":"Thai"}