{"title":"Exploring the Implications of Supply Chain Disruptions on Organizational Resilience","link":"https://www.preprints.org/manuscript/202406.0563/v1","date":1718020783000,"content":"Supply chain disruptions pose significant challenges to organizations, highlighting the critical importance of resilience in contemporary supply chains. This qualitative research explores the implications of supply chain disruptions on organizational resilience, drawing insights from interviews with supply chain managers and executives across various industries. The study identifies key factors that contribute to resilience, including agility, collaboration, risk management, strategic planning, technology integration, leadership, and organizational culture. Through thematic analysis, the research elucidates how these factors interact to enable organizations to manage and recover from disruptions effectively. Findings underscore the importance of agility in adapting to changing circumstances, collaboration with stakeholders to coordinate responses, and proactive risk management to anticipate and mitigate disruptions. Strategic planning and technology integration emerge as vital enablers of resilience, along with effective leadership and a resilient organizational culture that fosters adaptability and continuous improvement. The implications of supply chain disruptions extend beyond operational and financial impacts to include reputational and relational dimensions, emphasizing the importance of transparent communication and stakeholder engagement. The practical insights offered by this study provide guidance for organizations seeking to enhance their resilience and ensure continuity of operations in an increasingly complex and dynamic supply chain environment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fabd0c00a750ef5cd77da230fd81387dbfa319c2083f1ca8f08227e02f12ab5d","category":"Interdisciplinary"}