{"title":"Antimicrobial and anthelmintic effects of copper nanoparticles against Koi carp parasites and their toxicity","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.14003?af=R","date":1722318261000,"content":"<h2>Abstract</h2>\n<p>This study investigated the in vitro antimicrobial and anthelmintic effect of copper nanoparticles (CuNPs) against the bacterium <i>Aeromonas hydrophila</i>, the monogeneans <i>Dactylogyrus minutus</i>, <i>Dactylogyrus extensus</i>, <i>Gyrodactylus cyprini</i>, and the cestode <i>Schyzocotyle acheilognathi</i>, as well as their toxicity to <i>Cyprinus carpio</i> Koi. In the antimicrobial in vitro test, the inhibition zone method and minimum inhibitory concentration (MIC) were performed. In order to determine the time and efficacy of monogenean parasite mortality, the parasites were exposed to CuNP concentrations of 20, 50, 100, 150, 200, and 300 mg L<sup>−1</sup>, and a control group with tank water and one with copper sulphate pentahydrate (CuSO<sub>4</sub>.<sub>5</sub>H<sub>2</sub>O) at a concentration of 0.3 mg L<sup>−1</sup>, performed in triplicate. The parasites were observed every 10 min for 300 min, and mortality was recorded. For the cestodes, parasites were immersed in CuNP concentrations of 50, 100, 150, and 300 mg L<sup>−1</sup>. At the end of the in vitro tests, the anthelmintic efficacy of each treatment was calculated. To assess the tolerance and toxicity in fish, they were exposed to CuNP concentrations of 0.6, 1.25, 2.5, 5, 10, 20, and 50 mg L<sup>−1</sup> for 12 h. The MIC demonstrated that CuNPs effectively inhibited the growth of <i>A</i>. <i>hydrophila</i> up to a dilution of 12,500 mg L<sup>−1</sup> and showed an inhibition zone of 14.0 ± 1.6 mm for CuNPs. The results of anthelmintic activity showed a dose-dependent effect of concentration for both groups of parasites, with the most effective concentration being 300 mg L<sup>−1</sup> in 120 min. In the toxicity test, the carps showed tolerance to lower concentrations. The study indicated that CuNPs were effective against the studied pathogens. However, it proved to be toxic to fish at high concentrations. The use of low concentrations is recommended still requires further investigation.</p>","author":"Gracienhe Gomes dos Santos, \nLiseth Vanessa Perengue Riofrio, \nAna Paula Sousa, \nPaola Capistrano Santos, \nAlexandre Vaz Silva, \nEmilly Monteiro Lopes, \nDomickson Silva Costa, \nJucimauro de Araújo Pereira Júnior, \nGiulia Beatrice Ferreira, \nGraziella Vivine Gonçalves de Matos Silva, \nMarilia Tedesco, \nDiego José Nogueira, \nGabriela Tomas Jerônimo, \nMauricio Laterça Martins","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"fad058da6da7da52394af4bf6c6ed8f695fefee680297d46aac5e7ba29b86f09","category":"Environment"}