{"title":"157 Effects of increasing dietary protein concentration on digestibility of amino acids by growing pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/92/7665059?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Two experiments were conducted to test the hypothesis that the standardized ileal digestibility (SID) of amino acids (AA) by growing pigs is not influenced by dietary protein concentration if all AA are supplied by soybean protein isolate (SPI) or casein. In Exp. 1, cannulated pigs [n = 12; average body weight (BW) = 39.22 kg; SD = 3.96] were allotted to a replicated 6 × 3 Youden square design with the 6 diets and 3 periods. Five diets were formulated to contain 7 to 35% SPI. An N-free diet was also used. In Exp. 2, cannulated pigs (n = 24 average BW = 23.12 kg; SD = 2.89) were allotted a quadruplicated 6 × 2 Youden square design with the 6 diets and 2 periods. Five diets were formulated to contain 6.75 to 33.75% casein. An N-free diet was also used. Ileal digesta were collected and analyzed for dry matter (DM), Cr, and AA. The statistical models included diet as a fixed variable and square, animal, and period as random effects. Polynomial contrasts were used to test linear and quadratic effects of increasing dietary protein. Results from Exp. 1 indicated that the apparent ileal digestibility (AID) of DM linearly (<span>P</span> = 0.001) decreased and the AID of all AA quadratically (<span>P</span> &lt; 0.05) increased as the inclusion of SPI increased in the diets (Table 1). The SID of His and Trp was not affected by the inclusion of SPI in the diets. However, the SID of Arg, Leu, Lys, Phe, Thr, and Val linearly (<span>P</span> &lt; 0.05) decreased, and the SID of Ile and Met tended to linearly (<span>P</span> &lt; 0.10) decrease as the inclusion of SPI in the diets increased. Results from Exp. 2 indicated that the AID of DM tended to linearly decrease (<span>P</span> = 0.089) as the inclusion of casein increased in the diets (Table 2). The AID of most AA increased quadratically (<span>P</span> &lt; 0.01) and the AID of Trp tended to increase (quadratic, <span>P</span> = 0.068) with increasing inclusion rate of casein. The SID of most AA was independent of casein levels. In conclusion, the anti-nutritional factors may have been increased in the diets as the inclusion of SPI increased and thus resulted in reduced SID values. However, the SID values were not influenced by increasing dietary protein if all AA were supplied by casein that does not contain anti-nutritional factors. Therefore, it is concluded that pigs have the capacity to absorb peptides and AA with the same efficiency if the protein concentration is 30% as if it is 6%. Dietary protein concentration itself, therefore, is not likely to limit AA absorption. However, even small amounts of anti-nutritional factors appear to negatively impact the SID of AA.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"fad32aa1bdc9916b4dabec0b8f592cf4c208f62f6c32c51892cf5f3c3a7b7d23","category":"Environment"}