{"title":"Cigarette smoking combined with genetic variation regulates the m6A methylation of CRNKL1 and is associated with bladder cancer risk","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24138?af=R","date":1706181279000,"content":"<h2>Abstract</h2>\n<p>Cigarette smoking was known to accelerate the occurrence and development of bladder cancer by regulating RNA modification. However, the association between the combination of cigarette smoking and RNA modification-related single nucleotide polymorphisms (RNAm-SNPs) and bladder cancer risk remains unclear. In this study, 1681 participants, including 580 cases and 1101 controls, were recruited for genetic association analysis. In total, 1 287 990 RNAm-SNPs involving nine RNA modifications (m<sup>6</sup>A, m<sup>1</sup>A, m<sup>6</sup>Am, 2'-O-Me, m<sup>5</sup>C, m<sup>7</sup>G, A-to-I, m<sup>5</sup>U, and pseudouridine modification) were obtained from the RMVar database. The interactive effect of cigarette smoking and RNAm-SNPs on bladder cancer risk was assessed through joint analysis. The susceptibility analysis revealed that 89 RNAm-SNPs involving m<sup>6</sup>A, m<sup>1</sup>A, and A-to-I modifications were associated with bladder cancer risk. Among them, m<sup>6</sup>A-related rs2273058 in <i>CRNKL1</i> was associated with bladder cancer risk (odds ratios (OR) = 1.35, <i>p</i>\n<sub>adj</sub> = 1.78 × 10<sup>−4</sup>), and <i>CRNKL1</i> expression was increased in bladder cancer patients (<i>p</i> = 0.035). Cigarette smoking combined with the A allele of rs2273058 increased bladder cancer risk compared with nonsmokers with the G allele of rs2273058 (OR = 2.40, <i>p</i>\n<sub>adj</sub> = 3.11 × 10<sup>−9</sup>). Mechanistically, the A allele of rs2273058 endowed <i>CRNKL1</i> with an additional m<sup>6</sup>A motif, facilitating recognition by m<sup>6</sup>A reader IGF2BP1, thereby promoting <i>CRNKL1</i> expression under cigarette smoking (<i>r</i> = 0.142, <i>p</i> = 0.017). Moreover, elevated <i>CRNKL1</i> expression may accelerate cell cycle and proliferation, thereby increasing bladder cancer risk. In summary, our study demonstrated that cigarette smoking combined with RNAm-SNPs contributes to bladder cancer risk, which provides a potential target for bladder cancer prevention.</p>","author":"Jialei Yang, \nZihan Ji, \nFang Gao, \nJiajin Wu, \nMulong Du, \nZhengdong Zhang, \nLin Yuan, \nRui Zheng, \nMeilin Wang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"fad7729a82282fcebdbc47882ce65b93a41955edfc60af3df718ba2ba54b1896","category":"Environment"}