{"title":"Antibacterial Activity of Superhydrophobic-SiO2 Coatings to Inhibit the Growth of Escherichia coli and Staphylococcus aureus","link":"https://www.preprints.org/manuscript/202408.1170/v1","date":1724119083000,"content":"The emergence of superhydrophobicity-based antibacterial materials represents a promising approach to upholding surface cleanliness and hygiene, effectively preventing bacterial adhesion. This research describes the synthesis of a superhydrophobic coating with antibacterial and bacteriostatic properties using silica nanoparticles (SiO2 NPs) modified with 1H,1H,2H,2H-Perfluorodecyltriethoxysilane (PFDTES). TEM, XRD, EDS, SEM, and FTIR analyses were conducted to study its morphology and surface characterization. Additionally, the coating was applied on glass substrates using the spray coating method, varying the number of layers to evaluate antibacterial and bacteriostatic properties through turbidimetry and inhibition halo measurement techniques. The durability of the coatings was also assessed by exposing them to outdoor conditions for 35 days. This study aimed to evaluate the antibacterial capacity of the superhydrophobic coating and its weather resistance. The results demonstrate that a superhydrophobic coating with a contact angle ≥150° and a sliding angle ≤10° was successfully synthesized using SiO2 NPs smaller than 10 nm modified with PFDTES. The coating exhibited the ability to inhibit bacterial growth by preventing the adhesion of bacteria such as Escherichia coli and Staphylococcus aureus; moreover, the number of layers correlated with enhanced antibacterial properties. The coating also showed good durability under outdoor conditions. These results support the potential application of superhydrophobic coatings to prevent these bacteria from adhering and growing in areas where they can be harmful.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fadd24683adf2bc969840696a3720fc666f8cb465089b257522ec1fbf7d540b6","category":"Interdisciplinary"}