{"title":"Effect of mixed fermentation of Lactiplantibacillus plantarum and Lactiplantibacillus pentosus on phytochemical and flavor characteristics of Wallace melon juice","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13263?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Melons (<i>Cucumis melo</i> L.) are among the most commonly consumed fruits but they are highly susceptible to mechanical damage and rot during storage and transportation. New processed products are needed to avoid postharvest fruit loss and to increase health benefits. Fermentation is an effective means of utilizing the nutrients and improving flavor.</p>\n<h2>RESULTS</h2>\n<p>Fermented melon juice (MJ) was prepared using three potential probiotics <i>Lactiplantibacillus plantarum</i> CICC21824 (LP), <i>Lactiplantibacillus plantarum</i> GB3-2 (LG), and <i>Lactiplantibacillus pentosus</i> XZ-34 (LX). The nutrition, flavor characteristics, and digestive properties of different fermented MJs were compared. The results demonstrated that, in comparison with mono-fermentation, mixed fermentation by LG and LX could increase the level of organic acids and phenolic acids. Correspondingly, antioxidant capacity was improved significantly and positively correlated with <i>p</i>-coumaric acid and cinnamic acid content. The production of alcohols and acids was more strongly enhanced by mixed culture fermentation, whereas mono-fermentation reduced the content of esters, especially ethyl acetate and isopropyl acetate. Aldehydes and ketones increased significantly in fermented MJ, and damascenone and heptanal could be the characteristic aroma compounds.</p>\n<h2>CONCLUSION</h2>\n<p>Mixed fermented MJ provides more beneficial phytochemicals, better flavor, and stronger antioxidant properties than mono-fermentation. © 2024 Society of Chemical Industry.</p>","author":"Junwei Zhang, \nYu Zhong, \nDanfeng Wang, \nYun Deng, \nYuncheng Li, \nCong Liu, \nJi‐Li‐Te Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"fade00bd6e653ad16730a1891f7a236923b4d34723a462e3b6b164a9f202a1ef","category":"Environment"}