{"title":"Effects of Rotten Vegetable‐Based Low‐Cost Media on the Growth and Morphology of an Astaxanthin‐Producing Green Alga, Monoraphidium Littorale","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/6626962?af=R","date":1689577200000,"content":"<p>Growing microalgae on vegetable waste (rotten potatoes) media is not only a plausible technique to replace expensive commercial media but also a way of reducing feed costs for rearing zooplankton and fish larvae in aquaculture. As a way of starting an inevitable step up, <i>Monoraphidium littorale</i> was grown in 25% (<i>T</i>\n<sub>1</sub>), 50% (<i>T</i>\n<sub>2</sub>), and 75% (<i>T</i>\n<sub>3</sub>) of digested rotten potato supernatant (DRPS) and at the same time in Bold Basal Medium (BBM) as a control (<i>T</i>\n<sub>4</sub>) for 16 days. The highest cell density of <i>M. littorale</i> was recorded in <i>T</i>\n<sub>1</sub>, followed by <i>T</i>\n<sub>4</sub>, <i>T</i>\n<sub>2</sub>, and <i>T</i>\n<sub>3</sub>. A similar increasing trend of chlorophyll-a and optical density was also observed during the experimental period. The study also ascertained <i>T</i>\n<sub>1</sub> as a potential growth medium where <i>M. littorale</i> showed superior biomass production which was significantly higher (<i>P</i> &lt; 0.05) than other treatments. It was also worth mentioning that the highest (<i>P</i> &lt; 0.05) protein content was determined in <i>T</i>\n<sub>1</sub> at the end of the cultivation time. Similarly, a highly significant difference (<i>P</i> &lt; 0.05) was also found in the lipid content of the microalgae grown in <i>T</i>\n<sub>1</sub> and <i>T</i>\n<sub>4</sub>. Furthermore, the morphology of the cells of <i>M. littorale</i> was found to be strongly affected by the DRPS concentrations and BBM. Thus, the lower concentration of the DRPS served as the best medium for enhancing the growth and biomass of <i>M. littorale</i>. Consequently, to expedite the sustainable progression of microalgal production, cost-effective culture techniques by using different wastes may be adopted.</p>","author":"Jinnath Rehana Ritu, \nSaleha Khan, \nMd. Sakhawat Hossain, \nMd. Mahfuzul Haque, \nHouguo Xu","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"fae45461ab3a9b1e9666fb2776346e8bbaed965d31bc81e7f35382a457120207","category":"Environment"}