{"title":"Peanut Hulls, an Underutilized Nutritious Culinary Ingredient: Valorizing Food Waste for Global Food, Health, &amp; Farm Economies- a Narrative Review","link":"https://www.preprints.org/manuscript/202407.0296/v1","date":1720016393000,"content":"Peanut hulls (PH) are an edible food waste that is an underutilized food source for human consumption. While edible and palatable, they are mainly diverted to livestock feed or building materials. Here, we describe existing literature on human food valorization of PHs and propose methods to optimize recapturing nutrients (e.g. protein, fiber, polyphenols) lost by treating PHs as waste. Incorporated into common foods, PHs can be processed into functional ingredients to improve nutrient-density and the corresponding positive health outcomes associated with increases in plant foods. PH valorization can also address additional priorities of the UN Sustainable Development Goals using a Food Systems Approach (FSA) including food waste, increasing economic opportunities for farmers, and increasing the availability of healthy shelf-stable foodstuffs to address food security. Recent advances in sustainable food processing technologies can be utilized to safely incorporate peanut hulls into human food streams. We propose future applications that could make meaningful impacts to food availability and the nutritional composition of common foods. While the limited literature on this topic spans several decades, no global operations exist to incorporate peanut hulls and most publications precede the technological ‘green revolution’. The approaches outlined in this review may help bolster commercialization of this underutilized and nutritious food potentially improving opportunities for multiple global stakeholders.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"faf9953fe0f59e791a5bee6f81da879bd3703b14769f4730258efcdb54d14f27","category":"Interdisciplinary"}