{"title":"Freshwater Turtles in an Arid Land: Population Ecology, Habitat and Ecological Niche Modelling of Pelomedusa subrufa olivacea in the Sahel","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13321?af=R","date":1726738561000,"content":"<h2>ABSTRACT</h2>\n<p>Turtle ecology and conservation have been poorly explored in the West African Sahel regions, and this scarce information has produced a suboptimal management of their populations in the wild. In order to enhance the knowledge on the Sahelian turtle ecology, a field study was carried out in Burkina Faso on the ecology of <i>Pelomedusa subrufa olivacea</i>, a freshwater species inhabiting a wide range of waterbodies throughout West Africa. Reasoned sampling was carried out, resulting in the collection of a total of 196 individuals of <i>Pelomedusa subrufa olivacea</i>. This species shows a relatively balanced distribution of age and sex classes of individuals surveyed in the different study areas. The majority of individuals were observed in specific habitats, confirmed by an aggregative distribution. The potential habitats identified by the MaxEnt model highlight key areas for the conservation of this species in Burkina Faso. Conservation efforts should focus on protecting and restoring temporary and permanent aquatic habitats, and managing human activities to minimize the impact on turtle populations in the West African Sahel.</p>\n<h2>Abstrait</h2>\n<p>L’écologie et la conservation des tortues ont été peu explorées dans les régions sahéliennes ouest-africaines, et ces rares informations ont entraîné une gestion sous-optimale de leurs populations dans la nature. Afin d’améliorer les connaissances sur l’écologie des tortues sahéliennes, une étude de terrain a été réalisée au Burkina Faso sur l’écologie de <i>Pelomedusa subrufa olivacea</i>, une espèce d’eau douce habitant un large éventail de plans d’eau à travers l’Afrique de l’Ouest. Un échantillonnage raisonné a été réalisé, aboutissant à la collecte d’un total de 196 individus de <i>Pelomedusa subrufa olivacea</i>. Cette espèce présente une répartition relativement équilibrée des classes d’âge et de sexe des individus recensés dans les différentes zones d’étude. La majorité des individus ont été observés dans des habitats spécifiques, confirmés par une répartition regroupée. Les habitats potentiels identifiés par le modèle MaxEnt mettent en évidence des zones clés pour la conservation de cette espèce au Burkina Faso. Les efforts de conservation devraient se concentrer sur la protection et la restauration des habitats aquatiques temporaires et permanents, ainsi que sur la gestion des activités humaines afin d’atténuer l’impact sur les populations de tortues dans le Sahel ouest-africain.</p>","author":"Ardjima Lankoande, \nSidiki Roland Konate, \nDjidama Sirima, \nWendata Francis Dayama, \nEmmanuel M. Hema","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"fafb82cfe5e3cdd9480f123deeee854a843e50ea5e2aaa2c37a35d47d6b83e81","category":"Environment"}