{"title":"Dietary adherence among persons with type 2 diabetes: A concurrent mixed methods study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302914","date":1715090400000,"content":"<p>by Dorothy Wilson, Abigail Kusi-Amponsah Diji, Richard Marfo, Paulina Amoh, Precious Adade Duodu, Samuel Akyirem, Douglas Gyamfi, Hayford Asare, Jerry Armah, Nancy Innocentia Ebu Enyan, Joana Kyei-Dompim</p>\r\nBackground <p>Poor adherence to dietary recommendations among persons with type 2 diabetes (T2D) can lead to long-term complications with concomitant increases in healthcare costs and mortality rates. This study aimed to identify factors associated with dietary adherence and explore the barriers and facilitators to dietary adherence among persons with T2D.</p> Methods <p>A concurrent mixed methods study was conducted in two hospitals in the Ashanti Region of Ghana. One hundred and forty-two (142) persons with T2D were consecutively sampled for the survey. Dietary adherence and diabetes-related nutritional knowledge (DRNK) were assessed using the Perceived Dietary Adherence Questionnaire (PDAQ) and an adapted form of the General Nutritional Knowledge Questionnaire (GNKQ-R) respectively. A purposive sample of fourteen participants was selected for interviews to explore the factors that influence dietary adherence. Qualitative data were analysed using NVivo version 20 software and presented as themes. Furthermore, binary logistic regression was performed using IBM SPSS version 29.0 to identify the factors associated with dietary adherence.</p> Results <p>Nearly fifty-one percent (50.7%) of the participants in this study had good dietary adherence. In multivariable logistics regression, it was found that increase in DRNK (AOR = 1.099, 95% CI: 1.001–1.206, p = 0.041) score and living in an urban area (AOR = 3.041, 95% CI: 1.007–9.179, p = 0.047) were significantly associated with good dietary adherence. Inductive thematic analysis revealed four facilitators of dietary adherence (access to information on diet, individual food preferences and eating habits, perceived benefits of dietary adherence, and presence of social support) and four barriers (inability to afford recommended diets, barriers related to foods available in the environment, conflict between dietary recommendations and individual eating habits, and barriers related to the social environment).</p> Conclusion <p>The findings support the need for interventions including continuous dietary education tailored to individual preferences and dietary habits, expansion of poverty reduction social interventions and formulation of policies that will improve access to healthy foods in communities.</p>","author":"Dorothy Wilson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fb025f73faeba4debaf09cf074d73344c118db163e885a7f47572d58b34f2c6e","category":"Interdisciplinary"}