{"title":"Tree species explain only half of explained spatial variability in plant water sensitivity","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17425?af=R","date":1721026800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c846d787-62f3-4c80-872e-b61430db267e/gcb17425-toc-0001-m.png\" alt=\"Tree species explain only half of explained spatial variability in plant water sensitivity\" />\n<p>Written summary: We analyzed the degree to which the species that trees in a particular location belong to affects the overall sensitivity of those trees to variations in water status (such as with changes in rainfall or atmospheric dryness). We found that factors beyond species—such as local climate (which trees adapt their traits to), soil type, topography, or vegetation density—explain almost twice as much of the variability in this sensitivity as species do.</p>\n<br />\n<h2>Abstract</h2>\n<p>Spatiotemporal patterns of plant water uptake, loss, and storage exert a first-order control on photosynthesis and evapotranspiration. Many studies of plant responses to water stress have focused on differences between species because of their different stomatal closure, xylem conductance, and root traits. However, several other ecohydrological factors are also relevant, including soil hydraulics, topographically driven redistribution of water, plant adaptation to local climatic variations, and changes in vegetation density. Here, we seek to understand the relative importance of the dominant species for regional-scale variations in woody plant responses to water stress. We map plant water sensitivity (PWS) based on the response of remotely sensed live fuel moisture content to variations in hydrometeorology using an auto-regressive model. Live fuel moisture content dynamics are informative of PWS because they directly reflect vegetation water content and therefore patterns of plant water uptake and evapotranspiration. The PWS is studied using 21,455 wooded locations containing U.S. Forest Service Forest Inventory and Analysis plots across the western United States, where species cover is known and where a single species is locally dominant. Using a species-specific mean PWS value explains 23% of observed PWS variability. By contrast, a random forest driven by mean vegetation density, mean climate, soil properties, and topographic descriptors explains 43% of observed PWS variability. Thus, the dominant species explains only 53% (23% compared to 43%) of explainable variations in PWS. Mean climate and mean NDVI also exert significant influence on PWS. Our results suggest that studies of differences between species should explicitly consider the environments (climate, soil, topography) in which observations for each species are made, and whether those environments are representative of the entire species range.</p>","author":"Alexandra G. Konings, \nKrishna Rao, \nErica L. McCormick, \nAnna T. Trugman, \nA. Park Williams, \nNoah S. Diffenbaugh, \nMarta Yebra, \nMeng Zhao","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"fb0afe25aef3765026c410ddaba58f3a142fe85c4f4750c053e14c7b88abf424","category":"Environment"}