{"title":"FBLN2 is associated with Goldenhar syndrome and is essential for cranial neural crest cell development","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15183?af=R","date":1720279232000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/787a2449-33bb-4b6b-86ef-c676773258ab/nyas15183-gra-0001-m.png\" alt=\"FBLN2 is associated with Goldenhar syndrome and is essential for cranial neural crest cell development\" />\n<p>Goldenhar syndrome is a rare disease involving craniofacial malformations with ambiguous etiology. <i>FBLN2</i> was identified as a candidate gene via whole-exome sequencing combined with linkage analysis in a five-generation pedigree. A <i>fbln2</i> knockout zebrafish line was constructed, and it exhibited craniofacial cartilage malformations. Mutants presented abnormal chondrogenic differentiation, apoptosis, and proliferation of cranial neural crest cells and downregulation of BMP signaling, indicating a role of <i>FBLN2</i> in the pathogenesis of Goldenhar syndrome.</p>\n<p>\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Goldenhar syndrome, a rare craniofacial malformation, is characterized by developmental anomalies in the first and second pharyngeal arches. Its etiology is considered to be heterogenous, including both genetic and environmental factors that remain largely unknown. To further elucidate the genetic cause in a five-generation Goldenhar syndrome pedigree and exploit the whole-exome sequencing (WES) data of this pedigree, we generated collapsed haplotype pattern markers based on WES and employed rare variant nonparametric linkage analysis. <i>FBLN2</i> was identified as a candidate gene via analysis of WES data across the significant linkage region. A <i>fbln2</i> knockout zebrafish line was established by CRISPR/Cas9 to examine the gene's role in craniofacial cartilage development. <i>fbln2</i> was expressed specifically in the mandible during the zebrafish early development, while <i>fbln2</i> knockout zebrafish exhibited craniofacial malformations with abnormal chondrocyte morphologies. Functional studies revealed that <i>fbln2</i> knockout caused abnormal chondrogenic differentiation, apoptosis, and proliferation of cranial neural crest cells (CNCCs), and downregulated the bone morphogenic protein (BMP) signaling pathway in the zebrafish model. This study demonstrates the role of <i>FBLN2</i> in CNCC development and BMP pathway regulation, and highlights <i>FBLN2</i> as a candidate gene for Goldenhar syndrome, which may have implications for the selection of potential screening targets and the development of treatments for conditions like microtia-atresia.</p>","author":"Xiaomin Niu, \nFuyu Zhang, \nWei Gu, \nBo Zhang, \nXiaowei Chen","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"fb168c5c3da7f1cc6a86ab77a2f58adfaea7277e530571d87b4126f5f9fccb65","category":"Environment"}