{"title":"สิ้นยุค PostScript ซอฟต์แวร์ของ Adobe, Microsoft หยุดรองรับฟอนต์แบบ Type 1 แล้ว","link":"https://www.blognone.com/node/135318","date":1692241340000,"content":"<div><div><div><p>Adobe และ Microsoft ต่างทยอยหยุดซัพพอร์ตฟอนต์ PostScript Type 1 ในซอฟต์แวร์ของตัวเอง ซึ่งจะส่งผลให้ไฟล์เอกสารยุคเก่าที่ใช้ฟอนต์แบบเก่า ไม่สามารถเปิดได้กับซอฟต์แวร์รุ่นใหม่ๆ ได้อีกต่อไป</p>\n<p>ภาษา PostScript ฟอนต์ Type 1 ถูกสร้างขึ้นในยุค 80s พร้อมการก่อตั้งบริษัท Adobe ในช่วงเวลานั้น และถูกนำไปใช้อย่างแพร่หลายในวงการสิ่งพิมพ์ที่ออกแบบโดยคอมพิวเตอร์ (desktop publishing) เพราะเป็นฟอนต์แบบเวกเตอร์ที่คมชัด ขยายแล้วภาพไม่แตก แต่ภายหลังเรามีฟอนต์เวกเตอร์แบบใหม่ๆ ทั้ง TrueType (Apple) และ OpenType (Adobe/Microsoft) ความจำเป็นในการใช้ฟอนต์ Type 1 จึงลดน้อยลงไป</p>\n<p>การเปลี่ยนผ่านเพื่อสิ้นสุดยุค PostScript เริ่มขึ้นอย่างช้าๆ โดย Microsoft Office 2013 หยุดรองรับฟอนต์ Type 1 มานานแล้ว แต่ Microsoft Office for Mac เพิ่งหยุดรองรับฟอนต์ Type 1 ในรอบอัพเดตประจำเดือนนี้</p>\n<p>ส่วน <a href=\"https://helpx.adobe.com/fonts/kb/postscript-type-1-fonts-end-of-support.html\">Adobe เองหยุดซัพพอร์ตการแก้ไขไฟล์ Type 1 มาตั้งแต่เดือนมกราคม 2023</a> มีผลกับ Photoshop, Illustrator, InDesign โดยแอพเหล่านี้จะมองไม่เห็นฟอนต์ประเภท Type 1 อีกต่อไป แต่ยังสามารถเปิดอ่านไฟล์เก่า PDF/EPS ที่ฝั่งฟอนต์ Type 1 ได้ตามปกติ</p>\n<p>ซอฟต์แวร์ค่ายอื่นๆ ก็ทยอยหยุดซัพพอร์ตเช่นกัน ตัวอย่างคือ <a href=\"https://www.blognone.com/node/131194\">Preview ของ macOS หยุดซัพพอร์ตในเดือนตุลาคม 2022</a>, LibreOffice หยุดซัพพอร์ตในช่วงกลางปี 2022</p>\n<p>ทางออกของการเปิดแก้ไฟล์เก่าที่ยังใช้ฟอนต์ Type 1 ยังทำได้ผ่านการใช้ซอฟต์แวร์รุ่นเก่า, ใช้ซอฟต์แวร์ third party บางตัว รวมถึงการแปลงฟอนต์เก่ามาเป็น OpenType ซึ่ง Adobe บอกว่าฟอนต์ของตัวเองถูกแปลงมาเป็น OpenType เกือบหมดแล้ว</p>\n<p>ที่มา - <a href=\"https://arstechnica.com/gadgets/2023/08/microsoft-adobe-and-others-have-dropped-support-for-old-postscript-fonts/\">Ars Technica</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/3d3da420bbadfb0d7b3126e837fc1ff6.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/postscript\">PostScript</a></div><div><a href=\"/topics/adobe\">Adobe</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/microsoft-office\">Microsoft Office</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"fb261fe3c9ca20a123b697b20005389117ea50d276acbe50fef54acb80dd15ac","category":"Thai"}