{"title":"$5 Billion Google Lawsuit Over 'Incognito Mode' Tracking Moves Closer to Trial","link":"https://www.macrumors.com/2023/08/08/5-billion-google-lawsuit-incognito-mode/","date":1691493472000,"content":"A California judge has denied Google's request for summary judgement in a class action lawsuit alleging that it secretly tracked the online activity of Chrome users even when they were using the browser in its privacy-oriented Incognito mode (via <em><a href=\"https://www.theverge.com/2023/8/7/23823878/google-privacy-tracking-incognito-mode-lawsuit-summary-judgment-denied\">The Verge</a></em>).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/06/Chrome-Feature-22.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nThe lawsuit was filed in <a href=\"https://www.macrumors.com/2020/06/03/lawsuit-google-chrome-tracking-incognito-users/\">June 2020</a> by users alleging that Google hoovers up user data in Incognito mode through Google Analytics, Google Ad Manager and other applications and website plug-ins, including smartphone apps, whether or not users click on Google-supported ads.\r<br />\n\r<br />\nThe plaintiffs claim that Google is therefore deceiving customers into believing that they have control over the information they share with the company when they use Chrome's private browsing mode, and in doing so, violates federal wiretap laws.\r<br />\n\r<br />\nIn <a href=\"https://www.documentcloud.org/documents/23902170-chasom-brown-et-al-v-google?responsive=1&amp;title=1\">denying Google's request</a>, Judge Yvonne Gonzalez-Rogers referred to statements in the Chrome privacy notice, Privacy Policy, Incognito Splash Screen, and Search &amp; Browse Privately Help page suggesting that incognito mode limits the information stored or how people can control the information they share: \r<br />\n<blockquote>The Court is guided by the way that Google itself chose to represent its private browsing mode: Google told users that they could 'go Incognito' and 'browse privately.' By browsing privately, plaintiffs could be said to have asserted their expectation of privacy. Google is welcome to make the counterargument at trial. \r<br />\n\r<br />\nGoogle has not shown, as a matter of law, that all parties consented to it recording the communications here and therefore summary judgment is not appropriate.</blockquote>According to the plaintiffs, the lawsuit likely covers \"millions\" of Google users who since June 1, 2016 browsed the internet using Incognito mode. The proposed class action therefore seeks $5,000 in damages per user for violations of federal wiretapping and California privacy laws, amounting to at least $5 billion.\r<br />\n\r<br />\nGoogle has said it will defend itself \"vigorously' against the claims. The company has previously <a href=\"https://www.macrumors.com/2021/03/14/judge-rules-google-lawsuit-incognito-mode/\">unsuccessfully attempted to have the case thrown out</a> by arguing that the plaintiffs consented to its privacy policy, which the company said explicitly discloses its data protection practices. Google's denied request for summary judgement now moves the case closer toward settlement or a trial.<div>Tag: <a href=\"https://www.macrumors.com/guide/google-chrome/\">Google Chrome</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/08/5-billion-google-lawsuit-incognito-mode/\">$5 Billion Google Lawsuit Over 'Incognito Mode' Tracking Moves Closer to Trial</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/5-billion-google-lawsuit-over-incognito-mode-tracking-moves-closer-to-trial.2398061/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fb329bc61e0c08446426ac277af8f79c4282b0f8631e2ab9d594e809d20597c9","category":"Apple"}