{"title":"Cross border population movements across three East African states: Implications for disease surveillance and response","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002983","date":1729087200000,"content":"<p>by Patrick King, Mercy Wendy Wanyana, Harriet Mayinja, Brenda Nakafeero Simbwa, Marie Gorreti Zalwango, Joyce Owens Kobusinge, Richard Migisha, Daniel Kadobera, Benon Kwesiga, Lilian Bulage, Doreen Gonahasa, Peter Ahabwe Babigumira, Serah Nchoko, Edna Salat, Freshia Waithaka, Oscar Gunya, Fredrick Odhiambo, Vincent Mutabazi, Metuschelah Habimana, Gabriel Twagirimana, Ezechiel Ndabarinze, Alexis Manishimwe, Harriet Itiakorit, Samuel Kadivani, Katy Seib, Ellen Whitney, Alex Riolexus Ario</p>\r\n\r\nThe frequent population movement across the five East African Countries poses risk of disease spread in the region. A clear understanding of population movement patterns is critical for informing cross-border disease control interventions. We assessed population mobility patterns across the borders of the East African states of Kenya, Uganda, and Rwanda. In November 2022, we conducted Focus Group Discussions (FGDs), Key Informant Interviews (KIIs), and participatory mapping. Participants were selected using purposive sampling and a topic guide used during interviews. Key informants included border districts (Uganda and Rwanda) and county health officials (Kenya). FGD participants were identified from border communities and travellers and these included truck drivers, commercial motorcyclists, and businesspersons. During KIIs and FGDs, we conducted participatory mapping using Population Connectivity Across Borders toolkits. Data were analysed using thematic analysis approach using Atlas ti 7 software. Different age groups travelled across borders for various reasons. Younger age groups travelled across the border for education, trade, social reasons, employment opportunities, agriculture and mining. While older age groups mainly travelled for healthcare and social reasons. Other common reasons for crossing the borders included religious and cultural matters. Respondents reported seasonal variations in the volume of travellers. Respondents reported using both official (4 Kenya-Uganda, 5 Rwanda-Uganda borders) and unofficial Points of Entry (PoEs) (14 Kenya-Uganda, 20 Uganda-Rwanda) for exit and entry movements on borders. Unofficial PoEs were preferred because they had fewer restrictions like the absence of health screening, and immigration and customs checks. Key destination points (points of interest) included: markets, health facilities, places of worship, education institutions, recreational facilities and business towns. Twenty-eight health facilities (10- Lwakhakha, Uganda, 10- Lwakhakha, Kenya, and 8- Cyanika, Uganda) along the borders were the most commonly visited by the travellers and border communities. Complex population movement and connectivity patterns were identified along the borders. These were used to guide cross-border disease surveillance and other border health strategies in the three countries. Findings were used to revise district response and preparedness plans by strengthening community-based surveillance in border communities.","author":"Patrick King","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"fb35b64d3ec7e90ece3396cd64fd75a9a3437a832f47c58fa2a8e7917dc5a6dd","category":"Environment"}