{"title":"Philips Hue Lights Getting Deep Spotify Integration","link":"https://www.macrumors.com/2021/09/01/philips-hue-lights-spotify-integration/","date":1630481520000,"content":"Starting today, the popular Philips Hue smart lights will feature a deep integration with the Spotify streaming music service, allowing Hue users to sync their lights to their Spotify playlists.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/philips-hue-spotify-integration.jpg\" />\r\n<br />\r\nThe Philips Hue system will use an algorithm to analyze the metadata of each song in real time to make Hue lights flash, dim, brighten, and change colors while matching with the beat, mood, genre, and tempo of music on Spotify. The algorithm even takes into account factors like loudness, segments, pitch, and more.\r\n<br />\r\n\r\n<br />\r\nWith the Sync tab in the Philips Hue app, users can personalize the Spotify integration experience. There are tools for starting and stopping the sync, changing the brightness and intensity of the lights, and choosing a palette to change the colors of the lights.\r\n<br />\r\n\r\n<br />\r\nSpotify integration is free to use, requiring a Hue Bridge and color-capable Hue lights like the White and Color Ambiance Smart Bulbs. The feature works through the Philips Hue app and it does not require a microphone to react to the music, so the syncing experience can be done with no background noise and while leaving the phone free to be used for other tasks.\r\n<br />\r\n\r\n<br />\r\nAccording to Philips Hue parent company Signify, the integration works with any Spotify-compatible audio device, which includes speakers, computers, and smartphones. All that's required is linking a Spotify account and a Philips Hue account in the Hue app, and the lights will perform whenever you play a Spotify song.\r\n<br />\r\n\r\n<br />\r\nThe Philips Hue and Spotify integration will begin rolling out as an early access program for Philips Hue App 4 users beginning on September 1.\r\n<br />\r\n\r\n<br />\r\nThose who have the current version of the app can tap on the \"What's New\" update with the Spotify card and can select \"Early access\" to try it out. After October 2021, Spotify integration will be a permanent feature in the Philips Hue app.<div>Tags: <a href=\"https://www.macrumors.com/guide/spotify/\">Spotify</a>, <a href=\"https://www.macrumors.com/guide/philips-hue/\">Philips Hue</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/01/philips-hue-lights-spotify-integration/\">Philips Hue Lights Getting Deep Spotify Integration</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/philips-hue-lights-getting-deep-spotify-integration.2309385/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=lNSW-ih4PrE:6wGtUf39m1s:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=lNSW-ih4PrE:6wGtUf39m1s:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/lNSW-ih4PrE\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fb373312da2abd7d7569d659273cdf8b0a45c9ec7e43dae00ffde8cdfbfa31e2","category":"Apple"}