{"title":"[ลือ] เกม The Last of Us Part 3 เริ่มกระบวนการพัฒนาแล้ว","link":"https://www.blognone.com/node/134654","date":1688382689000,"content":"<div><div><div><p>ช่วงเวลาหลายเดือนที่ผ่านมา เริ่มเกิดคำถามขึ้นมากมายกับ <strong>Naughty Dogs</strong> ค่ายเกมผู้พัฒนาเกมในเครือของ PlayStation ว่ากำลังทำอะไรอยู่ หลังจากที่ในงาน State of play และ PlayStation Showcase รอบล่าสุดนั้นไร้เงาเกมใหม่ ๆ จาก Naughty Dogs แต่ก็มีการแถลงขอโทษจาก Naughty Dogs ที่ไม่ได้มีเกมไปแสดงในงานต่าง ๆ แต่แอบมีแง้ม ๆ มาว่ากำลังพัฒนาเกม Single Player เกมใหม่อยู่</p>\n<p>และในวันนี้มีข่าวคราวเพิ่มเติมออกมาเล็กน้อยเกี่ยวกับเกมใหม่ที่ Naughty Dogs กำลังสร้างครับ โดยมีผู้ใช้ Twitter นาม ViewerAnon ได้ออกมาบอกว่าการพัฒนาเกม The Last of US Part 3 เข้าสู่ช่วงการบันทึกเสียง และการบันทึกเคลื่อนไหวของตัวละครแล้ว</p>\n<p>ต่อมามีผู้ใช้ Twitter นาม Naughty Dogs Central ผู้ใช้งานที่ติดตามข่าวคราวของ Naughty Dogs บอกว่า Naughty Dogs กำลังมองหานักแสดงที่จะมารับบทตัวละครใหม่จำนวน 5 คน มีชื่อว่า Lucas, Mason, Val, Ezra และ Gracie ซึ่งทั้ง 5 ชื่อนี้จะเป็นผู้รอดชีวิตกลุ่มใหม่ในโลกของ The Last of Us</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/3abbdfbc2c321f921c359b431034f85e.jpg\" /></p>\n<p>ในตอนนี้ The Last of Us Part 3 ยังไม่ได้ประกาศเปิดตัวแต่อย่างใด มีเพียงเกม Multiplayer เกมใหม่ที่ใช้โลกเดียวกับ The Last of Us เท่านั้น ที่ Naughty Dogs เปิดตัวในงาน Summer Game Fest 2022 เมื่อปีที่แล้ว</p>\n<blockquote><p>All I can say is I’ve been very vocal for quite awhile that THE LAST OF US PART III is in development and others are finally noticing. Major filming is happening this year.</p>\n<p>— ViewerAnon (@ViewerAnon) <a href=\"https://twitter.com/ViewerAnon/status/1675610433221443584?ref_src=twsrc%5Etfw\">July 2, 2023</a></p></blockquote>\n<blockquote><p>Rumour: The Last of Us Part III.• Naughty Dog casting for 5 diverse new characters (Lucas, Mason, Val, Ezra &amp; Gracie) • Group of scavengers surviving on the outskirts of a post-apocalyptic city, crammed into a Victorian house that serves as their base. <a href=\"https://t.co/U4qIohB3A4\">pic.twitter.com/U4qIohB3A4</a></p>\n<p>— Naughty Dog Central (@NaughtyNDC) <a href=\"https://twitter.com/NaughtyNDC/status/1675610635424649216?ref_src=twsrc%5Etfw\">July 2, 2023</a></p></blockquote>\n<p>ที่มา - <a href=\"https://gamingbolt.com/the-last-of-us-part-3-motion-capture-and-audio-recordings-happening-this-year-rumour\">Gaming Bolt</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/the-last-of-us\">The Last of Us</a></div><div><a href=\"/topics/playstation\">PlayStation</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/rumors\">Rumors</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"fb431876d8e8021650d1e7f9162e4a67b043876a6adc43e0c7062ebe6398306a","category":"Thai"}