{"title":"Closed-loop oxygen control for critically ill patients––A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304745","date":1718200800000,"content":"<p>by Caroline Gomes Mól, Aléxia Gabriela da Silva Vieira, Bianca Maria Schneider Pereira Garcia, Emanuel dos Santos Pereira, Raquel Afonso Caserta Eid, Marcus J. Schultz, Ana Carolina Pereira Nunes Pinto, Ricardo Kenji Nawa</p>\r\nBackground <p>The impact of closed-loop control systems to titrate oxygen flow in critically ill patients, including their effectiveness, efficacy, workload and safety, remains unclear. This systematic review investigated the utilization of closed-loop oxygen systems for critically ill patients in comparison to manual oxygen titration systems focusing on these topics.</p> Methods and findings <p>A search was conducted across several databases including MEDLINE, CENTRAL, EMBASE, LILACS, CINAHL, LOVE, ClinicalTrials.gov, and the World Health Organization on March 3, 2022, with subsequent updates made on June 27, 2023. Evidence databases were searched for randomized clinical parallel or crossover studies investigating closed-loop oxygen control systems for critically ill patients. This systematic review and meta-analysis was performed following the Preferred Reporting Items for Systematic Review and Meta-analysis guidelines. The analysis was conducted using Review Manager software, adopting the mean difference or standardized mean difference with a 95% confidence interval (95% CI) for continuous variables or risk ratio with 95% CI for dichotomous outcomes. The main outcome of interest was the percentage of time spent in the peripheral arterial oxygen saturation target. Secondary outcomes included time for supplemental oxygen weaning, length of stay, mortality, costs, adverse events, and workload of healthcare professional. A total of 37 records from 21 studies were included in this review with a total of 1,577 participants. Compared with manual oxygen titration, closed-loop oxygen control systems increased the percentage of time in the prescribed SpO<sub>2</sub> target, mean difference (MD) 25.47; 95% CI 19.7, 30.0], with moderate certainty of evidence. Current evidence also shows that closed-loop oxygen control systems have the potential to reduce the percentage of time with hypoxemia (MD -0.98; 95% CI -1.68, -0.27) and healthcare workload (MD -4.94; 95% CI -7.28, -2.61) with low certainty of evidence.</p> Conclusion <p>Closed-loop oxygen control systems increase the percentage of time in the preferred SpO<sub>2</sub> targets and may reduce healthcare workload.</p> Trial registration <p>PROSPERO: CRD42022306033.</p>","author":"Caroline Gomes Mól","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fb4423692f3204124c8bbdd2e7f999982fc789f8aeda83ec68253e570816037a","category":"Interdisciplinary"}