{"title":"Correlates of post-traumatic growth among persons bereaved from cancer: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300291","date":1710511200000,"content":"<p>by N. V. Sri Lakshmi K., Eslavath Rajkumar, Aswathy Gopi, P. V. Hareesh, John Romate, R. Lakshmi, John Abraham</p>\r\nBackground <p>Recent research identified that cancer bereavement can lead to post-traumatic growth (PTG). Although PTG and its correlates are well explored in cancer patients and survivors, persons bereaved from cancer have received scant attention. Therefore, the present review attempts to identify the correlates of PTG among persons bereaved from cancer.</p> Methods <p>A systematic search in PubMed, Web of Science, APA PsycNet, Science Direct, Scopus, and Wiley was conducted to identify quantitative studies published in English, resulting in 12 eligible reports being included in the final analysis. JBI critical checklists were employed to appraise the risk of bias.</p> Results <p>The review identified 17 correlates, which were classified into four categories: demographic factors (age, gender, religious status, level of education), loss-related factors (time since death, quality of death, prolonged grief symptoms), interpersonal factors (relationship to the deceased, social support, attachment style, bereavement behaviours) and intrapersonal factors (resilience, coping, rumination, benevolence, meaningfulness, self-worth). Random effects meta-analyses on six correlates revealed correlation coefficients of age = -0.02 (95% CI: -0.35–0.31), gender = 0.27 (95% CI: 0.08–0.45), time since death = 0.09 (95% CI: -0.02–0.20), quality of death = 0.29 (95% CI: -0.01–0.54), prolonged grief symptoms = 0.22 (95% CI: 0.08–0.35) and relationship to the deceased = 0.13 (95% CI: -0.03–0.29). Fixed effects meta-analysis was performed for social support (r = 0.13, 95% CI: 0.04–0.21). However, PTG was found to be significantly associated with gender, prolonged grief symptoms, and social support.</p> Conclusions <p>Very few studies examined PTG among persons bereaved from cancer, highlighting the need for increased attention, understanding, and conceptualisation of PTG in the population.</p>","author":"N. V. Sri Lakshmi K.","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fb471b8f9faf35f4874a72a7e0d07bc11478ded4010a48612b5508956d137c22","category":"Interdisciplinary"}