{"title":"Unveiling the Evolution of Extreme Rainfall Storm Structure Across Space and Time in a Warming Climate","link":"https://onlinelibrary.wiley.com/doi/10.1029/2024EF004675?af=R","date":1727100003000,"content":"<h2>Abstract</h2>\n<p>Climate change induces significant changes in storm characteristics, particularly for short-duration extreme storms (heavy rain features), impacting their intensity and spatio-temporal distribution. Although alterations in precipitation intensity are well documented, past studies examining changes in spatio-temporal distribution of storms (storm rainrates) were region-specific and focused on isolated aspects of change in space or time, eluding a comprehensive understanding of the precise nature and extent of these changes. Bridging this gap, this study introduces a novel grid-based measure of storm homogeneity, “spatio-temporal homogeneity” metric and investigates the global patterns of change in combined spatio-temporal characteristics of extreme storms. Analyzing the 30 min × 0.1° × 0.1° resolution Global Precipitation Measurements, the study finds that extreme storms are shrinking in both space and time due to rising surface air temperatures, predominantly in tropics. In contrast, temperate regions experience expanded extreme storms with increasing temperatures. The study also identifies a global trend toward more front-loading in storms with rising temperatures, driven by a substantial increase in tropics and southern temperate regions. Conversely, storms in northern temperate regions become slightly more rear-loaded as temperature increases. Furthermore, the study finds that characteristics of short–duration storms (6–12 hr) are more sensitive to temperature changes. Overall, this study contributes valuable insights into the global spatio-temporal changes of extreme storms, highlighting regions most susceptible to alterations in storm patterns due to climate change. These findings are essential for developing effective adaptation strategies and flood management practices to cope with the changing nature of extreme storms in a warming climate.</p>","author":"Ankit Ghanghas, \nAshish Sharma, \nVenkatesh Merwade","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"fb48b46662b5b734c116285db6a7863e47bafa4411d894c83da5289632e5277d","category":"Environment"}