{"title":"Fractal Dimension of Generalized R&eacute;nyian Entropy With Potential Fractal Dimension Applications to Smart Cities","link":"https://www.preprints.org/manuscript/202404.0353/v1","date":1712210771000,"content":"The fractal dimension of is identified in this paper. More importantly, the undertaken research has shown how affects the Koch snowflake . The study has demonstrated the existence of negative values of (Koch snowflake), which connects to a considerable number of extremely intriguing mathematical and physical research areas. The information-theoretic impact on the Sierpiniski Gasket dimension , which corresponds to , was treated in a more fundamental way. Notably, the credibility of this current study adds to the existing kThe fractal dimension of is identified in this paper. More importantly, the undertaken research has shown how affects the Koch snowflake . The study has demonstrated the existence of negative values of (Koch snowflake), which connects to a considerable number of extremely intriguing mathematical and physical research areas. The information-theoretic impact on the Sierpiniski Gasket dimension , which corresponds to , was treated in a more fundamental way. Notably, the credibility of this current study adds to the existing knowledge for the information- theoretic fractal dimensions. On another applicative note, this paper offers some potential applications of fractal dimension to smart cities. The investigation of the threshold theorems for and in terms of the triad is part of the next study phase. Additionally, investigating the newly obtained 's corresponding arbitrary Sierpinski Gasket for the first time.applicative note, this paper offers some potential applications of fractal dimension to smart cities. The investigation of the threshold theorems for and in terms of the triad is part of the next study phase. Additionally, investigating the newly obtained 's corresponding arbitrary Sierpinski Gasket for the first time.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fb48fdf6ced6cedd30b6c46ddbb67310900579001e4f5296c98a81d1513046a4","category":"Interdisciplinary"}