{"title":"The role of pattern recognition receptors in crustacean innate immunity","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12829?af=R","date":1702540257000,"content":"<h2>Abstract</h2>\n<p>Crustacean species are among the most valued seafood with socioeconomic and ecological implications in the global fisheries sector. Microbial infections to the farming stock due to continued expansion and aquaculture puts global crustacean production at risk. Understanding and reviewing the complex innate immune system of crustaceans would be pivotal in formulating informed decisions for the control and management of epidemic diseases, thus making the global crustacean aquaculture industry sustainable. Under the purview of innate immunity in crustaceans, pattern recognition receptors (PRRs) represent the sensors capable of discriminating non-self pathogenic modules and invoking the activation of immune responses. The immunity to infections can be manifested at cellular (via phagocytosis, apoptosis, nodulation and encapsulation) and humoral (effected by prophenoloxidase cascade, lectins, antimicrobial proteins) levels leading to the elimination of pathogens or subversion of the pathogenic implications. In this review, we discuss the participatory role of 12 types of PRRs identified from crustacean species with an exhaustive focus on structural and functional specificities in binding to pathogens and possible execution of the immune activity. Moreover, we have elaborated on the PRRs-associated or possible signalling cascades (Toll-NFκB, IMD-NFκB and JAK-STAT) in crustacean species that could bridge our understanding of the resistance or susceptibility of the host to varied pathogenic infections thus providing clues to the regulatory mechanisms involved in pathogenesis of infectious diseases and mechanisms of immunity.</p>","author":"Bharat Bhusan Patnaik, \nSnigdha Baliarsingh, \nArup Sarkar, \nA. S. Sahul Hameed, \nYong Seok Lee, \nYong Hun Jo, \nYeon Soo Han, \nJyotirmaya Mohanty","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"fb4f75c0a829f2a93d9b777428c08e6075865b8e477bbfc6b77e3262e51d48d5","category":"Environment"}