{"title":"95 Temporal patterns of enteric gas production from cattle in response to ruminal infusions of synthetic bromoform","link":"https://academic.oup.com/jas/article/102/Supplement_3/327/7757180?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This dataset describes the temporal patterns of enteric gas production from cattle in response to ruminal infusions of synthetic bromoform (CHBr<sub>3</sub>). Four non-lactating, non-pregnant, rumen-fistulated Holstein-Friesian cows (12 yr of age, 781 ± 33 kg body weight) were infused via the rumen fistula with 592 mg CHBr<sub>3</sub>/d in an aqueous solution for 14 d. The daily dose was divided into 3 equal portions and infused every 8 h over a 24-h period (0545, 1345, and 2145 h). The 7 d following the infusion period served as a recovery period to describe the dynamics of enteric gas production after cessation of infusion. The Greenfeed system was used for enteric gas measurements. Animals had ad libitum access to grass hay and were supplemented with concentrate through the Greenfeed system for the infusion and recovery periods and for the 14-d adaptation period before the infusions. A two-way ANOVA was performed with phase (pre- and post-infusion) as fixed effect and animal as random effect to assess average differences. Preliminary results show a decrease in methane (CH<sub>4</sub>) production from on average 371 g/d before the infusions to 5 g/d after 14 d of infusions (<span>P</span> &lt; 0.01). Hydrogen (H<sub>2</sub>) production increased from on average 0.6 g/d before the infusions to 9.0 g/d after 14 d of infusions (<span>P</span> &lt; 0.01). Dry matter intake (DMI) decreased to on average 12.8 kg/d after 14 d of infusions compared with 16.9 kg/d before the infusions (<span>P</span> &lt; 0.01). A four-parameter logistic model was fitted for the response of CH<sub>4</sub> (CH<sub>4-inf</sub>) and H<sub>2</sub> (H<sub>2-inf</sub>) production in the 14 d after the first infusion, and separately for the response of CH<sub>4</sub> (CH<sub>4-rec</sub>) and H<sub>2</sub> (H<sub>2-rec</sub>) production in the 7 d after the last infusion (Table 1). Preliminary results indicate a 95% decrease in CH<sub>4-inf</sub> from the A-asymptote (small values of x) is reached after approximately 63 h, and a 95% increase in H<sub>2-inf</sub> from the B-asymptote (large values of x) is reached after approximately 49 h. After the last infusion, the 95% increase in CH<sub>4-rec</sub> from the B-asymptote is reached after approximately 109 h, and the 95% decrease in H<sub>2-rec</sub> from the A-asymptote is reached after approximately 112 h. When comparing the respective inflection points (xmid), the recovery of CH<sub>4</sub> production took approximately 3 times longer than the decrease. In addition, after 7 d of recovery, CH<sub>4</sub> production did not return to the initial levels before the infusion began. The reduced DMI can partially explain this difference in CH<sub>4</sub> recovery; however, other factors cannot be excluded. In conclusion, our data suggest that ruminal infusion of 592 mg CHBr<sub>3</sub>/d for 14 d reduces CH<sub>4</sub> production by &gt;95% and the recovery of CH<sub>4</sub> production to pre-infusion levels might take longer than 7 d.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"fb5274235ad518265ca9cbe0d0e3dcc9a9b5b15da5d394d7aa9a4256bd679a4d","category":"Environment"}