{"title":"More Recent Apple Trademark Activity: 'realityproOS' and 'realOS'","link":"https://www.macrumors.com/2023/05/22/apple-trademark-activity-realityproos-realos/","date":1684768376000,"content":"Following yesterday's news that an apparent Apple shell company is seeking to <a href=\"https://www.macrumors.com/2023/05/21/xrproos-trademark-application/\">trademark the term \"xrProOS\"</a> ahead of a headset unveiling at WWDC two weeks from today, additional trademark activity seemingly linked to Apple has surfaced around a couple of other terms.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/05/apple-ar-concept-kane-blue.jpg\" alt width=\"2500\" height=\"1406\" /><em>Apple headset concept mockup by <a href=\"https://www.behance.net/Konso1e\">designer Marcus Kane</a></em></div>\r<br />\nThe first is \"realityproOS,\" which was filed yesterday in New Zealand and <a href=\"https://www.linkedin.com/posts/narlyk_spotted-an-interesting-nz-trademark-filing-activity-7066322313012523009-l2q0/\">noticed</a> by patent attorney Narly Kalupahana. The filing was made by the same Immersive Health Solutions LLC company that filed to <a href=\"https://www.macrumors.com/2022/08/29/apple-ar-vr-headset-trademark-reality-one/\">protect terms like \"Reality One\" and \"Reality Pro\"</a> last year. Those terms have been rumored to be potential names of Apple's upcoming headset devices.\r<br />\n\r<br />\nThe new \"realityproOS\" filing cites a May 1 filing in Jamaica for establishing a priority date, a tactic commonly used by Apple to hide early trademark protection efforts as the trademark activity in the country is not currently available online.\r<br />\n\r<br />\nThe second trademark filing that has seen activity in recent days is \"realOS,\" a term which was broadly registered in Europe last year by an apparent Apple shell company named Realityo Systems LLC to cover various aspects of computers and operating systems. Realityo Systems also gained some notice last year after it was discovered the company had <a href=\"https://www.macrumors.com/2022/05/29/realityos-trademark-filing-ahead-of-wwdc/\">submitted a filing for \"realityOS\"</a> in late 2021.\r<br />\n\r<br />\nIn the past few weeks, Realityo Systems has <a href=\"https://www3.wipo.int/madrid/monitor/en/showData.jsp?ID=ROM.1729924\">submitted additional filings in other countries</a> for the \"realOS\" term with a much narrower description of \"computer operating systems, computer operating systems for integrated circuits.\"\r<br />\n\r<br />\nA trademark for \"realOS\" in the United States dating back to 2006 was also previously owned by Fujitsu, but changed hands several times before being <a href=\"https://assignments.uspto.gov/assignments/q?db=tm&amp;reel=8003&amp;frame=0993\">acquired by Realityo Systems</a> in November 2022.\r<br />\n\r<br />\nWith a number of operating system-related trademarks seemingly linked to Apple having seen activity in recent days, including \"<a href=\"https://www.macrumors.com/guide/xros/\">xrOS</a>,\" \"xrProOS,\" \"realityproOS\", and \"realOS,\" it's unlikely that Apple plans to use all of them as public-facing names. It is interesting, however, to see Apple seeking to protect various options as it prepares to show its long-rumored headset to the world.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ar-vr/\">AR/VR Headset</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/trademark/\">Trademark</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-glasses-ar-and-vr.209\">Apple Glasses, AR and VR</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/22/apple-trademark-activity-realityproos-realos/\">More Recent Apple Trademark Activity: 'realityproOS' and 'realOS'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/more-recent-apple-trademark-activity-realityproos-and-realos.2390204/\">Discuss this article</a> in our forums<br /><br />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fb63398f04e01971345064f256ee64b0a25e89055983a35ab3c706f7276d4970","category":"Apple"}