{"title":"Transcriptome profiling of two rice varieties reveals their molecular responses under high night-time temperature","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311746","date":1728568800000,"content":"<p>by Wardah K. Mustahsan, Yuya Liang, Abdul R. Mohammed, Charles D. Johnson, Endang M. Septiningsih, Lee Tarpley, Michael J. Thomson</p>\r\n\r\nHigh night-time temperatures (HNT) pose a threat to the sustainability of crop production, including rice. HNT can affect crop productivity and quality by influencing plant physiology, morphology, and phenology. The ethylene perception inhibitor, 1-methylcyclopropene (1-MCP), can minimize HNT-induced damage to plant membranes, thereby preventing decrease in rice yield. In this study, we employed a transcriptome approach to investigate the effects of HNT, 1-MCP, and their interaction on two Texas rice varieties, Antonio and Colorado. The plants were exposed to temperatures of 25°C (ambient night-time temperature, ANT) and 30°C (HNT) using an infrared heating system from the booting stage until harvest, while 1-MCP was applied at the booting stage of rice development. Several physiological and agronomical traits were evaluated under each condition to assess plant responses. Leaf tissues were collected from the plants grown in the ANT and HNT conditions after the heat stress and 1-MCP treatments. Based on agronomic performance, Colorado was less negatively affected than Antonio under HNT, showing a slight reduction in spikelet fertility and leaf photosynthetic rate but no significant reduction in yield. The application of 1-MCP significantly mitigated the adverse effects of HNT in Antonio. However, no significant differences were observed in yield and leaf photosynthetic rate in Colorado. Furthermore, transcriptomic data revealed distinct responsive mechanisms in Antonio and Colorado in response to both HNT and 1-MCP. Several ethylene and senescence-related transcription factors (TFs) were identified only in Antonio, suggesting that 1-MCP affected the ethylene signaling pathway in Antonio but not in Colorado. These findings contribute to our understanding of the physiological differences between varieties exhibiting susceptible and tolerant responses to high night-time temperatures, as well as their response to 1-MCP and ethylene regulation under 1-MCP.","author":"Wardah K. Mustahsan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fb63e95ead28c0ce38a764ce6ce4c00e2b6919142eb78867af20185407a5fe02","category":"Interdisciplinary"}