{"title":"Designing Accessible Text Over Images: Best Practices, Techniques, And Resources (Part 1)","link":"https://smashingmagazine.com/2023/08/designing-accessible-text-over-images-part1/","date":1691136000000,"content":"<p>What is the <em>text over images</em> design pattern? How do we apply this pattern to our designs without sacrificing legibility and readability?</p>\n<p>The text over images design pattern is a design technique used to place text on top of images. It is often used to provide information about the image or to serve as the main website navigation. However, this technique can quickly sacrifice legibility and readability if there is not enough contrast between the text and the image. To prevent this, designers need to ensure that the text and the image have a <strong>high enough contrast ratio</strong> to be legible and readable. Additionally, designers should also make sure the <strong>text is positioned in the right place</strong>, away from any image elements that might cause confusion, distraction, or make it difficult to read.</p>\n<blockquote>“Because images play such an important role, often designers end up placing text over an image to leverage the attention-grabbing aspect of the photo while providing text-based content to communicate actual information. However, these endeavors commonly backfire, usually when the <a href=\"https://www.nngroup.com/articles/low-contrast/\">contrast between the text and the background is too low</a>.”<br /><br />— Aurora Harley, “<a href=\"https://www.nngroup.com/articles/text-over-images/\">Ensure High Contrast for Text Over Images</a>” (NN/g Nielsen Group)</blockquote>\n\n<p>Before going forward, here are some <strong>useful resources</strong> (on how you can apply these techniques in practice with HTML/CSS) that are worth checking out:</p>\n<ul>\n<li>“<a href=\"https://medium.com/@erikdkennedy/7-rules-for-creating-gorgeous-ui-part-2-430de537ba96\">7 Rules For Creating Gorgeous UI - Part 2</a>,” by <a href=\"https://twitter.com/erikdkennedy\">Erik Kennedy</a></li>\n<li>“<a href=\"https://ishadeed.com/article/handling-text-over-image-css/\">Handling Text Over Images by CSS</a>,” by <a href=\"https://twitter.com/shadeed9\">Ahmad Shadeed</a></li>\n<li>“<a href=\"https://css-tricks.com/design-considerations-text-images/\">Design Considerations: Text On Images</a>,” by <a href=\"https://css-tricks.com/author/chriscoyier/\">Chris Coyier</a></li>\n<li>“<a href=\"https://twitter.com/addyosmani/status/1365735686838493187\">How Spotify Makes Text On Images Readable</a>,” a Twitter thread by <a href=\"https://twitter.com/addyosmani\">Addy Osmani</a></li>\n</ul>\nHow To Design A Text Over An Image\n<p>Admittedly, when I was starting my design career, and I had very little accessibility knowledge, one of the main things I used in my designs was the text over images design pattern, without me knowing that I was hurting my users who have low vision.</p>\n<blockquote>“A picture says a thousand words. But sometimes, images alone won’t work. This is why typography still proves to be a vital aspect of design despite the focus on more visual content. Remember that the need for visual content does not tell you to stop adding text to your designs — it simply reminds you to do so in the most tasteful and stylish way possible. And, of course, readability should not be sacrificed in the name of design. You can’t add text that people can barely understand, then argue that it’s a piece of art. Sending a message that cannot be deciphered defies the purpose of what you’re doing.”<br /><br />— Igor Ovsyannykov, “<a href=\"https://creativemarket.com/blog/typography-tricks-readability\">10 Typography Tricks to Make Your Text Much More Readable</a>”</blockquote>\n\n<p>Yet accessibility is a key aspect of design, and working with typography is one of the cornerstones of UX design. There are many typography principles that will help you create user-friendly designs. In the following sections of the article, you will learn more about how you can improve your design <em>without</em> sacrificing the accessibility aspect and how to combine text and images better.</p>\n<blockquote>According to <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/contrast-minimum\">WCAG Success Criterion 1.4.3</a>, make sure that your text on images should meet the minimum contrast of<ul><li><em><strong>3:1</strong> for large text (text bigger than 18 pt normal, or text bigger than 14 pt bold);</em></li><li><em><strong>4.5:1</strong> for body text (text lower than 18 pt normal, or text lower than 14 pt bold).</em></li></ul>Ensure that a minimum visual contrast ratio of 4.5:1 is maintained between the text and its background. This minimum contrast ratio should also be maintained in the case of <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/images-of-text\">images of text</a>.<br /><br />— “<a href=\"https://www.w3.org/WAI/WCAG21/Understanding/contrast-minimum\">Understanding Success Criterion 1.4.3: Contrast (Minimum)</a>,” W3.org</blockquote>\n\n\n\nUsing An Overlay Technique Over The Entire Image\n<p><strong>Overlays</strong> are colored layers such as overlay light, overlay dark, dark gradients, or colored overlays. As a general rule, overlays are used to make images stand out less or to act as a background for the text so that it has better readability and contrast.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-overlay.jpg\" /></p>\n<h3>Examples From The Wild</h3>\n<ul>\n<li><a href=\"https://www.strong.app/\"><strong>Strong App</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-overlay-strong-app.jpg\" /></p>\n<ul>\n<li><a href=\"https://www.hustonengineering.com/\"><strong>Huston Engineering</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-overlay-huston-eng.jpg\" /></p>\n<ul>\n<li><a href=\"https://dellavite.com/us\"><strong>Della Vite</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-overlay-dellavite.jpg\" /></p>\n<h3>Additional Resources On This Topic</h3>\n<ul>\n<li><a href=\"https://codepen.io/yaphi1/\">Optimal Overlay Finder</a><br />An accessibility tool that calculates the ideal opacity to use against your image so that the <a href=\"https://web.dev/color-and-contrast-accessibility/\">contrast</a> meets the WCAG 2.1 Success Criterion</li>\n<li><a href=\"https://abookapart.com/products/color-accessibility-workflows\"><em>Color Accessibility Workflows</em></a>, Geri Coady<br />A book that will teach you what color accessibility is and why it matters</li>\n</ul>\nText With Scrim Overlay\n<p>The <strong>scrim</strong> design technique uses a semi-transparent, lightweight, and semi-opaque gradient layer that helps text appear more readable against various backgrounds.</p>\n<p>According to Google Material Design, “Scrims are temporary treatments that can be applied to Material surfaces for the purpose of making content on a surface less prominent.” They help direct user attention to other parts of the screen, away from the surface receiving a scrim.</p>\n<blockquote>Scrims can be applied in a variety of ways, including the following:<ul><li>Darkening or lightening the surface and its content.</li><li>Reducing the opacity of the surface and its content.</li></ul>Multiple surfaces on a screen at a time can display scrims. Scrims can appear at any elevation, whether in the foreground or background.<br /><br />— <a href=\"https://m2.material.io/design/environment/surfaces.html#properties\">Google Material Design</a></blockquote>\n\n<p>Furthermore, you can explore this technique by using different colors besides black or white colored layers.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-scrim.jpg\" /></p>\n<h3>Examples From The Wild</h3>\n<ul>\n<li><a href=\"https://www.on-running.com/en-ch/\"><strong>On Running</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-scrim-on-running.jpg\" /></p>\n<ul>\n<li><a href=\"https://www.solancosd.org/\"><strong>Solanco School District</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-scrim-solancosd-org.jpg\" /></p>\n<ul>\n<li><a href=\"https://www.sotogardens.com/\"><strong>Soto Gardens</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-scrim-sotogardens.jpg\" /></p>\n<h3>Additional Resources On This Topic</h3>\n<ul>\n<li><a href=\"https://www.figma.com/community/plugin/1062137197474406566/Scrim-That\">Scrim That Figma Plugin</a><br />Quickly add a scrim over a selected layer in Figma Design with the <em>Scrim That</em> plugin with just one click.</li>\n</ul>\nStrips/Highlight Technique\n<p>The <strong>strips/highlight</strong> is one of the simplest design techniques that you can apply to your design. Add a semi-transparent black (or dark-colored) rectangle strip over the image along with your text, or you can be bolder and use different colors instead. But always make sure that the colors you selected for the fonts and the graphic elements have a lot of contrast against the background!</p>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-strips.jpg\" /></p>\n<h3>Examples From The Wild</h3>\n<ul>\n<li><a href=\"https://mode.com/\"><strong>Mode</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-strips-mode.jpg\" /></p>\n<ul>\n<li><a href=\"https://cantos.vc/\"><strong>Cantos</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-strips-cantos.jpg\" /></p>\n<ul>\n<li><a href=\"https://www.estea.se\"><strong>Estea</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-strips-estea.jpg\" /></p>\n<h3>Additional Resources On This Topic</h3>\n<ul>\n<li><a href=\"https://m2.material.io/design/color/text-legibility.html#text-backgrounds\">Google Material Design — Legibility Standards</a><br />All text should be legible and meet accessibility standards. The Web Content Accessibility Guidelines (WCAG 2.0) level AA requires a 4.5:1 color contrast between text and background for normal text and 3:1 for large text. To learn more about color, contrast, and accessibility design, read this chapter on Material Design Accessibility.</li>\n<li>“<a href=\"https://rodneylab.com/accessible-text-on-images/\">Accessible Text on Images: Nail the Contrast Ratio</a>”, Rodney Lab<br />Creating accessible text on images on a website page is not easy. First, there are all the usual accessibility concerns when adding an image to your site. For example, you need to make sure the image has an alt text which describes the image well for partially sighted visitors. But then, you also need to remember to leave the alt text empty if the image is included for decorative purposes only. Next, as with any other text on your site, you need to make sure that the contrast level between the text color and the background color is high enough. And there’s more! This article dives into all these little details.</li>\n<li><a href=\"http://web-accessibility.carnegiemuseums.org/design/color/\">Web Accessibility Guidelines v1.0</a> (<a href=\"http://web-accessibility.carnegiemuseums.org\">Carnegie Museums of Pittsburgh</a>)<br />Find colors that provide maximum contrast, including enough contrast between content and the background, so that text and non-decorative images are legible for anyone with low vision or color deficiencies. Best practices include: taking care of the 4.5:1 (3:1) ratio, (not) using only color as an indicator, and taking into account color blindness.</li>\n</ul>\nFind And Use That Space (Copy Space)\n<p>Yes, <strong>use that space</strong> to position your text, but first, make sure the space is passing the minimum contrast ratio. Space provides the perfect location for your text, especially when you balance and harmonize all the elements between the image and text.</p>\n<p><strong>Copy space</strong> is <a href=\"https://greatescapepublishing.com/travel-photography/the-secret-to-commercial-photography-copy-space/\">an area of an image</a> that is less busy and usually has enough contrast to give you space to write or put your text on.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-space.jpg\" /></p>\n<h3>Examples From The Wild</h3>\n<ul>\n<li><a href=\"https://www.rockwellgroup.com/\"><strong>Rockwell Group</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-space-rockwellgroup.jpg\" /></p>\n<ul>\n<li><a href=\"https://www.greenit-solution.de/en/\"><strong>Green IT Solution</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-space-greenit.jpg\" /></p>\n<ul>\n<li><a href=\"https://www.eventlocation-in-koeln.de/en/\"><strong>Villa Boisserée</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-space-vila.jpg\" /></p>\n<h3>Additional Resources On This Topic</h3>\n<ul>\n<li>“<a href=\"https://designmodo.com/space-design/\">Using Space to Create a Simple and Effective Design</a>,” Carrie Cousins\nSometimes the most effective design technique involves nothing at all, and it is quite intentional. Space can be one of the greatest tools in your design kit. It can make text easier to read, bring focus to certain parts of the design and help create an overall mood or feel. In this article, you will see some great uses of space and how they contribute to both simple and effective design schemes for different websites.</li>\n<li>“<a href=\"https://greatescapepublishing.com/travel-photography/the-secret-to-commercial-photography-copy-space/\">The Secret to Commercial Photography: Copy Space</a>,” Great Escape Publishing<br />Commercial photography is everywhere in our lives. Every time you drive down the highway with its rows of billboards, leaf through the glossy pages of a magazine, or visit a website with banner advertisements, you see commercial stock photography. This article explains one very important concept that helps photos sell: copy space. Copy space is an area of an image that is less busy, which means an advertiser can add text without obscuring critical parts of the photograph and choosing a stock photo becomes more manageable when the photographer has copy space in mind from the get-go.</li>\n</ul>\nText Over Blurred Background Effect Of The Entire Image\n<p>Blurring an image with a variety of blurred background styles, such as blurring the entire image, or adding a blur effect to highlight only the main subject, can bring focus into your text layered on top of the image, tone down the “busy” feeling of the image, and also add more dimension and depth to the visuals.</p>\n<p>The <strong>blurred background</strong> design technique is widely used for <a href=\"https://www.optimizely.com/optimization-glossary/hero-image/\">hero headers</a> when combined with a bold, impactful typeface.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-blur.jpg\" /></p>\n<h3>Examples From The Wild</h3>\n<ul>\n<li><a href=\"https://hlkagency.com/\"><strong>HLK Agency</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-blur-hlkagency.jpg\" /></p>\n<ul>\n<li><a href=\"https://tion-renewables.com/\"><strong>Tion Renewables</strong></a></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/designing-accessible-text-over-images-part1/smashing-text-over-images-technique-blur-tion.jpg\" /></p>\n<h3>Additional Resources On This Topic</h3>\n<ul>\n<li>“<a href=\"https://code-boxx.com/blurred-text-images-html-css/\">Blurred Text &amp; Images In HTML CSS (Simple Examples)</a>,” W.S. Toh<br />A quick tutorial on how to create blurred text and images with CSS only.</li>\n</ul>\nConclusion\n<p>Thank you for joining me on this accessibility journey. So far, we covered five key techniques when designing text over images: using an overlay over the entire image, text with scrim overlay, strips/highlight, copy space, and text over blurred background effect. In the following article of the series, we will review five more — frame the image, soft-colored gradients, text styles and text position, solid color shapes, and use of colored backgrounds — and I will also share with you a few additional useful tools and resources. Stay tuned!</p>\n<h3>Further Reading On SmashingMag</h3>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2020/05/accessible-images/\">Accessible Images For When They Matter Most</a>,” Carie Fisher</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/09/realities-myths-contrast-color/\">The Realities And Myths Of Contrast And Color</a>,” Andrew Somers</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2021/12/designing-better-links-websites-emails-guideline/\">Designing Better Links For The Web</a>,” Slava Shestopalov</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2023/01/closed-captions-subtitles-ux/\">Designing for Accessibility: Best Practices for Closed Captioning and Subtitles UX</a>,” Vitaly Friedman</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"fb66838b06ff241d84bf977559c69e869af1a19770439291d3c4e003a4cb9b49","category":"Tech"}