{"title":"Adverse Cardiovascular Outcomes in Young Cannabis Users: A Nationwide Analysis","link":"https://www.preprints.org/manuscript/202404.2013/v1","date":1714481175000,"content":"Abstract: \n Background: With the growing trends in recreational marijuana use, our study aims at analyzing the association between Acute coronary syndromes (ACS) and Ventricular Fibrillation (Vfib) and cannabis use disorder in young adults (18 – 45)\n Methods: National In-patient Sample was used for population analysis. Probit logistic regression was used for analyzing the associations between diagnosis of ACS/ Vfib and documented cannabis use disorder. Propensity Score matched samples were made from the ACS/Vfib admissions with Cannabis use disorder to analyze the in-hospital outcomes. \n\n Results: Statistically significant association was found between admission diagnosis of ACS/ vfib, and documented cannabis use disorder in the study population. The association remained sig-nificant after accounting for potential confounders. Documented race as black, documented di-agnosis of uncontrolled hypertension and diabetes were found to have significant association with admissions for ACS among the population with documented Cannabis use disorder. No difference in mortality were found between ACS admissions with and without documented cannabis use disorder in the propensity matched cohorts. \nConclusions: Documented diagnosis of Cannabis use disorder has statistically significant associ-ation with admission diagnosis of ACS/Vfib even after accounting for confounders. Documented race as black, and co existing diagnosis of uncontrolled hypertension and diabetes had significant association with admission diagnosis of ACS in population with documented cannabis use dis-order. \nKeywords: Cannabis use disorder; ACS; Ventricular fibrillation","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fb754abb9d4a2da51d96c778e93e52815288a42cd1556bb983ab8ea1d52bac90","category":"Interdisciplinary"}