{"title":"Comparative toxicological assessment of 2 bisphenols using a systems approach: evaluation of the behavioral and transcriptomic responses of Danio rerio to bisphenol A and tetrabromobisphenol A","link":"https://academic.oup.com/toxsci/article/200/2/394/7668450?rss=1","date":1715299200000,"content":"<span><div>Abstract</div>The zebrafish (<span>Danio rerio</span>) is becoming a critical component of new approach methods (NAMs) in chemical risk assessment. As a whole organism <span>in vitro</span> NAM, the zebrafish model offers significant advantages over individual cell-line testing, including toxicokinetic and toxicodynamic competencies. A transcriptomic approach not only allows for insight into mechanism of action for both apical endpoints and unobservable adverse outcomes, but also changes in gene expression induced by lower, environmentally relevant concentrations. In this study, we used a larval zebrafish model to assess the behavioral and transcriptomic alterations caused by subphenotypic concentrations of 2 chemicals with the same structural backbone, the endocrine-disrupting chemicals bisphenol A and tetrabromobisphenol A. Following assessment of behavioral toxicity, we used a transcriptomic approach to identify molecular pathways associated with previously described phenotypes. We also determined the transcriptomic point of departure for each chemical by modeling gene expression changes as continuous systems which allows for the identification of a single concentration at which toxic effects can be predicted. This can then be investigated with confirmatory cell-based testing in an integrated approach to testing and assessment to determine risk to human health and the environment with greater confidence. This paper demonstrates the impact of using a multi-faceted approach for evaluating the physiological and neurotoxic effects of exposure to structurally related chemicals. By comparing phenotypic effects with transcriptomic outcomes, we were able to differentiate, characterize, and rank the toxicities of related bisphenols, which demonstrates methodological advantages unique to the larval zebrafish NAM.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"fb7d0906b160da9e23baa9d03e9d27a056655fd7b1467f2097e771e11aa93706","category":"Environment"}