{"title":"Feds open up $100 million funding for EV charger reliability grants","link":"https://arstechnica.com/?p=1968159","date":1694630543000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/EA-charger-800x600.jpg\" alt=\"An electrify America charger with a white toyota ev behind it\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/EA-charger-scaled.jpg\">Enlarge</a> <span>/</span> Electrify America promised a lot when it first arrived, but now it mostly promises frustration and broken hardware. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Wednesday the Joint Office of Energy and Transportation announced it is accepting applications for grants to improve electric vehicle charger reliability. The Joint Office has $100 million to spend in this area to fund grants to repair or replace malfunctioning or broken EV chargers. The money was set aside as part of the National Electric Vehicle Infrastructure Program, <a href=\"https://arstechnica.com/cars/2023/02/heres-how-the-government-plans-to-make-ev-chargers-common-and-reliable/\">which allocated $5 billion for a national network of EV chargers by 2027</a>.</p>\n<p>\"We know that people expect public EV chargers to work the first time, every time,\" said Joint Office of Energy and Transportation Executive Director Gabe Klein. \"That's why we have a multi-pronged approach to create a seamless charging experience by building a capable workforce, tracking reliability metrics, and convening industry to ensure they can meet the performance standards for federally funded chargers set earlier this year.\"</p>\n<p>\"This funding to repair and replace non-operational chargers combined with the efforts of the ChargeX Consortium should increase reliability significantly over the next two years,” said Klein.</p></div><p><a href=\"https://arstechnica.com/?p=1968159#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1968159&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fb85b610149b65d111e5026384bb64fb99328ed846b0abadfb075917592b0ee6","category":"Tech"}