{"title":"Consumption of hyaena faeces and artificial mineral licks by leopard tortoises (Stigmochelys pardalis) in a low‐nutrient environment","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13308?af=R","date":1721109359000,"content":"<h2>Abstract</h2>\n<p>Hyaena faeces and mineral licks represent highly concentrated nutrient resources for leopard tortoises (<i>Stigmochelys pardalis</i>) living in nutrient-poor environments. Here, we provide direct evidence for the consumption of hyaena faeces and artificial mineral licks by leopard tortoises in the Kalahari Desert. Tortoises aggregated at hyaena latrines and lick sites during the wet season between 10 AM and 6 PM in groups of 1–5 individuals. Where both salt and mineral licks were available, tortoises displayed a preference for salt. We suggest that calcium, phosphorus and sodium deficits are likely driving coprophagy and geophagy behaviours by tortoises in the Kalahari.</p>\n<h2>Abstrait</h2>\n<p>Les excréments de hyène et les lèches minérales représentent des ressources nutritives très concentrées pour les tortues léopard (<i>Stigmochelys pardalis</i>) qui vivent dans des environnements pauvres en nutriments. Dans cette étude, nous fournissons des preuves directes de la consommation des excréments de hyène et de lèches minérales artificielles par les tortues léopards dans le désert du Kalahari. Les tortues se sont regroupées en groupes de 1 à 5 individus sur les excréments de hyène et les sites de léchage minérales pendant la saison humide, entre 10 heures et 18 heures. Lorsqu’il y avait à la fois du sel et des léchages de minéraux, les tortues montraient une préférence pour le sel. Notre hypothèse est que le manque de calcium, de phosphore et de sodium serait à l’origine des comportements de coprophagie et de géophagie chez les tortues dans le Kalahari.</p>","author":"Andrew J. Abraham, \nMattheus L. H. Louw, \nLaurene M. van Dijk, \nAndrea B. Webster","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"fb8a789168056e83249b7ebc43983dbaf4bf216b8845af8ea9403e34fb959543","category":"Environment"}