{"title":"A situational assessment of treatments received for childhood diarrhea in the Federal Republic of Nigeria","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303963","date":1716386400000,"content":"<p>by Ezra Gayawan, Ewan Cameron, Tolu Okitika, Osafu Augustine Egbon, Peter Gething</p>\r\n\r\nWe assess progress towards improved case management of childhood diarrhea in Nigeria over a period of targeted health systems reform from 2013 to 2018. Individual and community data from three Demographic and Health Survey rounds are leveraged in a geospatial model designed for stratified estimation by venue of treatment seeking and State. Our analysis reveals a highly regionalised health system undergoing rapid change. Nationally, there have been substantial increases in the proportion of children under 5 years old with diarrhea receiving the recommended oral rehydration therapy after seeking treatment at either a health clinic (0.57 [0.44–0.69; 95% CI] in 2008; 0.70 [0.54–0.83] in 2018) or chemist/pharmacy (0.28 [0.17–0.42] in 2008; 0.48 [0.31–0.64] in 2018). Yet State-level variations in venue attendance and performance by venue have conspired to hold the overall proportion receiving this potentially life-saving therapy (0.45 [0.35–0.55] in 2018) to well-below ideal coverage levels. High performing states that have demonstrated significant improvements include Kano, Jigawa and Borno, while under-performing states that have suffered declines in coverage include Kaduna and Taraba. The use of antibiotics is not recommended for mild cases of childhood diarrhea yet remains concerningly high nationally (0.27 [0.19–0.36] in 2018) with negligible variation between venues. Antibiotic use rates are particularly high in Enugu, Kaduna, Taraba, Kano, Niger and Kebbi, yet welcome reductions were identified in Jigawa, Adamawa and Osun. These results support the conclusions of previous studies and build the strength of evidence that urgent action is needed throughout the multi-tiered health system to improve the quality and equity of care for common childhood illnesses in Nigeria.","author":"Ezra Gayawan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fb9d1a8cc14e9253a7fb4352205fb034289fdc2c5fc6b2acf43d205edc1811c7","category":"Interdisciplinary"}