{"title":"Influence of model complexity, training collinearity, collinearity shift, predictor novelty and their interactions on ecological forecasting","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13793?af=R","date":1707816398000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Ecological forecasting is critical in understanding of ecological responses to climate change and is increasingly used in climate mitigation plans. The forecasts from correlative models can be challenged by model complexity, training collinearity, collinearity shift and novel conditions of predictors that are common during model extrapolation. The individual effect of these four factors has been investigated, but it is still unclear how these four factors interactively affect forecasting. To fill this gap, we conducted a comprehensive simulation experiment to quantify how the four factors interactively influence model forecasting.</p>\n<h2>Location</h2>\n<p>Simulated regions.</p>\n<h2>Time Period</h2>\n<p>Simulated scenarios.</p>\n<h2>Methods</h2>\n<p>We modelled three response variables commonly used in ecological forecasting following normal, Poisson and binomial distributions as a function of three functional relationships that represented model complexity under three levels of training collinearity using generalized linear models. By calculating prediction error under 3,780,000 testing scenarios, we partitioned its variance to model complexity, training collinearity, collinearity shift, predictor novelty and their interactions.</p>\n<h2>Results</h2>\n<p>We found that increased predictor novelty and collinearity shift degraded model performance, leading up to double prediction errors when a predictor's range increased by ~22% or when the correlation <i>r</i> between two predictors changed &gt;~0.8 for the combination of high training collinearity and interaction functional relationship. Predictor novelty reduced the influence of collinearity shift on model performance, suggesting a negative interaction between them. This pattern was more pronounced under high model complexity and high training collinearity.</p>\n<h2>Main Conclusions</h2>\n<p>The accuracy of ecological forecasting using correlative models depends on model complexity, training collinearity, collinearity shift, predictor novelty and their interactions. Besides the consideration of parsimonious models and <i>r</i> of 0.7 in model training, our study further recommends a threshold of &lt;22%–50% increased predictor range depending on training collinearity and/or &lt;0.8 correlation change for making reliable forecasting.</p>","author":"Xin Chen, \nYe Liang, \nXiao Feng","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"fb9fda291d9d7465085f8fab719a9b46c9388156a0bd75aa9d47072aa7374ee9","category":"Environment"}