{"title":"PSV-27 Optimizing corn silage utilization in beef feedlot diets: Evaluating the impact of exogenous glucoamylase addition on performance and digestibility","link":"https://academic.oup.com/jas/article/102/Supplement_3/739/7757850?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The addition of an exogenous glucoamylase enzyme preparation to feedlot diets that contain a high percentage of corn silage may improve digestibility and yield positive outcomes in growth and efficiency. However, it is unclear what concentration of corn silage in the diet would most benefit from exogenous glucoamylase. Crossbred steers [n = 180; body weight (BW) = 459 ± 11.8 kg] were divided into 30 pens (5 pens per treatment; 6 steers per pen) and assigned to one of six treatments arranged as a 3 x 2 factorial investigating 3 forage concentrations (15, 42, and 69% corn silage) and 2 exogenous glucoamylase additions (0 or 183 enzyme units/kg of dry matter per d). Steers were fed 42% corn silage, 30% corn, 23% dried distillers grains with solubles, and 5% supplement at feedlot entry and for 2 wk prior to initiation of the study. Steers on the 15% and 69% corn silage diets were transitioned to treatment diets by wk 3 of the study (d 15), with the first transition occurring on d 0. Diet transitions occurred once weekly. The animals were on feed for 105 ± 10.4 d and had ad libitum access to feed and water. Average daily gain (ADG), dry matter intake (DMI), and gain:feed were assessed both overall and for two distinct periods: d 0 to 50, and d 51 until slaughter. Data analysis was performed using the GLIMMIX procedure of SAS. From d 0 to 50, ADG, DMI, and gain:feed did not differ due to forage concentration or enzyme inclusion and there was no interaction (<span>P</span> ≥ 0.39). For d 51 to slaughter, enzyme inclusion interacted with forage concentration such that the enzyme improved ADG (<span>P</span> = 0.0003) and gain:feed (<span>P</span> = 0.01) for steers fed the 42% corn silage diet but did not effect ADG and gain:feed for steers fed the 15 or 69% corn silage diets. For d 51 to slaughter DMI was not affected by forage concentration, enzyme inclusion, or their interaction (<span>P</span> ≥ 0.21). When calculated for the entire study (d 0 to slaughter), increasing forage concentration decreased ADG and gain:feed (<span>P</span> ≤ 0.0006), but did not effect DMI (<span>P</span> = 0.22). Overall, enzyme addition did not impact ADG, DMI, or gain:feed and did not interact with forage concentration (<span>P</span> ≥ 0.50). Carcass characteristics were not affected by forage concentration, enzyme addition, or their interaction (<span>P</span> ≥ 0.19). Overall results suggest that an exogenous glucoamylase enzyme improves growth and efficiency of heavier feedlot cattle fed moderate amounts of forage later in the feeding period.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"fba263044bdad0d0744e8f5d0ba26f9203411f3a14c3c9c38a877ac079d0313e","category":"Environment"}