{"title":"U.S. Lawmakers Introduce Antitrust Legislation That Could Significantly Impact Apple and Other Tech Companies","link":"https://www.macrumors.com/2021/06/11/us-lawmakers-tech-antitrust-legislation/","date":1623440056000,"content":"U.S. House lawmakers <a href=\"https://cicilline.house.gov/press-release/house-lawmakers-release-anti-monopoly-agenda-\">today announced</a> sweeping bipartisan antitrust legislation that could result in major changes to the tech industry, impacting companies like Apple, Amazon, Facebook, and Google.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/app-store-blue-banner.jpg\" />\r\n<br />\r\nThese measures are the culmination of a 16-month antitrust investigation into tech companies practices that <a href=\"https://www.macrumors.com/2019/07/23/doj-tech-company-antitrust-review/\">kicked off in 2019</a>, and which saw Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> <a href=\"https://www.macrumors.com/2020/07/29/tim-cook-antitrust-hearing/\">testify in an antitrust hearing</a> alongside Alphabet/Google CEO Sundar Pichai, Amazon CEO Jeff Bezos, and Facebook CEO Mark Zuckerberg.\r\n<br />\r\n\r\n<br />\r\nAt the conclusion of that hearing, which took place in July 2020, the U.S. House Judiciary Antitrust Subcommittee leading the inquiry <a href=\"https://www.macrumors.com/2020/10/06/us-antitrust-report-apple-recommendations/\">released a 450 page report</a> with recommendations that have turned into the new antitrust bills that were proposed today. The five bills are aimed at Apple, Amazon, Facebook, and Google, with Antitrust Subcommittee Chairman David Cicilline suggesting the legislation will \"level the playing field.\"<blockquote>\"The American people sent us to Washington to get things done. Nothing is more important than ensuring every American has an opportunity to get ahead. Right now, unregulated tech monopolies have too much power over our economy. They are in a unique position to pick winners and losers, destroy small businesses, raise prices on consumers, and put folks out of work. Our agenda will level the playing field and ensure the wealthiest, most powerful tech monopolies play by the same rules as the rest of us.\"</blockquote>\r\n<br />\r\nRep. Ken Buck, the lead Republican on the committee, said that the four major tech companies have \"harmed American businesses and consumers\" by prioritizing \"power over innovation.\"<blockquote>\"Big Tech has abused its dominance in the marketplace to crush competitors, censor speech, and control how we see and understand the world. Apple, Amazon, Facebook, and Google have prioritized power over innovation and harmed American businesses and consumers in the process. These companies have maintained monopoly power in the online marketplace by using a variety of anticompetitive behaviors to stifle competition. This legislation breaks up Big Tech's monopoly power to control what Americans see and say online, and fosters an online market that encourages innovation and provides American small businesses with a fair playing field. Doing nothing is not an option, we must act now.\"</blockquote>There are five separate bipartisan bills that have been drafted by lawmakers, as outlined below:\r\n<br />\r\n<ul>\r\n<br />\r\n \t<li><a href=\"https://cicilline.house.gov/sites/cicilline.house.gov/files/documents/American%20Innovation%20and%20Choice%20Online%20Act%20-%20Bill%20Text.pdf\">\"American Innovation and Choice Online Act\"</a> - Prohibits discriminatory conduct by dominant platforms, including a ban on self-preferencing and picking winners and losers online.</li>\r\n<br />\r\n \t<li><a href=\"https://cicilline.house.gov/sites/cicilline.house.gov/files/documents/Platform%20Competition%20and%20Opportunity%20Act%20-%20Bill%20Text%20%281%29.pdf\">\"Platform Competition and Opportunity Act\"</a> - Prohibits acquisitions of competitive threats by dominant platforms, as well acquisitions that expand or entrench the market power of online platforms.</li>\r\n<br />\r\n \t<li><a href=\"https://cicilline.house.gov/sites/cicilline.house.gov/files/documents/Ending%20Platform%20Monopolies%20-%20Bill%20Text.pdf\">\"Ending Platform Monopolies Act\"</a> - Eliminates the ability of dominant platforms to leverage their control over across multiple business lines to self-preference and disadvantage competitors in ways that undermine free and fair competition.</li>\r\n<br />\r\n \t<li><a href=\"https://cicilline.house.gov/sites/cicilline.house.gov/files/documents/ACCESS%20Act%20-%20Bill%20Text%20%281%29.pdf\">\"Augmenting Compatibility and Competition by Enabling Service Switching (ACCESS) Act\"</a> - Promotes competition online by lowering barriers to entry and switching costs for businesses and consumers through interoperability and data portability requirements.</li>\r\n<br />\r\n \t<li><a href=\"https://cicilline.house.gov/sites/cicilline.house.gov/files/documents/Merger%20Filing%20Fee%20Modernization%20Act%20of%202021%20-%20Bill%20Text%20%281%29.pdf\">The \"Merger Filing Fee Modernization Act\"</a> - Updates filing fees for mergers for the first time in two decades to ensure that Department of Justice and Federal Trade Commission have the resources they need to aggressively enforce the antitrust laws.</li>\r\n<br />\r\n</ul>Apple's competitors have already been weighing in on the bills. Spotify legal chief Horatio Gutierrez <a href=\"https://www.cnbc.com/2021/06/11/amazon-apple-facebook-and-google-targeted-in-bipartisan-antitrust-reform-bills.html\">said in a statement</a> that the American Choice and Innovation Online Act is an \"important step in addressing anti-competitive conduct in the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> ecosystem, and a clear sign that momentum has shifted as the world is waking up to the need to demand fair competition in the App economy.\" \r\n<br />\r\n\r\n<br />\r\nIf ultimately passed, the legislation will overhaul competition laws that have not been revisited for decades, but tech companies will likely fight the bills.<div>Tag: <a href=\"https://www.macrumors.com/guide/antitrust/\">antitrust</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/11/us-lawmakers-tech-antitrust-legislation/\">U.S. Lawmakers Introduce Antitrust Legislation That Could Significantly Impact Apple and Other Tech Companies</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/u-s-lawmakers-introduce-antitrust-legislation-that-could-significantly-impact-apple-and-other-tech-companies.2300493/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=tK19BiSEl0Y:Z2bHQK63l6A:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=tK19BiSEl0Y:Z2bHQK63l6A:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/tK19BiSEl0Y\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fbabe5b0cdadca8dbb2d49338ac8ef88f11d134e228e3dcc3abe2a4bba529586","category":"Apple"}