{"title":"Interplay between vitamin D status, vitamin D receptor gene variants and preeclampsia risk in Ghanaian women: A case-control study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303778","date":1717077600000,"content":"<p>by Linda Ahenkorah Fondjo, Jonah Buah Mensah, Enoch Ofori Awuah, Samuel Asamoah Sakyi</p>\r\nBackground and aim <p>Preeclampsia (PE) is characterized by hypertension and proteinuria mostly after 20 weeks of gestation. It affects 2–8% of pregnancies worldwide, with detrimental consequences for both mother and foetus. Evidence, suggests that genetic factors, including vitamin D receptor (VDR) gene polymorphisms, could contribute to PE complexity. However, their role in the Ghanaian population remains underexplored. We assessed the interplay between Vitamin D, VDR gene variants and preeclampsia risk in Ghanaian women.</p> Methods <p>This unmatched case-control study was conducted at Kumasi South Hospital, Ghana, from June to November 2022. A total of 162 participants consisting of 62 PE cases and 100 normotensive controls were enrolled. Clinical and obstetric data were collected. Blood samples were also collected for DNA extraction and vitamin D assay. Genotyping of VDR Fok1 and Bsm1 gene variants was performed using Polymerase Chain Reaction (PCR) and Polymerase Chain Reaction—Restriction Fragment Length Polymorphism (PCR-RFLP) analysis whereas Vitamin D levels were estimated using sandwich ELISA. Statistical analyses were computed with SPSS version 25 and GraphPad prism version 8.0. A p-value of &lt; 0.05 was considered statistically significant.</p> Results <p>Vitamin D concentration were significantly lower in the PE group (<i>p</i> &lt; 0.0001). Vitamin D deficiency (aOR = 3.311, 95% CI: 1.584–6.921, p = 0.0010) was significantly associated with a three-fold increase in preeclampsia risk, whilst VDR gene variants, particularly the \"bb\" genotype (cOR = 0.227, 95% CI: 0.055–0.944, p = 0.0410) was associated with reduced risk of PE. There was no association between the distribution of Fok1 genotypes and PE.</p> Conclusion <p>This study highlights a significant association between vitamin D deficiency and an increased risk of PE among Ghanaian women. However, the VDR gene variant, \"bb\", genotype, for Bsm1 reduces the risk of PE.</p>","author":"Linda Ahenkorah Fondjo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fbb28fc0533450a6faf4df28ea82eebba11a819b6706c25475820d593b58d5c4","category":"Interdisciplinary"}