{"title":"Arabidopsis ribosomal RNA processing meerling mutants exhibit suspensor-derived polyembryony due to direct reprogramming of the suspensor","link":"https://academic.oup.com/plcell/article/36/7/2550/7633283?rss=1","date":1710979200000,"content":"<span><div>Abstract</div>Embryo development in Arabidopsis (<span>Arabidopsis thaliana</span>) starts off with an asymmetric division of the zygote to generate the precursors of the embryo proper and the supporting extraembryonic suspensor. The suspensor degenerates as the development of the embryo proper proceeds beyond the heart stage. Until the globular stage, the suspensor maintains embryonic potential and can form embryos in the absence of the developing embryo proper. We report a mutant called <span>meerling-1</span> (<span>mrl-1</span>), which shows a high penetrance of suspensor-derived polyembryony due to delayed development of the embryo proper. Eventually, embryos from both apical and suspensor lineages successfully develop into normal plants and complete their life cycle. We identified the causal mutation as a genomic rearrangement altering the promoter of the Arabidopsis <span>U3 SMALL NUCLEOLAR RNA-ASSOCIATED PROTEIN 18</span> (<span>UTP18</span>) homolog that encodes a nucleolar-localized WD40-repeat protein involved in processing 18S preribosomal RNA. Accordingly, root-specific knockout of <span>UTP18</span> caused growth arrest and accumulation of unprocessed 18S pre-rRNA. We generated the <span>mrl-2</span> loss-of-function mutant and observed asynchronous megagametophyte development causing embryo sac abortion. Together, our results indicate that promoter rearrangement decreased UTP18 protein abundance during early stage embryo proper development, triggering suspensor-derived embryogenesis. Our data support the existence of noncell autonomous signaling from the embryo proper to prevent direct reprogramming of the suspensor toward embryonic fate.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"fbc31492881be0499e791efd860d7eb465cb405ea9190d093ae3c2fa5eefdc75","category":"Environment"}