{"title":"Different temperature sensitivities of key physiological processes lead to divergent trait response patterns in Arctic phytoplankton","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12633?af=R","date":1723833029000,"content":"<h2>Abstract</h2>\n<p>Ocean warming is especially pronounced in the Arctic, and phytoplankton will face thermodynamically driven changes in their physiology, potentially pushing them beyond their thermal optimum. We assessed temperature responses of multiple functional traits over their entire thermal window (growth rates, quotas of particulate organic carbon, nitrogen, and chlorophyll <i>a</i>, as well as photophysiological parameters) in three different Arctic phytoplankton species (<i>Thalassiosira hyalina</i>, <i>Micromonas pusilla</i>, and <i>Nitzschia frigida</i>). Temperature response patterns in growth and biomass production rates indicated that all species exhibit wide thermal windows with highest rates at temperatures that exceed current polar temperatures. Species showed different temperature response patterns in cellular elemental quotas, which originate from the interplay of cell division and biomass production: These processes differ in their temperature sensitivity and optima, resulting in U-shaped, bell-shaped, or linear patterns of elemental quotas. Despite unaltered light intensity, higher temperatures increased light acclimation indices in all species while lifetimes of photosystem II reopening decreased in all species, suggesting that warming causes a transition from light saturation to light limitation. Our findings on temperature sensitivities of cell division and biomass production not only indicate that Arctic phytoplankton may benefit from moderate warming, but also highlight that meaningful interpretations of cellular quotas require a consideration of the underlying processes.</p>","author":"Linda Rehder, \nSebastian D. Rokitta, \nClara J. M. Hoppe, \nIsabelle Buschmann, \nLevke Jasper, \nBjörn Rost","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"fbcf606476d05d16d635748eebcb13c671a03f270d65d187e388b8ad48b6d899","category":"Environment"}