{"title":"Twitter Rebranded as 'X'","link":"https://www.macrumors.com/2023/07/24/twitter-rebranded-as-x/","date":1690194071000,"content":"Twitter has rebranded as \"<a href=\"https://twitter.com/home\">X</a>\" worldwide, under the <a href=\"https://twitter.com/elonmusk/status/1683171310388535296\">direction of owner Elon Musk</a>. An \"interim\" logo featuring a white X on a black background has replaced the original blue bird logo on the platform, signaling the billionaire's intention to transform the social media network into an \"everything app\" similar to China's WeChat.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/X-twitter-logo.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nMusk on Sunday changed his profile picture to the new logo and added to his bio \"X.com,\" which redirects to a brief \"X\" splash screen on Twitter's homepage. In a <a href=\"https://twitter.com/lindayacc/status/1683353772917940225?s=20\">tweet</a> on Monday morning, Twitter CEO Linda Yaccarino said \"X is here! Let's do this.\" Musk later <a href=\"https://twitter.com/elonmusk/status/1683378289031761920?s=20\">shared an image</a> of the new X branding projected onto the side of Twitter's headquarters in San Francisco.  \r<br />\n\r<br />\nTwitter's official legal entity name was registered as X Corp when the company was acquired in October 2022 by Musk, who has since been referring to it as \"X\" or \"an accelerant to creating X,\" but the customer-facing avian branding had hitherto survived. \r<br />\n\r<br />\nThe social media platform has been called Twitter since its launch in March 2006, and its <a href=\"https://about.twitter.com/en/who-we-are/brand-toolkit#:~:text=Twitter%20logo,like%20you%20to%20use%20it.\">About page</a> still says the blue bird logo is \"our most recognizable asset\" and \"That's why we're so protective of it.\" \r<br />\n\r<br />\nRegardless, Musk believes the replacement \"should have been done a long time ago.\" His penchant for the letter X is evident elsewhere, for example in his SpaceX and X.Ai company names. X.com was also the name of the online bank Musk co-founded, before it merged with Confinity to eventually become PayPal.\r<br />\n\r<br />\nAccording to <a href=\"https://www.threads.net/t/CvCuOMwrNco/\"><em>Platformer</em>'s Zoe Schiffer</a>, Musk sent an email last night to Twitter employees telling them the company would publicly become known as X, and that it was the last time he would email from a Twitter address.\r<br />\n\r<br />\n<div><blockquote><p><a href=\"https://t.co/IwcbqMnQtA\">pic.twitter.com/IwcbqMnQtA</a></p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1682978324375543808?ref_src=twsrc%5Etfw\">July 23, 2023</a></blockquote> </div>\r<br />\nIn a <a href=\"https://twitter.com/lindayacc/status/1683213895463215104?s=20\">Sunday tweet</a>, Yaccarino suggested X would be powered by AI and offer users \"unlimited interactivity – centered in audio, video, messaging, payments/banking – creating a global marketplace for ideas, goods, services, and opportunities... X will connect us all in ways we're just beginning to imagine.\"\r<br />\n\r<br />\n\"Tweets\" are to be replaced, according to Musk, and posts will be called \"x's\". As of writing, the service still appears as Twitter in the official app, but expect that to also change soon.<div>Tags: <a href=\"https://www.macrumors.com/guide/twitter/\">Twitter</a>, <a href=\"https://www.macrumors.com/guide/elon-musk/\">Elon Musk</a>, <a href=\"https://www.macrumors.com/guide/x/\">X</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/24/twitter-rebranded-as-x/\">Twitter Rebranded as 'X'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/twitter-rebranded-as-x.2396725/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fbe4db22a1a0a47af81c8d51f2be54eb48e96334927723362cb7cc034376f39a","category":"Apple"}