{"title":"Popular Reddit App Apollo Shutting Down on June 30","link":"https://www.macrumors.com/2023/06/08/apollo-shutting-down-june-30/","date":1686245236000,"content":"Popular third-party Reddit app <a href=\"https://www.reddit.com/r/apolloapp/comments/144f6xm/apollo_will_close_down_on_june_30th_reddits/\">Apollo will be shutting down</a> as of June 30, Apollo developer Christian Selig announced today. The news comes after Reddit decided to start requiring developers to pay an unreasonable amount to access its API.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/05/Apollo-for-Reddit-Feature.png\" alt width=\"1820\" height=\"1024\" />\r<br />\nSelig <a href=\"https://www.macrumors.com/2023/05/31/reddit-api-changes-pricing-apollo/\">said in late May</a> that Reddit is charging $12,000 for 50 million requests, and given the number of people that use Apollo, that would result in a $20 million per year charge that is unfeasible for Selig to pay.\r<br />\n\r<br />\n<div><blockquote><p>Apollo will close down on June 30th. Reddit’s recent decisions and actions have unfortunately made it impossible for Apollo to continue. Thank you so, so much for all the support over the years. ❤️ <a href=\"https://t.co/HOJaLMW8fx\">https://t.co/HOJaLMW8fx</a></p>— Christian Selig (@ChristianSelig) <a href=\"https://twitter.com/ChristianSelig/status/1666857672489189376?ref_src=twsrc%5Etfw\">June 8, 2023</a></blockquote> </div>\r<br />\nReddit has not budged on its pricing plans despite protests from users and Reddit moderators who rely on third-party apps, and the change will make it impossible for Apollo to continue to operate. \"Going from a free API for 8 years to suddenly incurring massive costs is not something I can feasibly make work with only 30 days,\" Selig wrote. \r<br />\n\r<br />\nApollo is the most popular third-party Reddit app, primarily because of the work that Selig has put into it. He regularly adds new features and updates, and interfaces with users to get feedback on new functionality. Reddit maintains its own app, but it does not have the same feature options as Apollo, and users who rely on the Apollo app will be undoubtedly disappointed by this turn of events. \r<br />\n\r<br />\nOver the last several days, Selig has attempted to work out a deal with Reddit, but it has been clear that Reddit has no plan to offer more reasonable API pricing. Reddit has in fact claimed that Selig tried to extort money from the company and is operating Apollo inefficiently, but has been unable to provide Selig with more information on how the app can be improved to further cut down on API usage. Selig does believe he could rewrite code to make Apollo more efficient in the long run, but Reddit has provided just 30 days for him to implement code changes, switch to a subscription model, migrate users, and make other updates. In addition to the cost and the negative interaction that he's had with Reddit leadership, Selig says that the timing is another reason that he's not able to make Apollo work with Reddit's new API pricing.\r<br />\n\r<br />\nSelig has provided full details on why he has made the decision to shut down Apollo, plus he has transcripts and audio of his discussions with Reddit and <a href=\"https://www.reddit.com/r/apolloapp/comments/144f6xm/apollo_will_close_down_on_june_30th_reddits/\">what led to this decision</a>.\r<br />\n<br />This article, \"<a href=\"https://www.macrumors.com/2023/06/08/apollo-shutting-down-june-30/\">Popular Reddit App Apollo Shutting Down on June 30</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/popular-reddit-app-apollo-shutting-down-on-june-30.2392262/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fbed019653e53a84ba3db1c5fb81d96ecdb089de0d5bf555119e635928115608","category":"Apple"}