{"title":"Optimizing a Pipeline for Eukaryotic Ultrastructure","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.362/7720454?rss=1","date":1721779200000,"content":"<span>Cryo-electron tomography (cryo-ET) has long been used to understand cell ultrastructure, and new technological advancements have allowed the field to quickly progress in the past 10 years. Sub nanometer resolution structures can be identified by subtomogram averaging and many semi-automated segmentation software now exists [<a href=\"#ozae044.362-B1\">1</a>]. We have established a pipeline to image common cryo-ET targets, mitochondria and the endoplasmic reticulum (ER), as well as a much less common target, primary cilia. These targets have been chosen for the following reasons. Mitochondria, and organelles associated with mitochondria, have been routinely imaged by cryo-ET due to their highly recognizable features in electron micrographs [<a href=\"#ozae044.362-B2\">2</a>]. On the contrary, there are no existing studies of primary cilia imaged with cryo-ET on whole, fully intact cells and questions remain regarding microtubule arrangement [<a href=\"#ozae044.362-B3\">3</a>]. There are many diseases caused by ciliopathies, such as Joubert syndrome, Meckel-Gruber syndrome, and Bardet-Biedl syndrome, to name a few. These occur when cilia have abnormal form or function, often as a result of a genetic mutation [<a href=\"#ozae044.362-B4\">4</a>]. We have established a reproducible pipeline of culturing various cell lines onto EM grids. This workflow can be applied to cytoplasmic organelles as well as cellular appendages. We use correlative light and electron microscopy (CLEM) with focused ion beam milling on an Aquilos 2 to target regions of interest and create optimal cryo-ET samples.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"fbef79ef914464cdf157443b6136eb791a9ad11bb715f8829516ca7c938d759a","category":"Environment"}