{"title":"Endothelin-1 as an Activator of Pro-inflammatory Microglia Cells","link":"https://www.preprints.org/manuscript/202409.0918/v1","date":1726067431000,"content":"Microglial cells are highly specialized central nervous system (CNS) cells that can promote the inflammation and neurodegeneration seen in Multiple Sclerosis (MS). MS is a neurodegenerative autoimmune disease characterized by inflammation, demyelination, and axonal degeneration. In MS patients, demyelination is associated with activated microglia. Endothelin-1 (ET-1) is a potent vasoconstrictor that induces severe and prolonged cerebral vasoconstriction and inflammation. However, the mechanism of how ET-1 activates a proinflammatory response in the CNS is unknown. To investigate ET-1’s role in microglia activation, HMC3 cells were treated with ET-1 in the presence or absence of endothelin receptor B antagonist, BQ788. TNFα and IL-6 levels were measured using ELISA. Nitric Oxide (NO) production was measured using Griess Reagent. Reactive oxygen species (ROS) production was measured using the MUSE Oxidative Stress kit. ET-1 increases TNFα levels by 56% (p= 0.0003) and IL-6 levels by 86% (p= 0.0111) in HMC3 cells, and it was decreased to basal levels in the presence of BQ788. NO and ROS production is induced by ET-1 (p&amp;lt;0.05), and treatment with BQ788 was able to decrease them. ET-1 increases STAT-1 activation by 3.5 folds compared to control (p &amp;lt;0.0001) in microglia cells. Moreover, to study ET-1 levels in MS, we used C57BL/6 mice brains with or without induced experimental autoimmune encephalomyelitis (EAE). The brain ET-1 levels were measured by qPCR and ELISA. We found that the ET-1 gene and protein were upregulated by 1.5 folds (p= 0.0199) in EAE mice compared to the control. These data suggest that in vitro administration of ET-1-activated microglia significantly increased inflammatory cytokine levels and NO and ROS formation. This novel mechanism of microglial cell activation will provide key information to understand MS pathogenesis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fbef129c8eb0ec7359ca19179d8297d3c3b277440ade9c9c8e850bc63652f294","category":"Interdisciplinary"}