{"title":"Four Gravel Stages in the Masai Mara Wildlife Reserve: the 2021 Migration Gravel Race Recap – Lian Van Leeuwen","link":"https://theradavist.com/2021/07/four-gravel-stages-in-the-masai-mara-wildlife-reserve-the-2021-migration-gravel-race-recap/?utm_source=rss&utm_medium=rss&utm_campaign=four-gravel-stages-in-the-masai-mara-wildlife-reserve-the-2021-migration-gravel-race-recap","date":1626091256000,"content":"<p>A week ago, 61 contestants battled it out over 4 stages through the Masai Mara wildlife reserve, during the inaugural <a href=\"https://migrationgravelrace.com/\" target=\"_blank\">Migration Gravel Race</a> in Kenya. While an epic adventure in itself, there’s more to this race than meets the eye. The MGR is one of the prongs of the <a href=\"http://www.teamamani.com/\" target=\"_blank\">Amani project</a>, aimed at creating more race opportunities for East African cyclists to measure themselves with the best on an international level.</p>\n<p>What better way to do so than to bring in the very best? With the attendance of 2021 Unbound-winner Ian Boswell and runner-up <a href=\"https://www.instagram.com/laurens_ten_dam/?hl=en\" target=\"_blank\">Laurens ten Dam</a> (who claimed the victory at MGR), the bar has been set for future editions. <a href=\"https://www.instagram.com/sulekangangi/?hl=en\" target=\"_blank\">Sule Kangangi</a>, Kenyan pro cyclist and coordinator of Amani’s activities in Kenya, and 2021 Unbound winner <a href=\"https://www.instagram.com/ian_boswell/?hl=en\" target=\"_blank\">Ian Boswell</a> share their thoughts on this unique first edition.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/7P5A1779-41.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>It being the week after: how do you look back on this race?</b></p>\n<p><b><i>Sule Kangangi</i></b><i>:</i> it has been fantastic. During the preparations over the last year and half, I was constantly thinking to myself: will we be able to pull this off, will it be possible with this continuing covid pandemic? Now I finally have time to sit down and process it, it feels amazing. Physically I gave it about two days to let it all sink in, but I got back on the bike right after. I am even more motivated to push on and chase my dreams.<span> </span></p>\n<p><b><i>Ian Boswell:</i></b> it really was such a unique event. I feel a lot of excitement around the race and the wider purpose behind it. When I came back home, friends and journalists asked me: what was it like? But it’s almost too hard to explain. It’s so different from any other bike race. The breathtaking location, the camping in wild places. The camaraderie, the connection I felt with all the participants. I miss it already.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/7P5A0824-4.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/07/7P5A1537-35.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/07/7P5A1615-37.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>What stood out most for you?<span> </span></b></p>\n<p><b><i>Ian Boswell</i></b>: For one, I was pleasantly surprised what a gravel bike can actually handle. It was not an easy course, but you can ride a lot more varied terrain with it than I would have imagined. Secondly: being with the people in this race. Seeing everyone’s resourcefulness of just making it to the finish line, be it in the front of the race or in the back: a race like this is really showing how the mindset of humans can be pushed.<span> </span></p>\n<p><b><i>Sule Kangangi</i></b>: One of the standout moments for me was during Stage 2: I was pushing over a long stretch together with Ian and Laurens, and I kept seeing this picture in my mind of the last miles of Unbound where these two were fighting it out. Just sharing a similar moment with them now kept me going. Every time I felt depleted and didn’t think I could push on, I got energy from that.<span> </span></p>\n<p>It embodies what this race is about: being given the opportunity to measure yourself against the best in gravel racing. And more uniquely, being able to do that on your home ground. It is difficult and expensive to bring one or two East African riders to Europe to try and make it in the World Tour. The pressure is immense, and there is a lot of room for failure. With a race like the MGR we can bring racing to East Africa instead. I can’t believe how impressed all East Africans were to be in the race with these top riders, and how much they learned from this experience.<span> </span></p>\n<p>It also shows that the World Tour is not the only road to success. Meeting and racing riders of the caliber of Ian, Laurens and Thomas (Dekker) in a gravel race like this, shows upcoming talent that there is another avenue to becoming a professional cyclist.<span> </span></p>\n<p><b><i>Ian Boswell</i></b>: Beyond us coming to Kenya, the idea for us (Wahoo) was to identify a couple of strong athletes in collaboration with the Amani organization, to come to the US to compete in some bigger gravel races this summer. This way these athletes can grow and learn on an international level and bring that knowledge back to their own cycling community and training partners at home. Just like participating in this race taught me a lot. It’s such a beneficial way to make the sport grow and become truly international.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/7P5A1830-48.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>Do you think this race and project could change something for East African cycling?<span> </span></b></p>\n<p><b><i>Sule Kangangi</i></b>: it already started with initiatives like Africa Rising, Adrien Niyonshuti Cycling Academy (Rwanda) and Masaka Cycling Club (Uganda), but the Amani Project is strengthening this development. By bringing high level racing to East Africa, but also by introducing e-racing to East African talent and by creating a local gravel culture through the Migration Gravel Series. Amani wants to help bring East African talent to the top because they have earned to be there. That is the only way to change things for the better. This is just the beginning; we hope it will grow exponentially.<span>   </span></p>\n<p><b><i>Ian Boswell</i></b>: I think the bicycle itself is global, bike racing is not. When I started cycling, I was lucky enough to have a US champion to look up to, it really helped US cycling to grow. But that’s the beauty of it: it really doesn’t take as much as people might think to make a shift. Just a few East African riders breaking through on an international level can change things. It is contagious. The groundwork might not be easy, but change can happen fast. And I want to do all I can to help that forward.<span> </span></p>\n<p><b><i>Sule Kangangi</i></b>: I have been fortunate enough, through hard work, to create a professional cycling career for myself, and I feel I’m not done yet. For me personally gravel racing is new territory, unknown waters. I aim to compete in bigger races, and I still feel strong. But I also take my role as ambassador for the sport seriously and hope to pave the way for future East African talent. I might not be wining the Tour de France, but I can show that there are more ways to be successful in this sport.<span> </span></p>\n<p><b><i>Ian Boswell</i></b>: This race connected everything I love: racing my bike, camping, community, adventure, but it also adds more purpose to these things, and I definitely want to increase my involvement in East African cycling and the Amani Project. People came before me to help me seize the opportunities that I had, I feel it is my duty and responsibility to do the same for the next generation. As there are already many organizations in the US that do great work, I think my effort goes way further in an area that still can benefit from support like that…</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"fbf980610355f452c9e31fbead6de94e7649627085328291ad275a3724c99ca3","category":"Cycling"}