{"title":"AIS Business ร่วมส่งเสริมธุรกิจยุคดิจิทัล กับกรณีตัวอย่าง การปรับตัวของ Toyota Motor เพื่อสู้ศึก Disruption ในธุรกิจยานยนต์","link":"https://www.blognone.com/node/123459","date":1624865548000,"content":"<div><div><div><p>AIS Business ได้จัดงาน <strong>AIS Business Digital Future 2021 - Your Trusted Smart Digital Partner</strong> รูปแบบของ Virtual Conference ในหัวข้อ Connected Automotive &amp; Ecosystems in Thailand โดยมีคุณสุรศักดิ์ สุทองวัน รองกรรมการผู้จัดการใหญ่ บริษัท โตโยต้า มอเตอร์ ประเทศไทย จำกัด มาพูดถึงการปรับตัวของอุตสาหกรรมยานยนต์อย่างเป็นระบบ เพื่อต่อสู้กับ Disruption โดยใช้เทคโนโลยียุคดิจิทัลและ IoT หรือ Internet of Things ในการปรับปรุงธุรกิจจากผู้ผลิตรถยนต์ ไปสู่ผู้ให้บริการในการขับเคลื่อน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/97ff1a0398374dc6b47c019f481ea79e.jpg\" /></p>\n<p>คุณสุรศักดิ์ระบุว่าธุรกิจยานยนต์ ต้องพบความเปลี่ยนแปลงในทุกๆ รอบ 100 ปี ตั้งแต่ยุครถลากด้วยแรงงานคนหรือสัตว์, การขนส่งด้วยระบบรางและรถจักรไอน้ำ, ระบบเครื่องยนต์สันดาปภายใน ในรถยนต์ที่ขนาดเล็กลง</p>\n<p>ปัจจุบัน ตลาดผู้ผลิตรถยนต์กำลังพบกับความเปลี่ยนแปลงอีกครั้ง โดยมุ่งไปที่พลังงานสะอาด เช่น รถยนต์ใช้พลังงานไฟฟ้า หรือไฮโดรเจน และในอีกด้าน ความต้องการในการเดินทางของคนก็เปลี่ยนแปลงไป โดยมีการใช้ข้อมูลและแพลตฟอร์มดิจิทัลเข้ามาเกี่ยวข้อง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/fff86635b3c7ee0028f5e72d34d252c9.png\" /></p>\n<p>แม้รูปแบบการใช้งานจะเปลี่ยนไป แต่ความต้องการของคนยังเป็นการเคลื่อนที่ (mobility) เหมือนเคย โตโยต้าจึงประกาศเปลี่ยนแปลงองค์กรตัวเอง จากบริษัทผู้ผลิตยานยนต์ มาเป็น Mobility Company หรือ MaaS (Mobility as a Service) ตั้งแต่ปี 2018 โดยเปลี่ยนจากการเป็นแค่บริษัทผู้ผลิตรถยนต์เพื่อขาย มาเป็นผู้ให้บริการการขับเคลื่อน ซึ่งท้าทายต่อวัฒนธรรมองค์กรและความพร้อมของบุคลากรที่มีอยู่เดิม แต่ก็เป็นการเปิดกว้างในการสร้างสรรค์นวัตกรรมแห่งอนาคตมากขึ้น</p>\n<p>คุณสุรศักดิ์ยกตัวอย่างว่า การ Disruption ครั้งใหญ่ของอุตสาหกรรมยานยนต์ จากบทบาทของแพลตฟอร์มดิจิทัลในยุคต่อไป จะทำให้เกิดการเปลี่ยนแปลง 4 ประเด็น 4 ตัวย่อ เรียกรวมกันได้ว่า CASE ซึ่งได้แก่</p>\n<ul>\n<li><strong>C (Connected)</strong> คือ การเชื่อมต่อ การขับขี่รถยนต์ไม่ได้จบแค่ในตัวรถอีกต่อไป แต่ต้องมีการเชื่อมต่อข้อมูลจากรถยนต์ไปยังอุปกรณ์ภายนอก โดยใช้เทคโนโลยี IoT ซึ่งมีการติดตั้งอุปกรณ์ Telematics หรืออุปกรณ์ตรวจวัดต่างๆ และมีการส่งข้อมูลผ่านสู่ระบบคลาวด์ผ่านโครงข่ายไร้สายของผู้ให้บริการโทรศัพท์เคลื่อนที่</li>\n<li><strong>A (Autonomous)</strong> คือ รถยนต์จะมีความสามารถในการขับเคลื่อนแบบอัตโนมัติมากขึ้น ตั้งแต่ระดับที่ยังต้องการคนควบคุมมากไปถึงน้อย จนถึงระดับที่รถยนต์สามารถตัดสินใจได้ด้วยตนเองทั้งหมดในอนาคต</li>\n<li><strong>S (Sharing)</strong> คือ บริการแบ่งปันรถยนต์ใช้งานร่วมกัน รูปแบบการใช้งานและชำระเงินที่แตกต่างจากเดิม ผ่านบริการรูปแบบใหม่ต่างๆ เช่น Grab, Uber</li>\n<li><strong>E (Electrification)</strong> คือ การใช้พลังงานไฟฟ้า หรือกลุ่ม xEV ซึ่งมีหลายรูปแบบ ตั้งแต่ระบบ Hybrid ไปจนถึงระบบไฟฟ้า</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c9dace3e8c95491bd651d772b147c74a.png\" /></p>\n<p>ธุรกิจรถยนต์เองก็ต้องมีการเปลี่ยนแปลงเพื่อสู้กับ Disruption ในยุคใหม่ คุณสุรศักดิ์ยกตัวอย่างเรื่องธุรกิจถ่ายภาพด้วยฟิล์มที่ปรับตัวช้า ไม่ทันกาลกับยุคกล้องดิจิทัล มีวัฒนธรรมองค์กรที่ติดกับความสำเร็จแบบเดิมๆ และเป็นตัวฉุดรั้งการเปลี่ยนแปลงเสียเอง</p>\n<p>โตโยต้ามอเตอร์จึงต้องเปลี่ยนแปลงองค์กรจากการเป็นบริษัทผู้ผลิตรถยนต์ ไปเป็นผู้ให้บริการในการขับเคลื่อน โดยมีมุมมองปัญหาใหม่ที่ทันสมัย ทั้งการขับขี่ที่ผู้ซื้อรถอาจไม่ได้โฟกัสแค่ความสนุกในการขับรถด้วยตัวเองอีกต่อไป แต่ต้องการความสะดวกสบายมากขึ้นจากระบบอัตโนมัติ ไปจนถึงการใช้งานรถส่วนตัวที่ลดลงจากการทำงานจากบ้าน และบริการไรด์แชริ่ง ซึ่งผู้ผลิตและจำหน่ายรถยนต์ต้องมองเห็นและปรับตัวให้ทัน</p>\n<p>การเปลี่ยนแปลงทั้ง 4 ประเด็น หรือ CASE ในข้างต้นนั้น สำหรับประเทศไทย คุณสุรศักดิ์มองว่าตัว C หรือ Connected เอง น่าจะเป็นส่วนที่เริ่มมีการเปลี่ยนแปลงที่ชัดเจนที่สุด ซึ่งโต้โยต้าได้เริ่มการเปลี่ยนแปลงในการเชื่อมต่อของข้อมูลนี้ โดยมีการติดตั้ง Wifi Box บนรถตั้งแต่ปี 2017 และติดตั้งอุปกรณ์ Telematics (LDCM) หรืออุปกรณ์รวบรวมข้อมูลที่ส่งผ่านเครือข่ายมือถือได้ในปี 2020 บนรถยนต์มากกว่า 220,000 คัน ในประเทศไทย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b1b2606ba70929ec5b69ef1f58eb61d7.png\" /></p>\n<p>อุปกรณ์การเชื่อมต่อนี้จะเชื่อมโยงข้อมูลจากรถยนต์ไปยังแอปพลิเคชันต่างๆ และเป็นจุดเริ่มต้นที่ทำให้เกิดการเปลี่ยนแปลงในด้านการเชื่อมต่อต่างๆ ของบริษัท เช่น</p>\n<ul>\n<li><strong>Connected Work</strong> การสร้างเครือข่ายเชื่อมโยง ช่วยเพิ่มประสิทธิภาพในการทำงานตั้งแต่อุปทานในภาคการผลิต ไปจนถึงอุปสงค์ในภาคการจำหน่าย โดยใช้ข้อมูลที่ได้รับเข้ามาเชื่อมโยง เพิ่มความแม่นยำตั้งแต่การผลิต การขนส่งรถยนต์ การบริหารจัดการ Stock รถยนต์ และการจำหน่ายรถยนต์</li>\n<li><strong>Connected Value Chain</strong> การนำข้อมูลมาพัฒนาเครือข่าย Value Chain ของอุตสาหกรรมรถยนต์ช่วยเชื่อมโยงโตโยต้ากับการเปลี่ยนแปลงบริการทางการเงินของรถยนต์ ตั้งแต่ไฟแนนซ์ของรถ ไปจนถึงการทำประกันภัย การติดตามเมื่อรถเกิดอุบัติเหตุ การบริการหลังการขาย และการประเมินสภาพรถในการขายรถใช้งานแล้ว</li>\n<li><strong>Connected Business</strong> การนำข้อมูลมาช่วยสนับสนุนการเปลี่ยนแปลงและมองหาธุรกิจใหม่ ร่วมกับ Partner ที่จะช่วยกันสร้างผลประโยชน์ให้กับผู้บริโภค โดยใช้ Platform T-Connect เช่น กระเป๋าเงิน T-Wallet, การทำ Loyalty Program, Point &amp; Privilege หรือการเช่าใช้รถยนต์ส่วนบุคคล KINTO ของโตโยต้า</li>\n</ul>\n<p>สำหรับธุรกิจที่กำลังจะที่ถูก Disrupt เช่น ในอุตสาหกรรมยานยนต์นั้น การเริ่มเปลี่ยนแปลงควรต้องเริ่มหา Customer Pain Point, Business Pain Point หรือ New Businessโตโยต้าเองได้ใช้ แพลตฟอร์มดิจิทัลเข้ามาแก้ไขปัญหาเหล่านี้ นำความต้องการและความพร้อมของผู้ซื้อ เข้ามาเชื่อมโยงกับการขาย ให้ทำได้รวดเร็วและแม่นยำมากยิ่งขึ้น พร้อมคัดเลือกและเชื่อมโยง Partner และทีมที่มีความสามารถในการต่อยอดและเติมเต็มเพื่อรองรับการเปลี่ยนแปลงที่รวดเร็วทั้งสถาบันการเงิน ศูนย์จำหน่าย แพลตฟอร์ม และช่องทางอื่นๆ ในอนาคต</p>\n<p>ฝั่ง AIS Business เป็นอีกหนึ่งในพาร์ทเนอร์ธุรกิจที่พร้อมจะรองรับการเปลี่ยนแปลงและสู้กับ Disruption ในยุคดิจิทัล ที่จะให้บริการเชื่อมต่อข้อมูลธุรกิจต่างๆ ไปจนถึงแพลตฟอร์มเครือข่ายที่พร้อมรองรับอนาคตและการเปลี่ยนแปลง โดยมีโตโยต้ามอเตอร์ เป็นอีกหนึ่งตัวอย่างธุรกิจที่สำคัญ</p>\n<p>ผู้ที่สนใจบริการธุรกิจจาก AIS เพิ่มเติม ไม่ว่าจะเป็นเครือข่าย IoT บริการคลาวด์ หรืออื่นๆ สามารถดูข้อมูลรายละเอียดต่างๆ ได้ที่<a href=\"https://business.ais.co.th/\">หน้าเว็บไซต์ของ AIS Business</a> ได้ทันที หรือติดต่อเจ้าหน้าที่ AIS Business ที่ดูแลท่านอยู่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/689af70742e2491f5f0b15515556bb04.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ais\">AIS</a></div><div><a href=\"/topics/toyota\">Toyota</a></div><div><a href=\"/topics/automobile\">Automobile</a></div><div><a href=\"/topics/manufacturing\">Manufacturing</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"fbf990c790a4537a2fbd834630f0bcc926098b8253b999fd3db2d8162abd60e4","category":"Thai"}