{"title":"COVID-19 self-testing: Countries accelerating policies ahead of WHO guidelines during pandemics, a global consultation","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002369","date":1710770400000,"content":"<p>by Melody Sakala, Cheryl Johnson, James Chirombo, Jilian A. Sacks, Rachel Baggaley, Titus Divala</p>\r\n\r\nThe widespread use of antigen-detection rapid diagnostic tests (Ag-RDTs) has revolutionized SARS-CoV-2 (COVID-19) testing, particularly through the option of self-testing. The full extent of Ag-RDT utilization for self-testing, however, remains largely unexplored. To inform the development of WHO guidance on COVID-19 self-testing, we conducted a global consultation to gather the views and experiences of policy makers, researchers, and implementers worldwide. The consultation was conducted by disseminating a WHO questionnaire through professional networks via email and social media, encouraging onward sharing. We used a cross-sectional design with both closed and open-ended questions related to policy and program information concerning the regulation, availability, target population, indications, implementation, benefits, and challenges of COVID-19 self-testing (C19ST). We defined self-testing as tests performed and interpreted by an untrained individual, often at home. Descriptive summaries, cross-tabulations, and proportions were used to calculate outcomes at the global level and by WHO region and World Bank income classifications. All information was collated and reported according to WHO guideline development standards and practice for global consultations. Between 01 and 11 February 2022, 844 individuals from 139 countries responded to the survey, with 45% reporting affiliation with governments and 47% operating at the national level. 504 respondents from 101 countries reported policies supporting C19ST for a range of use cases, including symptomatic and asymptomatic populations. More respondents from low-and-middle-income countries (LMICs) than high-income countries (HICs) reported a lack of an C19ST policy (61 vs 11 countries) and low population-level reach of C19ST. Respondents with C19ST experience perceived that the tests were mostly acceptable to target populations, provided significant benefits, and highlighted several key challenges to be addressed for increased success. Reported costs varied widely, ranging from specific programmes enabling free access to certain users and others with high costs via the private sector. Based on this consultation, systems for the regulatory review, policy development and implementation of C19ST appeared to be much more common in HIC when compared to LIC in early 2022, though most respondents indicated self-testing was available to some extent (101 out of 139 countries) in their country. Addressing such global inequities is critical for ensuring access to innovative and impactful interventions in the context of a public health emergency of international concern. The challenges and opportunities highlighted by key stakeholders could be valuable to consider as future testing strategies are being set for outbreak-prone diseases.","author":"Melody Sakala","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"fc030d61a3f0b9ac179796d5e877a557617a1061df323cc30b434f882a5ed579","category":"Environment"}