{"title":"Inflammatory Prostatitis plus IBS-D Subtype and Correlation with the Immunomodulating Agent Imbalance in Seminal Plasma: Novel Combined Treatment","link":"https://www.preprints.org/manuscript/202408.0684/v1","date":1723215649000,"content":"We recently demonstrated the effectiveness of long-term treatment with rifaximin and the probiotic VSL#3 at improving urogenital and gastrointestinal symptoms in patients with both chronic inflammatory prostatitis (IIIa prostatitis) and diarrhea-predominant irritable bowel syndrome     (IBS-D), relative to patients with IBS-D alone. Because low-grade inflammation of the intestine and prostate may be one of the reasons for co-developing both IIIa prostatitis and IBS-D, we designed the present study to once again evaluate the efficacy of combined rifaximin and VSL#3 treatment in patients affected by IIIa prostatitis plus IBS-D, but we also measured seminal plasma pro-inflammatory (IL-6) and anti-inflammatory (IL-10) cytokines before and after treatment. We consecutively enrolled 124 patients with IIIa prostatitis and IBS-D (diagnosed using the Rome III criteria). Patients were randomized into two groups: group A (n=64) was treated with rifaximin (seven days per month for three months) followed by VSL#3, and group B (n=60) was treated with a placebo. At the beginning of the study and after three months of treatment, all patients completed NIH-CPSI and IBS-SSS questionnaires to score the severity of their urogenital and gastrointestinal symptoms, and we measured seminal plasma levels of IL-6 and IL-10 using ELISA. We defined patients who improved following the treatment as those with a ≥6-point reduction in their NIH-CPSI score or ≥50-point reduction in their IBS-SSS score. By the end of the intervention, 68.7% and 62.5% of patients from group A reported improved NIH-CPSI and IBS-SSS scores, respectively, compared to only 3.3% and 5% of the placebo group. Group A patients also had significantly lower mean seminal plasma levels of IL-6 (11.3 vs 32.4 pg/mL) and significantly higher mean levels of IL-10 (7.9 vs 4.4 pg/mL) relative to baseline, whereas levels of IL-6 and Il-10 did not change in the placebo group. The co-occurrence of two clinical phenotypes (IBS-D plus IIIa prostatitis) result in increased intestinal inflammation and altered immune activation, both of which can be balanced by treatment with rifaximin and VSL#3.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fc0580291a0177a7ab08f802a960a3c0a17a25603610d21d5b9fd72a697b519c","category":"Interdisciplinary"}