{"title":"Arecoline induces neurotoxicity in HT22 cells via the promotion of endoplasmic reticulum stress and downregulation of the Nrf2/HO‐1 pathway","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24194?af=R","date":1709809624000,"content":"<h2>Abstract</h2>\n<p>Arecoline, the predominant bioactive substance extracted from areca nut (AN), is the world's fourth most frequently used psychoactive material. Research has revealed that chewing AN can affect the central nervous system (CNS) and may lead to neurocognitive deficits that are possibly linked to the action of arecoline. However, the mechanism behind the neurotoxicity caused by arecoline remains unclear. This study aimed to investigate the neurotoxic effects of arecoline and its underlying mechanism. The results showed that arecoline caused cytotoxicity against HT22 cells in a dose-dependent manner and induced apoptosis by upregulating the expression of pro-apoptotic caspase and Bcl-2 family proteins. Furthermore, arecoline escalated intracellular reactive oxygen species (ROS) levels and Ca<sup>2+</sup> concentration with increasing doses, thereby motivating endoplasmic reticulum stress (ERS) and ERS-associated apoptotic protein expression. Additionally, the study found that arecoline attenuates intracellular antioxidant defense by inhibiting the translocation of NF-E2-related factor-2 (Nrf2) into the nucleus and decreasing downstream Heme oxygenase-1 (HO-1) levels. The specific inhibitor Sodium 4-phenylbutyrate (4-PBA) can dramatically attenuate arecoline-mediated cell apoptosis and ERS-associated apoptotic pathway expression by blocking ERS. The antioxidant N-Acetylcysteine (NAC) also effectively reverses the arecoline-mediated increase of ERS-related apoptotic pathway protein levels by scavenging intracellular ROS accumulation. In conclusion, this study suggests that arecoline induces neurotoxicity in HT22 cells via ERS mediated by oxidative stress- and Ca<sup>2+</sup> disturbance, as well as by downregulation of the Nrf2/HO-1 pathway.</p>","author":"He Yan, \nJiameng Ding, \nXiong Li, \nShuyue Li, \nDongxian Zhang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"fc074767c8428c0d416a784ebfec89cf8fe859c18a2db788dc43c216c5e011d9","category":"Environment"}