{"title":"After a rapid turnaround from a Crew Dragon landing, another one is set to fly","link":"https://arstechnica.com/?p=1811784","date":1636557323000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul>\n          <li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/1-Crew-3-Nov-9-2021-6388-980x700.jpg\" /></div>\n        <p>\n          SpaceX's Falcon 9 B1067.2 and Crew Dragon spacecraft at LC-39A in advance of the Crew-3 mission: slated for liftoff no earlier than 9:03 pm EST on November 10th, 2021.                      [credit:\n                        Trevor Mahlmann                        ]\n                  </p>\n        </div>\n      </li>\n      </ul>\n  \n<p>NASA and SpaceX had originally hoped to fly the next bunch of astronauts to the International Space Station in late October, but the Crew-3 mission has been subject to a handful of delays due to weather and health issues. But now, the mission managers say Crew-3 is ready to fly on a Falcon 9 rocket, with a liftoff set for 9:03 pm ET on Wednesday (02:03 UTC Thursday).</p>\n<p>Four astronauts will launch inside Crew Dragon <em>Endurance</em> for this mission—NASA astronauts Raja Chari, Tom Marshburn, and Kayla Barron, as well as European astronaut Matthias Maurer. After docking with the space station on Thursday, the astronauts will spend about six months in orbit performing a variety of science and maintenance operations.</p>\n<h2>Weather concerns</h2>\n<p>Poor weather precluded an initial launch attempt on Halloween. Conditions at the launch site weren't bad, but flight controllers were concerned about high seas and strong winds offshore, where an extra-tropical system raged across the northern Atlantic Ocean. Had there been an emergency during the Falcon 9 rocket launch, the Crew Dragon spacecraft would have had to escape into unacceptably poor surface conditions.</p></div><p><a href=\"https://arstechnica.com/?p=1811784#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1811784&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fc094636ae2afac9e38620d276779a1b9659beaf7b690382bea61f5cab4e0426","category":"Tech"}