{"title":"Direct Seeding for Conifer Regeneration in the Pacific Northwest: A Past, Present, and Future of Operational Practices","link":"https://academic.oup.com/jof/article/122/2/171/7468883?rss=1","date":1702252800000,"content":"<span><div>Abstract</div>United States Pacific Northwest (PNW) forests are important ecological, cultural, and recreational landscapes. Direct seeding to aid forest regeneration in the PNW region was developed to reduce reforestation costs and timelines. These practices were largely discontinued in the 1970s due to poor establishment resulting from issues of seed predation, a lack of targeting favorable site conditions, seed distribution issues, and improvements to nursery seedling production. A recent renewed interest in direct seeding research has resulted from the growing geographic extent of postdisturbance areas requiring reforestation. This interest is also supported by the increasing recognition of the logistical impossibility of satisfying reforestation demand via planted seedlings. This historical review highlights the timeline of direct seeding research and practice in the PNW. It describes the main obstacles to its widespread use and opportunities for improvement. These opportunities include upscaling seed collection efforts, increasing distribution precision of seeding methods, upgrading seed quality evaluations, and mitigating seed predation and desiccation.Study Implications: The availability of seedlings is increasingly limited due to the rising demand for reforestation as a result of more frequent and severe wildfires. Further research into direct seeding as an artificial regeneration strategy for trees is necessary to operationally increase reforestation abilities and thus supplement natural regeneration and seedling planting. This study summarizes findings from prior direct seeding studies in the Pacific Northwest region and identifies (1) improving seed collection efforts, (2) refining seed quality assessments, (3) standardizing seed dispersal methods, and (4) improving seedling establishment by targeting favorable site conditions and predation mitigation as key future research priorities.</span>","author":"","siteTitle":"Journal of Forestry Current Issue","siteHash":"f325018648ab04fba35e6e1191e9c9d953f9458bd233a7a41545c2e465328e3b","entryHash":"fc0cb8c84b757d86a7845137b2414237da90a2d1053ba3a5b21ec5172646ce37","category":"Environment"}