{"title":"Acute Pancreatitis in Pediatric Acute Lymphoblastic Leukemia (AcuPA Study). A Nationwide Survey in Poland","link":"https://www.preprints.org/manuscript/202405.1449/v1","date":1716381423000,"content":"Purpose: This study aimed to identify the risk factors for acute pancreatitis (AP) and its impact on outcomes in Polish children treated for ALL. Methods: The study group included 2303 children who received intensive chemotherapy for ALL. The group was subdivided into patients with at least one episode of AP and those who did not develop AP following treatment for ALL. Results: The cumulative incidence of AP in the study group was 4.08%. Older age was an independent risk factor for AP development (OR 1.05; 95%CI: 1.006 – 1.098; p=0.03). The overall mortality related to AP was 2.13%. The probabilities of disease-free survival (p-DFS) and event-free survival (p-EFS) were 0.84 vs. 0.86, log-rank: p=0.65 and 0.75 vs. 0.80, log-rank: p=0.12, respectively in both subgroups. A total of 22 out of 94 patients (23.4%) with AP were re-exposed to asparaginase (ASP) during the subsequent phases of the treatment. Only one re-exposed to ASP patient (4.5%) developed a second episode of AP. There were no significant differences in p-DFS and p-EFS between patients re-exposed and not re-exposed to asparaginase (0.78 vs. 0.86, log-rank p=0.27 and 0.63 vs. 0.79, log-rank p=0.09 respectively). Conclusions: The incidence of AP in children with ALL is low and related to the patient’s age. AP development doesn’t seem to impact p-DFS and p-EFS in children with ALL. The recurrence of AP following re-exposure to asparaginase in patients with ALL and a history of AP is low (4.5%). Re-exposure to asparaginase after the first episode of AP doesn’t improve either p-DFS or p-EFS in children with ALL.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fc10f984757a69a1ecf49b0e39a2d0b0494d3af72fa649f3a3d6b40de7af36b3","category":"Interdisciplinary"}