{"title":"Pinarello goes electric with their new Nytro-E Road, Gravel, and Allroad","link":"https://www.cyclingtips.com/2023/03/pinarello-goes-electric-with-their-new-nytro-e-road-gravel-and-allroad/","date":1678982439000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/pinarellonytroEbike_E9red.jpg?width=1200\" alt=\"Pinarello goes electric with their new Nytro-E Road, Gravel, and Allroad\" /></figure><p><span><a href=\"https://www.cyclingtips.com/tag/pinarello/\" target=\"_blank\">Pinarello</a> has launched a new lineup of electric bikes, both for road, gravel, and urban options. Dubbed Nytro E, these e-bikes share that typical Pinarello design language, adapted just enough to meet the needs of electric assist. Importantly, all three model lines use the new TQ-HPR50 motor. </span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/0952_RB_110323_phRobyBragotto_Pinarello_Nytro-1340x893.jpg?width=730\" alt=\"Pinarello Nytro road bike\" width=\"1340\" height=\"893\" /><figcaption><span>Your first hit of the Royal Forest colorway, courtesy of a downtube big enough to fit a 350 Wh battery.</span></figcaption></figure>\n<p><span>Hot on the heels of the recently-released <a href=\"https://www.cyclingtips.com/2023/02/first-ride-review-pinarellos-baby-dogma-the-new-f-series/\" target=\"_blank\">Pinarello F-Series road bike</a> and <a href=\"https://www.cyclingtips.com/2022/06/pinarello-grevil-f-weight-spec-details-geometry/\" target=\"_blank\">Grevil F gravel bike</a>, the new Nytro E lineup seeks to capitalize on the brand’s unique design language with what feels like an “acoustic” bike, just with a bit of electric assistance.</span></p>\n<h2><span>Goldilocks found their match with the TQ HPR-50</span></h2>\n<p><span>Pinarello’s original electric road bike, </span><a href=\"https://www.cyclingtips.com/2017/12/pinarello-nytro-e-bike-first-ride-review/\" target=\"_blank\"><span>the Nytro</span></a><span>, used a Fazua Evation drive unit and motor. However, that bike wasn’t really available in the U.S., substituted instead for the Pinarello Dyodo. Dyodo came in both a road and gravel variation and used the now-popular Mahle X35 drive unit, a lightweight system with a hub motor, as opposed to the Nytro’s mid-drive setup. The folks at Pinarello must have taken the story of Goldilocks and the three bears to heart because, according to them, the new TQ HPR-50 motor is just right.</span></p>\n<p><span>So why would Pinarello switch to the new motor? Because the TQ seems like quite the impressive unit in a number of key areas. </span></p>\n<p><span>First and foremost, the HPR-50 as a package is rather lightweight for a mid-drive system, at 1850 g for the motor and 3900 g, including the 360 Wh battery and 2” display integrated into the top tube. Max assistance is available courtesy of four different assist levels, with the motor offering up to 50 Nm torque on tap and 300 W peak power. </span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/9383_RB_100323_phRobyBragotto_Pinarello_Nytro-1340x893.jpg?width=730\" alt=\"Pinarello Nytro road bike\" width=\"1340\" height=\"893\" /><figcaption><span>A view of the TQ display integrated into the top tube on the Nytro E-Gravel. Expect it in the same place on the Nytro E-Road.</span></figcaption></figure>\n<p><span>Pinarello makes a few claims we won’t be able to verify until we get the bike in for testing. Claimed range is up to 100 km (62 miles) or 140 km (87 miles) with an optional 160 Wh range extender. Additionally, Pinarello claims that the motor’s compact size provides a Q-factor (distance between the cranks) of 135 mm. Most mid-drive electric bikes are plagued with far wider Q-factors than traditional “acoustic” bikes, leaving the rider to waddle like a duck more than they’re actually pedaling. Should this number be the case, its Q factor is actually slightly lower than a Shimano GRX crank (151 mm) or SRAM WIDE crank (150 mm). </span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/NYTRO_E_ROAD_D290_MOST_MOST_PART1-1340x1005.jpg?width=730\" alt=\"pinarello nytro e bike tq motor detail\" width=\"1340\" height=\"1005\" /><figcaption><span>Pinarello boasts that their new e-bikes have a Q-factor that is narrower than even some gravel bikes, much less the average mountain bike. </span></figcaption></figure>\n<p><span>The Pinarello Nytro E bikes cut off assist at 28 mph (45 km/h) here in the United States, though that is sure to be limited by your country’s laws and regulations.</span></p>\n<h2><span>Pinarello Nytro E-Road details</span></h2>\n<p><span>The Nytro E-Road comes in two carbon layups that are familiar to Pinarello fans: Toray T700 and Toray T900. The T700 model is the starting point carbon, while the T900 uses more higher-modulus carbon that brings frame weight down to just 1130 g for a raw Road frame, not much heavier than a standard road frame despite the additional structure needed to house a battery and drive unit. Both frames use an aero seatpost shared with the Pinarello Dogma F, as well as a well-hidden seatpost wedge.</span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/NYTRO_E_ROAD_D290_MOST_MOST_PART4-1340x1004.jpg?width=730\" alt=\"Pinarello Nytro E road bike with integrated handlebar\" width=\"1340\" height=\"1004\" /><figcaption><span>The Pinarello Nytro Road E9 receives a one-piece MOST carbon handlebar and stem.</span></figcaption></figure>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/pinarello-nytro-e9-road-bike-in-red-1340x893.jpg?width=730\" alt=\"pinarello nytro e9 road bike in red\" width=\"1340\" height=\"893\" /><figcaption><span>More sparkle courtesy of the Nytro Road E9.</span></figcaption></figure>\n<p><span>The Nytro E-Road has all of the traditional Pinarello design hallmarks one might expect. The chain stays, seat stays, and downtube are all asymmetric in design, slightly oriented toward the drive side, which Pinarello says guarantees better lateral stiffness and a “balanced frame behavior.” Quoted max tire clearance for the Nytro E-Road bike is 700c x 32mm. </span></p>\n<p><span>It also uses the TiCR internal cable routing found on the Dogma, F-Series, and Grevil F, routing cables and hoses through the stem and oversized upper headset bearing. While clean in overall look, routing through the stem is less user-friendly than other fully internal cable routing systems from the likes of the <a href=\"https://www.cyclingtips.com/2022/10/2023-trek-domane-plus-e-road-bike-review/\" target=\"_blank\">Trek Domane E+</a> or <a href=\"https://www.cyclingtips.com/2023/01/2023-orbea-gain-e-road-bike-first-ride-review/\" target=\"_blank\">Orbea Gain</a> that route cables between the stem and a removable cosmetic cover.</span></p>\n<p><span>Nytro E-Road geometry adheres fairly closely to the Pinarello X road bike. Six sizes are available, and all of them offer stack and reach numbers that indicate this bike is more focused on riding comfort over longer distances than stealing KOMs and QOMs on the local Strava e-bike segment. </span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/Screen-Shot-2023-03-14-at-2.44.50-PM-1340x857.png?width=730\" alt=\"Pinarello Nytro Road and Gravel Geometry\" width=\"1340\" height=\"857\" /></figure>\n<p><span>The Nytro E-Road is available in three build options. Each model comes with Shimano drivetrains, and all but the Nytro Road E5 come with carbon wheels. </span></p>\n<h2><span>Pinarello Nytro E-Gravel details</span></h2>\n<p><span>Much of what’s been said about the Nytro E-Road can also be said about the Nytro E-Gravel bikes. Two carbon layup options are available, with the lighter model weighing in at 1250 g for a raw frame. Nytro E-Gravel also receives Pinarello’s TiCR internal cable routing and similar asymmetric tube profiles that have proliferated through Pinarello’s carbon bikes.</span></p>\n<p><span>Interestingly, the Nytro E-Gravel eschews an aero seatpost for a standard 31.6mm option with stated compatibility with a dropper seat post. It also receives a rear rack mount, and fender mounts too, in a nod to expected “gravel adventures.” Total available tire clearance is a 700c x 50mm tire.</span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/pinarello-nytro-gravel-E9-in-green-1340x893.jpg?width=730\" alt=\"pinarello. nytro e gravel bike green\" width=\"1340\" height=\"893\" /><figcaption><span>You may not be a fan of Pinarello’s design language, but this metallic green is undeniably a stunner.</span></figcaption></figure>\n<p><span>Geometry is decidedly relaxed. Angles and measurements are by no means progressive but err toward straight-line confidence. Interestingly the reach and stack numbers are even more upright than the Nytro E-Road or even the Pinarello Granger gravel bike. Cyclists should have no trouble placing the bars as high as they need to be.</span></p>\n<p><span>Nytro E-Gravel complete builds follow a similar formula to the E-Road. Three build options and two carbon layup options are available, all of which feature 1x SRAM AXS drivetrains. The top Nytro Gravel E9 features a SRAM RED eTap AXS drivetrain and Princeton Grit 4540 carbon wheels, while the other models use alloy wheels.</span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/0932_RB_110323_phRobyBragotto_Pinarello_Nytro-1340x893.jpg?width=730\" alt=\"Pinarello Nytro road bike\" width=\"1340\" height=\"893\" /><figcaption><span>The Pinarello Nytro Gravel E9 in the Royal Forest colorway.</span></figcaption></figure>\n<h2><span>Wait, there’s a Nytro E-Allroad?</span></h2>\n<p><span>Yes, there’s a third Nytro E option called the Pinarello Nytro E-Allroad. Think of it as a flat bar commuter bike based on the Nytro E-Gravel frame. The commuter option receives a rear rack, fenders front and rear, and a 1x Shimano Deore drivetrain. </span></p>\n<h2><span>Conclusion</span></h2>\n<p><span>The electric bike market is fast expanding, and Pinarello seeks to meet those needs with their new Nytro E. The TQ HPR-50 motor has been well-received in our </span><a href=\"https://www.cyclingtips.com/2022/10/2023-trek-domane-plus-e-road-bike-review/\" target=\"_blank\"><span>previous e-bike reviews</span></a><span>. Its geometry is decidedly less aggressive than their previous e-bikes, which should end up a win for folks who might want to ride a Pinarello. And importantly, there are a number of build kit options that should suit the needs of those looking to switch, like Bob Dylan, from acoustic to electric.</span></p>\n<p><span>We’ve requested a Pinarello Nytro E for review for our own ride impressions, but until then, find more information at </span><a href=\"https://pinarello.com/\" target=\"_blank\"><span>pinarello.com</span></a><span>.</span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/PinarelloNytroRoad_blackE5-1340x743.jpg?width=730\" alt=\"Pinarello Nytro E gravel bike in black\" width=\"1340\" height=\"743\" /><figcaption><span>More black, though this Nytro Road E5 is called ‘Brilliant Black.’ It comes kitted with a Shimano 105 Di2 drivetrain and Fulcrum alloy wheels.</span></figcaption></figure>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/PinarelloNytroRoad_redE7-1340x810.jpg?width=730\" alt=\"Pinarello Nytro Gravel bike red\" width=\"1340\" height=\"810\" /><figcaption><span>There’s Napa wine, Bordeaux wine, and then there’s the Nytro Gravel E7 in ‘Italian Wine.’</span></figcaption></figure>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/PinarelloNytroRoad_blueE7.jpg?width=730\" alt=\"Pinarello Nytro road bike\" width=\"1320\" height=\"743\" /><figcaption><span>There are three models of the Pinarello Nytro E-Road. Besides the listed Nytro Road E9, there is this Nytro Road E7. It features a Shimano Ultegra Di2 drivetrain and MOST Ultrafast carbon wheels, pictured in ‘Power Blue.’</span></figcaption></figure>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/PinarelloNytroRoad_blackE7-1340x802.jpg?width=730\" alt=\"Pinarello Nytro road bike black\" width=\"1340\" height=\"802\" /><figcaption><span>Want one in black on black? The Nytro Road E7 is also available in a matte Ghost Black.</span></figcaption></figure>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/PinarelloNytroGravel_greygreenE7-1340x864.jpg?width=730\" alt=\"pinarello nytro e gravel bike grey green\" width=\"1340\" height=\"864\" /><figcaption><span><span><span>The Pinarello Nytro Gravel E7 in Airforce Grey. It uses a SRAM Rival eTap AXS XPLR drivetrain and Fulcrum Rapid Red 500 wheels.</span></span></span><p></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/NYTRO_E_ALL-ROAD_D450_MOST_SHIMANO_ORE8-1-1340x762.jpg?width=730\" alt=\"Pinarello Nytro Allroad bike\" width=\"1340\" height=\"762\" /><figcaption><span>The Pinarello Nytro Allroad is the latest addition to the ever-expanding definition of “allroad.”</span></figcaption></figure>\n</figcaption></figure>","author":"Alvin Holbrook","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"fc16e2f0536b4455b8bbcf58443d7e46ce3c3551a4cec2adf76b10205e456485","category":"Cycling"}