{"title":"Find My: How to use Apple’s new all-in-one app to find friends, devices, and items","link":"https://www.macworld.com/article/233398/find-my-how-to-use-apples-new-all-in-one-app-to-find-friends-and-devices.html","date":1621028156000,"content":"\n<div>\n<section><div></div></section><p><em><strong>Updated 05/14/21:</strong> Updated to reflect changes to Find My to track items, including <a href=\"https://www.macworld.com/article/343664/airtags-price-release-date-specs-features-privacy.html\">AirTags</a>.</em></p>\n\n\n\n<p>Find My Friends was not the first location-sharing app when it was introduced in 2011, but by being a first-party solution, it saw incredibly widespread support. So much so that Apple just went ahead and included it in iOS starting with iOS 9. Find My iPhone first launched as a MobileMe service in 2010, and became a free iCloud service in 2011. It has been a critical piece of infrastructure to help people locate their lost gear.</p>\n\n\n\n<p>The ubiquity of this service has made it so popular, so oft-used and reliable, that it has become a mainstay of the Apple ecosystem; a reason to stick with Apple, just like iMessage.</p>\n\n\n\n<p>With iOS 13 and macOS Catalina, Apple combined Find My Friends and Find My iPhone into a single app called “Find My” with a new interface. Then, in iOS 14.5, Apple added a new “Items” tab to locate trackers that use the Find My network, both from third party companies and Apple’s own AirTags.</p>\n\n\n\n<p>(On the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.icloud.com/&amp;xcust=1-1-233398-0-0-0&amp;sref=https://www.macworld.com/feed\">iCloud.com</a> website, Find Friends and Find iPhone are separate apps. The Apple Watch only has a Find People app.)</p>\n\n\n\n<p>Here’s what you need to know about the Find My app and how you can use it to keep track of people and items you care about.</p>\n\n\n\n<h2>What can you do with the Find My app</h2>\n\n\n\n<p>The Find My app does more than help you find where you may have left your phone or see if your bestie is on the way or not. You can:</p>\n\n\n\n<ul><li><p>See your friends’ locations (with their permission)</p></li><li><p>See where all your Apple devices are</p></li><li>See the location of item trackers that use the Find My network (AirTags and others)</li><li><p>Make your devices emit a sound so you can find them more easily</p></li><li><p>Put your devices and items into a “lost mode” </p></li><li><p>Remotely erase a lost Apple device</p></li></ul><p>It’s about more than convenience, it’s about security. And because it deals with sensitive location data, it’s important to note that Apple has engineered it to protect your privacy as much as possible.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/10/find-my-devices-mac-100813865-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/10/find-my-devices-mac-100813865-large.jpg\" /></a><figcaption><p>Find My can help you keep track of all your Apple gear, now even on macOS Catalina.</p>\n</figcaption></figure></div>\n\n\n\n<h2>How Find My protects your privacy</h2>\n\n\n\n<p>Any app that shows you the location of people and your very expensive gear should be architected from the ground up to protect your privacy.</p>\n\n\n\n<p>Apple does of course get location data for your devices (how else would it show you where they are?) but it minimizes the data it collects and stores. Apple receives location information only when you <em>actively</em> locate your device, mark it as lost, or enable Send Last Location. Then, the data is stored encrypted on Apple’s servers, and is retained for no more than 24 hours.</p>\n\n\n\n<p>Finding offline devices using Bluetooth beacons is even more private—that relies on a system of fully end-to-end encrypted and anonymous identifiers that use a rotating key provided by one of your <em>other</em> Apple devices. Nobody else, not even Apple, can identify and track your devices this way.</p>\n\n\n\n<p>When somebody shares their location with you, you do not automatically share your location back—you’re given the option to. And you can share your location for just one hour, until the end of the day, or indefinitely.</p>\n\n\n\n<h2>How to enable Find My on your Apple device</h2>\n\n\n\n<p>When you sign into your Apple ID on your device, it automatically enables certain features, including Find My [device]. It’s enabled for your Apple Watch or AirPods if it’s enabled for the iPhone they’re associated with.</p>\n\n\n\n<p>If you’ve disabled this for some reason, you can re-enable it in the Settings app.</p>\n\n\n\n<p>Open <em>Settings</em>, and then tap on your Apple ID at the top. Select <em>Find My</em> and you’ll see a <em>Find My iPhone/iPad</em> menu at the top of the screen to enable Find My iPhone/iPad, Enable Offline Finding, and Send Last Location.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/10/find-my-settings-100813866-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/10/find-my-settings-100813866-large.jpg\" /></a><figcaption><p>Find My should be on by default for most users, but you can enable or disable it in Settings.</p>\n</figcaption></figure></div>\n\n\n\n<p>You can also choose whether to share your location with others, including when making requests of Siri or to trigger location-based automations in the Home app.</p>\n\n\n\n<p>On a Mac running macOS Catalina or later, open the System Preferences app and click on Apple ID. Select iCloud on the left, and scroll down through the list of apps using iCloud to make sure that Find My Mac is selected.</p>\n\n\n\n<h2>Finding items with Find My</h2>\n\n\n\n<p>Item trackers that use Apple’s Find My network like <a href=\"https://www.macworld.com/article/343664/airtags-price-release-date-specs-features-privacy.html\">AirTags</a> or the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://chipolo.net/en-us/pages/chipolo-one-spot-preorder&amp;xcust=1-1-233398-0-0-0&amp;sref=https://www.macworld.com/feed\">Chipolo ONE Spot</a> can be used to keep tabs on anything—keys, wallets, bags, whatever. You’ll need to have your iPhone updated to iOS 14.5 (or macOS 11.3 on a Mac) to see the new Items tab they appear under. The following video describes the setup process and how to use Find My to locate your items. </p>\n\n\n\n<figure><div>\n\n</div></figure><p>You can put make AirTags and most other Find My trackers emit a sound, or put them into “lost mode,” just as you can with your Apple devices (see below). As a privacy and security feature, your iPhone will alert you if it notices a Find My tracker moving around with you that it hasn’t registered. This will help prevent would-be-stalkers from slipping an AirTag into your bag or car or something to follow you around unsuspected.</p>\n\n\n\n<h2>Sharing your location with others</h2>\n\n\n\n<p>Sharing your location is simple. Open the Find My app and tap the “(+) Share My Location” prompt at the bottom of the People tab. On a Mac, it’s in the left sidebar.</p>\n\n\n\n<p>In fact, for all functions, the app works essentially the same on the iPhone, iPad, and Mac, just with slightly different interface layouts. The iPhone has a bottom bar, the iPad a floating window on a map, and the Mac has a left-side navigation bar.</p>\n\n\n\n<p>You’ll then have to enter the name, email address, or phone number of the people to whom you want to share your location. If they have multiple phone numbers or email addresses, be sure to use the one associated with their Apple ID, just as if you were going to send them an iMessage.</p>\n\n\n\n<p>You’ll then be prompted for how long you wish to share your location: One hour, until the end of the day, indefinitely, or don’t share your location after all.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/10/find-my-limits-100813868-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/10/find-my-limits-100813868-large.jpg\" /></a><figcaption><p>Whether you initiate location sharing or someone else does, you’ll have the option to limit the length of your location sharing.</p>\n</figcaption></figure></div>\n\n\n\n<p>To stop sharing your location with someone, tap their name on your People list, and scroll down to select <em>Stop Sharing My Location</em>.</p>\n\n\n\n<p>Under the Me tab, you can control how your location is shared. You can choose to stop sharing your location, and if you have multiple iPhones, you can decide which one should be used to represent your location to others. You can toggle the ability to receive friend requests or decide whether you want to receive location updates from everyone, or just those who you have also shared your location with. Finally, you can label your current location (Home, Work, School, Gym, or your own custom label).</p>\n\n\n\n<h2>Playing a sound to help find devices</h2>\n\n\n\n<p>If you can’t find one of your devices, but the map shows that it’s around here <em>somewhere</em>, you can make it emit a sound.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/10/find-my-sound-100813873-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/10/find-my-sound-100813873-large.jpg\" /></a><figcaption><p>Know your Apple device is somewhere nearby but still can’t find it? You can make it emit a loud sound.</p>\n</figcaption></figure></div>\n\n\n\n<p>Select the device from the Devices tab, then tap the Play Sound button. You’ll get an alert on the target device, after which it will make a series of increasingly loud sounds.</p>\n\n\n\n<p>It even works for your AirPods, assuming the battery isn’t dead.</p>\n\n\n\n<h2>Marking a device as lost</h2>\n\n\n\n<p>If you lose your device, you can use Find My on another one of your Apple devices to mark it as lost. This works on almost any device with a screen (so, not AirPods).</p>\n\n\n\n<p>Just tap the device in the Devices tab, and scroll down to the Mark as Lost section. Tap Activate and you’ll get a series of prompts—your lost device will be locked, and you can optionally display a phone number and a message to display on the lock screen, to help the person who finds it contact you.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/10/find-my-lost-ipad-100813874-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/10/find-my-lost-ipad-100813874-large.jpg\" /></a><figcaption><p>When you lose your device, you can quickly remotely lock it and make it display an optional message and phone number.</p>\n</figcaption></figure></div>\n\n\n\n<p>The Mark as Lost section will change to show you when it was activated—you can tap on this to change the phone number and message, receive email updates about the device (with its location as it moves), or turn off the Mark as Lost feature.</p>\n\n\n\n<h2>Remote erasing your device</h2>\n\n\n\n<p>If you know one of your devices is gone forever and you want to make sure nobody could possibly get at your data, you can remotely erase it.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/10/find-my-erase-100813880-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/10/find-my-erase-100813880-medium.jpg\" /></a><figcaption><p>If you feel your device is probably gone forever, be sure to erase all your content and settings.</p>\n</figcaption></figure></div>\n\n\n\n<p>Just open the Find My app, go to the Devices tab, and select the lost device. Scroll down and tap on Erase This Device. This will remove all content and settings from your device, essentially returning it to its new-in-box setup process.</p>\n\n\n\n<p>If the device is offline, it will erase itself as soon as it comes online. If you have an Apple ID associated with the device, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT201365&amp;xcust=1-1-233398-0-0-0&amp;sref=https://www.macworld.com/feed\">Activation Lock</a> will prevent someone else from setting it up without first entering your Apple ID. You need to remove your Apple ID from that device before someone else can set it up for themselves.</p>\n\n\n\n<p>This is a great feature to help protect your products from being stolen—they’re of no use to thieves without your Apple ID login and password. But if you plan to sell your device, make sure you remove your Apple ID from it first!</p>\n\n\n\n<p>Most of the actions you perform on your devices using the Find My app will trigger an email to the address associated with your Apple ID: playing sounds, marking as lost, erasing devices, and so on. So if someone else gets access to your unlocked phone and starts making changes to how it is tracked, you’ll at least get an email about it</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"fc187aa7cf7be26ff2b6a6965bbca2bc20ea9a44a23039ac51f59f01fbc05eae","category":"Apple"}