{"title":"Preparation and Refinement Mechanism of a New Master Alloy Al-5Ti-1B-1RE Refiner","link":"https://www.preprints.org/manuscript/202409.1266/v1","date":1726563088000,"content":"To obtain high quality grain refiner, a new Al-5Ti-1B-1RE master alloy grain refiner was synthesised by melt-matching method. Thermodynamic calculations and kinetic analyses, which were seriously missing from the study of key issues during the preparation process, were investigated. The microstructure and properties, comparison of the refining effect of different grain refiners on industrial pure aluminium and its refining mechanism were analysed with the help of X-ray diffraction (XRD), optical microscopy (OM), scanning electron microscopy (SEM) and energy spectroscopy, transmission electron microscopy (TEM) and an electronic universal testing machine (CSS-44100). The experimental results show that the second-phase particles in the Al-5Ti-1B-1RE master alloy matrix synthesised by the melt-matching method are mainly TiB2、 A13Ti、Ti2A120RE, etc. The magnitude of the free energy ΔG of the synthesis reaction is calculated to be ΔGTiB2&lt;ΔGAl3Ti&lt;ΔGTi2A120RE. When the temperature is low (undercooling ΔT is large), the nucleation rate N mainly depends on the kinetic atomic diffusion activation energy Q, while the thermodynamic nucleation work becomes a secondary factor, and vice versa. The industrial pure aluminum refined by the new grain refiner has almost transformed from coarse columnar crystals to fine equiaxed crystals, with an average grain size of 70.2 μm, which was 36.18% and 20.66% smaller than that refined by domestic and imported Al-Ti-B wire master alloy grain refiner, and its mechanical properties of tensile strength σb was increased by 11.94%, 8.29%, and elongation at break δ was improved by 31.79%, 17.41%, respectively. The main mechanism for refining pure aluminum in Al-5Ti-1B-1RE master alloy is the formation of TiA13 on TiB2 particles, the release of RE atoms from Ti2A120RE phase surrounding TiAl3, and the partial transformation into TiA13 phase, which promotes the dual nucleation refinement mechanism and the pinning effect of rare earth elements on grain boundaries.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fc22a67458af0c3f225a79bd7a7788963d783e382bdf93574dd91e92fb7422b2","category":"Interdisciplinary"}