{"title":"High-Resolution Early Warning Systems Using DL: Part II - Combining FourCastNet and E-TEPS for High-Resolution Climate Forecasting","link":"https://www.preprints.org/manuscript/202408.1322/v1","date":1724062581000,"content":"Extreme weather events, such as heat waves and heavy precipitation, are becoming increasingly frequent due to climate change, necessitating the development of effective early warning systems (EWS) to mitigate their impacts. This study introduces an advanced EWS designed specifically for Italy, which integrates the FourCastNet global forecasting model with Elevation-integrated TEmperature and Precipitation SRGAN downscaling (E-TEPS) to enhance the spatial resolution and accuracy of climate predictions. Building on previous work that demonstrated E-TEPS's effectiveness in downscaling temperature and total precipitation variables, this research applies the integrated system to two severe weather events in Central Italy: the Emilia-Romagna floods of 2023 and the Marche floods of 2022. The system's performance was evaluated using key metrics, including Mean Absolute Error (MAE), Root Mean Square Error (RMSE), and Pearson Correlation, by comparing downscaled outputs from FourCastNet and ERA5 datasets against high-resolution ground truth data from the Euro-Mediterranean Center on Climate Change (CMCC) dataset. The results indicate that the integrated system offers improved predictive accuracy, particularly in capturing critical climate variables, with the entire EWS delivering high-resolution forecasts and final outputs in under one minute. Although potential limitations were identified due to biases in the underlying datasets, which could affect forecast reliability in regions with complex topography or extreme weather conditions, this research highlights the potential of combining machine learning models with downscaling techniques to enhance EWS precision, providing valuable insights for future climate forecasting and disaster preparedness strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fc2370f84b6e1b58889118a5293aec830dd698484af6e08d0515cd28ba9ebe30","category":"Interdisciplinary"}