{"title":"This 15th century manuscript mentions a Monty Python-esque killer rabbit","link":"https://arstechnica.com/?p=1946709","date":1686869608000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/bawdybard9-ALT2-800x527.jpg\" alt=\"Scholar: The 15th century &quot;Heege manuscript&quot; could be a rare written record of a live minstrel performance.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/bawdybard9-ALT2.jpg\">Enlarge</a> <span>/</span> Scholar: The 15th century \"Heege manuscript\" could be a rare written record of a live minstrel performance. (credit: YouTube/University of Cambridge)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>One of many <a href=\"https://www.youtube.com/watch?v=PC4tNqdh6A8\">standout scenes</a> in the 1975 classic <a href=\"https://en.wikipedia.org/wiki/Monty_Python_and_the_Holy_Grail\"><em>Monty Python and the Holy Grail</em> </a>features King Arthur and his knights facing down the <a href=\"https://en.wikipedia.org/wiki/Rabbit_of_Caerbannog\">Killer Rabbit of Caerbannog</a>, a seemingly innocuous bunny who soon proves to be a devastating adversary, forcing the knights to retreat (\"Run away! Run away!\"). Killer rabbits are a kind of <a href=\"https://blogs.bl.uk/digitisedmanuscripts/2021/06/killer-rabbits.html\">mainstay of medieval literature</a>, featuring prominently in marginal illustrations, as well as a mention in Chaucer's <em>The</em> <em>Canterbury Tales</em>. In fact, the Python crew <a href=\"https://books.google.com/books?id=G49bRxbeH1kC\">drew inspiration</a> for their version from a scene on the facade of Notre Dame in Paris, depicting a knight fleeing a rabbit.</p>\n<p>Killer rabbits might even have been a common trope among traveling minstrels, according to one scholar's discovery of a written record of a live performance preserved in a 15th century manuscript, which also includes one of the earliest recorded uses of the phrase \"red herring.\" Cambridge University's James Wade, author of a <a href=\"https://academic.oup.com/res/advance-article/doi/10.1093/res/hgad053/7187022\">recent paper</a> published in The Review of English Studies, stumbled across the manuscript while doing research in the National Library of Scotland.</p>\n<p>The scribe identified himself in the text as Richard Heege, a household cleric and tutor to the Sherbrooke family of Derbyshire. Heege's manuscript, with its inclusion of low-brow nonsense verse, a mock sermon, and a burlesque romance, \"gives us the rarest glimpse of a medieval world rich in oral storytelling and popular entertainments,” said Wade.</p></div><p><a href=\"https://arstechnica.com/?p=1946709#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1946709&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fc25f39b1ff51b6bffb9ab3d5ecfc6c3908d8d3dc24fdf9c68547da0c92c60b8","category":"Tech"}