{"title":"The impact of aragonite saturation variability on shelled pteropods: An attribution study in the California Current System","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17345?af=R","date":1717482878000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3d076436-1876-476e-9c69-1955c5c3a6b4/gcb17345-toc-0001-m.png\" alt=\"The impact of aragonite saturation variability on shelled pteropods: An attribution study in the California Current System\" />\n<p>Observational evidence from the California Current System indicates that the long-term ocean acidification trend is severely damaging shelled pteropods, an indicator species for ocean health. This damage is linked to their vertical migration, which exposes them to more damaging conditions at depth. However, the increasing ocean acidification trend and extreme acidification events significantly amplify this exposure and the resulting damage, which emphasizes the growing concern that such conditions will continue to exacerbate the vulnerability of marine ecosystems in the future.</p>\n<br />\n<h2>Abstract</h2>\n<p>Observations from the California Current System (CalCS) indicate that the long-term trend in ocean acidification (OA) and the naturally occurring corrosive conditions for the CaCO<sub>3</sub> mineral aragonite (saturation state <i>Ω</i> &lt; 1) have a damaging effect on shelled pteropods, a keystone group of calcifying organisms in the CalCS. Concern is heightened by recent findings suggesting that shell formation and developmental progress are already impacted when <i>Ω</i> falls below 1.5. Here, we quantify the impact of low <i>Ω</i> conditions on pteropods using an individual-based model (IBM) with life-stage-specific mortality, growth, and behavior in a high-resolution regional hindcast simulation of the CalCS between 1984 and 2019. Special attention is paid to attributing this impact to different processes that lead to such low <i>Ω</i> conditions, namely natural variability, long-term trend, and extreme events. We find that much of the observed damage in the CalCS, and specifically &gt;70% of the shell CaCO<sub>3</sub> loss, is due to the pteropods' exposure to naturally occurring low <i>Ω</i> conditions as a result of their diel vertical migration (DVM). Over the hindcast period, their exposure to damaging waters (<i>Ω</i> &lt; 1.5) increases from 9% to 49%, doubling their shell CaCO<sub>3</sub> loss, and increasing their mortality by ~40%. Most of this increased exposure is due to the shoaling of low <i>Ω</i> waters driven by the long-term trend in OA. Extreme OA events amplify this increase by ~40%. Our approach can quantify the health of pteropod populations under shifting environmental conditions, and attribute changes in fitness or population structure to changes in the stressor landscape across hierarchical time scales.</p>","author":"Urs Hofmann Elizondo, \nMeike Vogt, \nNina Bednaršek, \nMatthias Münnich, \nNicolas Gruber","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"fc37f268a35a88fb6c815a66c68679f3218de763ce01aae64fcff8c0647379ef","category":"Environment"}