{"title":"Genetic structure of black soldier flies in northern Iran","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308953","date":1723730400000,"content":"<p>by Afrooz Boukan, Jamasb Nozari, Nazanin Naseri Karimi, Fahimeh Talebzadeh, Katayoun Pahlavan Yali, Mohammad Ali Oshaghi</p>\r\nBackground <p>The black soldier fly (BSF), <i>Hermetia illucens</i>, is known for nutrient-recycling through the bioconversion of organic waste into protein-rich insect larvae that can be processed into an animal feed ingredient. However, information on species distribution and its genetic structure in Iran is scarce.</p> Methods and results <p>We directed a survey on the Caspian Sea coast, with a reconstructing demographic relationships study using two parts of mitochondrial cytochrome C oxidase 1 (COI) gene (barcode and 3’ end regions) and nuclear internal transcribed spacer 2 (ITS2) to identify BSF<i>’</i> genetic diversity in retrospect to the global diversity and the potential origin of the Iranian BSF population. Larvae and adults were recovered from highly decomposed poultry manure, in May 2020. Sequence analysis of both regions of COI gene (about 1500 bp) revealed a single haplotype, identical to that of haplotype C, a worldwide commercial strain originated from Nearctic, Palearctic, or African biogeographic regions. However, the ITS2 locus was confirmed to be invariable across samples from diverse biogeographic regions.</p> Conclusion <p>The results proved the presence of BSF in north of Iran. However, it is not possible to determine with certainty when and where this species first established in Iran, and they have likely been released to nature due to the existence of companies importing and breeding such flies. Due to heavy international trading, the introduction and settlement of this fly in the southern coasts of the country is highly suggested.</p>","author":"Afrooz Boukan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fc404c71e0849ad681c81523844ce6bfd7bb31de1d06f664d5a356f88aca7b0f","category":"Interdisciplinary"}