{"title":"Goodnotes อัพเดตใหญ่เวอร์ชัน 6 นำ AI มาช่วยในการจดบันทึก พร้อมระบบผู้ช่วยสอนคณิตศาสตร์","link":"https://www.blognone.com/node/135206","date":1691629064000,"content":"<div><div><div><p>Goodnotes แอปจดบันทึกยอดนิยมของผู้ใช้งาน iPad ออกอัพเดตใหญ่ในรอบ 4 ปี เป็น Goodnotes 6 โดยมีจุดเด่นคือการนำ AI มาช่วยในการทำงาน ทั้งระบบรู้จำการจดบันทึก ระบบมาร์เกตเพลสสำหรับเครื่องเขียน ทางลัดการใช้ปากกาแบบใหม่ และอื่น ๆ</p>\n<p>เครื่องมือใหม่ด้านภาษาได้แก่ Spellcheck ช่วยแก้ไขคำสะกดผิด, Word Complete ไกด์แนะนำคำสะกดแบบ autocomplete รวมทั้งทำงานร่วมกับ Claude ช่วยร่างสรุป ย่อความ ขยายความ ปรับโทนการเขียน ด้วย AI ทั้งนี้ฟีเจอร์ด้านภาษารองรับเฉพาะภาษาอังกฤษ สเปน เยอรมนี และดัตช์</p>\n<p>Goodnotes ยังเพิ่มเครื่องมือสำหรับการเรียนการสอบ โดยมีทั้งคอร์สเตรียมสอบ SAT และ DSE ในแอป รวมทั้งมี AI ช่วยแนะนำการแก้โจทย์ทางคณิตศาสตร์ด้วย</p>\n<p>ทางลัดเวลาเขียนปากกาใหม่ที่เพิ่มมาได้แก่ ขีดฆ่าเพื่อลบข้อความ ไม่ต้องหายางลบ, วาดวงกลมรอบวัตถุเพื่อเลือก, กรณีเขียนสมการคณิตศาสตร์ Goodnotes สามารถแปลงเป็นตัวพิมพ์ให้</p>\n<p>เนื่องจาก Goodnotes อัพเกรดจากเวอร์ชัน 5 เป็น Goodnotes 6 จึงมาพร้อมค่าใช้จ่ายใหม่ ตัวแอปยังสามารถดาวน์โหลดใช้งานได้ฟรีทั้ง iOS, iPadOS และ macOS โดยเวอร์ชันฟรีใช้งานได้สูงสุด 3 notebooks สามารถเลือกอัพเกรดได้สองแบบคือ</p>\n<ul>\n<li>จ่ายรายปี 279 บาทต่อปี</li>\n<li>จ่ายครั้งเดียว 769 บาท</li>\n</ul>\n<p>สำหรับผู้ใช้งานปัจจุบันการเปลี่ยนแปลงมีดังนี้</p>\n<ul>\n<li>ผู้ใช้งาน Goodnotes 5 แบบฟรี หากมี notebook มากกว่า 3 ชุด จะใช้งานแก้ไขต่อได้เพียง 3 notebook หลังอัพเกรด ส่วนที่เกินมาจะดูได้อย่างเดียว โดยจะถูกบังคับอัพเกรดตั้งแต่ 9 กันยายน เป็นต้นไป</li>\n<li>ผู้ใช้งาน Goodnotes 5 แบบจ่ายเงิน ยังสามารถใช้งาน Goodnotes 5 ต่อไปได้ แต่จะไม่ได้รับฟีเจอร์ใหม่อีก ซึ่งสามารถอัพเกรดไปใช้ Goodnotes 6 ได้ ในราคาส่วนลดสำหรับปีแรกตามเงื่อนไข</li>\n</ul>\n<p>ทั้งนี้ Goodnotes ยังมีเวอร์ชัน <a href=\"https://www.blognone.com/node/132912\">Android</a> และ <a href=\"https://www.goodnotes.com/windows\">Windows</a> แต่ไม่ได้ฟีเจอร์แบบ Goodnotes 6</p>\n<p>ที่มา: <a href=\"https://www.goodnotes.com/blog/introducing-goodnotes-6\">Goodnotes</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/6af461c56d486cdb3de86b369d42f300.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/goodnotes\">GoodNotes</a></div><div><a href=\"/topics/ipad\">iPad</a></div><div><a href=\"/topics/mobile-app\">Mobile App</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"fc4343ee024b071c03f7d4d6356b650f904f1da581037931d8dc93c7e0310c6c","category":"Thai"}