{"title":"Did Oregon once host a nesting colony of pterosaurs?","link":"https://arstechnica.com/?p=1923922","date":1678818056000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/Hudspeth-Fig.10-800x716.jpg\" alt=\"The Oregon pterosaur &lt;em&gt;Bennettazhia oregonensis&lt;/em&gt;, with 4 meter wingspan, reconstructed independently in seagull colors by Midiaou Diallo and reproduced with permission.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/Hudspeth-Fig.10.jpg\">Enlarge</a> <span>/</span> The Oregon pterosaur <em>Bennettazhia oregonensis</em>, with 4 meter wingspan, reconstructed independently in seagull colors by Midiaou Diallo and reproduced with permission. (credit: Midiaou Diallo)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A single fossil toe is all we have of the ‘<a href=\"https://www.tandfonline.com/doi/full/10.1080/02724634.2018.1486847\">Mitchell ornithopod</a>,’ the nickname of the first early Cretaceous dinosaur fossil found in Oregon in 2018. Ornithopods were enormous herbivores such as duck-billed dinosaurs and iguanodons, and Gregory J. Retallack, lead author of that discovery, wanted to find more of its skeleton. Three years later, he returned to the site, aided by over 80 volunteers who helped excavate in more detail.</p>\n<p>No further ornithopod bones—indeed, no substantial dinosaur bones of any kind—were retrieved after two weeks of digging. It was, he said, “a failure” in that regard. What they found instead was a complete mess, a jumble of the remains of land-based and aquatic animals. And lots and lots of guano.</p>\n<p>That came from extinct flying reptiles, known collectively as pterosaurs, and suggests these animals may have flocked together on the cliffs above the coast of Oregon.</p></div><p><a href=\"https://arstechnica.com/?p=1923922#p3\">Read 28 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1923922&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fc433b16776d8a783a42010acff227911a5ce8b2d3abf1a45b44bedd26c1c53c","category":"Tech"}