{"title":"กูเกิลเพิ่มฟีเจอร์เข้ารหัสด้วยกุญแจองค์กร, แชร์เอกสารข้ามองค์กร, กำหนดเอกสารลับห้ามดาวน์โหลด","link":"https://www.blognone.com/node/123181","date":1623679117000,"content":"<div><div><div><p>กูเกิลประกาศเพิ่มฟีเจอร์ใน Google Workspace สำหรับลูกค้าองค์กร ทั้งการเข้ารหัสและการป้องกันข้อมูลรั่วไหล แบ่งเป็น 3 ฟีเจอร์ ได้แก่</p>\n<ul>\n<li><strong>เข้ารหัสข้อมูลโดยลูกค้า (client-side encryption)</strong> เปิดให้องค์กรเก็บกุญแจเข้ารหัสไว้กับตัวเอง โดยช่วงแรกอาจจะต้องเลือกใช้บริการเก็บกุญแจเข้ารหัสที่รองรับ Google Workspace ได้แก่ Flowcrypt, Futurex, Thales, และ Virtru แต่ต่อไปกูเกิลจะเปิด API ให้องค์กรใช้กุญแจของตัวเองเข้ารหัสข้อมูลได้โดยตรง</li>\n<li><strong>ควบคุมการเข้าถึงข้อมูลข้ามองค์กร (trust rule)</strong>  ฟีเจอร์นี้เปิดให้ผู้ดูแลระบบกำหนดผู้ใช้ขององค์กรอื่นเข้าถึงเอกสารที่แชร์กันได้ โดยอาจจะกำหนดเป็นกลุ่มหรือผู้ใช้รายคน</li>\n<li><strong>ป้องกันข้อมูลรั่วไหล (data loss prevention - DLP)</strong> ฟีเจอร์กำหนดชั้นความลับเอกสารเพื่อตั้งนโยบายเพิ่มเติม เช่นห้ามดาวน์โหลด, ห้ามพิมพ์, หรือห้ามแชร์ ความพิเศษคือกูเกิลมีระบบอัตโนมัติสำหรับจัดชั้นความลับเอกสารหากผู้สร้างเอกสารไม่ได้ตั้งค่าไว้เอง</li>\n</ul>\n<p>บริการ DLP เปิดให้ลูกค้าจ่ายเงินตั้งแต่ Business Standard ขึ้นไป ส่วน trust rule ต้องเป็นลูกค้าระดับ Enterprise Standard หรือ Education Plus ขึ้นไป ฟีเจอร์เข้ารหัสต้องเป็นระดับ Enterprise Plus หรือ Education Plus เท่านั้น และกูเกิลเตรียมขยายฟีเจอร์เข้ารหัสไปยังบริการอื่นๆ รวมถึงไฟล์จากภายนอกด้วย</p>\n<p>ที่มา - <a href=\"https://cloud.google.com/blog/products/workspace/new-google-workspace-security-features\">Google Cloud Blog</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ea353aff9ea50c94d5b770d256a0b50d.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-workspace\">Google Workspace</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/security\">Security</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"fc4340e3b58570fe9624d56e3e3f070ca9081f9030116d9c12773ff65cd79783","category":"Thai"}