{"title":"The Informational Physical Model and Fundamental Problems in Physics","link":"https://www.preprints.org/manuscript/202110.0453/v5","date":1722330216000,"content":"This article is some review of results that were obtained at 2007-2021 years development of “The Information as Absolute” concept and the informational physical model, which is based on the concept; including a number of fundamental physical problems are briefly considered in framework of the conception and the model. Recently in physics there are several publications, that  present lists of the problems. However, those lists are essentially incomplete, for at least two reasons. Firsts of all, a number of phenomena are studied traditionally by philosophy, and so corresponding problems are usually considered to be “metaphysical”. However, they relate also to some concrete physical phenomena. For example, physics evidently studies Matter, and so the metaphysical problems “what is ontology of Matter”, “what is “Space”, “Time” and a few other physical phenomena and notions as well, are really a Meta-physical problems “what does physics study?” There are other fundamental physical problems, which are not considered as such in physics, and are absent in the “fundamental problems lists”. Those include the problems, which really exist, yet are incorporated into standard physical theories, and so are fundamental “implicitly”, which in physics are “solved by default” ‒ and mostly erroneously. Note, though, that a number of “Meta-physical”, and concrete fundamental, problems more in detail are considered in the paper “The Informational Conception and Basic Physics”, https://arxiv.org/abs/0707.4657, v5 (2021), so this paper is, in certain sense, an expanded conclusion of this paper, which includes, correspondingly, more in detail consideration of some more general physical problems;  and, besides, in this article, the problem “what are Gravity and Electric Forces” is essentially clarified comparing with the arXiv 2021 paper version above, and additionally initial model of Nuclear Force is presented. Besides, the concrete problem “What is Life”, and the rational cosmological model, where a few vague points in standard cosmology rather probably are rationally clarified, while the fundamental problem “matter – antimatter asymmetry” in Matter is solved with rather large probability, are considered, and one of recently published rather complete “lists of fundamental problems” is commented in Appendix","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fc49e0c1b94071f49782158b4d1e1bef943558f56b23891fdb78e092a37fb655","category":"Interdisciplinary"}