{"title":"Alexa and Google Assistant fall on hard times, agree to be speaker roommates","link":"https://arstechnica.com/?p=1964688","date":1693509325000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/2-2-980x653.jpg\" alt /></div>\n          <p>\n            The JBL Authentics 200.                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>The Google Assistant and Alexa have long been at odds, and back in the voice assistants' heydays, speaker-makers seemingly weren't allowed to ship both platforms in one product. Later around 2019, the two companies finally deigned to be on the same device—but never active at the same time. Notably on Sonos speakers, customers could <a href=\"https://www.fastcompany.com/90300524/why-cant-alexa-and-google-assistant-coexist-on-one-device\">swap between</a> the two assistants via an app setting. Times are getting tough for voice assistants, though, and now via a new toolkit, Amazon and Google can finally work at the same time on a single speaker. One of the first to support the new toolkit is JBL, via the new <a href=\"https://news.harman.com/releases/jbl-authentics-what-your-home-looks-like-says-a-lot-what-it-sounds-like-says-more-6895100\">JBL Authentics 200, 300, and 500</a> speakers.</p>\n<p>The toolkit is called the \"Multi-Agent Experience (MAX) Toolkit,\" and we have dueling press releases from <a href=\"https://blog.google/products/assistant/google-assistant-alexa-jbl-speakers/\">Google</a> and <a href=\"https://www.aboutamazon.com/news/devices/alexa-google-assistant-jbl-speakers\">Amazon</a> promoting the new speaker. Amazon says the two voice assistants can even work together and handoff tasks, saying \"customers no longer need to remember which service they asked to start a request for music, timers, reminders, or alarms—either service can stop it. For example, customers can ask Alexa to set a timer and ask Google Assistant to stop it when it goes off, or vice versa.\"</p>\n<p>As for JBL's hardware, you get a choice of three rather pricey speakers. The JBL Authentics 200 is $329.99 and has \"a pair of 1-inch tweeters bringing each song to life, with the full-range 5-inch woofer and downfiring 6-inch passive radiator.\" The 300 model takes the same basic speaker and adds an \"8 hour\" battery and a handle to the mix, making it a portable bluetooth speaker for $429.99. The beefy 500 model is a whopping $699.99 and features three 1-inch tweeters, three 2.75-inch mid-range woofers, and a 6.5-inch downfiring subwoofer for 270 watts of sound. This also adds Dolby Atmos support for 3D sound. All units have top-mounted treble, base, and volume knobs, and on the back, you get USB-C, power, and—a real shocker—wired Ethernet ports!</p></div><p><a href=\"https://arstechnica.com/?p=1964688#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1964688&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fc4dca7688f9daddc345ba6a24075a041ea97e955c8803711cef18a7905015f0","category":"Tech"}