{"title":"Bitcoin Scam App Approved by Apple Robs iPhone User of $600,000+","link":"https://www.macrumors.com/2021/03/30/bitcoin-scam-app-costs-iphone-user-life-savings/","date":1617132620000,"content":"A scam bitcoin app that was designed to look like a genuine app was accepted by Apple's <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> review team and ended up costing <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> user Phillipe Christodoulou 17.1 bitcoin, or upwards of &#36;600,000 at the time of the theft, reports <em><a href=\"https://www.washingtonpost.com/technology/2021/03/30/trezor-scam-bitcoin-1-million/\">The Washington Post</a></em>.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-bitcoin-app-scam.jpg\" alt=\"\" width=\"1920\" height=\"1080\" class=\"alignnone size-full wp-image-791703\" />\r\n<br/>\r\nChristodoulou wanted to check on his bitcoin balance back in February, and searched Apple's &zwnj;App Store&zwnj; for \"Trezor,\" the company that makes the hardware device where he stored his cryptocurrency. He saw an app with the Trezor padlock logo and a green background, so he downloaded it and entered his credentials.\r\n<br/>\r\n\r\n<br/>\r\nUnfortunately, the app was fake, and was designed to look like a legitimate app to fool bitcoin owners. Christodoulou had his total bitcoin balance stolen from him, and he's angry with Apple. \"Apple doesn't deserve to get away with this,\" he told <em>The Washington Post</em>.\r\n<br/>\r\n\r\n<br/>\r\nApple reviews all &zwnj;App Store&zwnj; app submissions to prevent scam apps from being downloaded by &zwnj;iPhone&zwnj; users, but there are plenty of scam and copycat apps like the fake Trezor app that slip by and have major consequences for &zwnj;iPhone&zwnj; users.\r\n<br/>\r\n\r\n<br/>\r\nApple says the fake Trezor app got through the &zwnj;App Store&zwnj; through \"a bait-and-switch.\" It was called Trezor and used the Trezor logo and colors, but said that it was a \"cryptography\" app that would encrypt &zwnj;iPhone&zwnj; files and store passwords. The developer of the fake app told Apple that it was \"not involved in any cryptocurrency.\" After the fake Trezor app was submitted, it changed itself into a cryptocurrency wallet, which Apple was not able to detect.\r\n<br/>\r\n\r\n<br/>\r\nMeghan DiMuzio, the executive director for the Coalition of App Fairness that counts anti-Apple companies like <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> as a member, said that Apple \"pushes myths about user privacy and security as a shield against its anti-competitive &zwnj;App Store&zwnj; practices.\" She said that Apple's security standards are \"inconsistently applied across apps\" and \"only enforced when it benefits Apple.\"\r\n<br/>\r\n\r\n<br/>\r\nApple spokesperson Fred Sainz told <em>The Washington Post</em> that Apple takes swift action when criminals defraud &zwnj;iPhone&zwnj; users.\r\n<br/>\r\n<blockquote>User trust is at the foundation of why we created the &zwnj;App Store&zwnj;, and we have only deepened that commitment in the years since. Study after study has shown that the &zwnj;App Store&zwnj; is the most secure app marketplace in the world, and we are constantly at work to maintain that standard and to further strengthen the &zwnj;App Store&zwnj;'s protections. In the limited instances when criminals defraud our users, we take swift action against these actors as well as to prevent similar violations in the future.</blockquote>\r\n<br/>\r\nApple declined to comment on how often scam apps are found, nor how often they're removed from the &zwnj;App Store&zwnj;. The company did, however, say that 6,500 apps were removed last year for \"hidden or undocumented features.\"\r\n<br/>\r\n\r\n<br/>\r\nApple acknowledged that it has discovered other cryptocurrency scams on the &zwnj;App Store&zwnj;, but did not provide specific details on numbers nor whether there had been fake Trezor apps in the past. Trezor does not offer an iOS app at all, and Trezor spokesperson said that it had been notifying Apple and Google about fake Trezor apps \"for years.\"\r\n<br/>\r\n\r\n<br/>\r\nApple would not provide <em>The Washington Post</em> with the name of the developer of the fake Trezor app, whether that developer had other apps in the &zwnj;App Store&zwnj; under other names, nor would Apple say whether the name was turned over to law enforcement officials. Apple says that it removed the fake Trezor app and banned the developer after the actual Trezor company reported it. Another fake app popped up two days later, and Apple removed that, too.\r\n<br/>\r\n\r\n<br/>\r\nUK-based cryptocurrency regulation company Coinbase said that it has received over 7,000 inquiries about stolen crypto assets since 2019, and fake apps found in the Google Play and &zwnj;App Store&zwnj; are common complaints. In fact, five people have had cryptocurrency stolen by the fake Trezor app on iOS, with losses totaling &#36;1.6 million.\r\n<br/>\r\n\r\n<br/>\r\nData from Sensor Tower suggests that the fake Trezor app was on the &zwnj;App Store&zwnj; from January 22 to February 3, and was downloaded approximately 1,000 times. The 17.1 bitcoin that Christodoulou lost are worth close to &#36;1 million today, and Christodoulou says that he's heard nothing from Apple on the subject.\r\n<br/>\r\n\r\n<br/>\r\nAnother &zwnj;iPhone&zwnj; user who lost &#36;14,000 worth of Ethereum and bitcoin said that an Apple representative told him Apple was not responsible for the loss from the fake Trezor app.<br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/30/bitcoin-scam-app-costs-iphone-user-life-savings/\">Bitcoin Scam App Approved by Apple Robs iPhone User of &#36;600,000+</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/bitcoin-scam-app-approved-by-apple-robs-iphone-user-of-600-000.2290123/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ZjNw37qe5Xg:RSAhWDbdEco:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ZjNw37qe5Xg:RSAhWDbdEco:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ZjNw37qe5Xg\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fc578ac74fa23272afdbc7ad19dc15812ef94c25beb660f0a64bc8cf51e11f1d","category":"Apple"}