{"title":"The Impact of Expert Pathology Review and Molecular Diagnostics on the Management of Sarcoma Patients: A Prospective Study of the Hellenic Group of Sarcomas and Rare Cancers","link":"https://www.preprints.org/manuscript/202404.1963/v1","date":1714455983000,"content":"Precise classification of sarcomas is crucial to drive optimal clinical management. In this prospective, multicenter, observational study within the Hellenic Group of Sarcoma and Rare Cancers (HGSRC) we assessed the effect of expert pathology review, coupled with the application of molecular diagnostics, on diagnosis and management of sarcoma patients. Newly diagnosed sarcoma patients were addressed by their physicians to one of the two sarcoma pathologists of HGSRC for histopathological diagnostic assessment. RNA next-generation sequencing was per-formed to all samples, using a platform targeting 86 sarcoma gene fusions. Additional molecular methods were performed on the opinion of the expert pathologist. Therefore, the expert pathologist provided a final diagnosis based on the histopathological findings and, when necessary on molecular tests. In total, 128 specimens from 122 patients were assessed. Among the 119 cases in which there was a preliminary diagnosis by a non-sarcoma pathologist, there were 37 modifications in diagnosis (31.1%) by the sarcoma pathologist, resulting in 17 (14.2%) modifications in management. Among the 110 cases in which molecular tests were performed, there were 29 modifications in diagnosis (26.4%) through the genomic results, resulting in 12 (10.9%) modifications in management. Our study confirms that expert pathology review is of utmost importance for the optimal sarcoma diagnosis and management and should be assisted by molecular methods in selected cases.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fc5d82a16e7437c4d256497aded98fdfc53c506514e62ad20c2c6eb4f5d62e76","category":"Interdisciplinary"}