{"title":"Century‐Long Records of Sedimentary Input on a Caribbean Reef From Coral Ba/Ca Ratios","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004746?af=R","date":1715418278000,"content":"<h2>Abstract</h2>\n<p>Coral reef ecosystems are delicately balanced and are thus prone to disruption by stressors such as storms, disease, climate variability and natural disasters. Most tropical coral populations worldwide are now in rapid decline owing to additional anthropogenic pressures, such as global warming, ocean acidification and a variety of local stressors. One such problem is the addition of excess sediment and nutrients flux to reefs from increased soil erosion from land use changes. Here we present century-long Ba/Ca records from two <i>Siderastrea siderea</i> colonies as a proxy for local riverine discharge and sediment flux to the southern Mesoamerican Barrier Reef System (MBRS). The coral colonies have linear extension trends, which can be seen as a first-order indicator for coral health and response. The coral colony that exhibits a decline in linear extension rate from the forereef of the MBRS, mainly receives riverine input from Honduras, whilst the coral from the backreef, which does not exhibit a decline in extension rate, primarily receives riverine input from more sparsely populated regions of Belize. Coral Ba/Ca increased (&gt;70%) through time in the forereef colony, while the backreef colony showed little long-term increase in Ba/Ca over the last century. Our results suggest that increasing sediment supply may have played a role in the decline of forereef skeletal extension in the southernmost MBRS region, likely stemming from increasing land-use changes in Honduras.</p>","author":"Kathryn M. M. Shaw, \nChristopher D. Standish, \nSara E. Fowell, \nJoseph A. Stewart, \nKarl D. Castillo, \nJustin B. Ries, \nGavin L. Foster","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"fc5d705b2b711d829eaf2dc56bb6429f777f03dc21a52573d2f1f5133f369116","category":"Environment"}