{"title":"Reproductive parameters of Bering‐Chukchi‐Beaufort Seas bowhead whales","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13079?af=R","date":1712234898000,"content":"<h2>Abstract</h2>\n<p>Data from Bering-Chukchi-Beaufort Seas bowhead whales (<i>Balaena mysticetus</i>), harvested during 1973–2021 by aboriginal subsistence hunters, were used to estimate reproductive parameters: length at sexual maturity (LSM), age at sexual maturity (ASM), pregnancy rate (PR), and calving interval. Sexual maturity (<i>N</i> = 187 females) was determined from the presence/absence of corpora in the ovaries, or a fetus. Using sampling bias-corrected logistic regression, LSM was estimated at 13.5 m, 95% CI [13.0, 13.8]. There was a downward trend in LSM over time, statistically significant with one method but marginal with another. A growth model translated this estimate to an ASM estimate of 23.5 years, 95% CI [20.4, 26.7]. Pregnancy rate was determined from mature females (<i>N</i> = 125), and from a subset limited to certain autumn-caught whales (<i>n</i> = 37) to reduce bias. The PR was estimated at 0.46 globally, 95% CI [0.36, 0.55] and 0.38 for the autumn sample, 95% CI [0.20, 0.51]. Both estimated PRs are consistent with a 3-year calving interval, because the larger estimate includes two cohorts of pregnant whales harvested in spring, and bowhead whale gestation is longer than 12 months. These analyses represent the most conclusive empirical estimates of ASM, LSM, and PR for this bowhead whale stock from the largest available data sets to date.</p>","author":"John C. Craig George, \nGeof H. Givens, \nLara Horstmann, \nRobert Suydam, \nKayla Scheimreif, \nRaphaela Stimmelmayr, \nGay Sheffield, \nTodd L. Sformo, \nBrian Person, \nAndrew Von Duyke, \nLeandra Sousa, \nRita M. Frantz, \nRaymond Tarpley","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"fc5ea03956d0c54ed3bba455b776981fea47c8a9eac254f152a0b64fd3f2ad30","category":"Environment"}