{"title":"F-Secure Total for Mac review","link":"https://www.macworld.com/article/668100/f-secure-total-review.html","date":1683632790000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n<div><span>At a Glance</span><h3>Expert's Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Includes virus protection, secure browsing, ID monitoring, a VPN, and a password vault in one package</li><li>Effective and flexible VPN</li></ul></div><div><h3>Cons</h3><ul><li>Missing key capabilities such as a quick virus scan and a scheduled scan</li><li>Certain options unavailable in the Mac version vs the Windows version</li><li>No notification for malware infections</li><li>No way to view malicious or quarantined files</li><li>Charges a hefty annual subscription</li></ul></div></div></div><h3>Our Verdict</h3><p>F-Secure Total for Mac includes several useful features but lacks certain key options, especially in the virus scanning. For a product that costs $59.99/£34.99 a year for one device (even with a discount), the Mac version feels lackluster, particularly when compared with its Windows counterpart.</p>\n</div><h3>Price When Reviewed</h3><p>$89.99 (1 device), $119.99 (5 devices) First year discounts available</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today: F-Secure Total\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>F-Secure</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$109.99</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://prf.hn/click/camref:1011liRZ5/pubref:1-1-668100-2-664206-10156/destination:https://www.f-secure.com/us-en/home/products/total\" target=\"_blank\">View Deal</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\n\n\n<p>Some security products that offer both Windows and macOS versions seem to devote equal time and resources to both versions. Others more heavily favour the Windows version, leaving the Mac edition lacking certain features and options. Such is the case with F-Secure Total for the Mac, which seems to be a full-featured security program at first glance but isn’t quite on par with its Windows counterpart.</p>\n\n\n\n<h2>Installation</h2>\n\n\n\n<p>To use F-Secure Total, you can select one of the paid subscriptions right off the bat or go for the free 30-day trial, all of which prompt you to set up an account. The trial requires no credit card and even gives you free technical support if you need it. At the main screen, you’re asked if you want to add your own device, your child’s device, or someone else’s device. Choosing your own device or a child’s device then lets you download the macOS version of the software.</p>\n\n\n\n<p>A wizard guides you through the installation and deposits you at the program’s main screen where you can review the different security features–Viruses &amp; Threats, Password Vault, Privacy VPN, ID Monitoring, and Secure Browsing. The software also tries to help you by offering specific recommendations, such as setting up the password vault and turning on the VPN.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/1-F-Secure-Total-for-Mac-Review.jpg?quality=50&amp;strip=all\" alt=\"The main screen for F-Secure Total displays all of the key features, including virus scanning, password vault, and secure browsing\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/1-F-Secure-Total-for-Mac-Review.jpg?quality=50&amp;strip=all 1088w, https://b2c-contenthub.com/wp-content/uploads/2023/05/1-F-Secure-Total-for-Mac-Review.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/1-F-Secure-Total-for-Mac-Review.jpg?resize=768%2C515&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/05/1-F-Secure-Total-for-Mac-Review.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"686\" /><figcaption>The main screen for F-Secure Total displays all of the key features, including virus scanning, password vault, and secure browsing.</figcaption></figure><p> </p></div>\n\n\n\n<h2>Features</h2>\n\n\n\n<p>Your first task will probably be to hunt for malware. Clicking the Scan button runs a full scan that checks your entire system. Clicking the link for Viruses &amp; Threats takes you to another screen where you can scan just specific folders. Surprisingly, there are no options to run a quick scan or even to schedule a scan. (The Windows version does let you run a quick scan). Here, you’re also able to check for virus definition updates and submit a sample of an infected file to the company for analysis.</p>\n\n\n\n<p>F-Secure provides real-time virus and spyware scanning to automatically block malware. You can exclude specific folders and files from the real-time scan and temporarily disable the scanning if it’s interfering with a software installation or other process.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/2-F-Secure-Total-for-Mac-Review.jpg?quality=50&amp;strip=all\" alt=\"F-Secure Total for the Mac lets you run a full virus scan but not a quick scan or scheduled scan\" width=\"1088\" height=\"733\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/2-F-Secure-Total-for-Mac-Review.jpg?quality=50&amp;strip=all 1088w, https://b2c-contenthub.com/wp-content/uploads/2023/05/2-F-Secure-Total-for-Mac-Review.jpg?resize=300%2C202&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/2-F-Secure-Total-for-Mac-Review.jpg?resize=768%2C517&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/05/2-F-Secure-Total-for-Mac-Review.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" /><figcaption>F-Secure Total for the Mac lets you run a full virus scan but not a quick scan or scheduled scan.</figcaption></figure><p> </p></div>\n\n\n\n<p>To augment the regular virus scanning, F-Secure provides an option called DeepGuard, which monitors applications for any changes indicative of a malware infection. This option already includes many items in the list but you can add the names and locations of other applications to monitor.</p>\n\n\n\n<p>Next, you may want to set up the ID monitoring to check your email address for data breaches among your online accounts. You can add as many as 10 addresses as well as other items, including a username, phone number, social security number, bank account number, credit card number, and passport number.</p>\n\n\n\n<p>The VPN is another defense you’d likely want to enable, especially when using unprotected networks. By default, the VPN selects a location that provides the best possible connection. But you can switch to another location, including several across North America, Europe, Asia, and Australia. You’re also able to add your own personal network as a trusted one to allow access to local resources such as printers and scanners.</p>\n\n\n\n<p>You can manually turn on the VPN or set it to activate whenever you log into your Mac. The VPN also includes tracking protection to prevent advertisers from monitoring your online activity and a kill switch to quickly cut off all internet traffic if the connection goes down. By default, F-Secure uses OpenVPN as the VPN protocol, which should suffice in most situations. You can also switch to OpenVPN (TCP) or IKEv2, both of which are briefly described in the program.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/3-F-Secure-Total-for-Mac-Review.jpg?quality=50&amp;strip=all\" alt=\"The VPN in F-Secure Total is both effective and flexible\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/3-F-Secure-Total-for-Mac-Review.jpg?quality=50&amp;strip=all 1096w, https://b2c-contenthub.com/wp-content/uploads/2023/05/3-F-Secure-Total-for-Mac-Review.jpg?resize=300%2C195&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/3-F-Secure-Total-for-Mac-Review.jpg?resize=768%2C500&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"667\" /><figcaption>The VPN in F-Secure Total is both effective and flexible.</figcaption></figure><p> </p></div>\n\n\n\n<p>Next, an option for secure browsing allows you to install a browser extension that aims to block harmful webpages. The extension supports Safari, Google Chrome, Firefox, and Microsoft Edge (via the Chrome Web Store). With Secure Browsing active, the extension attempts to block phishing sites and other harmful pages. You can also tell it to block sites considered untrustworthy or those that contain prohibited content. Further, you’re able to manually add sites that you don’t want blocked and submit a sample URL that you believe is malicious.</p>\n\n\n\n<p>Finally, F-Secure offers a password vault that creates and stores secure logins for all your accounts. To kick this off, you’re first asked to create your master password. Rather than enter this password each time you need to access the vault, you can instead use Touch ID on your MacBook.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/4-F-Secure-Total-for-Mac-Review.jpg?quality=50&amp;strip=all\" alt=\"Password Vault \" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/4-F-Secure-Total-for-Mac-Review.jpg?quality=50&amp;strip=all 1085w, https://b2c-contenthub.com/wp-content/uploads/2023/05/4-F-Secure-Total-for-Mac-Review.jpg?resize=300%2C202&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/4-F-Secure-Total-for-Mac-Review.jpg?resize=768%2C517&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/05/4-F-Secure-Total-for-Mac-Review.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"690\" /></figure><p> </p></div>\n\n\n\n<p>To add your account logins, you import an existing list from Chrome, Firefox, Edge, LastPass, Dashlane, or another programs or manually create a login with the necessary username, password, and other details. An autofill option automatically enters your vault password at a stored site and will offer to save a password that you create. However, there’s no password suggestion option as is found in most password managers, so you have to devise your own complex passwords.</p>\n\n\n\n<p>The required extension for the password vault officially supports Chrome, Firefox, and Edge. Safari isn’t yet supported, though F-Secure told me that this is in the works. The vault will also analyze your stored passwords to indicate which ones are strong, weak, or reused.</p>\n\n\n\n<h2>Performance</h2>\n\n\n\n<p>Browsing to the EICAR test virus website triggered a message that the site was considered harmful. Forging ahead by allowing access to the site, I tried downloading the eicar.com and eicar text files. Both were automatically removed but without any notification from F-Secure. I was able to download and extract the two eicar zip files. Upon extraction, the test malicious files in the archive were removed. A manual scan ultimately trashed the two zip files. Unfortunately, F-Secure doesn’t let you review blocked or deleted malicious files, and I couldn’t find any setting that would quarantine files instead of remove them.</p>\n\n\n\n<p>A <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.av-test.org/en/antivirus/home-macos/macos-monterey/december-2022/f-secure-safe-18.4-225406/&amp;xcust=1-1-668100-1-0-0&amp;sref=https://www.macworld.com/feed\">December 2022 review by AV-Test</a> gave F-Secure SAFE for macOS a score of 4.5 out of 6 for protection and 5.5 out of 6 for usability.</p>\n\n\n\n<h2>Price &amp; Availability</h2>\n\n\n\n<p>F-Secure Total costs $119.99/£99.99 for five devices, with the first year discounted to $69.99/£44.99. If you want to protect just one Mac, it’s $89.99/£69.99 ($59.99/£34.99 after the discount). </p>\n\n\n\n<p>This gives full access to iOS apps as well as the Mac ones, and of course Android and Windows ones as well if required, and the cross-device configuration is managed through F-Secure web accounts.</p>\n\n\n\n<p>Depending upon how many Macs, or other devices, need protecting, F-Secure Total can be quite expensive. Don’t forget though that F-Secure Safe is available, and cheaper, if you don’t want the VPN or ID Protection. F-Secure has no issue with you protecting devices belonging to other people, although of course it’s all managed through your own account. </p>\n\n\n\n<p>See alternatives in our roundup of the \n<a href=\"https://www.macworld.com/article/668850/best-mac-antivirus-software.html\">best antivirus software for Macs.</a></p>\n\n\n\n<h2>Verdict</h2>\n\n\n\n<p>F-Secure for the Mac seems to have all the right components that would make it an effective product. But given that certain key options are missing or lacking and the program costs $59.99/£34.99 a year even with the discount for one device, the Mac version should be more capable and better designed.</p>\n\nAntivirus</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"fc639f49031e350e18ab8dc50b244238a0ba3e395dafea213c506f8160f2d96f","category":"Apple"}