{"title":"Untargeted metabolomics reveals that declined PE and PC in obesity may be associated with prostate hyperplasia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301011","date":1713535200000,"content":"<p>by Guorui Fan, Xiaohai Guan, Bo Guan, Hongfei Zhu, Yongchao Pei, Chonghao Jiang, Yonggui Xiao, Zhiguo Li, Fenghong Cao</p>\r\nBackground <p>Recent studies have shown that obesity may contribute to the pathogenesis of benign prostatic hyperplasia (BPH). However, the mechanism of this pathogenesis is not fully understood.</p> Methods <p>A prospective case–control study was conducted with 30 obese and 30 nonobese patients with BPH. Prostate tissues were collected and analyzed using ultra performance liquid chromatography ion mobility coupled with quadrupole time-of-flight mass spectrometry (UPLC-IMS-Q-TOF).</p> Results <p>A total of 17 differential metabolites (3 upregulated and 14 downregulated) were identified between the obese and nonobese patients with BPH. Topological pathway analysis indicated that glycerophospholipid (GP) metabolism was the most important metabolic pathway involved in BPH pathogenesis. Seven metabolites were enriched in the GP metabolic pathway. lysoPC (P16:0/0:0), PE (20:0/20:0), PE (24:1(15Z)/18:0), PC (24:1(15Z)/14:0), PC (15:0/24:0), PE (24:0/18:0), and PC (16:0/18:3(9Z,12Z,15Z)) were all significantly downregulated in the obesity group, and the area under the curve (AUC) of LysoPC (P-16:0/0/0:0) was 0.9922. The inclusion of the seven differential metabolites in a joint prediction model had an AUC of 0.9956. Thus, both LysoPC (P-16:0/0/0:0) alone and the joint prediction model demonstrated good predictive ability for obesity-induced BPH mechanisms.</p> Conclusions <p>In conclusion, obese patients with BPH had a unique metabolic profile, and alterations in PE and PC in these patients be associated with the development and progression of BPH.</p>","author":"Guorui Fan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fc6311a13ba98f65deba72cd5b032dbab4fae12fa04202fa37333308339577ae","category":"Interdisciplinary"}