{"title":"Paris-Roubaix 2021 Preview – Route, predictions and contenders","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-2021-preview","date":1632996823000,"content":"\n      <p><em><strong>'The Hell of the North'</strong></em></p>\n<p><span>Very few bike races have such marked, sadistic connotations. However, Paris-Roubaix really is a Sunday in Hell, for the participants, at least.</span></p>\n<p>Following its postponement, Paris-Roubaix will take place on <strong>Sunday 3rd October 2021.</strong></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/not-all-superheroes-wear-lycra-paris-roubaix-race-day-with-mavic-neutral-service\">Related - Not all superheroes wear lycra: Paris-Roubaix race day with Mavic neutral service</a><br /><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/outsiders-with-a-chance-at-paris-roubaix-2021\">Related - Outsiders with a chance at Paris-Roubaix 2021</a></strong></em></p>\n<div></div>\n<p><span>Paris-Roubaix is one of cycling’s five monuments and is one of the oldest races around — the first edition took place in 1896. </span>Roger De Vlaeminck and Tom Boonen hold the record for the most wins with four apiece, whilst Philippe Gilbert is the most recent winner after he outsprinted Nils Politt in 2019.</p>\n<p>In 2020, for the first time since World War II, Paris-Roubaix did not take place due to the global pandemic. We are doubly excited about 'The Hell of the North' this year after an extended wait.</p>\n<p><span>We are also thrilled to see the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-femmes-2021-preview\">inaugural Women’s Paris-Roubaix this year.</a> </span></p>\n<h4><strong>Route</strong></h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/paris-roubaix-2021_1024x1024.png?v=1632219832\" /><em>Paris - Roubaix 2021 profile (via La Flamme Rouge)</em></p>\n<p><span>Despite its name, Paris-Roubaix has started in Compiègne in recent years, and continues to do so in 2021. <span>Compiègne</span> is located north-east of Paris and marginally closer to the finish-line than the French capital.</span></p>\n<p><span>The route is 257.5km in length. The first 100km don't feature any cobblestones, which means the early breakaway will form and establish a lead in this phase of the race.</span></p>\n<h4><b>Cobbled Sectors</b></h4>\n<p><span>The 2021 route features 30 cobblestone sectors in total. Paris-Roubaix is a race of attrition — it's all about staying out of trouble and to the front, but the cobblestones can throw up surprises at any moment.</span></p>\n<h4><b>Troisville à Ichy - Sector 30</b></h4>\n<p><span>Troisville à Ichy is the first sector — it begins just under 100km into proceedings and is just over 2,000 metres in length. The three star sector doesn't pose the most punishing cobbles of the day, but they'll be a major battle for position beforehand. The race will move up a gear and the team leaders must stay wholly focused from this point onwards.</span></p>\n<h4><b>Trouée d'Arenberg - Sector 19</b></h4>\n<p><span>The revered <span>2,300 metre long </span>Trouée d'Arenberg, also known as the</span><span> Forest of Arenberg</span><b>,</b><span> arrives with just under 95km left. The road is straight, narrow and surrounded by trees. There will be a battle for position at the front due to the increased risk of crashes, punctures or other incidents. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_4782_1024x1024.jpg?v=1615469975\" /><em>Trouee D'Arenberg (Image credit: Alex Broadway/SWpix)</em></span></p>\n<p><span>Speak</span><span>ing of the Trouée d'Arenberg, three-time Roubaix winner Johan Museeuw explains, “<span>You must enter Arenberg in the first ten. It’s the worst sector, but not the most important one. The main thing is to get out of Arenberg well, without puncturing or crashing, then you see how many are left</span></span><span>.”</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/muddy-hell-paris-roubaix-2002-the-last-wet-hell-of-the-north\"><b><i>Related - Paris-Roubaix 2002, the last wet Hell of the North</i></b></a></p>\n<h4><b>Mons-en-Pévèle - Sector 11</b></h4>\n<p><span>A notoriously arduous, five star sector. </span><span>Mons-en-Pévèle occurs close enough to the finish line to encourage attacks, but with over 40km to be navigated </span><span>after the sector is crossed, solo moves have little chance of holding on until the velodrome. Nonetheless, it’s a great chance for teams still with strength in depth to fire a rider off the front, gaining a tactical stranglehold on the event.</span></p>\n<h4><b>Carrefour de l'Abre - Sector 4</b></h4>\n<p><span>Carrefour de l'Abre is the final five star cobbled sector. Occurring after 242.8km and with just 15km remaining, it is one of the final clear chances to attack. As it occurs so close to the finish line, any selections created here have a good chance of surviving until the velodrome. Windy conditions could either hinder or assist any escapees, depending on its direction. In 2016, Sep Vanmarcke attacked on Carrefour de l'Abre, but was reeled in after turning into a headwind.</span></p>\n<p><span>The finish remains in Roubaix, just metres from the France-Belgium border, and is one of the most romantic yet epic finishes in cycling. The riders enter the Roubaix velodrome, where unless led by a solo breakaway, the final sprint for victory will take place. Four riders have won solo since 2010, but none since Niki Terpstra's victory in 2014.</span></p>\n<h4></h4>\n<h4><b>Contenders</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_5329_1024x1024.jpg?v=1615470091\" /></b></p>\n<p><i><span>John Degenkolb, the 2015 Paris-Roubaix winner (Image credit: </span></i><i><span>Alex Broadway/ASO/SWpix)</span></i></p>\n<p><span>We’ll start with a team synonymous with the cobblestones — Deceuninck-Quick Step. The Belgian outfit won the most recent edition in 2019 with Philippe Gilbert, who has since moved on to Lotto-Soudal — more on him later. Deceuninck are undoubtedly the team with the most depth when it comes to cobbled classics. Any of <strong>Florian Sénéchal, Yves Lampaert, Zdeněk Štybar </strong>and <strong>Kasper Asgreen</strong> could feasibly win. Having so much strength at the top-end of a team is crucial in a race where a puncture or crash could end an individual's chance in an instant. Looking further down the teamsheet, 'The Tractor' <strong>Tim Declerq</strong> can ride on the front of the peloton all day to ensure Deceuninck start on the front foot.</span></p>\n<p><span>Away from DQS, there are two riders that stand above the rest on the favourites list, <strong>Mathieu van der Poel </strong>and<strong> Wout Van Aert</strong>. The two cyclo-cross stars have already displayed elite form on the road in 2021, with Van der Poel winning Strade Bianche in stunning fashion and Van Aert three stages at the Tour de France. The two riders seemingly have no weaknesses — they are strong enough to attack away from the others and if anyone goes to the line with them, they are almost impossible to beat in a sprint. Van Aert is one of the fastest riders in the world right now; he won on <span>Champs-Élysées at the Tour de France this season</span>, whilst Van der Poel beat Van Aert himself in a sprint at the Tour of Flanders last year. However, Van Aert was disappointed to finish eleventh in the World Championships road race, whilst Van der Poel has suffered back pain recently after crashing at Tokyo 2020.<br /></span></p>\n<p><span>Lotto-Soudal have an intriguing team with great experience.</span><span> Now 39 years old, </span><strong>Philippe Gilbert</strong> <span>has one monument left to win in his illustrious career — Milan-San Remo. He starts Roubaix as the defending champion, although he hasn't won a pro bike race since September 2019</span><span>. Lotto-Soudal have another former winner in their ranks in <strong>John Degenkolb</strong>. The 2015 victor is dangerous in a sprint should he be there in the finale. Lotto’s rider to watch is <strong>Florian Vermeersch</strong>, who is just 22-years-old, but he has a bright future in the classics.</span></p>\n<p><span>On paper, Trek-Segafredo have one of the strongest lineups<span></span>, though they can be unpredictable on the cobbles. They failed to finish in the top 50 at Omloop </span><span>Het Nieuwsblad </span><span>earlier this year, yet won Kuurne-Brussels-Kuurne with <strong>Mads Pedersen</strong> the following day. <strong>Jasper Stuyven</strong> and Pedersen make up the heart of their team and like Degenkolb, both are quick in a sprint. Rivals must be aware of <strong>Quinn Simmons</strong> though, who is developing rapidly and has spoken before about his endearment to the classics.</span></p>\n<p><span>BORA-Hansgrohe have rebuffed their classics squad with the 2019 Paris-Roubaix runner-up <strong>Nils Politt</strong>. The German has displayed fair form in 2021, too. He will work in conjunction with <strong>Peter Sagan</strong>, one of the best classics riders of his generation. Sagan is moving on to </span>Team TotalEnergies from 2022, which means this could be his final outing in a Bora-Hansgrohe jersey.</p>\n<p><em><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_5352_1024x1024.jpg?v=1615484418\" />Peter Sagan won Paris-Roubaix in 2018 (</span></em><em><span>Image credit: Alex Broadway/SWpix)</span></em></p>\n<p><span>AG2R-Citroen turned their focus from the Grand Tours to the classics after losing Romain Bardet to sign <strong>Greg Van Avermaet.</strong> Van Avermaet won 'The Hell of the North' in 2017 in a five-man sprint, though he hasn't won since September 2019. Nonetheless, he remains a perennial contender. <strong>Oliver Naesen </strong><span>is one of the best cobble riders in the peloton, although he</span> has never finished in the top 10 at Paris-Roubaix.</span></p>\n<p><span>The Ineos Grenadiers last finished on the podium at Roubaix in 2016 with Ian Stannard. Their best shot this season is with <strong>Dylan van Baarle</strong>, who was runner-up to Julian Alaphilippe at the World Championships in Flanders. He has never finished better than 16th, which he achieved in 2016 when riding for </span>Cannondale. The Grenadiers also have <strong>Gianni Moscon, Luke Rowe </strong>and <strong>Michał Kwiatkowski</strong>.</p>\n<p><span>When you think of Movistar, the last race that comes to mind is Paris-Roubaix. The team have always been GC-centric with a focus on the Grand Tours. However, the addition of <strong>Ivan Garcia Cortina</strong> does provide them with some impetus on the cobbles. The Spaniard i<span>s fast in a sprint finish, </span></span><span>although he has no notable results at Roubaix to this point.</span></p>\n<p><span>Other riders to keep an eye on include <strong>Victor Campenaerts, Anthony Turgis, Taco van der Hoorn </strong>and<strong> Christophe Laporte.</strong></span></p>\n<p><b>Favourites: </b><span>Wout Van Aert, Mathieu van der Poel, <span>Florian Sénéchal</span>, Kasper Asgreen, Peter Sagan</span></p>\n<p><b>Outsiders:</b><span> John Degenkolb<span>, </span></span>Victor Campenaerts, Taco van der Hoorn, Christophe Laporte, Anthony Turgis</p>\n<h4><strong>Prediction</strong></h4>\n<p>Considering their strength in depth, it's hard to see past Deceuninck-Quick Step. After two runner-up finishes in the past, we are backing Zdeněk Štybar to win Paris-Roubaix 2021. His record at the race speaks for itself — he has finished in the top ten on six out of seven starts. Additionally, the 35-year-old showed strong form when he finished seventh at the World Championships last week.</p>\n<p><i><span>Cover image credit: </span></i><i><span>Alex Broadway/SWpix</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"fc6391281521ce0b6e2b489078e3d7f4ce6a3093473a14341d64076908c1948c","category":"Cycling"}