{"title":"A Gentle Stoke: Touring the Lower Dolores Canyon – Beija Flor & Todd Gillman","link":"https://theradavist.com/2021/06/a-gentle-stoke-touring-the-lower-dolores-canyon/?utm_source=rss&utm_medium=rss&utm_campaign=a-gentle-stoke-touring-the-lower-dolores-canyon","date":1623153655000,"content":"<p>On the last Friday of April, four strangers convened at the Bradfield Campground near Cahone, Colorado at dusk. Our two rigged up trucks and one camper van were parked neatly near the start of what would turn out to be a grand adventure: a weekend of sanctity, the fruition of an obsession, training in preparation for a big tour, and then checking off of a box to confirm that yes, all of the time, energy, and research spent assembling this could lead to something quite special.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DRC_BF_1.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>What led me to this moment was a series of miscommunications, happy accidents, and mostly an obsession I had developed over the past year. The pandemic altered all of our lives in ways through which we are all still working. I found myself parsing through metaphorical rubble as I packed up from Portland and moved home to Seattle in March 2020. My dad was stuck in a touch-and-go two-month stint in the ICU with an anomalous case of COVID-19. He was still in a coma when I moved home. It was life or death with every phone call we’d received twice daily for quite a long time.</p>\n<p>When stagnancy and cynicism took over and the complications of two previously reconstructed ACLs inhibited me from high-impact activity, I turned to cycling. Riding every morning at 5 am when I couldn’t sleep. Riding the West Seattle peninsula for sunrise and sunset. I’d often ride with friends, but only the wind in my face and the mindless endorphins and the shortness of breath and my tires singing when I went fast enough could provide me momentum and a euphoric reprieve from what consumed my thoughts every single day.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DRC_TG_18.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>My dad was released in early May and has since fully recovered, yet my addiction to cycling never faded. In the year that followed I incessantly scanned the internet for used bikes and bike parts. A buddy of mine let me borrow his Zeitgeist Pack and subsequently introduced me to Swift Industries. I grew to be proactive in preparing for bikepacking. I bought a Kona Sutra ULTD off The Pro’s Closet. I followed Swift on Instagram and waited for the right moment to nab the perfect bag. A “seconds” sale on their Instagram connected me with Todd Gillman, Swift media/marketing extraordinaire, dog-dad, pizza-lover, and the Dolores River Canyon route mastermind.</p>\n<p>In early April 2021, I rode to Swift HQ in Pioneer Square hoping to pick someone’s brain with bag questions despite their retail space being closed. I had already exhausted every one I knew with questions about gear and I was overwhelmed with all the frame bag options I did and didn’t have on my Kona. I was just a few days out from departing for a 3-month road trip down the West Coast and eventually to New Mexico and I still didn’t have most of the bikepacking gear I needed. I called Todd, my one connect at Swift who was – unbeknownst to me – not working from a desk in the building in front of me, but was instead miles away in Southwest Colorado. First, he patiently and graciously answered my questions, then secondly quelled my concerns about my trip. He mentioned a grand bikepacking route planned for the last weekend of April in Four Corners (more or less where I was headed), of which I was invited to join. I snuffed out my ever-present imposter syndrome and was all-in.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DRC_TG_28.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Fast forward a few weeks and I was eating chicken pot pie at a campsite with three strangers as we prepared to take off the next morning. I had peeped Sarah Swallow’s socials before connecting and saw that she not only rides, but she absolutely crushes and later found out she does this while sporting the most down-to-earth of attitudes. Tony Savastano, an attorney based out of Durango is a big-hearted husband and father radiating benevolent energy, who also noshes single-track when he has the time. Sarah and Todd had connected through mutual friends and industry connections and events. Todd had sold Tony bike parts through Craigslist and camaraderie had formed. So there I was, setting off to do something I’d never done before, in a place I’d never been before, with people I had never met before (sorry Mom &amp; Dad if you’re reading this, I chucked my stranger-danger radar off the Dolores Canyon cliffs for this one [at least I’m not like Tony befriending strangers on Craigslist]).</p>\n<p>When dawn broke Saturday morning we sprawled out our gear on the picnic table and took stock. Ahead of us, we’d cover upwards of 78 miles of multi-terrain ground with 7,400 feet of climbs and descents circumnavigating a section of the Dolores River Canyon. I’d read dozens of articles and had heard plenty of opinions about what gear should go where. I felt like I was buzzing, working through everything I had previously learned: “remember to keep your weight distributed evenly,” “prioritize which of your gear needs to be most or least accessible,” “pack snacks up front and definitely bring extra.” It felt like every moment in the past year had led me to this.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DRC_TG_29.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We set out at 10:30 am and began the ascent following County Road S on some buttery gravel switchbacks. We climbed under cloud cover (I still made sure everyone applied SPF) and did about 1,800 feet of climbing in the first 11 miles. The roads were smooth and our spirits were high, and only one car passed us on that ascent while the rest of the day we were left unbothered. Snack and pee breaks were taken as needed and our pace felt solid, stopping once for a three-minute hacky sack bond sesh that I had the foresight to record (and rewatch whenever I feel nostalgic). Maybe it was the endorphin high in tandem with me being acclimated at sea-level but the views were already immaculate and everything seemed utterly meant-to-be.</p>\n<p>We took turns riding in tandem, chatting about what brought us here. I took that time to ask all my questions; I had the perfect, experienced, and captive audience to direct all my inquiries. I learned about the Tour Divide that Sarah’s been training for coming up in the Summer. In particular, one conversation with Sarah still resonates with me. Before we set out for this bike tour the group was composed of two “cool hilarious mountain dads” who bailed last minute, Todd, and me (very obviously not a mountain dad). When Todd told me another woman was joining the group I felt a bit relieved to see the ratio balance. The majority of my cycling career had been guided by mostly dudes, which is totally fine, but as it turns out they aren’t capable of answering all of my questions. I’d often answer them myself by diving in headfirst and learning the hard way. Sarah’s been at this for years and I later found out from a buddy that I rode with somewhat of a celebrity, though on our ride she was just a human with a gnarly pace, a sunny attitude, and some really profound insight I hadn’t yet heard from any other cyclist.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DRC_TG_21.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Eventually, after 35 miles on CRS we veered left onto an unmarked dirt road splicing a pastoral field, marking our transition out of the pine forest into a harsh high desert. Our new path flanked the canyon as we rode North toward our descent. Sarah, Todd, and Tony all have had their fair share of time on MTBs while I hadn’t so much as sat on a bike with suspension. As the road grew steadily rougher and everyone but Sarah had rigid frames, we let out some air in our tires and it was time to buck up.</p>\n<p>I have to mention that I ate shit, like utter shit, like pick-the-dirt-and-rocks-out-of-your-skin type of shit. I slipped out in sand what felt like five or six times, definitely more. On my worst fall, I landed on my drivetrain and bent my rear derailleur hanger. The quick fix was limiting myself from using my three easiest climbing gears for the rest of the day, making the rest of my climbing a bit more brutal. By the end of the trip, I looked like I had taken a cheese grater lined with sandpaper against my body. I watched as the distance between me and the crew grew steadily larger. The roadie in me screamed, but the terrain beneath my tires was unfamiliar and despite being up in my head about it I had to focus and slow down. While I was working through all of this, Todd would pause his descent to wait for me. I bemoan being burdensome and though I gently voiced my protests against his constant checking in on me, he assured me that this was all part of the experience. As the orchestrator of this whole weekend, he also felt obligated to ensure that I wasn’t left for dead at any point. In retrospect, all of the little pep-talks and back-pats were exactly what I needed and there simply was not an option to turn around.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DRC_TG_3.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We had to check the map fairly often and backtrack a few times to ensure we were headed the right way. As we pedaled we noticed three separate fresh bike tracks more or less following the same route, a friendly reminder that maybe we were headed in the right direction. After more thought that seemed utterly wild considering this route was kind of tossed together by Todd and as far as he knew it had never been done before. Golden hour was soon upon us as we neared the edge of the canyon to begin our final descent. We turned about a curve and stumbled upon an abandoned hut overlooking both the river and our campsite for the night. We decided to huck it hike-a-bike style down a gully (do not wear Chucks for a tour like this) until we again found our three trusty treads in the sand leading us to the river crossing. Standing on the banks of the campsite we were greeted by the three riders we’d been following, one of which Sarah knew peripherally from Durango. He had serendipitously planned the same route as Todd and decided to ride it the same exact weekend. After setting up camp and pumping fresh filtered water from the river we settled into our respective dinners. Blissfully exhausted, we turned ourselves in for the night knowing the next day was going to be a burly one, but not before Tony and I briefly attempted a mezcal-fueled 10-minute yoga flow (stay limber!).</p>\n<p>We took our morning slowly, sitting at the river to read and relax. While I drank my rancid instant coffee, I watched Tony whip out a glass coffee grinder protected in its store-bought box, proceed to brew, and drink a cup of gourmet coffee. The entire first day we witnessed his handlebar bag magically expand at every stop we made. He donned a DSLR with quite the meaty lens, a never-ending mezcal flask, and some summer sausage that also seemed to last and last. Pulling shit out of thin air, Tony was like the Mary Poppins of our trip. Through this, I learned that sometimes we must suffer for the more savory things in life. Around 11 am we packed up camp, finished up breakfast and electrolyte drinks, and set out for the day.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DRC_TG_14.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Early in the day Tony spotted upwards of 50 bighorns scaling the steep canyon walls on the opposite side of the river. We watched as they gracefully hopped from cliff to cliff. I reflected on my own wiping out from the day prior and anticipated what the next few hours might hold for me. The trail flanked the river for a solid 25 miles with a few punchy climbs and descents sprinkled throughout. I was elated to find the rest of the route was much less chunky sandy downhill shit than the day before. With not a wisp of clouds in the sky, I was not relieved to find myself feeling parched and dehydrated after drinking two of my three water bottles in the first couple of hours. We stopped at a swimming hole along the river for a much-needed lunch break. I highly recommend bringing tons of sausage and pepperoni, because with a little river dip and some meat-snacks (a la Tony’s magic bag) I felt like I had been both reborn and baptized. Whatever hesitancy and doubt had been leftover from my spillages the day prior dissipated and for the next few hours I was flowing.</p>\n<p>We rode past a few campsites along the river and heard some ATVers ripping around in the distance, marking the end of our solitude. Then, we climbed. We took a right onto an unmarked gravel road that gained about 1,250 feet in just under 7 miles. Climbing without stopping is all an internal battle; feeling the burn in your muscles and the strain in your breath, while fighting only with yourself. In silence, we lost sight of one another as we climbed at our own pace. Only after having completed the buckling ascent did we reconvene for a well-deserved snack break. Now, we were no longer surrounded by rocky canyonland, but instead by rolling green fields.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DRC_TG_23.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The next 15 miles would turn out to be the most brutal pavement riding I’d ever experienced. Earlier this year I completed my first-century ride after deciding to do it only a mere 30 minutes prior to embarking. The lack of planning left me grinding to get my last 10 miles in, aimlessly looping around my neighborhood, and completely gassed – I thought I was tired then. My head was reeling with sensory overload after the past two days, the innocuous farm roads all blurring together provided our tired minds space to zone out. By the end of it, as I cruised the final descent to our camp at Bradfield, I fought against every muscle in my body not to give up. I thought I’d simultaneously pass out and vomit from fatigue but there was one thing keeping me vertical: the promise of Mexican food.</p>\n<p>Running on nothing, a new mantra popped in my head and kept me chugging along as I repeated the word “chimichanga” over and over until I had one right in front of me. You’d have seen us four at Gustavo’s Mexican Restaurant covered in dirt, contented as could be, pounding eight rounds of chips and salsa, and you’d have thought we’d known each other for years.</p>\n<p>Amazingly, there were no kinks during our trip besides my bent derailleur hanger that Tony and Sarah wailed on the second morning and fixed with no lingering repercussions. I’ve been speculating that maybe due to the fact that we were all strangers we felt obliged to present to one another only the best versions of ourselves. Moreover, I’ve reflected on how truly myself I felt surrounded by these three strangers. Nonetheless, I think I can speak for the group in saying that if ever anyone felt challenged or overwhelmed by something they also felt equally supported by the crew.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DRC_TG_43.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>It’s been three weeks since that weekend and I’m typing this now recovering from a recently dislocated elbow, two partial ligament tears, and one partial muscle tear, after flipping over my bars and learning just how solid pavement is. This injury in particular has been incredibly sobering as it’s put into perspective exactly how high riding my bike sits on my list of priorities. How fantastically ironic it is that riding my bike led me to injure myself in a way that has forced me to take a break from riding my bike. Writing this is only reminding me of exactly why I must take the time to heal in full as there are plenty more grand adventures in my near future.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/06/DRC_TG_42.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I look forward to the time when this serendipitous crew of strangers-turned-friends can reunite to tackle this route again. The four of us were there that weekend for a multitude of reasons: Tony sought solace from a sometimes troubling world, I craved a safe and guided entryway into the world of bikepacking, Sarah tested out a different ride configuration in preparation for the Tour Divide, and Todd wanted to see if this route actually worked. In orchestrating this route, Todd accidentally and harmoniously conceived an ineffable kind of joy found only in four strangers on bikes. Tony put it in words much better than I could, “There is something remarkable in the strange; the unfamiliar. The thing of it is, you all played a part in a weekend that served as a reminder of what beauty life sometimes holds. Meeting you all was a gentle stoke in a settling fire.” There is goodness in all people, it is endless and encompassing, reaching beyond all borders – physical or not. It can hold you and move through you; you will find yourself leaving pieces of you with the strangers you meet like the chunks of canyon rock stuck in my skin after persisting on my first bike tour.</p>\n<p></p>\n<p><strong>Route Notes:</strong></p>\n<p><em>The Dolores Canyon route starts and ends at Bradfield Bridge on the Dolores River, just downstream of the McPhee Reservoir dam. Because this is a river route, we’ll adopt standard river-running terminology referring to “river-right” and “river-left” as determined by the downstream orientation. That is, river-right is always on the right when you are facing downstream, and is then always on the left when facing upstream. There is a National Forest campground (fee) a quarter-mile downstream of the bridge on river-left which makes staging vehicles easy. Alternatively, there are limited parking areas adjacent to the bridge, and I’m sure you could just find a random pullout off the road nearby. The route exists within the Tres Rios BLM Field Office management area, and effectively circumnavigates a portion of the Dolores River Canyon, with about one-third of the route being roughly at river level within the canyon itself. </em></p>\n<p><em>There is one <b>river crossing</b> around mile 40-45 where the rough Jeep road on river-right you’ve been riding ends at an obvious ford. For this reason, it is critical that you carefully plan your trip only during low-flow water years and/or seasons. A link is provided below where you can check the outflow from McPhee Reservoir. You’ll want not much more than about 100 CFS out of the dam. At higher flows, in all likelihood, you could find a braided section of the river where the water is shallower across several channels to provide a mellow crossing, but we cannot assure that. In Spring ’21 when we did the route, SW CO was experiencing yet another drought, so the release out of the dam was below 20 CFS and we barely got our ankles wet. Depending on your tolerance for heat and sun, this route is best enjoyed in spring and fall. It varies from buttery-smooth packed gravel to easy two-track to rough desert 4×4 Jeep road to broken bedrock to sections of soft sand and packed dirt, before climbing out of the canyon on perfect gravel once again. I rode it on 48mm tires but wouldn’t recommend it. </em></p>\n<p><em>A group of mountain-bikers on 2+” tires experienced multiple blowouts. I’d reckon well-lugged and firmly inflated 2.25″ – 3.0″ rubber would be the sweet spot, but be prepared with spare tubes, patch kit, sealant, etc. We did the route as an overnighter, but when I do it again it will be 2 nights to provide for a full day of lizarding in that magical desert canyon. There are endless swimming/fishing holes and perfect camp spots. </em></p>\n<p><b>Resources:</b></p>\n<p>–<a href=\"https://www.fs.usda.gov/recarea/sanjuan/recarea/?recid=44031\" target=\"_blank\">USFS / Bradfield C.G.:</a><br />\n–<a href=\"https://www.blm.gov/visit/bradfield-recreation-site\" target=\"_blank\">BLM / Bradfield Rec Area</a><br />\n–<a href=\"https://dwr.state.co.us/surfacewater/data/detail_graph.aspx?ID=DOLBMCCO&amp;MTYPE=DISCHRG\" target=\"_blank\">CO DNR River Flow Database</a>: (You will need to locate the correct monitoring station in the database. The station name is DOLORES RIVER BELOW MCPHEE RESERVOIR. Do not confuse with the upstream station DOLORES RIVER AT DOLORES which is the discharge into the reservoir.)<br />\n–<a href=\"https://waterdata.usgs.gov/nwis/uv?09168730\" target=\"_blank\">USGS Slickrock Station</a> (If the river flows concern you, it can be helpful to check the next gage downstream at Slickrock. It can show lower discharge than the outflow from the dam due to irrigation diversions from the river.)</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"fc719855be4a2b9810cc146318bd5aa619f22a3a686700975b0435b712c6c755","category":"Cycling"}