{"title":"Dietary Probiotic Prototypes and Their Effects on Growth Performance, Immune Function, and Gut Microbiota of Rainbow Trout (Oncorhynchus mykiss)","link":"https://www.preprints.org/manuscript/202407.0720/v1","date":1720507644000,"content":"This study investigated the development of novel probiotic formulations specifically designed for rainbow trout aquaculture. The project evaluated the effects of two formulations containing potential probiotic strains isolated from rainbow trout itself. These effects were assessed on various parameters including growth performance, immune response, liver enzyme activity, gene expression related to immunity, and the composition of the bacterial gut microbiota in rainbow trout (Oncorhynchus mykiss). In a completely randomized experimental design, a total of 450 rainbow trout were randomly divided into 70-liter fiberglass tank. The study included six treatments of three replicates (n=18 tanks). Six dietary treatments were included (A) and (B) containing three strains of Pediococcus sp P15, Lactococcus lactis ml3, Weissella cibaria ml6 at two dosages (300 and 500 mg/kg), treatments (C) and (D) containing five strains of P. sp P15, L. lactis ml3, W. cibaria ml6, Enterococcus faecium E10 and Lactobacillus curvatus 13A at two dosages (300 and 500 mg/kg), a commercial probiotic (E) at 300 mg/kg, and a control group (F) without probiotics. Treatments of (A), (B) and (E) resulted in the highest final weights in compared to control group. Fish fed treatments (A) and (B) had the lowest FCR than other groups. Treatments (A) and (D) showed a significant increase in immunoglobulin M (IgM) concentration compared to other groups. The expression of tumor necrosis factor (TNF) was significantly lower in group (A) than the control. In contrast, the expression of interleukin 6 (IL6) and immunoglobulin T (IgT) was increased 4.4-fold and 41-fold, respectively, in group (A) compared to control group. Among the probiotic fed treatments, group (A) showed a significant higher number of lactic acid bacteria compared to other groups during the experiment. This study highlights the significant role of treatment (A) containing three strains of P. sp P15, L. lactis ml3, and W. cibaria ml6 at a dosage of 300 mg/kg as a potential probiotic product for the rainbow trout industry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fc73b8594eb0b2d3346bb1b47280ee4c0a6da558efa72c6ed9eb7a6b2648fa7f","category":"Interdisciplinary"}