{"title":"Rapid DNA barcoding‐based fern and lycophyte inventories of protected areas—A pilot study to introduce a simple but effective protocolDNA条形码技术实现保护区生物多样性的快速编目和鉴定一种不过度依赖分类学家的快速高效的研究手段","link":"https://onlinelibrary.wiley.com/doi/10.1002/inc3.60?af=R","date":1722330898000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/578b628e-a529-4e2a-943b-42548bf21911/inc360-gra-0001-m.png\" alt=\"Rapid DNA barcoding-based fern and lycophyte inventories of protected areas—A pilot study to introduce a simple but effective protocol DNA条形码技术实现保护区生物多样性的快速编目和鉴定一种不过度依赖分类学家的快速高效的研究手段\" /><p>DNA barcoding-supported inventories of protected areas provide fast assessment with reduced reliance on taxon experts but enhanced effectiveness in recording quality. Feedback loops to taxon experts enable the identification of taxonomic gaps, especially the identification of species not known to science yet.\n</p><br />\n<h2>Abstract</h2>\n<p>Recording inventories of species conserved in protected areas is a key step to evaluate the effectiveness of Kunming Montreal Global Biodiversity Framework (KM-GBF) targets, such as the expansion of protected areas. The application of DNA barcoding facilitates the rapid production of enables to obtain rapid inventories with reduced reliance on taxon experts. These inventories aim not only to confirm existing records but also to minimize gaps in our knowledge of the distribution and taxonomy of species targeted for conservation through the implementation of protected areas. This pilot study introduces a simplified DNA barcoding pipeline as a reliable tool for recording fern and lycophyte species occurring in protected areas. The pipeline emphasizes limited and/or short training requirements, reducing the input required from taxon experts and maximizing shared benefits between conservationists and taxonomists. Despite using a single DNA barcoding region, 78% of the accessions were unambiguously identified to the species level. This applied approach not only confirmed previous records but also identified several previously overlooked species, either as newly recorded species conserved in the protected area or as species new to science. The pilot project effectively documented known species diversity and identified gaps in our taxonomic knowledge by discovering previously unknown and locally rare taxa. This rapid assessment enhances productive exchanges between conservation practitioners and taxon experts, with substantial benefits for both parties.</p>\n<h2>摘要</h2>\n<p>了解和认识保护区内的生物多样性是开展科学研究和保护的前提，也是实现昆明-蒙特利尔公约目标的基础，但是分类学家人数和规模的不足是当前开展保护区生物多样性编目和分类研究的制约因素之一，而相对标准化的DNA条形码技术是一种不过度依赖分类学家的快速高效的研究手段。在保护区内开展深入的野外调查，并结合DNA条形码研究，不仅可以记录保护区内的常见物种，而且有助于发现珍稀物种或地区特有种。</p>\n<p>本研究通过在西双版纳国家级自然保护区勐仑子片区的绿石林开展石松类和蕨类野外调查，并结合室内DNA条形码研究，对该保护区内的蕨类植物多样性进行编目和鉴定。我们的研究发现，本研究手段不仅能发现和记录大部分的常见物种，还记录到勐仑特有种1个、勐仑新纪录种1个和可能的新种1个。本研究的优势是，通过相对易培训和操作的DNA条形码技术，在不过度依赖类群专家的情况下，可以快速完成保护区的物种编目和鉴定，进而能够提升对保护区生物多样性的认知和物种保护。</p>\n<p>本研究的结果表明，仅利用单个通用的DNA条形码片段（叶绿体rbcL片段）即可以实现对78%的物种的准确鉴定，通过结合标本检视和文献查阅，还记录到勐仑特有种1个、勐仑新纪录种1个和可能的新种1个。因此，本研究呼吁未来的保护区物种调查和生物多样性编目可以引入DNA条形码技术，以实现对保护区的生物多样性的认识和研究。【翻译：刘红梅】</p>","author":"Hongmei Liu, \nYarong Chai, \nHarald Schneider","siteTitle":"Wiley: Integrative Conservation: Table of Contents","siteHash":"b2434e359c647f096191c4befea99097fa9394fd28e02b126976eb35d9219c03","entryHash":"fc76f7eb0fc4faeb7c3426d976d330455174844783023f701ebd249f91cb110b","category":"Environment"}