{"title":"iOS 15: How to use FaceTime links to call Android or Windows users","link":"https://www.macworld.com/article/350395/how-to-ios-15-facetime-links-call-android-windows-users.html","date":1625652900000,"content":"\n<div>\n<section><div></div></section><p>When Steve Jobs stood on stage at the WWDC in 2010 and introduced iOS 4 (renamed from iPhone OS!), one of the marquee features was FaceTime. Jobs had grand ambitions for this to be <em>the</em> video calling standard. “We’re going to the standards bodies starting tomorrow. And we’re going to make FaceTime an open industry standard,” he said.</p>\n\n\n\n<p>As we know, it didn’t exactly work out that way. FaceTime remained an Apple-only technology for over a decade, but iOS 15 (and iPadOS 15, and macOS Monterey) changes all that. For the first time ever, you’ll be able to have FaceTime conversations with those on Windows PCs or Android phones.</p>\n\n\n\n<p>Apple’s not making the FaceTime app available to them, though. No, instead you’ll be able to create a link to a FaceTime call, which you can then attach to future calendar events, share in Slack or via text, or whatever you want to do with it. Anyone running a Windows PC or Android phone (or Linux box or whatever) will open the call in their web browser, and the link creator has to allow them to join the call.</p>\n\n\n\n<p>So, an Apple device is still necessary to create a FaceTime call and must serve as the “host” of sorts to allow others in, but you can at least chat between devices. Here’s how the new FaceTime links feature works.</p>\n\n\n\n<h2>Creating a FaceTime link</h2>\n\n\n\n<p>Before you can chat with someone using Windows or Android, you need to make a link for them to join. </p>\n\n\n\n<ol><li>Open the FaceTime app on your iPhone or iPad</li><li>Tap <em>Create Link</em></li><li>The share sheet will open. You can tap <em>Copy</em> to copy the link and paste it wherever you like, or choose an app or person to share it with.</li><li>When you’re done, you’ll see the FaceTime Link call in the main history list under “Upcoming” calls.</li></ol><p>The call hasn’t started yet, and it won’t until you tap that upcoming “FaceTime Link” call and then tap “Join” in the upper right.</p>\n\n\n\n<p>Tap the info button (i) on the call if you need to share the link again or if you want to delete it. The link should remain active until it’s manually removed, so you can add it to a calendar event a month away or schedule a FaceTime call for next year’s Mother’s Day.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-facetime-link-create.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Create a FaceTime link and your friends can join from an Android phone or Windows PC.</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Removing a FaceTime link</h2>\n\n\n\n<p>Those FaceTime Link calls stick around until you delete them, which isn’t such a bad thing, really. It allows you to create a call for a future date, even if it’s only going to be used by Apple devices.</p>\n\n\n\n<p>To delete a future FaceTime Link call, just:</p>\n\n\n\n<ol><li>Swipe left on the event.</li><li>Tap <em>Delete</em>.</li><li>A confirmation message pops up, warning you that the link will no longer work for anyone you’ve sent it to. Tap <em>Delete Link</em> to confirm.</li></ol><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-facetime-link-delete.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>You can swipe left on a FaceTime Link to delete it, or tap the Info button (i) and choose Delete Link.</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Chatting with Android or Windows users</h2>\n\n\n\n<p>Anyone joining from an Android phone or Windows PC will be directed to their default browser, where they will join a FaceTime progressive web app in their browser window. It works pretty well, but it is of course with limited options and features.</p>\n\n\n\n<p>When those users join the call, they’ll first have to type a name to use during the call. Importantly, they do <em>not</em> need an Apple ID.</p>\n\n\n\n<p>After the Windows/Android user enters their name, the Apple user who created the link will get a notification that the person is waiting to be let in. While they wait for them to tap the button to admit you, they won’t see the contents of the call, only a “waiting to be let in” message with their own live video.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/ios15-facetime-link-android.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>FaceTime on Android is definitely not as robust as the native app on iPhone, but it does work and offers many of the standard call options.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>Once you let the person in, you’ll chat like a regular video call, though the Windows/Android users won’t have nearly as many options. You can switch cameras and use an external microphone or earbuds, or change the view if more than one person is on the call. You’ll also be able to share the link with anyone else you’d like to invite.</p>\n\n\n\n<p>When you’re done withe call, you can press <em>End</em> or the person on the other end can tap <em>Leave</em>.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"fc81c4521d4f9983bc5930cde4b200916e8c4642a1610774ec58c590dcc722b3","category":"Apple"}