{"title":"Phenological growth stages of cardamom (Elettaria cardamomum Maton): Detailed identification and description using the extended BBCH scale","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12895?af=R","date":1712896825000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d12726e1-c9fd-43ed-97b6-3d0bd00a7425/aab12895-toc-0001-m.png\" alt=\"Phenological growth stages of cardamom (Elettaria cardamomum Maton): Detailed identification and description using the extended BBCH scale\" />\n<p>Sequential progression of principal growth stages of cardamom. Bar indicates time elapsed in each stage and line indicates weather parameters during the study period (2021-23).\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Cardamom (<i>Elettaria cardamomum</i> Maton) is an important spice crop with high market value. In this study, we describe the phenological growth stages of cardamom using a three-digit extended Biologische Bundesanstalt, Bundessortenamt und CHemische Industrie (BBCH) scale, which includes eight principal growth stages, comprising four vegetative, two reproductive and two capsule development stages. Additionally, we identified 45 secondary stages within these principal growth stages, providing a comprehensive characterisation of the crop's growth progression, including bud development, leaf emergence, tillering and shoot development, while the reproductive stages included inflorescence emergence and flowering. The capsule development stage details the maturation process of capsules. The study also highlights the parallel occurrence of tillering, shoot development and inflorescence emergence stages during specific growth phases. The knowledge of growth stages facilitates timely interventions, optimising crop management strategies and enhancing overall crop productivity. Additionally, these findings offer valuable insights for breeding programmes and the selection of superior genotypes, contributing to the sustainable cultivation and economic viability of cardamom as an important export-oriented spice crop.</p>\n<h2>Highlights</h2>\n<p>\nBBCH scale provides uniform coding for different growth stages of cardamom.\nIdentified and described eight principal growth stages (PGS).\nPGS comprises of 4 vegetative, 2 reproductive and 2 capsule development stages.\n45 secondary stages were identified within 8 principal growth stages.\nTillering, shoot development and inflorescence emergence occurs parallelly.\n</p>","author":"Hosahalli Jagannathagowda Akshitha, \nMundagodu Somashekar Shivakumar, \nShettahallikoppalu Javaraiah Ankegowda","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"fc82f41be4f1da7085ca19968bf6b044eb17d46ba50017423437c512068e6d47","category":"Environment"}