{"title":"Dietary kelp meal improves serum antioxidants, intestinal immunity, and lipid metabolism in hybrid snakehead (Channa maculata ♀ × Channa argus ♂)","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13566?af=R","date":1715410465000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Dietary kelp possesses a variety of useful biological qualities but does not have a toxic effect on the host. In this study, we examine how kelp dietary supplementation enhances the serum biochemistry, intestinal immunity, and metabolism of hybrid snakehead. A total of 810 juvenile hybrid snakeheads (<i>Channa maculata</i> ♀ × <i>Channa argus</i> ♂), with an initial average weight of 11.4 ± 0.15 g, were allocated randomly to three treatment groups (three replicates per group). The fish were fed for 60 days with isonitrogenous and isolipidic diets. The groups were the control group (C) (20% high-gluten flour), the medium replacement group (MR) (10% high-gluten flour and 10% kelp meal), and the full replacement group (FR) (0% high-gluten flour and 15% kelp meal).</p>\n<h2>RESULTS</h2>\n<p>The results showed that dietary kelp increased the activity of serum antioxidant enzymes significantly and decreased the content of serum malondialdehyde (MDA) in hybrid snakeheads, with significant changes in the FR group (<i>P</i> &lt; 0.05). The intestinal morphology results showed that dietary kelp helped to increase the specific surface area of intestinal villi, which was beneficial for intestinal digestion and absorption. According to transcriptome and quantitative real-time polymerase chain reaction (qRT-PCR) analysis, dietary kelp can improve the expression of intestinal immunity and metabolism-related pathways. Among them, immune-related genes <i>MHC1</i> and <i>HSPA1</i> were significantly up-regulated, and <i>IGH</i>, <i>MHC2,</i> and <i>IL-8</i> were significantly down-regulated (<i>P</i> &lt; 0.05). Lipid metabolism-related genes <i>DGAT2</i>, <i>FABP2</i>, <i>RXRα,</i> and <i>PLPP1</i> were all significantly up-regulated (<i>P</i> &lt; 0.05).</p>\n<h2>CONCLUSION</h2>\n<p>Dietary kelp can effectively improve the antioxidant function of hybrid snakeheads, improve intestinal morphology, reduce intestinal inflammation, and promote intestinal lipid synthesis and transportation, thereby improving intestinal immunity and metabolic functions. © 2024 Society of Chemical Industry.</p>","author":"Shaodan Wang, \nDi Sun, \nBin Ye, \nGuohuan Xu, \nJixing Zou","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"fc8574688a7ed2912e1809c5471035c293bcbc9dee8803b8879b01d6d7516129","category":"Environment"}