{"title":"SCICON Cuts Astana Contract Over ‘Ethics’: Mark Cavendish Won’t Wear Its Glasses","link":"https://bikerumor.com/scicon-cuts-astana-contract-cavendish-sunglasses/","date":1679583600000,"content":"<p>SCICON has dropped the entire Astana team from its sponsorship roster. That’s because the recently-signed Mark Cavendish will not wear the Italian sunglasses — instead opting for the shades of his longtime sponsor, Oakley.</p>\n\n\n\n<p>In a Monday statement, SCICON CEO Heinrich Dannhauser made the brand’s position clear in terms of “ethics.”</p>\n\n\n\n<p>“It is unfortunate that individual riders can compromise sponsorship agreements in this way. It is even more unfortunate that a team would not stand up for what is ethically the right thing to do – honoring the agreement and recognizing the significant investments that were made by SCICON,” Dannhauser said. “We took a strong stance in this case and could not make an exception for one rider.”</p>\n\n\n\n<p>The CEO went on to put “all sponsors of professional cycling” on notice regarding SCICON’s decision.</p>\n\n\n\n<p>SCICON operated as Astana’s gear partner for two years, after first appearing on the UCI circuit three years ago. The deal included eyewear, luggage, and bike bags, according to the brand.</p>\n\n\n\n<p>SCICON avoided naming Oakley, <a href=\"https://bikerumor.com/mark-cavendish-sports-new-oakley-sunglasses-during-his-brief-tour-de-france-outing/\" target=\"_blank\">Cavendish’s longtime sunglass sponsor</a>, in its release. Cyclingnews <a href=\"https://www.cyclingnews.com/news/scicon-pulls-out-of-astana-sponsorship-amid-mark-cavendish-oakley-conflict/\" target=\"_blank\">reported</a> the sponsorship conflict previously led to “tensions” during the Kazakh team’s negotiations with the Manxman. And now, the outlet said, other members of the Astana lineup have been spotted wearing Oakley.</p>\n\n\n\n<p>SCICON, meanwhile, reportedly prepares to sue Astana for damages over breach of contract.</p>\n\n\n\n<figure><div>\n<div><blockquote><p>The Oakley/Scicon story of Astana continues as Scicon pulls their sponsorship as multiple teammate's of Cav, including Lutsenko, have also been seen wearing Oakley glasses. <br /><br />CN also understands that Scicon are planning leagal action!! <a href=\"https://t.co/XrHxctZ8AF\">https://t.co/XrHxctZ8AF</a></p>— Tim Bonville-Ginn (@TimBonvilleGinn) <a href=\"https://twitter.com/TimBonvilleGinn/status/1637937776376131591?ref_src=twsrc%5Etfw\">March 20, 2023</a></blockquote></div>\n</div></figure>\n\n\n\n<p>“Many of the world’s best riders <a href=\"https://sciconsports.com/us_en/sponsorships\" target=\"_blank\">use SCICON eyewear</a>,” Dannhauser said, referring to the likes of Tadej Pogacar and Australian Criterium National Champion Amber Pate. “This unfortunate situation will not deter us at a time when there are very exciting developments in our business and so much to look forward to.”</p>\n<p>The post <a href=\"https://bikerumor.com/scicon-cuts-astana-contract-cavendish-sunglasses/\">SCICON Cuts Astana Contract Over ‘Ethics’: Mark Cavendish Won’t Wear Its Glasses</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Sam Anderson","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"fc919aefb99154c0ebd62c8fe65b192e9cf36e3c8bbf2b159a249c0d275ec83f","category":"Cycling"}