{"title":"Constraining Plio‐Pleistocene Shifts in Northwest African Hydroclimate, Ecosystem Distributions, and Marine Productivity: New Paleo‐Records Across the Mid‐Pleistocene Transition","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004777?af=R","date":1719039600000,"content":"<h2>Abstract</h2>\n<p>Northwest Africa transitioned from a wet/vegetated landscape toward drier/sparser conditions sometime between the late-Pliocene and the late-Pleistocene. However, our understanding of the precise timing and nature of this transition is hampered by a paucity of paleo-records which bridge these two intervals. Here we report new plant-wax isotope as well as dust and opal flux records from the relatively brief interval ∼1.1–1.0 million years ago (Ma) to evaluate the astronomical timescale controls of Northwest African hydroclimate and vegetation during the Mid-Pleistocene Transition (MPT) and, in context with published records, the drivers of long-term climate and ecological trends over the Plio-Pleistocene. The tempo and amplitude of the Northwest African monsoon rainfall swings closely track low latitude insolation forcings over the last 5 Ma. However, we demonstrate that a pronounced mean state decline in monsoon strength likely occurred following the MPT most likely instigated by increasing Atlantic meridional sea surface temperature gradients or declines in the strength of the meridional overturning circulation. The northward extent of vegetation does not track changes in monsoon strength over the Plio-Pleistocene and thus may be more strongly influenced by changes in monsoon rainfall extent or ecosystem disturbances. Progressively diminished dust fluxes following a decline in monsoon strength after 1.0 Ma is consistent with reduced production and subsequent depletion of fine-grained sediments in the Sahara. Synchroneity between dust and opal fluxes across timescales suggests nutrient delivery to the surface ocean via dust plays a key role in marine primary productivity off the coast of Northwest Africa.</p>","author":"Nicholas A. O’Mara, \nCharlotte Skonieczny, \nDavid McGee, \nGisela Winckler, \nAloys J.‐M. Bory, \nLouisa I. Bradtmiller, \nBruno Malaizé, \nPratigya J. Polissar","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"fca5838d32bdec0c9d1eb3cf1b84f8b3dc9f581ab61fd17bb569f768dc3c88c9","category":"Environment"}