{"title":"iOS 15 Includes Secure Paste Feature That Hides the Clipboard From Developers","link":"https://www.macrumors.com/2021/06/08/ios-15-secure-paste/","date":1623177046000,"content":"<a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a> has multiple significant <a href=\"https://www.macrumors.com/2021/06/07/ios-15-macos-monterey-privacy-features/\">privacy-focused improvements</a> such as new protections in the Mail app to prevent tracking, an App Privacy section that shows you how often apps access sensitive information like location, and on-device <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> processing, but there are also some smaller but equally important changes.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/06/tiktokclipboard.jpg\" />\r\n<br />\r\nOne of these updates is a new Secure Paste function for developers, which can be built into apps. With this feature implemented, users can paste something from a different app, with the content of what's copied hidden unless it's pasted into the developer's own app.\r\n<br />\r\n\r\n<br />\r\nIf secure paste is implemented, users can copy and paste from one app to another without being alerted through the clipboard notification that was introduced in <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a>, giving them peace of mind that what they've copied is secure.\r\n<br />\r\n\r\n<br />\r\nThis feature sounds complicated, but it stems from a major privacy issue that surfaced last year. Back in March 2020, it <a href=\"https://www.macrumors.com/2020/03/15/ios-apps-pasteboard-data-report/\">came to light</a> that many <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> apps were \"snooping\" on pasteboard data, as developers could access whatever was on the pasteboard without the user being aware.\r\n<br />\r\n\r\n<br />\r\nApps like TikTok, Hotels.com, Reddit, Zillow and others could see whatever a user copied from another app, which was a concern because sometimes sensitive information like a password is copied.\r\n<br />\r\n\r\n<br />\r\nApple addressed this issue in ‌iOS 14‌ by implementing a small banner that notifies you whenever an app accesses the clipboard, which means apps can no longer see the clipboard without your knowledge. ‌iOS 15‌ takes it further with the secure paste feature that prevents developers from seeing the clipboard entirely unless you opt to copy something from one app and paste it into the app you're actively using.\r\n<br />\r\n<blockquote>With secure paste, developers can let users paste from a different app without having access to what was copied until the user takes action to paste it into their app. When developers use secure paste, users will be able to paste without being alerted via the pasteboard transparency notification, helping give them peace of mind.</blockquote>\r\n<br />\r\nAfter Apple first implemented the ‌iOS 14‌ feature to unveil when apps were accessing the clipboard, many apps were found to be copying the clipboard on a frequent basis, though some apps like TikTok claimed that <a href=\"https://www.macrumors.com/2020/06/25/tiktok-clipboard-access-ios-14-caught/\">this was a mistake</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-15.233\">iOS 15</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/08/ios-15-secure-paste/\">iOS 15 Includes Secure Paste Feature That Hides the Clipboard From Developers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-15-includes-secure-paste-feature-that-hides-the-clipboard-from-developers.2299918/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Z2zMDsG-wR8:1amDwLaISHM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Z2zMDsG-wR8:1amDwLaISHM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/Z2zMDsG-wR8\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fcb1037f1ba4fc9245f77736eed38bcdab610b9d8e02a54ac0e9fb358fb38891","category":"Apple"}