{"title":"Wilier Filante SLR review: superbike pedigree with style to match","link":"https://cyclingtips.com/2021/06/wilier-filante-slr-review-superbike-pedigree-with-style-to-match/","date":1623256668000,"content":"<p>Wilier announced its new Filante SLR last November with claims of improved aerodynamics and decreased weight compared to its existing aero bike, the Cento 10 Pro. Wilier even introduced a whole new fitting system it calls the Accufit to accompany the new bike and make frame size selection that bit easier.</p>\n\n\n\n<p>The new bike certainly promised a lot, so naturally, when the opportunity to review the Filante came about I wasn’t shy in putting my hand up.</p>\n\n\n\n<p>Wilier is a famous Italian brand with stacks of history and tradition, but it has proved in recent years it is also capable of innovative bike design and tech. As one of the first brands to introduce an aero-specific road bike, superlight climbing options, fully internal cable routing, and disc brake only options, Wilier has proved it is not afraid to push the boundaries of accepted trends. </p>\n\n\n<p>    </p><div>\n        <div>\n\t\t\t                <h2>Story Highlights</h2>\n\t\t\t\n\t\t\t                <ul>\n\t\t\t\t\t                        <li><strong>What it is:</strong>Wilier Filante SLR, Italian lightweight aero bike.</li>\n\t\t\t\t\t                        <li><strong>Frame features:</strong>Light weight, aerodynamic, disc brake and electronic shifting only, fully integrated. </li>\n\t\t\t\t\t                        <li><strong>Weight:</strong> 7.02 kg size large in Velvet Red with Dura-Ace Di2, Wilier wheelset, no pedals. </li>\n\t\t\t\t\t                        <li><strong>Price:</strong> £9,250 / €10,300 (as tested).<strong> </strong></li>\n\t\t\t\t\t                        <li><strong>Highs:</strong> Relatively lightweight, looks stunning, fast without the harsh feel.</li>\n\t\t\t\t\t                        <li><strong>Lows:</strong> Wheels, price, internal cable routing headaches. </li>\n\t\t\t\t\t                </ul>\n\t\t\t        </div>\n    </div>\n\t<p></p>\n\n\n\n<p>The Cento 10 Pro and the 0 SLR have sat atop Wilier’s range for the past two years. The Filante is said to combine the low weight and ride characteristics of the 0 SLR with the aerodynamic advantages of the Cento10 Pro. This sounds good! </p>\n\n\n\n<p>Wilier offers the Filante in a host of build options, including Ultegra Di2, SRAM Force and Red Etap AXS, and Campagnolo EPS, but it was the Dura-Ace Di2 model I had in for testing. </p>\n\n\n\n<p>The Dura-Ace model naturally includes the R9170 groupset and also features Wilier’s Filante-specific integrated handlebar and stem, Wilier SLR 42KC disc wheels, Selle Italia SLR Boost saddle, and Vittoria Corsa tubeless tyres. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-33-1340x754.jpg\" /><figcaption>I was hoping for the Velvet Red and Wilier duly obliged. Standing on this snow-speckled hairpin, I could almost convince myself I was in Italy racing the Giro.</figcaption></figure>\n\n\n\n<p>It seemed someone had answered all my prayers when I opened the box to find Wilier had shipped the glossy Velvet Red colourway. Yes, I know colour preference is subjective, and beauty is in the eye of the beholder, but damn this bike looked good. The only problem with it was I had the bike during a lockdown, so very few people got to see it. Those who did all agreed it was one of the nicest bikes they had seen. </p>\n\n\n\n<p>Having owned a Wilier Cento 10 Pro and been somewhat underwhelmed by the relatively high weight of 7.6 kg with a mechanical rim brake groupset, the first thing I wanted to test with the Filante was those lightweight claims. </p>\n\n\n\n<p>Bearing in mind this Filante features an electronic groupset with disc brakes, a rich paintwork that is undoubtedly adding some grams, internal cable routing, and an integrated handlebar and stem, I was impressed with the 7.2 kg (minus pedals) weight for this size large.</p>\n\n\n\n<p>I then turned to setting the bike up for my riding position. I was excited to read about Wilier’s new Accufit system when the bike was launched. The Filante handlebars feature some rather strange stem length options which, Wilier says, were specifically chosen to offer 240 different position options with zero overlap, meaning riders can achieve the perfect handlebar reach and drop.  </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-9-1340x754.jpg\" /><figcaption>Even with just five variants of handlebar sizing, Wilier can offer 240 different positions options using the five different frames and up to 35 mm of spacers.</figcaption></figure>\n\n\n\n<p>Wilier also offers a frame size suggestion service. Just give Wilier your current frame details and stem length, and it will calculate the frame size and exact handlebar option to achieve an identical fit. </p>\n\n\n\n<p>This sounded glorious to me as I have previously spent hours deciding on the exact right frame size to go for. Thank you Wilier for making this decision for me. Except in my case, Wilier didn’t. Despite going through the process, and figuring out the frame and handlebar sizes, Wilier then sent a bike with a different stem length. </p>\n\n\n\n<p>This was no doubt because I was shipped a bike already pre-built specifically for reviews, rather than any mistake from Wilier, but it did mean I couldn’t confirm if the Accufit system is as accurate as Wilier suggests. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2020/12/Wilier-Filante-geometry-1340x419.jpg\" /></figure>\n\n\n\n<p>So how does it ride? </p>\n\n\n\n<h2>Filante SLR ride review</h2>\n\n\n\n<p>Well I can say the Filante does not disappoint once out on the open road. The bike rides as well as it looks regardless of terrain or road surface. Uphill and down dale the new Filante frame was equally happy and performant in both terrains. </p>\n\n\n\n<p>Wilier has a long history in bike racing, and in some ways, I can relate the characteristics of the Filante to those of a seasoned, experienced WorldTour professional. The bike clearly has the speed and the capability to impress when it wants, but it seems content and confident enough in itself to only really show off its true colours when it really matters. Power and control without the in-your-face attitude of youthful exuberance.</p>\n\n\n\n<p>The Filante doesn’t deliver the punch or constant sense of speed of some other aero bikes, but that’s not to say it is slow. Rather the combination of the frame and the 28 mm Vittoria tubeless tyres I ran at 65 psi meant the bike lacks the road buzz and harsh ride usually associated with moving fast. As such, it was usually only when I glanced at my speed or checked a ride average that I realised the bike was actually fast! </p>\n\n\n\n<p>Pump those tyres up to 80 or 90 psi and it’s a different story, though. The frame then shows its true rear-end stiffness, and it wasn’t long before I was dropping the pressure again, given the state of some of my local roads. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-21-1340x754.jpg\" /><figcaption>This Selle Italia is hardly the most padded of saddles, but with the tyre pressure dropped I found it fine on even the roughest of roads.</figcaption></figure>\n\n\n\n<p>So just what gives the Filante this best-of-both-worlds speed and comfort? Well, to start with, that front end helps. Wilier has routed all the wires and brake hoses internally through the Filante integrated and aero handlebar. This tidies up the front end and leaves the narrow tapered head tube as a welcoming shape to increase aerodynamic efficiency. </p>\n\n\n\n<p>Yes, that does mean all the wires and hoses are internally routed and run through an ultra-fine proprietary headset bearing, likely to be much more expensive than a more readily available bearing. But on a racing bike, designed to be fast, I’m personally happy to accept the extra headache this causes. </p>\n\n\n\n<p>Also, just as I said in my <a href=\"https://cyclingtips.com/2021/05/2021-vitus-zx-1-evo-road-bike-review-aero-affordable-and-available/\" target=\"_blank\">Vitus ZX-1 review</a> a while back, for a lot of riders, this just means an extra expense when the local bike shop has to replace the bearing. And really, if you have spend €10,000+ on a bike, a bit more mechanic’s time won’t break the bank. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-10-1340x754.jpg\" /><figcaption>Yes it is integrated, and yes it will likely be a costly headache at some point. But that is one clean front end. </figcaption></figure>\n\n\n\n<p>Wilier has also incorporated some aerodynamic witchcraft into the design of the tubing used on the Filante. Kammtail or truncated tubing is not new on road bikes, but Wilier has adapted the design to provide softer, more rounded trailing edges. Wilier claims this results in lower weight but still achieves the same aerodynamic benefits of the sharper-edged Kammtail tubes. </p>\n\n\n\n<p>Wilier has widened both the front fork, by 7 mm, and the dropped seatstays at the rear. Furthermore, Wilier has arranged the seatstays directly behind the wider fork. Wilier claims this effectively hides the stays in the wake of the fork, improving the aerodynamics of the frame. </p>\n\n\n\n<p>While I could not test this claim, I do have my questions about how much of this gain this translates to in the real world with a wide range of yaw angles. Nevertheless, it doesn’t seem to hurt the bike’s performance. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-8-1340x754.jpg\" /><figcaption>The forks are wide, the seatstays look off the scale with their wide setting and without the rim brake bridge. What are your thoughts on this look? Yay or nay?</figcaption></figure>\n\n\n\n<p>Four years on from the groupset’s launch, there is little that remains to be said about Dura-Ace R9170. It shifts, it brakes, it works, but at this stage it is feeling a little long in the tooth compared to other offerings and the extra gear offered by Shimano’s competitors. As we all know, this is due for an update soon. </p>\n\n\n\n<p>One thing I did find a slight mismatch was the decision to spec the Filante with 50/34 chainrings. This is an aerodynamic race bike, with a racing groupset, designed to go fast, yet Wilier has spec’d a compact chainring setup. Perhaps this is just down to availability? </p>\n\n\n\n<p>I might also have expected to see a power meter included on this bike, especially at this price point.  </p>\n\n\n\n<h2>Wheels </h2>\n\n\n\n<p>Apart from that chainring option, which will be fine for many, the wheels were the only area I could point to that disappointed me with the Filante. </p>\n\n\n\n<p>The Wilier SLR 42KC disc wheelset looks good on paper and the 42 mm rim profile matches the frame well. However, I found the wheels to be less inspiring than the rest of the frame. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/DSCF3062-1340x754.jpg\" /><figcaption>This zero point balancing sticker didn’t do anything positive for the wheel’s aesthetics, and probably even less for the aerodynamics. </figcaption></figure>\n\n\n\n<p>The wheels delivered with the bike had a slight balance issue, which manifested itself in instability in the front wheel. Wilier was happy to address this and shipped a new set of wheels for comparison. </p>\n\n\n\n<p>The new wheels did solve the balance issue but did also feature a slightly rudimentary transparent plastic weight Wilier explained was a “zero point” for balancing the wheels. This might have helped with the wheel balance but it did little for the aesthetics of the wheels. </p>\n\n\n\n<p>Setting the balance and zero-point issues of the separate wheels aside, the wheels also failed to impress on the road. I can’t say the wheels are bad, but they left a lot to be desired on such a high-end bike. </p>\n\n\n\n<p>I found the wheels lacked the stiffness to allow me to maximise the responsiveness of the frame. Some part of that unhurried and comfy ride will be due to that flex in the wheels. As a result, the bike lacks the snap and acceleration I was expecting. I also had a constant woosh of disc brake rub when climbing out of the saddle, which I put down to flex in the hub. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-28-1340x754.jpg\" /><figcaption>The front hub is from fellow Italian brand Miche.</figcaption></figure>\n\n\n\n<p>I swapped in a set of Campagnolo Shamal Carbons I had on another bike (and as found on the Super Record EPS version of the Filante) and noticed an immediate improvement in all these areas. </p>\n\n\n\n<p>Gone was the brake rub and, most notably, on the local rough and steep descent I take all review bikes to, the Wilier was much more willing to hold its line through the flat-out S-bend corners when running the Shamals than with the SLR 42K wheelset. </p>\n\n\n\n<p>The only other grievances I had with the Filante were very minor. The seatpost bolt is in an awkward and tight position to fit a torque wrench into. The frame is disc brake- and electronic-compatible only, sadly for the traditionalists like me, but again, in a modern racing bike with tight internal cable routing, mechanical would likely be a struggle. </p>\n\n\n\n<h2>Back to what’s good</h2>\n\n\n\n<p>It has to be said again: I think that paint job is to die for. Wilier has a reputation for stunning paint jobs, and the Filante does not disappoint. The Ramato paint on my own Cento10 Pro was quite brittle and very easily chipped, but after nearly two months of riding the Filante, I am happy to report no such issues.  </p>\n\n\n\n<p>Beyond just the paintwork, the Filante looks ultra-modern with its wide seatstays, integrated handlebar, and not a cable in sight. This modern look is balanced with the traditional Wilier decal and that velvet red. </p>\n\n\n\n<p>Looking at the geometry, Wilier has opted for a relatively low stack height on the Filante (and previously the Cento10). However, as a minimum, two spacers are required between the frame and stem to facilitate the integrated cable routing; therefore, the functional stack height is actually 10 mm taller. Fans of the slammed stem look beware – this means the Filante will always show at least two spacers. </p>\n\n\n\n<p>In better news though, those spacers fully split and so adding or removing additional spacers is very easy. I recently worked on a bike with split spacers for the brake hoses which didn’t split for the steerer so the stem had to be lifted off. No such complication with the Wilier setup. </p>\n\n\n\n<p>Elsewhere, the relatively long wheelbase on the Filante – 997 mm in size large – certainly contributes to that unrushed feel and a smoother ride feel for this aero race bike.  </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-115-1340x893.jpg\" /><figcaption>Again, the integration looks so clean, but it can’t offer that slammed stem look. </figcaption></figure>\n\n\n\n<p>Officially, Wilier limits tyre clearance to 30 mm, but the Vittoria 28s on these Wilier wheels actually measure close to 30 mm and still show plenty of clearance in both frame and fork. While I didn’t have a wider tyre on-site to test, it seems unlikely an additional 2 mm of rubber would fill the clearance in the frame. </p>\n\n\n\n<p>Wilier has included three bottle cage bosses on the down tube. While the lowest position presumably offers a slight aerodynamic advantage and is fine for confident and flexible riders, I know the higher and easier-to-reach bottle cage position will be a welcome addition for some riders. It’s a simple thing, but kudos to Wilier for giving riders the option. </p>\n\n\n\n<p>Eagle-eyed viewers of <a href=\"https://cyclingtips.com/2021/03/ronan-mclaughlin-world-record-everesting-attempt/\">our Everesting video</a> might just spot the Filante actually came to the rescue when I got that rear wheel blow-out. For that, I will always be grateful to the Filante. </p>\n\n\n\n<p>I can’t go this full review without mentioning the price. Starting at more than €7,200 and coming in at close to €10,600 (AU$16,700 / £10,940) for the review model, the Wilier will sadly be out of reach for most of us. </p>\n\n\n\n<p>However, in the Filante’s defence, Wilier does appear to have poured a lot of R&amp;D time and money into this bike, and the Filante SLR well and truly pushes into superbike territory where these prices are not abnormal. Hopefully, we can expect a somewhat more reasonably priced SL version in the future. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-39-1340x754.jpg\" /><figcaption>Superbike stuff. With the tan sidewalls on the second set of wheels, it somehow looked even better.</figcaption></figure>\n\n\n\n<p>Overall, the Filante is a true superbike. My grievances with the wheels and chainrings might not be an issue for someone less inclined to push the limits as often as I do. </p>\n\n\n\n<p>If it’s good looks, racing pedigree, Italian heritage, and a smooth ride you’re after, the Filante can deliver. For me? I’m off to play the lotto. If I win, I will be on the phone to Wilier to order the Filante option with those Shamal carbon wheels.</p>\n\n\n\n<p>The Filante SLR model tested is available at <a href=\"https://wilier.com/en/my2022/world/racing-bikes/road-bikes/filante-slr\" target=\"_blank\">Wilier.com</a> , priced at £10,940 / AU$16,700 / €10,600. The Filante SLR Dura-Ace is not currently available in the USA, but Wilier does offer the Ultregra Di2 equipped version, priced at US$9,008.</p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-38-1340x754.jpg\" /></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-30-1340x754.jpg\" /><figcaption>A close-up of that red.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-25-1340x754.jpg\" /><figcaption>Those seatstays are like something off an F1 car.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-24-1340x754.jpg\" /><figcaption>Another view of the width of those stays.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-27-1340x754.jpg\" /><figcaption>Plenty of width up front also.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-26-1340x754.jpg\" /><figcaption>And plenty of tyre clearance too.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-22-1340x754.jpg\" /><figcaption>Filante Google-Translates to “racy”. It sure is!</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-18-1340x754.jpg\" /></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-15-1340x754.jpg\" /><figcaption>Mavic SpeedR elease has pre-set torque limits for tightening the thru-axle. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-16-1340x754.jpg\" /><figcaption>The seatpost bolt is below this cap, and is awkward to reach without being very careful not to mark the seat post.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-41-1340x754.jpg\" /><figcaption>Ready for takeoff.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Wilier-Filante-SLR-111-1340x893.jpg\" /><figcaption>Cleared for landing.</figcaption></figure></li></ul></figure>\n<p>The post <a href=\"https://cyclingtips.com/2021/06/wilier-filante-slr-review-superbike-pedigree-with-style-to-match/\">Wilier Filante SLR review: superbike pedigree with style to match</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"fcbf0eb8760c5a0c7bb416dce6f330ce333c70ec8a6e70fae94976a76930942d","category":"Cycling"}