{"title":"Low levels of Cd2+ combined with procymidone may cause ovarian damage in mice via unfolded protein response","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24169?af=R","date":1713272355000,"content":"<h2>Abstract</h2>\n<p>As no study about the combined effect of low levels of Cd<sup>2+</sup> with procymidone (PCM) on organs and organisms, we investigated their actions on mouse-ovary in vivo and in vitro. Four-week mice were treated with corn oil for the control group, corn oil + 0.0045 mg/L Cd<sup>2+</sup> (CdCl<sub>2</sub> was dissolved in ultrapure water and freely consumed by mice) for Cd<sup>2+</sup> group, 50 mg/kg/d PCM (suspended in corn oil and administered orally to mice) for PCM group, and 50 mg/kg/d PCM + 0.0015 (0.0045 and 0.0135) mg/L Cd<sup>2+</sup> for L+ (M+ and H+) PCM group for 21 days. For in vitro experiment, the cultured ovaries were treated with acetone for the control group, 0.1% acetone + 8.4 μg/L Cd<sup>2+</sup> for the Cd<sup>2+</sup> group, 0.63 mg/L PCM (dissolved in acetone) for the PCM-group, and 0.63 mg/L PCM + 2.8 (8.4 and 25.2) μg/L Cd<sup>2+</sup> for L+ (M+ and H+) PCM group for 7 days. Mouse body weight in each treatment group, the weight and volume of ovaries in all PCM groups were lower than the control. Both in vivo and in vitro, all-stage follicle numbers were lower in M+PCM and H+PCM groups, whereas the atretic follicles and CASPASE3/8 were higher; meanwhile, lower estradiol and progesterone and higher unfolded protein response (UPR) members in all PCM groups. L+, M+, and H+PCM groups had further ovarian damage and stronger UPR than PCM groups, as did M+PCM groups over Cd<sup>2+</sup> groups. It is hypothesized low-level PCM and Cd<sup>2+</sup> may mutually promote each other's triggered UPR and exacerbate ovarian damage.</p>","author":"Fan Li, \nXuning Wang, \nJiaxin Zhang, \nHui Nie, \nShiyun He, \nYushan Li, \nRuowen Xia, \nYongfei Zhu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"fcc170fa079a03648db607a37d18e631745893e4b4fddc7750914126ca3f2686","category":"Environment"}