{"title":"Multiple isoforms of the Activin-like receptor baboon differentially regulate proliferation and conversion behaviors of neuroblasts and neuroepithelial cells in the <i>Drosophila</i> larval brain","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305696","date":1719237600000,"content":"<p>by Gyunghee G. Lee, Aidan J. Peterson, Myung-Jun Kim, Michael B. O’Connor, Jae H. Park</p>\r\n\r\nIn <i>Drosophila</i> coordinated proliferation of two neural stem cells, neuroblasts (NB) and neuroepithelial (NE) cells, is pivotal for proper larval brain growth that ultimately determines the final size and performance of an adult brain. The larval brain growth displays two phases based on behaviors of NB and NEs: the first one in early larval stages, influenced by nutritional status and the second one in the last larval stage, promoted by ecdysone signaling after critical weight checkpoint. Mutations of the <i>baboon</i> (<i>babo</i>) gene that produces three isoforms (BaboA-C), all acting as type-I receptors of Activin-type transforming growth factor β (TGF-β) signaling, cause a small brain phenotype due to severely reduced proliferation of the neural stem cells. In this study we show that loss of <i>babo</i> function severely affects proliferation of NBs and NEs as well as conversion of NEs from both phases. By analyzing <i>babo</i>-null and newly generated isoform-specific mutants by CRISPR mutagenesis as well as isoform-specific RNAi knockdowns in a cell- and stage-specific manner, our data support differential contributions of the isoforms for these cellular events with BaboA playing the major role. Stage-specific expression of EcR-B1 in the brain is also regulated primarily by BaboA along with function of the other isoforms. Blocking EcR function in both neural stem cells results in a small brain phenotype that is more severe than <i>baboA</i>-knockdown alone. In summary, our study proposes that the Babo-mediated signaling promotes proper behaviors of the neural stem cells in both phases and achieves this by acting upstream of EcR-B1 expression in the second phase.","author":"Gyunghee G. Lee","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fcc9dfc485573f4cfe8afe6ec4b2c99a6b59124afef50bf1962711adcb1e6d42","category":"Interdisciplinary"}