{"title":"Tour de France 2021 Stage 14 Preview - Into the Pyrenees","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-stage-14-preview-the-tour-reaches-the-pyrenees","date":1625762946000,"content":"\n      <p><span>Through the years, the <span>Pyrenees has hosted many of the great mountain duels at the Tour de France. </span></span><span>The famed mountain range is where many of the remaining stages will play out. </span></p>\n<p><span>With just under 3,000 metres of climbing on the cards, the Tour de France most likely can't be won on stage 14. </span>However, it most certainly could be lost. </p>\n<p>Stage 13 of the 2021 Tour de France will go down in history. Mark Cavendish won his fourth stage of the race, tying Eddy Merckx' all-time stage victory record. Cavendish and Merckx have both won 34 Tour de France stages, and with a couple of opportunities for the sprinters remaining, Cav could surpass Merckx before the conclusion of the 2021 Tour de France.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b><i>Tour de France 2021 Guide</i></b></a></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tagged/tour-de-france-2021\"><b><i>Tour de France 2021 articles</i></b></a></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_PROFILS_ETAPES_SANS_RAVITO_ETP14_1024x1024.jpg?v=1625752923\" />Stage 14 profile</span></i></p>\n<p><span>Stage 14 begins in Carcassonne, a citadel famous for being a medieval hilltop fortress. Three Tour stages have started here since 2014, where Michael Rogers, Peter Sagan and Julian Alaphilippe have won.</span></p>\n<p><span>The first categorised climb arrives just over 50 kilometres in with the Col du Bac, which is 3.1km long and averages just over 5%. After a short descent, the riders head towards the intermediate sprint in Lavelanet. With the aforementioned climb and a false flat beforehand, this is a good opportunity for Sonny Colbrelli and Michael Matthews to gain ground on Mark Cavendish in the points classification.</span></p>\n<p><span>This leads directly into the steepest climb of the stage, the Col de Montségur. The second category climb has five KOM points available at the top, and averages more than 8% over 4.3km. A short descent follows and with little time for respite, the Col de la Croix des Morts begins. At 6.8km, this is the longest climb of the stage. This ascent is made more challenging as there is no descent that immediately follows. Instead, the riders must endure a</span><span> 10km flat section which leads into the short, third category Côte de Galinagues.</span></p>\n<p><span>Just over 50 kilometres will remain when this is crested. Finally, the riders will enjoy a long descent, and bar the uncategorised Col du Camp</span><span>érié, this downhill segment will carry the riders to the final climb which could be critical in deciding the stage outcome. At 4.7km and 7.4% on average, the Col de Saint-Louis is the perfect launchpad for those feeling strong. The second kilometre is particularly steep with percentages well over 12% — this is the moment to attack. The ascent also provides bonus seconds to the first three riders over the top.</span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_ETP14_PROFILS_PARTICULIERS_COL_DE_SAINT_LOUIS_1024x1024.jpg?v=1625752943\" />Col de Saint-Louis profile</span></i></p>\n<p><span>17 kilometres remain until the finish in Quillan, most of which is downhill. The descent takes place on a narrow road so riders must be careful. Nonetheless, numerous kinks in the road provide a great chance for the most daring, confident descenders to gap their rivals. With 2.4km to go, the riders will turn left and head into Quillan. Any rider that reaches this turn solo has a fantastic chance of crossing the finish line victorious.</span></p>\n<h4><b>Contenders</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210707TDF1051-A.S.O._Pauline_Ballet-min_1024x1024.jpg?v=1625752982\" />Julian Alaphilippe (Image credit: A.S.O./Pauline Ballet)</span></i></p>\n<p><span>Considering the dominance displayed by Tadej </span><span>Pogačar </span><span>so far, UAE Team Emirates will probably be leant upon to control the breakaway. This dynamic gives the breakaway a superb chance of going all the way to the line.</span></p>\n<p><span>19 king of the mountains points are available over the stage. Although there are plenty more opportunities to gain points in the coming days, those vying for the polka-dot jersey should consider joining the breakaway. Many remain in contention for polka-dots, including </span><b>Nairo Quintana, Wout van Aert, Mike Woods, Wout Poels </b><span>and </span><b>Bauke Mollema</b><span>. Expect to see some of these names in the eventual breakaway.</span></p>\n<p><b>Julian Alaphilippe</b><span> has been ever present in the breakaways at the Tour de France so far. The Frenchman didn’t have the legs on Mont Ventoux after an aggressive start to the stage, and then joined the breakaway on the windy stage 12 to Nîmes. With shorter, sharper ascents, this stage matches Alaphilippe's skillset more closely. </span>The World Champion has a real shot at picking up his seventh Tour de France stage victory in Quillan.</p>\n<p><span>Astana - Premier Tech are still in GC contention with Alexey Lutsenko surpassing expectations, and they have plenty of breakaway options available to them here. </span><b>Jakob Fuglsang</b><span> is free to go stage hunting as he has lost time in the general classification. The Dane may be looking to the lengthier climbs in the final week, however. Instead, </span><b>Ion Izagirre, Omar Fraile </b><span>and </span><b>Alex Aranburu </b><span>could all be great choices. Izagirre is the better climber, but Fraile and Aranburu are fast finishers. </span></p>\n<p><span>Groupama-FDJ have had a torrid Tour de France so far. </span><b>Arnaud </b><b>Démare</b><span> went home early without winning a sprint stage, whilst </span><b>David Gaudu</b><span> was sick on Mont Ventoux which means he has no chance of competing in the GC. This could be a blessing in disguise, as Gaudu is now free to chase stage victories in the breakaway, where he found success twice at the Vuelta a </span><span>España </span><span>last year. The steep ramps here could suit the talented Frenchman, though </span><b>Valentin Madouas</b><span> could also pose a threat.</span></p>\n<p><span>Bahrain-Victorious have been one of the most offensive teams at the Tour de France so far, and already have two wins to show for their exploits. </span><b>Dylan Teuns </b><span>and </span><b>Matej </b><b>Mohorič </b><span>won back-to-back stages on stages 7 and 8. Alongside </span><b>Wout Poels</b><span> and even the well-rounded</span><b> Fred Wright</b><span>, who can sprint well and climb capably, <span>Bahrain-</span>Victorious could be one of the most active teams. </span></p>\n<p><span>Other riders with a good shot from a breakaway group include </span><b>Ruben Guerreiro, Benoît Cosnefroy, Sergio Higuita, Patrick Konrad </b><span>and </span><b>Pierre Latour.</b></p>\n<p><span>The long descent to Quillan could deter severe GC attacks. We can expect the majority of the general classification contenders to finish together.</span></p>\n<h4><b>Prediction</b></h4>\n<p>We think a rider from the breakaway will win in Quillan. Astana - Premier Tech are yet to win a stage at the 2021 Tour de France, even though they have multiple stage hunters in their ranks. After winning the Spanish road race prior to the Tour, we are backing <strong>Omar Fraile</strong> to win stage 14 of the Tour de France. Fraile is a brave, aggressive descender, which will be advantageous in the final 20km.</p>\n<p><i><span>Cover image: A.S.O./Pauline Ballet</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"fccc3017a082690b6e15a5d11cf6c25676641b3f4179af84d5c8dc7cd53a5230","category":"Cycling"}