{"title":"จีนเตรียมออกแนวทางการแสดงคอนเทนต์บนโซเชียล จำกัดการใช้อัลกอริทึม สนับสนุนให้คนรีวิว","link":"https://www.blognone.com/node/124041","date":1627992049000,"content":"<div><div><div><p>หน่วยงานกำกับดูแลของรัฐบาลจีน 5 หน่วยงาน ประกาศแนวทางการแสดงคอนเทนต์บนสื่อสังคมออนไลน์ โดยลดบทบาทของอัลกอริทึมลง แต่ใช้บรรณาธิการจัดความสำคัญของเนื้อหาให้มากขึ้น ระวังการแพร่กระจายของเนื้อหาคุณภาพต่ำ</p>\n<p>หน่วยงานทั้งห้า ได้แก่  ได้แก่ กระทรวงโฆษณาชวนเชื่อกลางของพรรคคอมมิวนิสต์, กระทรวงวัฒนธรรมและการท่องเที่ยว, สำนักงานกำกับดูแลวิทยุและโทรทัศน์, สมาพันธ์วงการศิลปะและวรรรกรรม, และสมาคมนักเขียนจีน</p>\n<p>ที่ผ่านมาบริษัทเทคโนโลยีทั้งในและนอกจีนมีการใช้อัลกอริทึมจัดอันดับการแสดงเนื้อหา และประสบความสำเร็จอย่างสูง เช่น TikTok หรือ ByteDance ก็ใช้อัลกอริทึมในการแสดงคอนเทนต์สำหรับผู้ใช้ในจีน แต่แนวทางใหม่นี้ระบุว่าบริษัทออนไลน์ควรมีทีมรีวิวคอนเทนต์ และให้คุณค่ากับ วัฒนธรรม และศิลปะให้มากขึ้น</p>\n<p>รัฐบาลจีนเริ่มพยายามเข้ามาควบคุมบริษัทเทคโนโลยีมากขึ้นเรื่อยๆ ในช่วงปีที่ผ่านา หลักจากบีบแนวทางการทำธุรกิจของบริษัทขนาดใหญ่จำนวนมาก ไปจนถึงการวิจารณ์แนวทางที่<a href=\"https://www.blognone.com/node/123716\">บริษัทใช้งานพนักงานอย่างหนักว่าไม่เป็นไปตามแนวทางมาร์กซิสต์</a> ประกาศแนวปฎิบัติครั้งนี้รัฐบาลจีนก็ยังคงอ้างว่าเป็นการสนับสนุนแนวทางมาร์กซิสต์เช่นกัน</p>\n<p>ที่มา - <a href=\"https://www.scmp.com/tech/policy/article/3143664/chinas-top-propaganda-agencies-want-limit-role-algorithms-distributing\">South China Morning Post</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3c05959b7a4ed651d9bc099f1809d364.jpg\" /></p>\n<p>ภาพโดย <a href=\"https://th.m.wikipedia.org/wiki/%E0%B9%84%E0%B8%9F%E0%B8%A5%E0%B9%8C:Wai_Tan,_Shanghai,_China_(Unsplash).jpg\">Li Yang</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/social-network\">Social Network</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"fccdd8b2aeecf3b7170321b0bb844a72fc0847d1463dc8864474d4c06ff85caf","category":"Thai"}