{"title":"Apple Seen in Vehicle Supply Chains, but It May Be Exploring Taxi Service or Car Platform Instead","link":"https://www.macrumors.com/2021/05/24/apple-seen-in-vehicle-supply-chains/","date":1621864162000,"content":"Apple is intensely researching all aspects of car engineering and manufacturing, but there are growing questions around what form Apple's vehicle project may take, according to a report from the <a href=\"https://www.wsj.com/articles/apple-and-the-end-of-the-car-as-we-know-it-11621656010\"><em>Wall Street Journal</em></a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/Apple-car-wheel-icon-feature-triad.jpg\" />\r\n<br />\r\nSpeaking to the <em>Wall Street Journal</em>, Peter Fintl, the director of technology and innovation for Capgemini Engineering Germany, explained that Apple's movement in vehicle supply chains is noticeable.<blockquote>We have seen enough echoes in the supply chain that we know Apple is really looking into every detail of car engineering and car manufacturing. But nobody knows if what Apple creates will be a car or a tech platform or a mobility service.</blockquote>The report suggests that Apple's car project may not actually culminate in a consumer-purchasable complete vehicle. Instead, Apple may be looking to leverage its software and chip design expertise to create a kind of next-generation vehicle platform for other manufacturers to use.\r\n<br />\r\n\r\n<br />\r\nThat being said, this option conflicts with Apple's general desire to vertically integrate the full stack \"whenever possible\" and \"control every aspect of the user experience.\" Even so, according to the <em>Wall Street Journal</em>, there is \"no clear indication\" that Apple intends to use its philosophy of vertical integration for its vehicle project.<blockquote>If Tesla is the model here, it's unclear why Apple's executives would want to endure the tortuous process of building the manufacturing, testing and service capacities this path would require.</blockquote>If making a vehicle platform is unlikely to fit in with the company's ethos or objectives, and making an entire car is impractical and likely to be subject to fierce competition, the other option that the report suggests is an Apple mobility company, such as a self-driving taxi service.\r\n<br />\r\n\r\n<br />\r\nJohannes Deichmann, a partner at management consulting firm McKinsey whose expertise is software and electronics in automobiles, suggested:<blockquote>Apple and others could design and commission vehicles that bear their branding, and operate as part of a service they provide, with no trace of the actual manufacturer on them.</blockquote>Such a service would allow Apple to capture market share while the robot-taxi service industry is still in its infancy, and compete with the likes of GM's Cruise and Amazon's Zoox.\r\n<br />\r\n\r\n<br />\r\nWhile it is highly speculative, the report indicates that Apple's vehicle project has not yet penetrated the supply chain deeply enough to reveal the nature of the car itself, and concludes with the comment that \"it's quite possible that Apple will end up spending billions on attempts to develop an electric car without ever releasing a product.\"<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/the-wall-street-journal/\">The Wall Street Journal</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/24/apple-seen-in-vehicle-supply-chains/\">Apple Seen in Vehicle Supply Chains, but It May Be Exploring Taxi Service or Car Platform Instead</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-seen-in-vehicle-supply-chains-but-it-may-be-exploring-taxi-service-or-car-platform-instead.2297574/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=-qR_hA3QeeI:agBTLdQRZ5E:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=-qR_hA3QeeI:agBTLdQRZ5E:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/-qR_hA3QeeI\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fcd851055dc62e2e2fbb04b64ad7b5c8fbf720941d856b882507b747b755c64f","category":"Apple"}