{"title":"128 Impact of different levels of dark-cutting severity on the retail color and color stability of beef longissimus lumborum steaks","link":"https://academic.oup.com/jas/article/102/Supplement_1/41/7617963?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Dark-cutting beef is hallmarked by a dark red to almost purple color present within the interface of the ribeye between the 12<sup>th</sup> and 13<sup>th</sup> rib of the beef carcass. Yet, the shade or degree of darkness present within the ribeye can vary widely and have a substantial impact on the color and biochemical traits of the steaks. However, limited studies have compared color characteristics of different degrees of dark-cutting during retail display. Therefore, the objective of this study was to evaluate the impact of the visual degree of dark cutting at the time of grading on the retail color and color stability attributes of beef longissimus lumborum steaks. Beef strip loins (IMPS #180) were collected from two different Midwestern beef processors over the course of two collections. Strip loins (n = 8/treatment) were identified based on the degree of dark-cutting present within the ribeye to represent one-half dark, two-thirds dark, full dark, and a control of USDA Choice. At 48 to 60 h postmortem, loins were fabricated from the anterior end into 2.54 cm steaks and randomly assigned to retail display or d 0 lab analysis. Steaks designated for retail display were placed into Styrofoam trays and overwrapped with polyvinyl chloride film, and placed into retail display in coffin style display cases under continuous lighting for 5 d. Steaks designated for d 0 analysis were evaluated for pH, bloom, oxygen consumption, and metmyoglobin reducing activity. All color measurements were taken using a HunterLab MiniScan EZ spectrophotometer. The data were analyzed using the PROC GLIMMIX procedure of SAS at an α &lt; 0.05. Two-thirds and full dark-cutter steaks had a greater (P &lt; 0.05) pH than half and normal steaks on d 0. Moreover, full dark-cutter steaks had a decreased (P &lt; 0.05) bloomed L* value and were darker in color on d 0 than normal and half steaks. Full dark-cutter steaks had a greater (P &lt; 0.05) oxygen consumption and metmyoglobin reducing activity on d 0 than normal and half steaks. Full and two-third steaks had a decreased (P &lt; 0.05) a* value and were less red in color on d 0 of retail display than normal and half steaks. All degrees of dark-cutters had a reduced change in redness than USDA Choice steaks. These results indicate color stability activity can be dependent on the degree of dark-cutting, with full and two-thirds dark-cutters being similar in biochemical activity.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"fcd9a94bbad0ae209767c2621de919f96666cfeda474f41fee8a7fb2e2734c53","category":"Environment"}