{"title":"Trends in prevalence and correlates of tobacco use among school-going adolescents in Bhutan: A secondary data analysis of the 2004–2019 Global Youth Tobacco Survey","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003544","date":1722002400000,"content":"<p>by Tshewang Gyeltshen, Mahbubur Rahman</p>\r\n\r\nTobacco use remains a major public health challenge globally. In Bhutan, despite the implementation of strict tobacco control measures, the tobacco uses among the students continue to be alarmingly high compared to neighboring countries. This study aims to analyze the trends and correlates of tobacco use among students in Bhutan, utilizing the nationally representative Global Youth Tobacco Survey (GYTS) data from multiple survey years. Secondary analyses of GYTS data collected during 2004–2019 with 12,594 students aged 11–18 years were employed. Use of tobacco was defined as either smoked or smokeless tobacco use in last 30 days of the survey. Prevalence was estimated over time and multivariable log-binomial regression was used to determine the correlates of current tobacco use. Overall tobacco use prevalence increased from 18.5% in 2004 to 27.3% in 2019. Males had higher prevalence (20.4% in 2019) than females (7.0% in 2019). Smokeless tobacco use increased substantially from 8.2% to 19.4% over the study period. Earlier age of initiation had adjusted odds ratio (aOR) of 9.2 for &lt;11 years and 12.8 for 13–16 years vs. never smoking), betel quid use (aOR 3.3), peer pressure (aOR 3.6), and lower cost were significant correlates of adolescent tobacco use. Despite tobacco control policies, tobacco use among Bhutanese students is high and has been increasing over time, especially smokeless forms. Tobacco uses regulation, targeted interventions for high-risk junior high school students, and addressing social influences are urgently needed to curb this epidemic. Sustained tobacco use surveillance and public health action is imperative to protect students in Bhutan from this harmful habit.","author":"Tshewang Gyeltshen","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"fce19475bcfb76a6c9d873994e20112078235384c08c3054499979ec2df1bcf6","category":"Environment"}