{"title":"Experimental research on the influence of acid on the chemical and pore structure evolution characteristics of Wenjiaba tectonic coal","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301923","date":1713880800000,"content":"<p>by Xianxian Li, Xijian Li, Enyu Xu, Honggao Xie, Hao Sui, Junjie Cai, Yuhuan He</p>\r\n\r\nThe chemical and pore structures of coal play a crucial role in determining the content of free gas in coal reservoirs. This study focuses on investigating the impact of acidification transformation on the micro-physical and chemical structure characteristics of coal samples collected from Wenjiaba No. 1 Mine in Guizhou. The research involves a semi-quantitative analysis of the chemical structure parameters and crystal structure of coal samples before and after acidification using Fourier Transform infrared spectroscopy (FTIR) and X-ray diffraction (XRD) experiments. Additionally, the evolution characteristics of the pore structure are characterized through high-pressure mercury injection (HP-MIP), low-temperature nitrogen adsorption (LT-N<sub>2</sub>A), and scanning electron microscopy (SEM). The experimental findings reveal that the acid solution modifies the structural features of coal samples, weakening certain vibrational structures and altering the chemical composition. Specifically, the asymmetric vibration structure of aliphatic CH<sub>2</sub>, the asymmetric vibration of aliphatic CH<sub>3</sub>, and the symmetric vibration of CH<sub>2</sub> are affected. This leads to a decrease in the contents of -OH and -NH functional groups while increasing aromatic structures. The crystal structure of coal samples primarily dissolves transversely after acidification, affecting intergranular spacing and average height. Acid treatment corrodes mineral particles within coal sample cracks, augmenting porosity, average pore diameter, and the ratio of macro-pores to transitional pores. Moreover, acidification increases fracture width and texture, enhancing the connectivity of the fracture structure in coal samples. These findings provide theoretical insights for optimizing coalbed methane (CBM) extraction and gas control strategies.","author":"Xianxian Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fcf12bf0702415f21a058134603f106bbdbc06dbc8954b299dca3d3c1590e5bc","category":"Interdisciplinary"}