{"title":"Horizon scan survey to identify key research questions to promote sustainability of the marine recreational fishery in Namibia","link":"https://onlinelibrary.wiley.com/doi/10.1111/fme.12709?af=R","date":1715700864000,"content":"<h2>Abstract</h2>\n<p>Recreational fishing is popular worldwide, but many low- and middle-income countries (LMICs) are experiencing increased participation and reduced catches. Like other LMICs, the recreational fishery in Namibia is facing concerns regarding its sustainability. Empirical evidence suggested limited knowledge of the fish and fishery as one plausible cause. Herein, we used a horizon scan survey to identify critical questions by anglers and decision makers to facilitate sustainable and adaptive management strategies. Of 115 questions and concerns raised by 59 stakeholders, including fisheries managers, anglers (specialists and non-specialists), and scientists, 58 of the top research questions were organised within 11 high-priority themes, including: governance; human dimensions; regulatory actions; compliance; knowledge of fish populations; resource monitoring and data acquisition; angler outreach, education, and engagement; competing sectors/groups; bioeconomics; catch-and-release practises and perceived threats. Questions raised by non-specialist anglers differed from those raised by specialist anglers and scientists, which highlighted the potential importance of integrating fisher ecological knowledge into fishery management. Although questions were in the context of recreational fisheries, we recommend that some of the themes identified herein may be applicable to other LMICs and may also improve understanding of other fisheries, such as small-scale or commercial fisheries.</p>","author":"Natanah M. C. Gusha, \nMargit R. Wilhelm, \nChristopher S. Bova, \nGeorg H. Engelhard, \nKieran Hyder, \nWarren M. Potts","siteTitle":"Wiley: Fisheries Management and Ecology: Table of Contents","siteHash":"2b1b3fff230d9382f58e34a4967fc2d5f8d98012b5e160c81a8e044227f32245","entryHash":"fcf283ef2b6ff91b37aed1ad4a6af1e78c2291d82422842eeaf38a5224d731b3","category":"Environment"}