{"title":"Extreme Planktic Foraminiferal Dwarfism Across the ETM2 in the Tethys Realm in Response to Warming","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023PA004762?af=R","date":1717743600000,"content":"<h2>Abstract</h2>\n<p>Pronounced warming negatively impacts ecosystem resilience in modern oceans. To offer a long-term geological perspective of the calcareous plankton response to global warming, we present an integrated record, from two Tethyan sections (northeastern Italy), of the planktic foraminiferal and calcareous nannofossil response to the Eocene Thermal Maximum 2 hyperthermal (ETM2, ∼54 Ma). Our study reveals pronounced changes in assemblage composition and a striking dwarfing of planktic foraminiferal tests of up to 40% during the event, impacting both surface and deeper dwellers. The increased abundance of small placoliths among calcareous nannofossils is interpreted as community size reduction. Literature and our foraminiferal size data from Sites 1263 and 1209 (Atlantic and Pacific Oceans) highlights that the pronounced dwarfism is restricted to the Tethyan area. The ETM2 is characterized by warm sea surface temperatures as indicated by our δ<sup>18</sup>O data, but this warming is of global extent and cannot explain the unique dwarfism. Excluding evolutionary modifications, other potential drivers of dwarfism (eutrophication, deoxygenation, metabolic adaptation) cannot explain the exceptional dwarfism by themselves. The smallest sizes are in close temporal association with peaks in volcanic derived Hg/Th-Hg/Rb recorded just before and at the ETM2 which could not have been brought into our sections through weathering. In contrast, size reductions are absent below and above the ETM2 at Hg peaks where δ<sup>18</sup>O data do not show warm conditions. We speculate that the local input of toxic metals from submarine volcanic emissions could have acted synergistically to warming, causing the unique dwarfism.</p>","author":"R. D’Onofrio, \nR. Barrett, \nD. N. Schmidt, \nE. Fornaciari, \nL. Giusberti, \nG. Frijia, \nT. Adatte, \nN. Sabatino, \nA. Monsuru, \nV. Brombin, \nV. Luciani","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"fcf5e5a2992f8f37e6f363361171d20e03b0381820429ee78fad6fa132ed1001","category":"Environment"}