{"title":"Pixar, Adobe, Apple, Autodesk, and Nvidia Form Alliance for OpenUSD","link":"https://www.apple.com/newsroom/2023/08/pixar-adobe-apple-autodesk-and-nvidia-form-alliance-for-openusd/","date":1690915042000,"content":"\n<p>Apple Newsroom:</p>\n\n<blockquote>\n  <p>Pixar, Adobe, Apple, Autodesk, and NVIDIA, together with the Joint\nDevelopment Foundation (JDF), an affiliate of the Linux\nFoundation, today announced the Alliance for OpenUSD (AOUSD) to\npromote the standardization, development, evolution, and growth of\nPixar’s Universal Scene Description technology. [...]</p>\n\n<p>Created by Pixar Animation Studios, OpenUSD is a high-performance\n3D scene description technology that offers robust\ninteroperability across tools, data, and workflows. Already known\nfor its ability to collaboratively capture artistic expression and\nstreamline cinematic content production, OpenUSD’s power and\nflexibility make it an ideal content platform to embrace the needs\nof new industries and applications.</p>\n\n<p>The alliance will develop written specifications detailing the\nfeatures of OpenUSD. This will enable greater compatibility and\nwider adoption, integration, and implementation, and allows\ninclusion by other standards bodies into their specifications. The\nLinux Foundation’s JDF was chosen to house the project, as it will\nenable open, efficient, and effective development of OpenUSD\nspecifications, while providing a path to recognition through the\nInternational Organization for Standardization (ISO).</p>\n</blockquote>\n\n<p>Conspicuously absent: Meta, which supposedly has bet its future on XR. (Likewise the word <em>metaverse</em>.)</p>\n\n<p>I suspect some people will be surprised by Apple’s inclusion, thinking that Apple is only interested in proprietary technology. But that’s not the case. Apple’s interests tend to be at <em>both</em> ends of the proprietary spectrum, and the company has historically embraced open content/file formats in particular. A huge part of the original iPhone’s appeal was its groundbreaking support for the full web (as opposed to, as Steve Jobs called it, the “baby web” supported by mobile devices of the time). Nvidia executives have repeatedly made the analogy that <a href=\"https://blogs.nvidia.com/blog/2022/08/09/siggraph-huang-metaverse-ai/\">USD is to 3D content was HTML is to 2D</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/08/01/alliance-for-openusd\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"fcfe5e1260aa74bb48b4017f18bd2dd8260b43b159f28003fad9f26fd66c9a4e","category":"Tech"}