{"title":"Theory of Food: The Relationship between Childhood Eating Habits to Implicit Attitudes towards Food in Adulthood","link":"https://www.preprints.org/manuscript/202409.1895/v1","date":1727169094000,"content":"Background/Objectives: The growing interest in nutritional psychology has sparked exploration into how eating habits impact emotional, cognitive, and physical health. The Theory of Food (ToF) posits that childhood eating patterns shape food choices in adulthood, influenced by cognitive and associative representations formed early in life. This study examined the relationship between childhood eating habits and implicit attitudes toward food in adulthood, testing the ToF hypothesis. Methods: One hundred nineteen participants completed a recall questionnaire about their childhood eating habits and an Implicit Association Test (IAT) to assess implicit attitudes toward food groups. The primary hypotheses were that greater fruit consumption in childhood would lead to more positive attitudes toward fruit, and higher snack consumption would result in more favorable attitudes toward snacks. Results: The results did not support the initial hypotheses, indicating no direct relationship between childhood consumption of fruits or snacks and implicit attitudes in adulthood. However, further analyses revealed a significant difference in implicit attitudes toward fruit between participants with low versus high childhood fruit consumption, particularly among women. Conclusions: These findings highlight the complexity of the relationship between childhood eating habits and implicit food attitudes. While no direct associations were found for the overall sample, the significant differences in attitudes based on childhood fruit consumption in women suggest gender-specific patterns. These results emphasize the need for further research to unravel the intricate connections between early eating behaviours and later food attitudes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fd0631372643cc3f70abc208dc25c5adc45a10f18cf25e85bc76a3cba79813ab","category":"Interdisciplinary"}