{"title":"EU Proposes to Force Apple to Switch iPhone, iPad, and AirPods From Lightning to USB-C","link":"https://www.macrumors.com/2021/09/23/eu-proposes-to-force-apple-to-switch-to-usb-c/","date":1632398220000,"content":"The European Commission has presented legislation that would compel Apple to use a USB-C port on all iPhones, iPads, and <a href=\"https://www.macrumors.com/guide/airpods/\">AirPods</a> in Europe (via <em><a href=\"https://www.reuters.com/business/media-telecom/eu-plans-one-mobile-charging-port-all-setback-apple-2021-09-23/\">Reuters</a></em>).\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/USB-C-Over-Lightning-Feature.jpg\" />\r\n<br />\r\nThe proposal, known as a directive, would force all consumer electronics manufacturers who sell devices in Europe to ensure that all smartphones, tablets, cameras, headphones, portable speakers, handheld videogame consoles feature a USB-C port. This \"common port\" would be a world first and impact Apple in particular since it widely uses the Lightning connector instead of USB-C on many of its devices.\r\n<br />\r\n\r\n<br />\r\nIn 2018, the European Commission tried to reach a final resolution on the issue but it failed to come into law. At the time, Apple warned that forcing a common charging port on the industry would stifle innovation and create electronic waste as consumers were forced to switch to new cables. A European Commission impact assessment study conducted in 2019 found that half of all charging cables sold with mobile phones had a USB micro-B connector, 29 percent had a USB-C connector, and 21 percent had a Lightning connector. \r\n<br />\r\n\r\n<br />\r\n<ul>\r\n<br />\r\n\t<li><a href=\"https://www.macrumors.com/guide/eu-charging-standard-proposals-and-apple/\">The EU Wants All Phones to Work With Interoperable Chargers, Here’s What That Means for Apple's Lightning Port</a></li>\r\n<br />\r\n</ul>\r\n<br />\r\n\r\n<br />\r\nEnvironmental benefits, reduced waste, convenience, and $293 million in annual savings for users are said to be among the advantages of the new directive.\r\n<br />\r\n\r\n<br />\r\nThe draft legislation also proposed that chargers should be sold separately from electronic devices, a move that Apple already started with the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> and Apple Watch Series 6 models last year. The European Commission is also planning to revise its eco-design regulations to ensure that external power supplies for devices are interoperable.\r\n<br />\r\n\r\n<br />\r\nIn a statement shared with <em>Reuters</em>, Apple said \"We remain concerned that strict regulation mandating just one type of connector stifles innovation rather than encouraging it, which in turn will harm consumers in Europe and around the world.\" The company also expressed concerns about the proposed two-year transition period to switch to USB-C.\r\n<br />\r\n\r\n<br />\r\nThe directive now needs to be greenlit by the EU Parliament and national governments, who may suggest amendments, before it can come into law. The European Commission hopes that this will occur in 2022. From that point, companies will have two years to transition to USB-C on their devices.<div>Tags: <a href=\"https://www.macrumors.com/guide/usb-c/\">USB-C</a>, <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a>, <a href=\"https://www.macrumors.com/guide/european-commission/\">European Commission</a>, <a href=\"https://www.macrumors.com/guide/lightning/\">Lightning</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/23/eu-proposes-to-force-apple-to-switch-to-usb-c/\">EU Proposes to Force Apple to Switch iPhone, iPad, and AirPods From Lightning to USB-C</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/eu-proposes-to-force-apple-to-switch-iphone-ipad-and-airpods-from-lightning-to-usb-c.2312839/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wOMzLWkeCl0:-cWgZB4BL4c:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wOMzLWkeCl0:-cWgZB4BL4c:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/wOMzLWkeCl0\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fd077f0e1e6d54582d9654c47f20ce5d9a863796cd57042b110786fadf017f07","category":"Apple"}