{"title":"Transforming waste resources into efficient activated carbon for energy storage and environmental remediation: a comprehensive review","link":"http://link.springer.com/10.1007/s13762-024-05457-3","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>The accumulation of non-biomass wastes, including anthracite, asphalt/asphaltene, synthetic polymers, petroleum coke, and tire wastes, contributes to environmental pollution. Utilizing these waste resources as precursors for activated carbon production emerges as an economical and sustainable strategy for energy storage and environmental remediation. This review (explicitly from 2010 to 31 December 2022) comprehensively explores recent advancements in employing these waste materials for activated carbon synthesis. The study highlighted textural characteristics such as surface chemistry, surface area, microstructures, and mesostructures and their impact on the functionality of activated carbon. Examining various precursors, asphalt-based activated carbons exhibited superior mean specific surface area (2715.73 m<sup>2</sup>g<sup>─1</sup>) and pore volume (1.6078 cm<sup>3</sup>g<sup>─1</sup>), surpassing other reported sources. Anthracite-based activated carbon stood out with a specific capacitance of 433 Fg<sup>─1</sup>, demonstrating excellent energy storage potential. In wastewater treatment, asphalt-based activated carbons display a remarkable q<sub>max</sub> of 1113 mgg<sup>─1</sup>, while waste tire-based activated carbon exhibited a strong gaseous compound removal capacity of 475 mgg<sup>─1</sup>. Despite widespread application in wastewater treatment, the investigation notes a gap in utilizing these activated carbons for energy storage. The activated carbon derived from these non-biomass sources emerges as a promising material with commendable properties in volume and pore sizes, surface area, surface behavior, and functional groups. The review guides researchers toward an economical approach for producing non-biomass-derived activated carbons with exceptional physicochemical characteristics and adsorption capacity. It concludes by critically evaluating current knowledge gaps, synthesizing challenges, and offering recommendations for future research endeavors.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"fd136cc4515166a06c5efe575bb147b93ac807f08a5805c6307c2f5344f05ad4","category":"Environment"}