{"title":"The transformation of 20-year social participation policies of older people in China: Network analysis and text analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308401","date":1723471200000,"content":"<p>by ZiQi Mei, WeiTong Li, JunYu Chen, HaiYan Yin, YuLei Song, WenJing Tu, ZiChun Ding, YaMei Bai, ShengJi Jin, Guihua Xu</p>\r\nBackground <p>Social participation of older adults is a crucial component of China’s aged care services and an important strategy for actively addressing the aging population. Analyzing policy texts on older people’s social participation can inform future policy formulation and the development of relevant programs.</p> Objectives <p>This study aims to quantitatively analyze the transformation of China’s social participation policies for older people from 1999 to 2023, employing institutional network analysis and policy text analysis.</p> Method <p>A two-dimensional policy analysis framework was constructed based on the perspective of “policy tools and social participation stages.” Using Rost Content Mining 6.0 and Nvivo 11.0 Plus software, 55 national-level policy texts were coded. Structural analysis of policy-issuing subjects and topic words was conducted to visualize the findings.</p> Results <p>The analysis revealed that the policy-issuing subjects demonstrated strong authority but weak coordination, with a lack of communication and cooperation across subjects. The use of policy tools was imbalanced, with an over-reliance on supply-type tools and insufficient use of demand-type tools. Additionally, the lack of effective policy tools to support various social participation stages has limited policy implementation.</p> Conclusion <p>With technological advancement and changing needs of the elderly population, there is a need for a more systematic and forward-looking top-level design of elderly social participation policies: accelerating the systematization and precision of technological elements in policies for elderly social participation, integrating social organizations via technological platforms to mobilize diverse stakeholder engagement, and addressing the digital divide between the elderly and new technologies is imperative.</p>","author":"ZiQi Mei","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fd208bf6ff276f3c13750476ffdd22c97f793636b74558e3d4d246fdd554961d","category":"Interdisciplinary"}