{"title":"iPhone 15 and iPhone 15 Plus Rumored to Be Available in Light Green","link":"https://www.macrumors.com/2023/08/28/iphone-15-and-15-plus-light-green-color-rumor/","date":1693230945000,"content":"Just a few weeks ahead of Apple unveiling new iPhones, rumors continue to circulate about new color options for the devices. The latest information comes from established leakers <a href=\"https://twitter.com/MajinBuOfficial/status/1696145808196780032\">@MajinBuOfficial</a> and <a href=\"https://twitter.com/URedditor/status/1696146103547146555\">@URedditor</a>, who today said the lower-end iPhone 15 and iPhone 15 Plus models will be available in a new light green finish.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/iPhone-15-Mock-Green-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\n@MajinBuOfficial said it appears the new color option will be very similar to the green finish available for the iPhone 12 and the discontinued iPhone 12 mini. However, the leaker is unsure if the color will be available when the iPhone 15 and iPhone 15 Plus launch in September, or introduced as an additional color option in spring 2024.\r<br />\n\r<br />\nOther color options rumored for the iPhone 15 and iPhone 15 Plus include black, blue, yellow, and pink. Apple typically also makes the standard iPhones available in (PRODUCT)RED, a deep red color that benefits The Global Fund, an organization fighting HIV/AIDS, tuberculosis, and malaria, primarily in sub-Saharan Africa.\r<br />\n\r<br />\nApple is expected to unveil the iPhone 15 series at an event that is rumored to be <a href=\"https://www.macrumors.com/2023/08/08/iphone-15-september-12-event/\">planned for Tuesday, September 12</a>. Apple has yet to officially announce the event, but invitations will likely go out within the next week or two.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/28/iphone-15-and-15-plus-light-green-color-rumor/\">iPhone 15 and iPhone 15 Plus Rumored to Be Available in Light Green</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-and-iphone-15-plus-rumored-to-be-available-in-light-green.2399838/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fd23615ae5da869d15d64fd2f8612d18809257b34fa0688b61bf4520fab45aac","category":"Apple"}