{"title":"Online media sentiment analysis for US oysters","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.191?af=R","date":1722409200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/495c6a2b-66d5-41cc-82ac-6f97a715338c/aff2191-gra-0001-m.png\" alt=\"Online media sentiment analysis for US oysters\" />\n<p>In this research, sentiment analysis was applied to social media data concerning oysters spanning from January 2019 to December 2022. Findings indicate a growing preference for farmed oysters, yet certain reservations and criticisms persist within the industry. The collective net sentiment for all US oysters stands at a positive 63%, with wild oysters receiving a positive sentiment of 51%, and farmed oysters also displaying a positive sentiment of 58%.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Sentiment analysis, a form of data analytics, utilises information from online discussions, reviews, and social media posts to assess consumer sentiments. This study utilised data collected from social media using online listening procedures to assess online sentiments on oysters from January 2019 through December 2022. The analysis utilises machine learning algorithms to extract consumer sentiments, opinions, and demands from online chatter from different online domains. The online sentiments are determined as positive, negative, or neutral based on their word choice, tone, and context. The information provided gives insights into perception, which is valuable information for oyster producers, seafood industry stakeholders, and marketers to identify consumer preferences and formulate appropriate strategies accordingly. The results suggest that while farmed oysters are gaining popularity, there are still some concerns and criticisms around the industry. Positive words associated with mentions of oysters in general include ‘great’, ‘love’, ‘delicious’, ‘enjoyed’, and ‘oyster bar’, while negative words associated with oysters include ‘water’, ‘raw oyster’, ‘bad’, and ‘not eat’. The overall percentage net sentiment associated with all oysters in the United States is positive at 63%. The net sentiment associated with wild oysters is positive, at 51%, and that of farmed oysters is 58%. The oyster industry could invest more in public education, sustainability, and water-cleaning initiatives to improve its image. Utilising social media to monitor and shape public perception can help the industry address concerns and enhance oyster-related sentiments, offering valuable insights for marketing and sales strategies.</p>","author":"Taylor L. Bradford, \nKwamena K. Quagrainie","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"fd27b63938203fb657a6e5614cea9053790bfcfa0f37d93f3e8590851aab96d4","category":"Environment"}