{"title":"Next year’s iPhone could bring massive camera improvements, no more mini","link":"https://www.macworld.com/article/343293/next-years-iphone-could-bring-massive-camera-improvements-no-more-mini.html","date":1618411063000,"content":"\n<div>\n<section><div></div></section><p>While the iPhone 13 is looking to be an S-type update with minor design changes and few show-stopping features, next year’s model is shaping up to be a massive upgrade. Following rumors of a notchless, portless iPhone 14, Ming-Chi Kuo is back with a rumor that could elevate the iPhone’s camera to new heights.</p>\n\n\n\n<p>In a new report <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/04/14/kuo-2022-iphones-no-mini-upgraded-camera/&amp;xcust=1-1-343293-0-0-0&amp;sref=https://www.macworld.com/feed\">obtained by MacRumors</a>, Kuo literally says just that: “We believe that the camera quality of the new 2H22 ‌iPhone‌ will elevate mobile phone camera photography to a new level.” What that means is a greater pixel size, higher resolution, and 8K video. As Kuo writes:</p>\n\n\n\n<blockquote><p>“In terms of pixel size, the ‌iPhone 12‌, iPhone 13, and new 2H22 ‌iPhone‌ are about 1.7um, 2um, and 1.25um, respectively. We believe that the new 2H22 ‌iPhone‌ may support direct 48MP output and 12MP (four cells merge output mode) output simultaneously. With 12MP output, the CIS pixel size of the new 2H22 ‌iPhone‌ increases to about 2.5um, which is significantly larger than the ‌iPhone 12‌ and ‌iPhone 13‌, and larger than existing Android phones.”</p></blockquote>\n\n\n\n<p>Those specs would be a massive jump over the current 12MP, f/1.6, 1.7um pixel size in the iPhone 12 Pro Max’s main camera and the 2.4um effective pixel size in Samsung’s 108MP main camera on the S21 Ultra. In general, the larger the sensor size the better the image quality, and when you add in things like Night Mode, sensor-shift stabilization, and whatever other goodies Apple has planned for the camera in this year’s and next year’s iPhone, it’s not a stretch to say the iPhone 14 (what Kuo refers to as “2H22”) could giver higher-end digital still cameras a run for their money.</p>\n\n\n\n<p>But if you’re a fan of smaller phones like the <a href=\"https://www.macworld.com/article/234921/iphone-12-mini-review-a-concentration-not-a-reduction.html\">iPhone 12 mini</a>, you might not have a model to buy for too much longer. While all signs point to the release of an iPhone 13 mini this year, Kuo says that there won’t be a new mini in 2022. Instead, Apple will reportedly make a pair of 6.7-inch phones with pro and non-pro features, much like the 6.1-inch model. With reports of low sales and <a href=\"https://www.macworld.co.uk/opinion/iphone-13-mini-3803010/\">a general lack of interest</a>, we’re not surprised at all.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"fd2cf79edba1429051b3afe4f9e0cd9e118135625ab0f06b6f2cc2031f0e8d62","category":"Apple"}