{"title":"211 United States Department of Agriculture National Animal Health Monitoring System Goat 2019 study: Regional prevalence of gastrointestinal nematodes and lungworms in the United States","link":"https://academic.oup.com/jas/article/102/Supplement_3/403/7757372?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>One objective of the United States Department of Agriculture National Animal Health Monitoring System Goat 2019 study (September 2019-April 2020) was to determine the prevalence of gastrointestinal nematode (GIN) and lungworm infection in goats across the US. Feces were collected from 5,176 animals on 318 operations in 24 states and results were consolidated into 4 regions: Northwest (3 states, 34 operations), Northeast (9 states, 89 operations), Southeast (9 states, 132 operations) and Southwest (3 states, 63 operations). Feces from each operation were mixed and cultured to allow eggs to hatch and develop, The Baermann technique was used to recover infective third-stage larvae from cultures. GIN identification included <span>Haemonchus</span>, <span>Trichostrongylus</span>, <span>Teladorsagia</span>, Oesophagostomum and <span>Nematodirus</span>. Lungworm (<span>Muellerius/Protostrongylus</span>) first-stage larval presence was also noted. Frequencies were calculated and <span>Haemonchus</span> were found on 18.6 ± 3.5 % of the operations (Northwest, 27.0 ± 16.5 %; Northeast, 13.1 ± 4.7 %; Southeast, 15.9 ± 5.1 % and Southwest, 29.2 ± 9.4) %); <span>Trichostrongylus</span> on 97.2 ± 1.4 % of the operations (Northwest, 100 %; Northeast, 98±1.1 %; Southeast, 97.0 ± 2.2 % and Southwest, 95.7±4.2 %); <span>Teladorsagia</span> on 80.3 ± 4.0% of the operations (Northwest, 97.1 ± 2.4%; Northeast, 71.6 ± 9.1%; Southeast, 88.6 ± 4.6% and Southwest, 75.7 ± 7.3%); <span>Oesophagostomum</span> on 38.2 ± 4.3% of the operations (Northwest, 73.1 ± 9.2%; Northeast, 39.6 ± 7.1 %, Southeast, 46.4 ± 8.2% and Southwest, 15.5 ± 6.0%); <span>Nematodirus</span> on 7 ± 2.6 % of the operations (Northwest, 7 ± 5.1%; Northeast, 5.2 ± 4.7 %, Southeast, 0 % and Southwest, 20.8 ± 8.6 %); and lungworms on 35.4 ± 4.2 % of the operations (Northwest, 69.1 ± 9.8 %; Northeast, 52.2 ± 9.1 %, Southeast, 33.4±6.9% and Southwest, 8.3±3.3%). Results indicated that <span>Trichostrongylus</span> was the most prevalent followed by <span>Teladorsagia</span>, <span>Oesophagostomum</span>, lungworms, <span>Haemonchus</span> and <span>Nematodirus</span>. Prevalence of all GIN and lungworms were similar within regions except <span>Nematodirus</span> and lungworms, which were less in the southeast and southwest, respectively. Due to project seasonal timing and sampling logistics, fecal collection was conducted from fall through early spring which may have influenced prevalence, specifically the most pathogenic GIN, Haemonchus. This study provided valuable insight into USA regional prevalence of GIN and lungworms in goats.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"fd30926160f7f9fe6223122849bd667e89c485acbb29d187b1a1519588c44d73","category":"Environment"}