{"title":"Sensors and Sensing Devices Utilizing Electrorheological Fluids and Magnetorheological Materials &ndash; a Review","link":"https://www.preprints.org/manuscript/202404.0318/v1","date":1712239122000,"content":"This paper comprehensively reviews sensors and sensing devices developed or/and proposed so far utilizing two smart materials: electrorheological fluids (ERFs) and magnetorheological materials (MRMs) whose rheological characteristics such as stiffness and damping can be controlled by external stimuli, an electrical voltage for ERFs and a magnetic field for MRMs, respectively. In this review article, the MRMs are classified into magnetorheological fluid (MRF), magnetorheological elastomer (MRE) and magnetorheological plastomer (MRP). To easily understand the history of sensing research using the two smart materials, the order of this review article is organized in a chronological manner of ERF sensors, MRF sensors, MRE sensors and MRP sensors. Among many sensors fabricated from each smart material, one or two sensors or sensing devices are adopted to discuss on the sensing configuration, working principle and specifications such as accuracy and sensitivity. Some sensors adopted in this article include force sensor, tactile device, strain sensor, wearable bending sensor, magnetometer, display device and flux measurement sensor. After briefly describing what have been reviewed in a conclusion, several challenging future works, which should be done for practical applications as sensors or sensing devices, are remarked in terms of new technologies such as artificial intelligence neural network in which several parameters affecting the sensor signals can be precisely tuned or controlled. It is sure that this review article is very helpful to make creative sensors using not only the proposed smart materials but also several different types of smart materials including shape memory alloys and active polymers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fd3a9a0032b316430548cf16774282dc52a948da84de37bb177d1cdf5e68aa46","category":"Interdisciplinary"}