{"title":"Antibiotics Elution Depth in Bone Cement: Impact of Surface Area and Volume","link":"https://www.preprints.org/manuscript/202405.2025/v1","date":1717053098000,"content":"Antibiotic-loaded bone cement (ALBC) plays a pivotal role in infection prevention and treatment related to musculoskeletal surgery. The release efficacy of antibiotics from ALBC is closely tied to its surface area, yet little is known about the effective release depth. To investigate the relationship between surface area, volume, and antibiotic elution, spheric ALBC specimens with consistent outer diameters but different internal metal sphere diameters were prepared. Two vancomycin doses were utilized in ALBC specimens with an outer diameter of 35 mm: high (4 g) and low (1 g). Each dosage group included five specimens containing embedded metal spheres with diameters of 15, 25, 29, 32, or 33 mm. The resulting shell-like ALBC specimens had thicknesses of 10 mm, 5 mm, 3 mm, 1.5 mm, or 1 mm, respectively. The specimens were immersed in sterile phosphate buffer solution, and antibiotic elution was measured at designated sampling times (1, 3, 6, 10, 24, 48, 72, and 168 hours). Methylene blue was employed to visualize penetration depth. Vancomycin elution did not display statistically significant differences between high- and low-dose groups. In both groups, specimens with 1 mm thickness exhibited a higher vancomycin release efficiency (high-dose group: 18560±5474 μg, 6.7%; low-dose group: 2017±419 μg, 2.6%), decreasing sharply in thicker ALBC specimens. Methylene blue penetration depth showed no apparent difference between high-dose and low-dose groups. ALBC thickness does not significantly impact antibiotic elution, while surface area and antibiotic dose exert notable effects. These in vitro findings offer potential applications in clinical treatments for musculoskeletal infections.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fd3d64084f9c2b8bca7f1c08f6db87be0bb435e7adda5a777f4d66286d8bfbce","category":"Interdisciplinary"}