{"title":"This pro track cyclist is going to be an astronaut","link":"https://cyclingtips.com/2021/12/this-pro-track-cyclist-is-going-to-be-an-astronaut/","date":1638837120000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/Christina-Birch-650x406.jpg\" /></div><h2>This pro track cyclist is going to be an astronaut</h2><p>\n</p><p>American track, cyclocross, and gravel cyclist Christina Birch was not content with being a high achiever on the bike. After a long and successful racing career – which saw her pick up 11 national championships, win gold at two Pan-Am Games, and get close to Olympic selection – Birch has just been named as one of 10 candidates in NASA’s 2021 astronaut class. </p>\n\n\n\n<p>While balancing her ambitions as a cyclist, Birch gained a PhD in biological engineering from MIT, and has also worked as an academic, before taking a sabbatical from her career in 2018 to pursue her cycling career as far as she could. That led to remarkable success on the track, as well as a love of gravel cycling. Along with her partner – reigning individual pursuit world champion Ashton Lambie – she was a co-founder of the <a href=\"https://www.instagram.com/p/CAsiWy9lObM/\">Gravelnauts</a> cycling collective. </p>\n\n\n\n<p>Birch, 35, learned of her selection by NASA in late October, and along with Lambie has moved to Texas in preparation for commencement of training in January. </p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CXJr99lOjmv/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div>View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CXJr99lOjmv/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Ashton Lambie (@bahamalongbottom)</a></p></div></blockquote> \n\n\n\n<p>According to NASA’s <a href=\"https://www.nasa.gov/press-release/nasa-selects-new-astronaut-recruits-to-train-for-future-missions\">press release</a>, the two-year training program “falls into five major categories: operating and maintaining the<a href=\"http://www.nasa.gov/station\"> </a>International Space Station’s complex systems, training for spacewalks, developing complex robotics skills, safely operating a T-38 training jet, and Russian language skills.” </p>\n\n\n\n<p>After successful completion of training, the astronauts could be assigned to a range of missions including “research aboard the space station, launching from American soil on spacecraft built by commercial companies, as well as deep space missions to destinations including the Moon on NASA’s Orion spacecraft and Space Launch System rocket.”</p>\n\n\n\n<p>The NASA astronaut class is a highly coveted intake, receiving more than 12,000 applications. The 10 candidates selected are the first in four years, and join a rarified group of just 360, ever – the majority of which we can assume were not champion cyclists.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/this-pro-track-cyclist-is-going-to-be-an-astronaut/\">Read More</a>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"fd431b66e3ab300ea5f3a298db7913d9b15d90b0f92f4d213fc295262783cf77","category":"Cycling"}