{"title":"Advances in Compounds Targeting Regulatory Mechanisms of Biofilm Formation in Unicellular Eukaryotes: Insights from 2024 Research and Applications in Vietnam","link":"https://www.preprints.org/manuscript/202409.1406/v2","date":1727094763000,"content":"Biofilm formation in unicellular eukaryotes, such as Candida albicans and Saccharomyces cerevisiae, represents a significant challenge in various sectors, including healthcare, agriculture, and industry. These biofilms are resistant to conventional antimicrobial treatments due to their protective extracellular matrix and complex regulatory mechanisms, such as quorum sensing (QS) and cyclic AMP (cAMP) signaling. Recent advances in the understanding of biofilm formation pathways have led to the identification of novel compounds that target these regulatory mechanisms. This review highlights breakthroughs from 2024 research, focusing on the inhibition of quorum sensing, disruption of extracellular matrix synthesis, and transcriptional/post-transcriptional regulation of biofilm-related genes. The application of these discoveries in Vietnam is particularly promising, given the country's challenges with biofilm-related infections in healthcare and productivity losses in agriculture and aquaculture. Natural product-based approaches, especially those derived from Vietnam's marine biodiversity, offer environmentally sustainable solutions for biofilm control. However, translating these laboratory findings into scalable, cost-effective applications faces challenges such as resistance development, environmental sustainability, and regulatory constraints. This review provides a comprehensive overview of compounds targeting biofilm regulatory mechanisms, evaluates their potential applications in Vietnam, and discusses future research directions, emphasizing the need for interdisciplinary collaboration to address the complexities of biofilm control.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fd45b807c49d647154da874dd2f28d80d70bde3511dbe61de399b1169eabccf2","category":"Interdisciplinary"}