{"title":"Micro-osteoperforation for enhancement of orthodontic movement: A mechanical analysis using the finite element method","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308739","date":1724076000000,"content":"<p>by João Ricardo Cancian Lagomarcino Gomes, Ivana Ardenghi Vargas, Antônio Flávio Aires Rodrigues, Luiz Carlos Gertz, Maria Perpétua Freitas, Sergio Augusto Quevedo Miguens Jr., Ahmet Ozkomur, Pedro Antonio González Hernandez</p>\r\nBackground <p>Micro-osteoperforation is a minimally invasive technique aimed at accelerating tooth movement. The goal of this novel experimental study was to assess tooth movement and stress distribution produced by the force of orthodontic movement on the tooth structure, periodontal ligament, and maxillary bone structure, with and without micro-osteoperforation, using the finite element method.</p> Materials and methods <p>Cone-beam computed tomography was used to obtain a virtual model of the maxilla and simulate the extraction of right and left first premolars. Three micro-osteoperforations (1.5 x 5 mm) were made in the hemiarch on the distal and mesial surfaces of upper canines, according to the power tip geometry of the Propel device (Propel Orthodontics, Ossining, New York, USA). An isotropic model of the maxilla was fabricated according to the finite element method by insertion of mechanical properties of the tooth structures, with orthodontic force (1.5 N) simulation in the distal movement on the upper canine of a hemiarch.</p> Results <p>Initial movement was larger when micro-osteoperforations were performed on the dental crown (24%) and on the periodontal ligament (29%). In addition, stress distribution was higher on the bone structure (31%) when micro-osteoperforations were used.</p> Conclusions <p>Micro-osteoperforations considerably increased the movement of both the dental crown and periodontal ligament, which highlights their importance in the improvement of orthodontic movement, as well as in stress distribution across the bone structure. Important stress absorption regions were identified within micro-osteoperforations.</p>","author":"João Ricardo Cancian Lagomarcino Gomes","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fd56a1fbb281a008fb5c5400bba653014b34cf4b675847b8a7900a99172ab353","category":"Interdisciplinary"}