{"title":"CAS-ESM2.0 Successfully Reproduces Historical Atmospheric CO2 in a Coupled Carbon-Climate Simulation","link":"http://link.springer.com/10.1007/s00376-023-3172-9","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>The atmospheric carbon dioxide (CO<sub>2</sub>) concentration has been increasing rapidly since the Industrial Revolution, which has led to unequivocal global warming and crucial environmental change. It is extremely important to investigate the interactions among atmospheric CO<sub>2</sub>, the physical climate system, and the carbon cycle of the underlying surface for a better understanding of the Earth system. Earth system models are widely used to investigate these interactions via coupled carbon-climate simulations. The Chinese Academy of Sciences Earth System Model version 2 (CAS-ESM2.0) has successfully fixed a two-way coupling of atmospheric CO<sub>2</sub> with the climate and carbon cycle on land and in the ocean. Using CAS-ESM2.0, we conducted a coupled carbon-climate simulation by following the CMIP6 proposal of a historical emissions-driven experiment. This paper examines the modeled CO<sub>2</sub> by comparison with observed CO<sub>2</sub> at the sites of Mauna Loa and Barrow, and the Greenhouse Gases Observing Satellite (GOSAT) CO<sub>2</sub> product. The results showed that CAS-ESM2.0 agrees very well with observations in reproducing the increasing trend of annual CO<sub>2</sub> during the period 1850–2014, and in capturing the seasonal cycle of CO<sub>2</sub> at the two baseline sites, as well as over northern high latitudes. These agreements illustrate a good ability of CAS-ESM2.0 in simulating carbon-climate interactions, even though uncertainties remain in the processes involved. This paper reports an important stage of the development of CAS-ESM with the coupling of carbon and climate, which will provide significant scientific support for climate research and China’s goal of carbon neutrality.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"fd5a12530ff0a9b18bcb49809fc00e102176e60acab1951f9cb3b5bb47a5db33","category":"Environment"}