{"title":"Commentary to: An integrated historical study on human–tiger interactions in China中国境内人虎互动的综合历史研究","link":"https://onlinelibrary.wiley.com/doi/10.1002/inc3.63?af=R","date":1727440028000,"content":"<h2>Abstract</h2>\n<p>The tiger holds a revered position in Chinese culture, symbolizing power and strength, yet its coexistence with human populations has often been marked by tension and conflict. Understanding the historical dynamics of human-tiger relations is essential for comprehending the current state of tiger populations and shaping future coexistence with the species. The article “An integrated historical study on human-tiger interactions in China” examines several aspects of human attitudes toward tigers across varying dynasties, revealing striking differences, with some periods marked by intense exploitation and others characterized by greater tolerance. While the article discusses a number of interesting historical and current issues that help the reader to better understand human–tiger relations, it does not mention significant issues such as the practice of tiger farming, which appears to be a major area of human–tiger interaction as the number of captive tigers is now double that of wild populations. It is also important to consider the fundamental role of legislation in shaping human-tiger interactions in China. This commentary aims to complement the article's vision by addressing these gaps and offering valuable guidance for policymakers and conservationists working toward long-term human-tiger coexistence in China.</p>\n<h2>摘要</h2>\n<p>在中国文化中，老虎是受人尊敬的象征，这种文化根深蒂固，然而这些顶级食肉动物与当地人类的共存关系却常常充满紧张和冲突。关于人虎关系的历史分析对于了解老虎种群的现状以及未来与该物种的关系非常重要。“An integrated historical study on human-tiger interactions in China”一文考察了不同朝代的人们对老虎有什么样的态度，揭示了明显的差异，有些朝代对对老虎作为资源的开发利用很密集，而有些朝代对老虎的宽容度更高。这一历史背景对于理解老虎保护的现状以及实现可持续共存的潜在方法是至关重要的。尽管这篇文章讨论了一些有趣的历史和当前的问题来理解人虎关系，但该文似乎也忽略了一些重要的问题:例如当前的老虎养殖，随着圈养老虎数量比野生虎数量翻一番，这似乎已成为人类与老虎之间的主要互动关系。此外，对立法的考虑也是很重要的一个方面，这是了解中国虎与人类互动的现状和未来的关键。本文为寻求在中国实现长期人虎共存的政策制定者和环保主义者提供了宝贵的指导，帮助他们在中国实现人虎长期共存。</p>","author":"Pablo Villalva","siteTitle":"Wiley: Integrative Conservation: Table of Contents","siteHash":"b2434e359c647f096191c4befea99097fa9394fd28e02b126976eb35d9219c03","entryHash":"fd5ab95dd5aeff137767700530980e3ddc8af63ff97acae9ee87b375b57701a6","category":"Environment"}