{"title":"Dependence of Climate and Carbon Cycle Response in Net Zero Emission Pathways on the Magnitude and Duration of Positive and Negative Emission Pulses","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004891?af=R","date":1721372400000,"content":"<h2>Abstract</h2>\n<p>Understanding the climate and carbon cycle response to negative CO<sub>2</sub> emissions is important for developing climate mitigation strategies that aim to limit global warming to a specific threshold. In this study, using a coupled climate and carbon cycle model, a novel set of nine stylized simulations are conducted with cumulative emissions of 1,000 GtC, 2,000 GtC, and 5,000 GtC over 150, 250, and 500 years, followed by identical cumulative negative emissions so that the net cumulative emissions are zero. On millennial-timescales, the climate system returns close to the preindustrial state, independent of the emission and removal pathways. However, the thermal and biogeochemical inertia of the ocean play an important role in determining the climate and carbon cycle response during the emission and removal phases. When zero net emissions are reached, surface air temperature is larger by 0–1°C than the preindustrial state, and the atmospheric CO<sub>2</sub> concentration is less by 12–29 ppm. These changes increase with both the magnitude and duration of the emission and removal pulses. In contrast, hysteresis in the relationship between global mean surface temperature and cumulative carbon emissions increases with the magnitude but decreases with the duration of emission and removal pulses. Our study highlights the role of ocean inertia in the asymmetry in climate response to emissions and removals and indicates that an earlier emission reduction implying emission/removal pathways with smaller magnitudes and shorter durations for the positive and negative emission pulses would avoid larger climate and carbon cycle impacts on centennial-timescales.</p>","author":"K. U. Jayakrishnan, \nGovindasamy Bala, \nKen Caldeira","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"fd61a4a7fcca32a597b5a134a528b677f9fe704f4cbfe7b6ada8e7a899b64893","category":"Environment"}