{"title":"Links between climatic histories and the rise and fall of a Pacific chiefdom","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae399/7795949?rss=1","date":1727740800000,"content":"<span><div>Abstract</div>Sea level rise and climate change are shaping present societies, particularly those on oceanic islands. Few historical examples could serve as references for these changes. One such potential model is the Saudeleur Dynasty with its capital Nan Madol on the Pacific Island of Pohnpei. However, the timing of its construction, as well as the dynasty's fluctuations and potential environmental influences, has remained unresolved. Through the analyses of <sup>230</sup>Th ages on 171 dates on corals fragments used as building materials and charcoal <sup>14</sup>C ages from excavations, 2 major construction phases spanning from the 10th to the 15th century CE can be discerned. The results show that the first phase of the site's construction, spanning the 10th–12th century, marked the dynasty's rise. The second period, spanning from the late 12th to the early 15th century, provides the most substantial evidence for the demise of the island-scale chiefdom and a significant societal reorganization. The phases are centuries earlier than previously believed. With this new evidence, we propose the hypothesis that variations in the El Niño-Southern Oscillation and subsidence-related sea level rise presented major challenges for building and maintaining Nan Madol, and thus, influenced the course of the island's history. This case serves as a compelling example of how adverse climatic conditions can spur investments—in this case, in seawater defense under high sea levels—yet ultimately may contribute to abandonment. It offers lessons for island nations, showcasing coastal resilience in the face of worsening catastrophic events that unfolded over generations.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"fd674befdf4d781dc86e722064d5386f0ba90d66c8c249dc1d56a9808aa341b0","category":"Interdisciplinary"}