{"title":"Characterization of the literature informing health care of transgender and gender-diverse persons: A bibliometric analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309169","date":1728050400000,"content":"<p>by Badal S. B. Pattar, Nabilah Gulamhusein, Chantal L. Rytz, Keila Turino Miranda, Lauren B. Beach, Zack Marshall, David Collister, Dina N. Greene, Cameron T. Whitley, Nathalie Saad, Sandra M. Dumanski, Tyrone G. Harrison, Lindsay Peace, Amelia M. Newbert, Sofia B. Ahmed</p>\r\nBackground and objective <p>Transgender and gender-diverse (TGD) persons experience health inequities compared to their cisgender peers, which is in part related to limited evidence informing their care. Thus, we aimed to describe the literature informing care provision of TGD individuals.</p> Data source, eligibility criteria, and synthesis methods <p>Literature cited by the World Professional Association of Transgender Health Standards of Care Version 8 was reviewed. Original research articles, excluding systematic reviews (n = 74), were assessed (n = 1809). Studies where the population of interest were only caregivers, providers, siblings, partners, or children of TGD individuals were excluded (n = 7). Results were synthesized in a descriptive manner.</p> Results <p>Of 1809 citations, 696 studies met the inclusion criteria. TGD-only populations were represented in 65% of studies. White (38%) participants and young adults (18 to 29 years old, 64%) were the most well-represented study populations. Almost half of studies (45%) were cross-sectional, and approximately a third were longitudinal in nature (37%). Overall, the median number of TGD participants (median [IQR]: 104 [32, 356]) included in each study was approximately one third of included cisgender participants (271 [47, 15405]). In studies where both TGD and cisgender individuals were included (n = 74), the proportion of TGD to cisgender participants was 1:2 [1:20, 1:1]. Less than a third of studies stratified results by sex (32%) or gender (28%), and even fewer included sex (4%) or gender (3%) as a covariate in the analysis. The proportion of studies with populations including both TGD and cisgender participants increased between 1969 and 2023, while the proportion of studies with study populations of unspecified gender identity decreased over the same time period.</p> Conclusions <p>While TGD participant-only studies make up most of the literature informing care of this population, longitudinal studies including a diversity of TGD individuals across life stages are required to improve the quality of evidence.</p>","author":"Badal S. B. Pattar","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fd6c9d80aef1f2d84640d4c0c5ba238f7cf4aa1c6101086727be4b84366adbf0","category":"Interdisciplinary"}