{"title":"Digital Image Analysis and Multivariate Data Analysis as Tools for the Identification of Microplastics in Surface Waters: The Case of the Vistula River (Central Europe)","link":"https://www.preprints.org/manuscript/202406.1977/v1","date":1719495879000,"content":"The primary objective of this study was to demonstrate the potential of digital image analysis as a tool to identify microplastic (MP) particles in surface waters and to facilitate their characterisation in terms of 2D and 3D morphology. Digital image analysis preceded by microscopic analysis was used for an exhaustive quantitative and qualitative evaluation of MPs isolated from the Vistula river. Using image processing procedures, 2D and 3D shape descriptors were determined. The Principal Components Analysis (PCA) was used to interpret the relationships between the parameters studied, characterising MP particle geometry, type and colour. This multivariate analysis of the data allowed 3 or 4 main factors to be extracted, explaining approximately 90% of the variation in the data characterising MP morphology. It was found that the first principal component for granules, flakes and films was largely represented by strongly correlated with 2D shape descriptors (area, perimeter, equivalent area diameter) and 3D shape descriptors (CSF, Compactness, Dimensionality). Considering the scraps, PC1 was represented by only five of the above descriptors, and the Compactness variable had the largest contribution to PC2. In addition, for granules, flakes and films, a relationship between 2D shape and the colour of their particles could be observed. For the most numerous MP group identified of multicoloured scraps, no such association was found. The results of our study can be used for further multivariate analysis regarding the presence of microplastic floating on the river surface, with a particular focus on particles of secondary origin. This is of key importance for optimising future efforts in conducting small-scale and multidimensional monitoring of and reducing plastics in the aquatic environment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fd6e6915efff0a9b49bafbd21c62163aaebdb5dce8b80226fc36527979428dc5","category":"Interdisciplinary"}