{"title":"Deprescribing interventions in older adults: An overview of systematic reviews","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305215","date":1718632800000,"content":"<p>by Shiyun Chua, Adam Todd, Emily Reeve, Susan M. Smith, Julia Fox, Zizi Elsisi, Stephen Hughes, Andrew Husband, Aili Langford, Niamh Merriman, Jeffrey R. Harris, Beth Devine, Shelly L. Gray, the Expert Panel </p>\r\nObjective <p>The growing deprescribing field is challenged by a lack of consensus around evidence and knowledge gaps. The objective of this overview of systematic reviews was to summarize the review evidence for deprescribing interventions in older adults.</p> Methods <p>11 databases were searched from 1<sup>st</sup> January 2005 to 16<sup>th</sup> March 2023 to identify systematic reviews. We summarized and synthesized the results in two steps. Step 1 summarized results reported by the included reviews (including meta-analyses). Step 2 involved a narrative synthesis of review results by outcome. Outcomes included medication-related outcomes (<i>e</i>.<i>g</i>., medication reduction, medication appropriateness) or twelve <i>other</i> outcomes (<i>e</i>.<i>g</i>., mortality, adverse events). We summarized outcomes according to subgroups (patient characteristics, intervention type and setting) when direct comparisons were available within the reviews. The quality of included reviews was assessed using A MeaSurement Tool to Assess systematic Reviews 2 (AMSTAR 2).</p> Results <p>We retrieved 3,228 unique citations and assessed 135 full-text articles for eligibility. Forty-eight reviews (encompassing 17 meta-analyses) were included. Thirty-one of the 48 reviews had a general deprescribing focus, 16 focused on specific medication classes or therapeutic categories and one included both. Twelve of 17 reviews meta-analyzed medication-related outcomes (33 outcomes: 25 favored the intervention, 7 found no difference, 1 favored the comparison). The narrative synthesis indicated that most interventions resulted in some evidence of medication reduction while for <i>other</i> outcomes we found primarily no evidence of an effect. Results were mixed for adverse events and few reviews reported adverse drug withdrawal events. Limited information was available for people with dementia, frailty and multimorbidity. All but one review scored low or critically low on quality assessment.</p> Conclusion <p>Deprescribing interventions likely resulted in medication reduction but evidence on <i>other</i> outcomes, in particular relating to adverse events, or in vulnerable subgroups or settings was limited. Future research should focus on designing studies powered to examine harms, patient-reported outcomes, and effects on vulnerable subgroups.</p> Systematic Review Registration <p>PROSPERO CRD42020178860.</p>","author":"Shiyun Chua","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fd733ec64becd1a77d81143355f0d0c3e3ab1d1431f62e57eb530f952c95f108","category":"Interdisciplinary"}