{"title":"LinkedIn Won't Use IDFA After Apple's App Tracking Transparency Changes","link":"https://www.macrumors.com/2021/03/04/linkedin-app-tracking-transparency-no-idfa/","date":1614887446000,"content":"Apple plans to begin enforcing its App Tracking Transparency changes following the <a href=\"https://www.macrumors.com/guide/everything-new-in-ios-14-5-beta/\">release of iOS 14.5</a>, and all apps that access an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>'s ad identifier or IDFA will need to ask a user's permission before tracking is allowed.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/nba-tracking-prompt.jpg\" alt=\"\" width=\"1600\" height=\"878\" class=\"aligncenter size-full wp-image-780733\" />\r\n<br/>\r\nLinkedIn <a href=\"https://business.linkedin.com/marketing-solutions/blog/linkedin-news/2021/sharing-an-update-on-our-plans-for-idfa\">today said</a> that with Apple's proposed changes, it will no longer be accessing the IDFA so LinkedIn users will not be presented with an ad tracking popup.\r\n<br/>\r\n\r\n<br/>\r\nOn its Marketing Solutions blog, LinkedIn says that it won't use the IDFA \"for now,\" a change that will result in \"limited impact\" to campaign performance for advertisers.<blockquote>We've always kept ourselves to a higher standard by putting our members first. And we work hard daily to provide reliable and resilient solutions for our customers that evolve with the industry's requirements, while providing a trusted, quality experience for our members. One of the bigger industry shifts is Apple's upcoming changes to Identifier for Advertising (IDFA), which companies use for tracking and ad targeting.\r\n<br/>\r\n\r\n<br/>\r\nWe want to share an update on our plans and guidance to help you prepare for these changes. We have decided to stop our iOS apps' collection of IDFA data for now. Although this change affects the LinkedIn Audience Network (LAN), Conversion Tracking and Matched Audiences, we expect limited impact to your campaign performance, and don't foresee major changes required for your campaign set-up.</blockquote>LinkedIn plans to \"regularly reevaluate\" the usage of the advertising identifier, but the company says it is committed to \"privacy-by-design principles\" that \"provide a trusted experience\" for LinkedIn users. Rather than using the IDFA, LinkedIn says that it will leverage its first-party data to help marketers reach buyer groups.\r\n<br/>\r\n\r\n<br/>\r\nLinkedIn's message that abandoning the IDFA will have a limited impact to campaign performance for LinkedIn advertisers is a different message than other major social networking sites like Facebook have been sharing. Facebook has claimed that Apple's App Tracking Transparency changes <a href=\"https://www.macrumors.com/2020/12/16/facebook-takes-out-full-page-ads-to-attack-apple/\">will have a major impact</a> on the small businesses that use Facebook advertising tools.\r\n<br/>\r\n\r\n<br/>\r\nTwitter this week also said that it <a href=\"https://www.macrumors.com/2021/03/03/twitter-cfo-apple-app-tracking-changes/\">is not concerned</a> about Apple's ad tracking changes because Twitter does not heavily rely on the IDFA. Twitter CFO Ned Segal said that Apple's IDFA restrictions will actually \"level the playing field\" by giving all advertisers new challenges to face. Twitter has, however, said that App Tracking Transparency will <a href=\"https://www.macrumors.com/2021/02/09/twitter-apple-app-tracking-transparency-impact/\">have a \"modest\" impact</a> on revenue.\r\n<br/>\r\n\r\n<br/>\r\nFacebook and other advertisers that have spoken out against App Tracking Transparency are concerned about Apple's changes because many do not believe that users will consent to being tracked across apps for ad personalization purposes.\r\n<br/>\r\n\r\n<br/>\r\nAll of the App Tracking Transparency code is in <a href=\"https://www.macrumors.com/roundup/ios-14/\">iOS 14</a> at the current time, but starting with the release of iOS 14.5, all apps that access the IDFA will need to implement the ad tracking popup that allows users to give or deny permission to use the IDFA.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/linkedin/\">LinkedIn</a>, <a href=\"https://www.macrumors.com/guide/app-tracking-transparency/\">App Tracking Transparency</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/04/linkedin-app-tracking-transparency-no-idfa/\">LinkedIn Won&#039;t Use IDFA After Apple&#039;s App Tracking Transparency Changes</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/linkedin-wont-use-idfa-after-apples-app-tracking-transparency-changes.2287069/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=zYnE9PapSTc:YPNddh-isuQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=zYnE9PapSTc:YPNddh-isuQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/zYnE9PapSTc\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fd792e8f5ce924bc3fa024d602e8e1253421364577a880170067dacfabcba197","category":"Apple"}