{"title":"Pro-Inflammatory Biomarkers and Long Term Neurological Outcomes in Hypothermia Plus Melatonin Treated Newborns. A Pilot Clinical Trial","link":"https://www.preprints.org/manuscript/202404.0777/v1","date":1712813374000,"content":"Objective. To evaluate serum neuronal and inflammatory biomarkers in asphyctic newborns treated with hypothermia alone or hypothermia plus melatonin, and whether biomarkers correlate with neurodevelopmental outcomes.\nDesign. This is a pilot multicentre, randomised, controlled, double blind clinical trial. Neuronal glial fibrillary acidic protein (GFAP), granulocyte-macrophage colony-stimulating factor (GM-CSF), and inflammatory cytokines (interleukin (IL)-1, IL-2, IL-7 and IL-13) were measured in serum samples at hospital admission (T0), 24 hours (T1), 72 hours (T2) and 7-10 days of age (T3). Neurodevelopmental outcomes (Bayley Scales of Infant and Toddler Development-III scales, Gross Motor Function Classification System (GMFCS) and the Tardieu scale) were performed at 6 and 18 months. Setting: Level 3 neonatal intensive care unit. Patients and interventions: 25 newborns were recruited. The treated patients received a daily dose of intravenous melatonin, 5 mg per kg body weight, for 3 days. \nResults. After adjusting the data for severity, in the group treated with melatonin, there is a decrease in plasma levels of GM-CSF, IL-2 and IL-13 at T1 compared to placebo, as well as, at T2, in GM-CSF concentrations, as well as IL-7 and IL-13 at T3. Evolutionarily, we found a significant decrease in GM-CSF concentrations in the treatment group compared to placebo, with no differences for the rest of the biomarkers. It is noteworthy that the sustained decrease in GM-CSF and inflammatory cytokines IL-2, IL-7 and IL-13 correlated with better neurodevelopmental outcomes at 6 and 18 months.\nConclusions. In neonates with hypoxic-ischemic encephalopathy, the addition of iv melatonin to hypothermia therapy affects the plasma concentration of biomarkers in the first week of life, with a high correlation with long-term neurological prognosis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fd819e256be32dd63319a96d47c1199643113db6939d3884c370652101bbd0cb","category":"Interdisciplinary"}