{"title":"Is There Gender Disparity in Vascular Access for Hemodialysis with New Percutaneous Systems?","link":"https://www.preprints.org/manuscript/202408.0636/v1","date":1723190273000,"content":"Background: Historically, a large gender-related disparity in vascular access (AV) has been demonstrated, with a lower prevalence of women with arteriovenous fistula (AVF) compared to men and worse maturity rates. The cause of this difference is not entirely clear, although several reasons that could contribute to it have been hypothesized. The emergence of new percutaneous FAV (pFAV) systems could be an alternative for reducing these differences.\nObjective: The study aims to determine if there is a gender difference in the creation of AVFs using the new percutaneous systems.\nMaterial and Methods: A systematic review of the literature was conducted by searching PubMed and Google Scholar using the following terms: \"percutaneous arteriovenous fistula\", \"endovascular arteriovenous fistula\", and \"hemodialysis\". All clinical trials, comparative studies, and descriptive studies involving patients who underwent a pAVF were included.\nResults: Finally, the review includes 19 studies, comprising 14 retrospective and 5 prospective studies. Of these, 6 studies are comparative, 5 of which compare pAVF with surgically created AVFs (sAVF), and 1 comparing pAVFs performed using different systems with each other.\nA total of 1,269 patients were included in the review. Of the total number of patients, only 414 were women, representing 32.62%.\nConclusion: The number of women included in the various studies analyzing pAVF remains very low, representing less than one-third of all patients. Although the causes of this difference are not entirely clear, several reasons have been hypothesized such as socio-economic factors, anatomical factors, or even patients' preferences. Given these results, further studies are needed to try to clarify the reasons for this gender disparity and to establish different strategies to mitigate the barriers faced by women in accessing the creation of an AVF.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fd82e2851ecf482509bb2139f0974bed039f93cfadad78aacf7f7ae1282315cc","category":"Interdisciplinary"}