{"title":"Disc brake pads explained: organic vs sintered vs semi-metallic","link":"https://www.bikeradar.com/advice/buyers-guides/disc-brake-pads/","date":1621423804000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/02/SramGTMFYB_01Max-cut-02.00_01_01_14.Still005-f024655.jpg?quality=90&amp;resize=620,413\" />                                            <p>All disc brakes, whether hydraulic or mechanical, operate in the same way, by pushing two disc brake pads against the sides of the rotor to slow or bring your bike to a halt.</p>\n<p>As with most things in cycling, however, even a seemingly simple, consumable component such as disc brake pads come in a variety of options.</p>\n<p>Over time the pads on your bike will get worn down, so you need to check regularly for pad wear before replacing them.</p>\n<p>You can also change and upgrade your pads if you’re not happy with the braking performance, with different pads better suited to different conditions.</p>\n<p>Bit what disc brake pads do you need for your bike? Here’s everything you need to know, including how disc brake pads work, when to replace disc brake pads, and the different materials available.</p>\n<ul><li><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-disc-brakes/\">Best mountain bike disc brakes</a></li>\n</ul><h2>How do disc brake pads work?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A disc brake works by pushing two pads against a rotor.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<p>A disc brake pad is made up of a block of braking material bonded to a metal backing plate. The metal plate adds structural rigidity to the braking surface and holds it in position within the brake caliper.</p>\n<p>When you apply a bike’s brakes, pistons in the caliper push the pads against the spinning rotor, which is attached to the hub of the wheel. There’s usually a metal spring to push the pads back when you release the brake lever.</p>\n<p>The friction between the pad and the rotor generates heat and also slowly wears down the layer of braking material in the pad.</p>\n<p>The metal plate helps remove heat from the brake and some will have fins or other features to help dissipate heat faster.</p>\n<p>With prolonged hard braking, it’s possible for the pads to transfer enough heat into the caliper to boil the hydraulic fluid in the pistons, resulting in brake fade and causing the brakes to become less effective.</p>\n<h2>When to replace disc brake pads</h2>\n<div>\n<dl><dt>\n<div>\n    <img /></div><div><figcaption><span><i></i> Don’t let your pads get like this if you want to stop effectively.</span></figcaption><span> <i>Ben Delaney / Immediate Media</i></span></div>\n<p><span>As a very general guide, you should replace your disc brake pads once the layer of braking material reaches 1.5mm or less in thickness.</span></p>\n<p>How quickly that happens depends on the sort of riding you do and the conditions in which you ride, as well as the composition of the braking material.</p>\n<p>Wet and dirty conditions will wear pads much quicker than dry conditions – you may even need to take a replacement set with you on exceptionally long rides and swap them out mid-ride. In dry conditions, you’re likely to get a much longer life from a set of pads.</p>\n<p>More extreme riding, such as <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-downhill-mountain-bikes/\">downhill mountain biking</a>, will wear through pads more quickly than mellower cross-country mountain biking or general road riding.</p>\n<p>You can also get uneven pad wear if they’re not aligned correctly with the rotor – or they might rub the rotor when not in use. We’ve got a separate article on pad alignment and <a href=\"https://www.bikeradar.com/advice/workshop/are-your-disc-brakes-rubbing-heres-how-to-silence-them/\">how to silence your disc brakes</a>, plus a guide on <a href=\"https://www.bikeradar.com/advice/workshop/how-to-change-the-disc-brake-pads-on-your-bike/\">how to replace disc brake pads</a>.</p>\n<p>When it comes to pad wear, you definitely don’t want to reach the point where there’s metal-on-metal contact between the pad’s support and the rotor because this will not only reduce braking performance but also quickly damage the rotor.</p>\n<h2>What disc brake pads do you need for your bike?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Sintered (left) and organic (right) brake pads are the most common.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>Like many bike components, disc brake pads come in a range of shapes and sizes to fit different brake models, so the sassy answer is “the ones that fit your brakes”.</p>\n<p>But there’s more to pad choice than that because pads can be made from a range of different materials. The best option for you depends on the type of riding you’re doing.</p>\n<p>Pads can be either organic, sintered or semi-metallic and we’ll run through the pros and cons of each.</p>\n<h3>Organic disc brake pads</h3>\n<p>Organic disc brake pads are generally made up of Kevlar, rubber and silica, bound together with resin.</p>\n<p>If you’re offended by noisy brakes, organic pads are for you. Also referred to as resin pads, they’re the quietest option. They also give you sharper braking and don’t need to warm up before they start to work well.</p>\n<p>The organic compound helps to insulate the pad from the caliper, so more heat stays in the rotor and less is transferred to the brake fluid, although they’re more prone to fade under prolonged braking.</p>\n<p>An organic pad will also wear out more quickly than other options, so you’ll need to change your pads more frequently. They don’t like dirty or wet riding much either and they can glaze over, so you might need to <a href=\"https://www.bikeradar.com/features/tools-and-tricks-for-trouble-free-disc-braking/\">recondition the pads</a>.</p>\n<p>Organic pads are a good option for less extreme riding in dry conditions, so they work well for summer use on <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">road bikes with disc brakes</a> and XC mountain biking, particularly if you live somewhere relatively flat and aren’t riding technical descents with lots of braking.</p>\n<section><div>\n        \n<dl><dt><strong>Pros</strong>\n<ul><li>Sharper initial braking response</li>\n<li>Quick to bed-in</li>\n<li>Excellent initial bite, especially at low temperatures</li>\n<li>Quieter</li>\n</ul><p><strong>Cons</strong></p>\n<ul><li>Faster wear</li>\n<li>Degraded performance and faster wear when conditions are wet or dirty</li>\n<li>Braking power fades at high temperatures</li>\n<li>Can glaze over</li>\n</ul></dt>\n</dl><p>\n\n    </p></div>\n    </section><h3>Sintered disc brake pads</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Sintered brake pads cope better with wet and muddy conditions.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<p>Sintered, or metallic, brake pads are made of a mixture of metallic particles pressed together.</p>\n<p>They are more durable than organic pads and should last longer because they can handle dirt and damp conditions a lot better.</p>\n<p>Sintered brake pads will keep working well at higher temperatures too, although the metal content tends to transfer more heat to the brake fluid in the caliper than an organic pad.</p>\n<p>However, sintered brake pads need a while to warm up before they start to work at their best and are also much more likely to be noisy.</p>\n<p>Sintered disc brake pads are a good option if your riding is on the more extreme side, such as downhill or <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-enduro-bikes/\">enduro mountain biking</a>, or if you frequently ride in muddy conditions.</p>\n<section><div>\n        <dl><dt><strong>Pros</strong>\n<ul><li>Longer lasting</li>\n<li>Strong stopping power under extreme braking</li>\n<li>More consistent in wet and dirty conditions</li>\n<li>Can handle higher temperatures</li>\n<li>Not prone to glazing</li>\n</ul><p><strong>Cons</strong></p>\n<ul><li>Take longer to bed-in</li>\n<li>More prone to transfer heat to calipers</li>\n<li>More likely to be noisy</li>\n</ul></dt>\n</dl><p>\n\n    </p></div>\n    </section><h3>Semi-metallic disc brake pads</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Semi-metallic pads offer a balance of stopping power and durability.</span></figcaption><span> <i>James Huang / Immediate Media</i></span></div>\n<p>Semi-metallic pads look to combine the advantages of both organic and sintered brake pads.</p>\n<p>They’re made of an organic compound but incorporate metal particles to increase durability.</p>\n<p>Other advantages include better ultimate stopping power than organic pads on long descents paired with quicker warm-up than sintered.</p>\n<p>Like organic pads, they’re prone to glazing and they’re often the most expensive option. They’re not as quiet as organic pads either.</p>\n<p>They’re a good all-round option for road riders and XC mountain bikers because they’ll work well in the wet or dry, without sacrificing too much longevity.</p>\n<section><div>\n        <dl><dt><strong>Pros</strong>\n<ul><li>More durable and better wet-weather performance than organic</li>\n<li>More predictable power than sintered pads</li>\n<li>Don’t take as long to warm up as sintered</li>\n</ul><p><strong>Cons</strong></p>\n<ul><li>More expensive than other options</li>\n<li>Can be prone to glazing</li>\n</ul></dt>\n</dl><p>\n\n    </p></div>\n    </section><h2>Swapping pad compounds</h2>\n<p>It can be worth experimenting with pads and pad composition, rather than just replacing like with like. You might want to change pads between summer and winter too, opting for the increased power and quieter performance of organic pads in the summer, and the durability of sintered in the winter.</p>\n<p>You can also mix-and-match brake pads, using a longer-lasting sintered or semi-metallic pad at the rear and an organic one at the front.</p>\n<p>The organic front pad will give you more stopping power, but at the expense of greater wear. Rear brake stopping power doesn’t need to be as great as at the front and the harder pad should last longer and be more weather-resistant.</p>\n<p>For optimum performance, when you change pad compounds you should swap brake rotors too, because the new pads won’t grip as well on the layers of material laid down by the previous pads.</p>\n<p>Keeping the same rotors won’t be a disaster, though – it’ll just take the new pads longer to bed in.</p>\n<p>Read our guide on <a href=\"https://www.bikeradar.com/advice/workshop/how-to-bed-in-new-disc-brake-pads/\">how to bed in disc brake pads</a> for more information.</p>\n<h2>Other factors to consider</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> SwissStop Exotherm pads use a semi-metallic compound and incorporate cooling fins in their backing plates to up heat dissipation.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>It’s also worth considering the backing material used on brake pads. You may not have a choice in this, but some brands make pads with either alloy or steel backing plates – the former saving you a couple of grams and sometimes coming with claims of better heat dissipation.</p>\n<p>Titanium-backed pads are also available, most notably with Shimano’s XTR brakes, stepping things up once again.</p>\n<p>It’s also increasingly common to see disc brake pads with built-in cooling fins, popularised by Shimano with its Ice-Tech pads and said to improve braking performance by using airflow to quickly move heat away from the pad surface.</p>\n<p>A number of other brands, including SwissStop and Superstar, offer similar designs.\n</p></dt></dl></div>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"fd869f35ff5e1fb322cd3aafc83dcc42deaaab0967c10ec05d810501d58d0870","category":"Cycling"}