{"title":"Apple Watch Series 7 Orders Start This Friday, and a Bonus Spitball Theory About the Much-Rumored Flat-Sided Design","link":"https://www.apple.com/newsroom/2021/10/apple-watch-series-7-orders-start-friday-october-8/","date":1633355840000,"content":"\n<p>Apple Newsroom:</p>\n\n<blockquote>\n  <p>Apple today announced Apple Watch Series 7, featuring the largest\nand most advanced Apple Watch display ever — and a reengineered\nAlways-On Retina display with significantly more screen area and\nthinner borders — will be available to order beginning Friday,\nOctober 8, at 5 a.m. PDT and available in stores starting Friday,\nOctober 15.</p>\n</blockquote>\n\n<p>So the Series 7 watches are only shipping three weeks after the iPhones 13. Not bad, but let’s see how supply-constrained they are.</p>\n\n<p>While I’m writing about Apple Watch, let me put on the record my theory about the flat-sides industrial design <a href=\"https://daringfireball.net/linked/2021/09/14/prosser-flat-edge-watch\">that a slew of rumor guys claimed was coming for Series 7</a>, but in fact, did not. (I put forth this theory on <a href=\"https://daringfireball.net/thetalkshow/2021/09/30/ep-324\">the latest episode of The Talk Show</a>, with guest Jason Snell.)</p>\n\n<p>My guess is that the flat-sided design is real, and it’s making its way through Apple’s supply chain, which is how it leaked. But it clearly was never intended for Series 7 — Series 7 <em>is</em> an altogether different new industrial design. So my theory is that the flat-sided design is for the next-generation Apple Watch SE. The current SE debuted a year ago, alongside the Apple Watch Series 6, so I wouldn’t expect a second-generation SE until, say, April of next year at the earliest, but perhaps more likely a year from now, alongside the Series 8 models.</p>\n\n<p>The problem, from a product marketing perspective, with the existing Apple Watch SE is that it <em>looks</em> exactly like a Series 6. With the iPhones, the SE models always look older — the original SE looked like an iPhone 5/5S (when the new models had moved to the bigger iPhone 6/7/8 sizes), and the second-gen SE looks like an iPhone 6/7/8 (while the new models are now all derived from the iPhone X design).</p>\n\n<p>There is no “old” industrial design for Apple Watch SE to follow that is distinguishable at a mere glance as a lower-cost budget model. The flat-sided look would do that. I’m not saying the flat-sided design would look bad, per se, but I am convinced that — if it ever does ship — it will look more utilitarian. It’s not a premium design. It’s plain.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/10/04/watch-series-7-preorders-plus-flat-sided-spitball\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"fd8e15b0783926fdb5cde1efcc5744f9e268b249bee4a7839d95e7ec0d97b81f","category":"Tech"}