{"title":"Effect of biofloc technology in Farfantepenaeus aztecus culture: The optimization of dietary protein level on growth performance, digestive enzyme activity, non‐specific immune response, and intestinal microbiota","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13041?af=R","date":1700019093000,"content":"<h2>Abstract</h2>\n<p>In this study, a biofloc technology (BFT) based 90-day feeding trial was performed to estimate the effects of four different dietary protein levels (290, 320, 350 and 380 g protein kg<sup>−1</sup> diet; 29P, 32P, 35P, and 38P, respectively) on growth performance, digestive enzyme activity, non-specific immune response, whole-body proximate and fatty acid composition and intestinal microbiota of <i>Farfantepenaeus aztecus</i>. Final weight, weight gain, and specific growth rate improved with protein levels up to 35P per kg of diet, below which decreased significantly. Significant differences were observed in total hemocyte count, acid phosphatase, respiratory burst, glutathione, alkaline phosphatase, and total antioxidant capacity indices of shrimp fed different dietary protein levels. Protease, lipase, and amylase activities of shrimp were also affected by dietary protein levels. Proteobacteria was the most abundant bacteria among the groups. Overall, this study revealed that using 35% dietary protein is optimal in <i>F. aztecus</i> culture under environmentally friendly BFT conditions. Furthermore, these results provide a theoretical basis for future research on the evaluation of functional ingredients in diet for more economical production of <i>F. aztecus</i> at optimal protein levels.</p>","author":"Ercument Genc, \nDogukan Kaya, \nMunevver Ayce Genc, \nEmre Keskin, \nHijran Yavuzcan, \nDerya Guroy, \nAhmet Gurler, \nKoray Umut Yaras, \nAtakan Pipilos, \nBerna Funda Ozbek, \nBilgenur Harmansa Yilmaz, \nMevlut Aktas","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"fd92155637b84643f8a520678211bd7f195c7148e0e4e2b18117faf941883490","category":"Environment"}