{"title":"Proteomics analysis of deep fascia in acute compartment syndrome","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305275","date":1719842400000,"content":"<p>by Haofei Wang, Yan Liu, Sujuan Xu, Tao Wang, Xiaojun Chen, Huiyang Jia, Qi Dong, Heng Zhang, Shuai Wang, Huijie Ma, Zhiyong Hou</p>\r\n\r\nAcute compartment syndrome (ACS) is a syndrome in which local circulation is affected due to increased pressure within the compartment. We previously found in patients with calf fractures, the pressure of fascial compartment could be sharply reduced upon the appearance of tension blisters. Deep fascia, as the important structure for compartment, might play key role in this process. Therefore, the aim of the present study was to examine the differences in gene profile in deep fascia tissue in fracture patients of the calf with or without tension blisters, and to explore the role of fascia in pressure improvement in ACS. Patients with lower leg fracture were enrolled and divided into control group (CON group, n = 10) without tension blister, and tension blister group (TB group, n = 10). Deep fascia tissues were collected and LC-MS/MS label-free quantitative proteomics were performed. Genes involved in fascia structure and fibroblast function were further validated by Western blot. The differentially expressed proteins were found to be mainly enriched in pathways related to protein synthesis and processing, stress fiber assembly, cell-substrate adhesion, leukocyte mediated cytotoxicity, and cellular response to stress. Compared with the CON group, the expression of Peroxidasin homolog (PXDN), which promotes the function of fibroblasts, and Leukocyte differentiation antigen 74 (CD74), which enhances the proliferation of fibroblasts, were significantly upregulated (<i>p</i> all &lt;0.05), while the expression of Matrix metalloproteinase-9 (MMP9), which is involved in collagen hydrolysis, and Neutrophil elastase (ELANE), which is involved in elastin hydrolysis, were significantly reduced in the TB group (<i>p</i> all &lt;0.05), indicating fascia tissue underwent microenvironment reconstruction during ACS. In summary, the ACS accompanied by blisters is associated with the enhanced function and proliferation of fibroblasts and reduced hydrolysis of collagen and elastin. The adaptive alterations in the stiffness and elasticity of the deep fascia might be crucial for pressure release of ACS.","author":"Haofei Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fd9246ecd05c21454eeac697460a72bec7d77d20194b2a120957333999c049ee","category":"Interdisciplinary"}