{"title":"The role of diabetic foot treatment in improving left ventricular function: Insights from global longitudinal strain echocardiography","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299887","date":1711720800000,"content":"<p>by Mohammad Taghi Ashoobi, Hosein Hemmati, Maziar Moayerifar, Mani Moayerifar, Mahboobeh Gholipour, Mahsa Motiei, Mohammad Ali Yazdanipour, Habib Eslami Kenarsari</p>\r\n\r\nWe decided to evaluate the effect of treatment of diabetic foot ulcers in improving heart function by strain echocardiography than conventional transthoracic echocardiography. This prospective cross-sectional study included patients with diabetic foot ulcer (DFU). Conventional and two-dimensional strain echocardiography performed before and after three months diabetic foot treatment. Then, we compared the echocardiographic parameters including left ventricular ejection fraction (LV-EF), left ventricular global longitudinal strain (LV-GLS). Multivariate and univariate logistic regression analysis were performed to find which variable was mainly associated with LV-GLS changes. 62 patients with DFU were conducted. After echocardiography, all patients underwent surgical or non-surgical treatments. Three months after the treatment, LV-EF was not significantly different with its’ primary values (P = 0.250), but LV-GLS became significantly different (P&lt;0.05). In the multivariate logistic regression analysis, with the increase in the grade of ulcer, LV-GLS improved by 6.3 times. Not only the treatment of DFU helps to control adverse outcomes like infection, limb loss and morbidity but also it enhances cardiac function. Of note, strain echocardiography found to be a better indicator of myocardial dysfunction than LV-EF. These findings make a strong reason for the routine assessment of cardiac function in patients with DFU.","author":"Mohammad Taghi Ashoobi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fd98cbe53b18643875fa4b00196f7c23df46565d4a1bf72f436d9e6a1fc6fe25","category":"Interdisciplinary"}