{"title":"Introducing the first AWS Security Heroes","link":"https://aws.amazon.com/blogs/aws/introducing-the-first-aws-security-heroes/","date":1690915225000,"content":"<p>The <a href=\"https://aws.amazon.com/developer/community/heroes/\" target=\"_blank\">AWS Heroes</a> program recognizes individuals who combine their deeply technical expertise with a passion for helping others to learn more and build faster. Over the years, trends have evolved in how the community develops and deploys solutions built on AWS, which has influenced the creation of specialized Hero categories. Today, we’re thrilled to officially recognize and acknowledge leaders in the security area of focus.</p> \n<p>Security is often looked at in terms of impact and not how it enables teams to safely innovate. Our inaugural <strong>AWS Security Heroes</strong> have shown time and time again that a pragmatic approach, executed with the intent to inform and educate, delivers positive security outcomes. The initial cohort of AWS Security Heroes are experts at the forefront of their field, and share a mission to help others better understand security.</p> \n<p><strong>Please join us in welcoming our first AWS Security Heroes!</strong></p> \n<h2>Chris Farris – Atlanta, USA</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/chris-farris\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/27/headshot_chris_farris_175x263.png\" width=\"175\" height=\"263\" /></a>Security Hero <a href=\"https://aws.amazon.com/developer/community/heroes/chris-farris\" target=\"_blank\">Chris Farris</a> has worked in IT since 1994, primarily focused on Linux, networking, and security. For the past eight years, he has been deeply involved in public cloud and public cloud security in media and entertainment, leveraging his expertise to build and evolve cloud security programs at Turner Broadcasting, WarnerMedia, Discovery Communications, and PlayOn! Sports. His current focus is on educating and empowering builders to understand core cloud security concepts, and to enable small and medium sized organizations to better secure and govern in the cloud.</p> \n<h2>Gerardo Castro – Callao, Perú</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/gerardo-castro\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/27/headshot_gerardo-castro_175x263.png\" width=\"175\" height=\"263\" /></a> Security Hero <a href=\"https://aws.amazon.com/developer/community/heroes/gerardo-castro\" target=\"_blank\"> Gerardo Castro</a> is a Security Solutions Architect at Caleidos. He likes to write technical posts and talk about cybersecurity on his Medium blog. He also builds and leads videos, podcasts, online classes, and workshops focused on AWS. In addition, Gerardo is a community leader of the AWS UG Security Community in Latin America, and has inspired many people to begin and grow their career in the cloud.</p> \n<h2>Keisuke Usuda – Chiba, Japan</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/keisuke-usuda\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/27/headshot_keisuke_usuda_175x263.png\" width=\"175\" height=\"263\" /></a> Security Hero <a href=\"https://aws.amazon.com/developer/community/heroes/keisuke-usuda\" target=\"_blank\"> Keisuke Usuda</a> is a Senior Solution Architect at Classmethod and holds the CISSP certification. He is also a core member of the Japan AWS User Group focused on security (Security-JAWS), and regularly organizes events. Keisuke has a deep affection for AWS security-related managed services, and advocates for the enablement of Amazon GuardDuty across all AWS accounts worldwide.</p> \n<h2>Ray Lin (Chia-Wei Lin) – Taipei, Taiwan</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/ray-lin\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/27/ray-lin_175x263.png\" width=\"175\" height=\"263\" /></a>Security Hero <a href=\"https://aws.amazon.com/developer/community/heroes/ray-lin\" target=\"_blank\"> Ray Lin</a> is an AWS and Security Consultant at iFUS System Consultants Ltd., and excels in building teams and developing new products from zero to one. His primary expertise spans software project management, Agile development, business and system analysis, SaaS product development, architecture design, cybersecurity, DevSecOps, and AI. Ray has also made significant contributions to the AWS community, particularly in cybersecurity and secure architecture design. His commitment to sharing knowledge is evident in his active involvement in the AWS User Group Taiwan.</p> \n<h2>Shun Yoshie – Yokohama, Japan</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/shun-yoshie\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/03/10/shun_yoshie.jpg\" width=\"175\" height=\"263\" /></a>Security Hero <a href=\"https://aws.amazon.com/developer/community/heroes/shun-yoshie\" target=\"_blank\">Shun Yoshie</a> is a Security Consultant at Nomura Research Institute, Ltd(NRI), and has been a Hero since 2021. He consults on operational design of security in multi-cloud environments, and has been focusing on themes related to multi-cloud, Cloud Native, CNAPP, and Security Observability. Additionally, Shun joined the Japanese AWS User Group (JAWS-UG) in 2013, and he has been running the JAWS-UG Tokyo chapter since 2019.</p> \n<h2>Teri Radichel – Savannah, USA</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/teri-radichel\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/07/27/teri-radichel_headshot_175x263.png\" width=\"175\" height=\"263\" /></a> Security Hero <a href=\"https://aws.amazon.com/developer/community/heroes/teri-radichel\" target=\"_blank\"> Teri Radichel</a> is the CEO of 2nd Sight Lab, a cybersecurity company that offers three services: cloud security training to organizations, penetration tests, and security assessments. She also answers cybersecurity questions for clients on consulting calls scheduled through IANS Research. Teri is the author of the book, “Cybersecurity for Executives in the Age of Cloud,” has been a Hero since 2016, and received the SANS 2017 Difference Makers Award for security innovation. Teri has 13 cybersecurity and pentesting certifications, including the GSE, which required a two-day hands-on in person test to pass at the time she obtained it.</p> \n<h2>Learn More</h2> \n<p>If you’d like to learn more about the new Security Hero category or connect with a Hero near you, please visit the <a href=\"https://aws.amazon.com/developer/community/heroes/\" target=\"_blank\"> AWS Heroes website</a> or browse the <a href=\"https://aws.amazon.com/developer/community/heroes/content-library/\" target=\"_blank\">AWS Heroes Content Library</a>.</p> \n<p>— <a href=\"https://twitter.com/taylorjacobsen\" target=\"_blank\">Taylor</a></p>","author":"Taylor Jacobsen","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"fd9853f9f0031d7670b465601be3fb931e0565b9e1dfba235ddf2eea0b3325bf","category":"Tech"}