{"title":"Fast & furious: Rejecting the hypothesis that secondary psychopathy improves reaction time-based concealed information detection","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311948","date":1729000800000,"content":"<p>by Imbar Mizrahi, Nathalie klein Selle</p>\r\n\r\nDeception, a complex aspect of human behavior, is inherently difficult to detect directly. A valid alternative involves memory detection, particularly through methods such as the Reaction-Time based Concealed Information Test (RT-CIT). The RT-CIT assesses whether an individual possesses specific knowledge by presenting various probe (familiar) items amidst irrelevant (unfamiliar) items. The task-required \"unfamiliar\" response to probes may induce a response conflict. Resolving this conflict, by inhibiting the automatic \"familiar\" response, takes time and slows probe RTs–a phenomenon known as the RT-CIT effect. Notably, secondary psychopathy is characterized by disinhibition and impulsivity, traits which may hinder the ability to effectively manage experienced conflict. Therefore, we hypothesized that secondary psychopathy would be associated with an elevated RT-CIT effect. To investigate this hypothesized relation, we conducted a pre-registered study (<i>n</i> = 86, student sample), employing a novel CIT paradigm that incorporates no-go trials to assess response inhibition capacity. Psychopathic traits were measured using the Levenson Self-Report Psychopathy (LSRP) scale, while the Barratt Impulsiveness Scale (BIS-11) assessed impulsivity. The novel CIT paradigm revealed impressive detection efficiency. However, contrary to our expectations, we observed no significant correlation between the RT-CIT effect and secondary psychopathic traits (BF<sub>01</sub> = 6.98). This cautiously suggests that while secondary psychopathic tendencies do not improve RT-CIT validity, they also do not compromise it. Although future investigations should explore more diverse contexts and populations, this tentative finding is reassuring and underscores the robustness of the CIT paradigm.","author":"Imbar Mizrahi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fd9a6210c1aa6a9efe50d8e6031f80a96aa3fe166267a98b69a985bc21457a8b","category":"Interdisciplinary"}