{"title":"Pesticides&rsquo; Mode of Action on Aquatic Life","link":"https://www.preprints.org/manuscript/202407.0314/v2","date":1724218503000,"content":"Pesticides are chemical compounds or mixtures of hazardous substances that are used by humans to increase and protect crops from pests and control disease-carrying insects. Because of its wide use, it may be poisonous to helpful and non-targeting plants and animals. Spraying or spreading pesticides over whole fields of crops can cause runoff to transfer the chemicals into aquatic ecosystems, and wind can carry the chemicals to nearby grazing regions, farms, and populated areas, where they can endanger other animals. This review summarises recent studies on pesticide combination toxicity to aquatic biota and approaches used to anticipate toxic effects. When toxicants harm economically significant organisms that humans consume, the negative effects become more severe and can cause stress conditions, vital organ damage, biochemical damage, or even the death of living things in both terrestrial and aquatic environments. Pesticides are highly toxic to aquatic organisms such as snails, fish, etc. Neurological dysfunction in freshwater organisms is also caused by pesticides. By producing excessive ROS, pesticides can cause severe biochemical and histological changes in freshwater organisms. So, it is therefore easy to understand the attention of the public on these substances. Because aquatic organisms play a major part in the food chain. However, through the biomagnification process, the quantity of pesticides increases in the higher organisms through the food chain. Which results play a terrific role in the higher organism’s body. So, It's essential to comprehend the way that insecticides work on aquatic organisms. In this review article, we are focusing on the way that pesticides work, which will help in the system of biomonitoring.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fd9e73a7935356984ae3b752efe345f35d0387720afb4657e666e17734c42db0","category":"Interdisciplinary"}