{"title":"Sharing How HashiCorp Works","link":"https://www.hashicorp.com/blog/sharing-how-hashicorp-works","date":1615878000000,"content":"<p><span>Today we're excited to introduce </span><a href=\"https://works.hashicorp.com\"><span>How HashiCorp Works</span></a><span>, a website dedicated to sharing the practices that make HashiCorp, HashiCorp. Every organization has implicit cultural norms and working practices. How HashiCorp Works started as an internal resource to document these practices to help new employees be successful. This encouraged us to make the implicit explicit and turn siloed knowledge into knowledge that could be used by anyone across our organization. </span></p>\n<p></p>\n<p><span>We often get asked to share these working practices externally, so today we're \"open sourcing\" How HashiCorp Works. We look to other companies’ systems and processes as inspiration material for our own, and open sourcing our own various practices is our way of paying it forward. We recommend that other organizations use How HashiCorp Works as inspiration to find the aspects that make sense for their settings. Every organization is different. </span></p>\n<p></p>\n<p><span>Within How HashiCorp Works you'll find documentation on everything from setting up a successful at-home work environment to participating in HashiCorp's writing culture for making decisions. With over 1,100 HashiCorp employees working together all over the world, we are committed to helping all team members learn our individual, team, and company-wide best practices. Thank you to all the HashiCorp employees who shared their perspectives and whose quotes are used throughout the guides.</span></p>\n<p></p>\n<p><span>Readers will notice that some of the guides reference internal documents; we decided to keep those references to maintain the same document for both internal and external readers. Those internal documents don't provide much additional information, just more HashiCorp-specific prescription, so external readers aren't missing key content by not having access. </span></p>\n<p></p>\n<p><span>We'll update the guides in How HashiCorp Works every year, as our practices are always evolving. If you have feedback, questions, or want to learn more, you can reach us at <a href=\"mailto:hhw@hashicorp.com\">hhw@hashicorp.com</a>.</span></p>","author":"Kevin Fishner","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"fd9f99e9737a724d4901f7647cb2d3a153fdabf42bd61509601587554c4053fa","category":"Tech"}