{"title":"Distribution of quetiapine between serum and whole blood in therapeutic drug-monitoring specimens","link":"https://academic.oup.com/jat/article/48/3/180/7614074?rss=1","date":1708905600000,"content":"<span><div>Abstract</div>Quetiapine use is on the rise, leading to a corresponding increase in acute intoxications, some of which have fatal outcomes. When assessing whole-blood quetiapine concentrations during forensic autopsies, interpretations are primarily based on toxicity data from studies of serum concentrations. To our knowledge, there are only two previous studies that have attempted to establish the ratio between whole blood and serum quetiapine concentrations with limited populations and high variability of results. Paired specimens of whole blood and serum from 16 quetiapine users recruited from the Psychiatric Clinic, St. Olav University Hospital were analyzed using LC–MS-MS. Quetiapine concentrations in both matrices were determined and compared. The mean blood:serum ratio of quetiapine was 0.74 (standard deviation (SD) = 0.05, 95% confidence interval (CI) 0.71–0.76, <span>P</span> &lt; 0.001), range 0.66–0.85. Simple linear regression showed strong linear correlation between quetiapine concentrations in the two matrices (B = 0.774, <span>P</span> &gt; 0.001, <span>r</span> = 0.999). Our results imply that quetiapine occurs at lower concentrations within erythrocytes than in plasma. This is most likely due to a high degree of plasma protein binding. Other factors which may influence the distribution of quetiapine between these compartments are solubility, metabolism and passive or active efflux mechanisms. We did not observe any covariation between blood:serum ratios and serum concentrations. Quetiapine was consistently present at lower concentrations in whole blood than in serum. If so inclined to, a conversion factor of ∼0.7 may be considered for extrapolation of concentrations from serum to whole blood, at least in cases with therapeutic quetiapine concentration levels.</span>","author":"","siteTitle":"Journal of Analytical Toxicology Current Issue","siteHash":"684cff8c881f5537e121ec409f4017c5ba6630e2a004f9595c9e918ac4254c23","entryHash":"fda68a030ee1506017dda532ee93e1fc4ad0ecf78844195bc27920e0452817f0","category":"Environment"}