{"title":"AWS ExecLeaders Data and Generative AI Day: Fueling Business Growth with Data and Generative AI","link":"https://aws.amazon.com/blogs/aws/aws-execleaders-data-and-generative-ai-day-fueling-business-growth-with-data-and-generative-ai/","date":1696514822000,"content":"<p>Join us on Thursday, October 5, 2023, for a free-to-attend online event, <a href=\"https://pages.awscloud.com/NAMER-event-LS-Data-Generative-AI-2023-reg-event.html?trk=1fbae26b-1fb2-4bb6-aae1-016b37f578cb&amp;sc_channel=el\">Data and Generative AI Day</a>. AWS will stream the event simultaneously across multiple platforms, including <a href=\"https://www.linkedin.com/showcase/aws-on-air/\">LinkedIn Live</a> and <a href=\"https://www.youtube.com/c/AWSEventsChannel/featured\">YouTube</a>.</p> \n<p>In the realm of generative AI, the power and potential hidden within your organization’s data are more expansive than ever before. Generative AI has the capability to reshape customer interactions, elevate employee productivity, stimulate creative ideation, and drive groundbreaking innovation. However, as a forward-thinking leader, what steps are required to fully harness this data-driven potential and translate it into tangible outcomes?</p> \n<p>During this half-day event, AWS experts, partners, customers, and leading startups will provide you insights into their efforts to propel innovation using data and generative AI within the ever-evolving landscape of today. You shall find practical guidance from industry leaders on how to navigate the diverse spectrum of opportunities and challenges presented by this transformative technology, all while gaining a glimpse into what the future holds in store.</p> \n<p>Here are some of the highlights you can expect from this event.</p> \n<p><a href=\"https://www.linkedin.com/in/swaminathansivasubramanian/\">Swami Sivasubramanian</a>, VP, Database, Analytics, and ML at AWS, will kick oﬀ the event with a keynote session where he will share the blueprint to democratize data and AI for business leaders. Swami will share how leaders can usher in the right mindset, strategy, and tools to translate the promise of generative AI into real business value.</p> \n<p><a href=\"https://www.linkedin.com/in/tomgodden/\">Tom Godden</a>, Director of Enterprise Strategy at AWS, will explore practical strategies for leveraging generative AI to drive business outcomes. He will share the frameworks for identifying opportunities to pilot generative AI across your organization and provide business leaders with a timely understanding of how to employ these powerful emerging capabilities.</p> \n<p><a href=\"https://www.linkedin.com/in/gsankaran/\">Gopinath Sankaran</a>, Vice President, Strategic Cloud Ecosystems at Informatica, will share insights on the impact of generative AI on data management and explore how Informatica’s AI-powered Intelligent Data Management Cloud and AWS AI and Analytics services can power a new wave of insights and experiences.</p> \n<p><a href=\"https://www.linkedin.com/in/diegosaenz2010/\">Diego Saenz</a>, Managing Director of Data &amp; AI at Deloitte, and Jojy Matthew, Principal, Global Financial Services Industry (GFSI) Data, Analytics, &amp; AI at Deloitte, will share what a well-crafted data strategy means to generative AI success. Diego will share practical advice on assessing if your data estate is ready for leveraging generative AI and driving business outcomes.</p> \n<p>You will hear from AWS leaders and AWS customers FOX, Salesforce, and Booking.com, as they share their data and generative AI journeys and explain how you can leverage this transformational technology to re-imagine your customer and employee experiences.</p> \n<p><a href=\"https://pages.awscloud.com/NAMER-event-LS-Data-Generative-AI-2023-reg-event.html\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/09/17/2023-09-17_14-07-01.png\" alt=\"Data &amp; Generative AI Day\" width=\"1474\" height=\"598\" /></a></p> \n<p>You can add an event reminder to your calendar by registering on the <a href=\"https://pages.awscloud.com/NAMER-event-LS-Data-Generative-AI-2023-reg-event.html?trk=1fbae26b-1fb2-4bb6-aae1-016b37f578cb&amp;sc_channel=el\">event page</a>.</p> \n<p>See you there.</p> \n<p>— Irshad</p>","author":"Irshad Buchh","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"fdaecc11592bb12c9bbbdb2376efc0b249fc06f2234a3f46abe8666a736ddd4d","category":"Tech"}