{"title":"Lung Microbiome in Lung Cancer: Composition and Influence &ndash; A Systematic Review of Randomised and Non-randomised Trials","link":"https://www.preprints.org/manuscript/202409.1080/v1","date":1726276112000,"content":"To date, the percentage composition of the lung microbiome in bronchopulmonary cancer has not been summarized. Existing studies on identifying the lung microbiome in bronchopulmonary cancer through 16S rRNA sequencing have shown variable results regarding the abundance of bacterial taxa.\nObjectives: To identify the predominant bacteria in the lung microbiome of bronchopulmonary cancer from samples collected through bronchoalveolar lavage and to assess their potential role in the diagnosis of bronchopulmonary cancers.\nData Sources: A systematic review of English articles using MEDLINE, Embase, and Web of Science. Search terms included lung microbiome, lung cancer, bronchoalveolar lavage.\nStudy Selection: Randomized clinical trials that investigated the lung microbiome in bronchopulmonary cancer with samples collected via bronchoalveolar lavage.\nData Extraction: Independent extraction of articles using predefined data fields, including study quality indicators.\nData Synthesis: Nine studies met the inclusion criteria, focusing on those that utilized a percentage expression of the microbiome at the phylum or genus level. There was noted heterogeneity between studies, both in terms of phylum and genus, with a relatively constant percentage of the Firmicutes phylum and the genera Streptococcus and Veillonella being mentioned. Significant differences were also observed regarding the inclusion criteria for study participants, the method of sample collection, and data processing.\nConclusions: To date, there is no consistent percentage pattern at the phylum or genus level in bronchopulmonary cancer, with the predominance of a phylum or genus varying across different patient cohorts, resulting in non-overlapping outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fdb1ccc9311ca96542168268f53461c2ec6925ffbadfdbe87c0b3ac8484f2003","category":"Interdisciplinary"}