{"title":"Neighborhood poverty and hopelessness in older adults: The mediating role of perceived neighborhood disorder","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311894","date":1729000800000,"content":"<p>by Yeon Jin Choi, Eun Young Choi, Jennifer A. Ailshire</p>\r\n\r\nHopelessness is one of the strongest predictors of health and mortality, particularly for older populations. Prior research has found associations between individual-level socioeconomic factors and hopelessness, but less is known about the potential importance of neighborhood-level socioeconomic contexts for hopelessness. In particular, the role of neighborhood disorder as a potential explanatory factor for poor psychological well-being remains underexplored. This study investigates whether neighborhood poverty is associated with a sense of hopelessness among older adults and if perceived neighborhood disorder mediates the link between poverty and hopelessness. Individual-level data came from the 2014/2016 Health and Retirement Study and were merged with neighborhood-level poverty data from the 2012–2016 and 2014–2018 American Community Survey. Linear regression models were employed to examine the association between neighborhood poverty, disorder, and hopelessness. Respondents in neighborhoods with higher poverty levels reported a greater sense of hopelessness (b = 0.11, 95% CI = 0.08, 0.15, <i>p</i> &lt; .001), controlling for individual-level sociodemographic and health characteristics. Greater perceived neighborhood disorder was also positively associated with a sense of hopelessness (b = 0.16, 95%CI = 0.14, 0.18). When we included both neighborhood poverty and disorder in the same model, the association between neighborhood poverty and hopelessness was reduced by two thirds (b = 0.04, 95%CI = 0.0003, 0.07), while the association between perceived disorder and hopelessness remained robust (b = 0.16, 95%CI = 0.14, 0.18). We further examined the formal mediating effects of neighborhood disorder using structural equation modeling. The total effect of neighborhood poverty on hopelessness was significant (β = 0.08, bootstrapped 95%CI = 0.05, 0.10). The direct effect of neighborhood poverty was not significant (β = 0.02, bootstrapped 95% CI = -0.01, 0.04), while the indirect effect through neighborhood disorder was significant (β = 0.06, bootstrapped 95% CI = 0.05, 0.07). Neighborhood disorder mediated 75% of the association between neighborhood poverty and hopelessness. In light of these findings, improving neighborhood conditions, such as signs of disorder, may alleviate feelings of hopelessness in older adults residing in impoverished neighborhoods.","author":"Yeon Jin Choi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fdb64cb39006d80cc4698b1e2984aaec031ca350c9e17f53ffedfbe9e8ba68bf","category":"Interdisciplinary"}