{"title":"No A/C? No problem, if buildings copy networked tunnels of termite mounds","link":"https://arstechnica.com/?p=1942139","date":1685128193000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/termite1CROP-800x541.jpg\" alt=\"Part of the egress complex of a mound of Macrotermes michaelseni termites from Namibia\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/termite1CROP.jpg\">Enlarge</a> <span>/</span> Part of the system of reticulated tunnels (egress complex) of a mound of <em>Macrotermes michaelseni</em> termites from Namibia. (credit: D. Andréen)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The mounds that certain <a href=\"https://en.wikipedia.org/wiki/Mound-building_termites\">species of termites</a> build above their nests have long been considered to be a kind of built-in natural climate control—an approach that has intrigued architects and engineers keen to design greener, more energy-efficient buildings mimicking those principles. There have been decades of research devoted to modeling just how these mounds function. A <a href=\"https://www.frontiersin.org/articles/10.3389/fmats.2023.1126974/full\">new paper</a> published in the journal Frontiers in Materials offers new evidence favoring an integrated-system model in which the mound, the nest, and its tunnels function together much like a lung.</p>\n<p>Perhaps the most famous example of the influence of termite mounds in architecture is the <a href=\"https://en.wikipedia.org/wiki/Eastgate_Centre,_Harare\">Eastgate Building</a> in Harare, Zimbabwe. It is the country’s largest commercial and shopping complex, and yet it uses less than 10 percent of the energy consumed by a conventional building of its size because there is no central air conditioning and only a minimal heating system. <a href=\"https://www.mickpearce.com/biomimicry.html\">Architect Mick Pearce</a> famously based his design in the 1990s on the cooling and heating principles used in the region’s termite mounds, which serve as fungus farms for the termites. Fungus is their primary food source.</p>\n<p>Conditions have to be just right for the fungus to flourish. So the termites must maintain a constant temperature of 87° F in an environment where the outdoor temperatures range from 35° F at night to 104° F during the day. Biologists have long suggested that they do this by constructing a series of heating and cooling vents throughout their mounds, which can be opened and closed during the day to keep the temperature inside constant. The Eastgate Building relies on a similar system of well-placed vents and solar panels.</p></div><p><a href=\"https://arstechnica.com/?p=1942139#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1942139&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fdb7271883d6b2ea0116cd1127fd38eb2cf1450553dab02c02258a751077a0ab","category":"Tech"}