{"title":"Photoreceptor-induced sinapate synthesis contributes to photoprotection in Arabidopsis","link":"https://academic.oup.com/plphys/article/196/2/1518/7699120?rss=1","date":1719360000000,"content":"<span><div>Abstract</div>Plants must balance light capture for photosynthesis with protection from potentially harmful ultraviolet (UV) radiation. Photoprotection is mediated by concerted action of photoreceptors, but the underlying molecular mechanisms are not fully understood. In this study, we provide evidence that UV RESISTANCE LOCUS 8 (UVR8) UV-B, phytochrome red, and cryptochrome blue-light photoreceptors converge on the induction of <span>FERULIC ACID 5-HYDROXYLASE 1</span> (<span>FAH1</span>) that encodes a key enzyme in the phenylpropanoid biosynthesis pathway, leading to the accumulation of UV-absorbing sinapate esters in Arabidopsis (<span>Arabidopsis thaliana</span>). <span>FAH1</span> induction depends on the basic leucine zipper transcription factors ELONGATED HYPOCOTYL 5 (HY5) and HY5 HOMOLOG that function downstream of all 3 photoreceptors. Noticeably, mutants with hyperactive UVR8 signaling rescue <span>fah1</span> UV sensitivity. Targeted metabolite profiling suggests that this phenotypic rescue is due to the accumulation of UV-absorbing metabolites derived from precursors of sinapate synthesis, namely, coumaroyl glucose and feruloyl glucose. Our genetic dissection of the phenylpropanoid pathway combined with metabolomic and physiological analyses show that both sinapate esters and flavonoids contribute to photoprotection with sinapates playing a major role for UV screening. Our findings indicate that photoreceptor-mediated regulation of <span>FAH1</span> and subsequent accumulation of sinapate “sunscreen” compounds are key protective mechanisms to mitigate damage, preserve photosynthetic performance, and ensure plant survival under UV.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"fdc4d02bcb74e024ef1c4a1bd780d2ba2264c6c543744170f6b3571e8126654e","category":"Environment"}