{"title":"A DNA-based storage system with files and metadata","link":"https://arstechnica.com/?p=1773723","date":1623787173000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/measuring_stick_standard_for_gene_sequencing_now_available_from_nist-800x584.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/measuring_stick_standard_for_gene_sequencing_now_available_from_nist.jpg\">Enlarge</a> <span>/</span> Fluorescent tagged DNA is the key to a new storage system. (credit: <a href=\"https://www.nist.gov/industry-impacts/accuracy-genetic-testing-technologies\">Gerald Barber, Virginia Tech</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>DNA-based data storage appears to offer solutions to some of the problems created by humanity's ever-growing capacity to create data we want to hang on to. Compared to most other media, DNA offers phenomenal data densities. If stored in the right conditions, DNA doesn't require any energy to maintain the data for centuries. And due to DNA's centrality to biology, we're always likely to maintain the ability to read it.</p>\n<p>But DNA is not without its downsides. Right now, there's no standard method of encoding bits in the pattern of bases of a DNA strand. Synthesizing specific sequences remains expensive. And accessing the data using current methods is slow and depletes the DNA being used for storage. Try to access the data too many times and you have to restore it in some way—a process that risks introducing errors.</p>\n<p>A team from MIT and the Broad Institute has decided to tackle some of these issues. In the process, the researchers have created a DNA-based image-storage system that is somewhere between a file system and a metadata-based database.</p></div><p><a href=\"https://arstechnica.com/?p=1773723#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1773723&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fdca0f9e575ce665ec5f68473f5e000c20de131ae3417f7ac736419972abdeb8","category":"Tech"}