{"title":"When birds of a feather flock together: Severe genomic erosion and the implications for genetic rescue in an endangered island passerine","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13739?af=R","date":1719558000000,"content":"<h2>Abstract</h2>\n<p>The Seychelles magpie-robin's (SMR) five island populations exhibit some of the lowest recorded levels of genetic diversity among endangered birds, and high levels of inbreeding. These populations collapsed during the 20th century, and the species was listed as Critically Endangered in the IUCN Red List in 1994. An assisted translocation-for-recovery program initiated in the 1990s increased the number of mature individuals, resulting in its downlisting to Endangered in 2005. Here, we explore the temporal genomic erosion of the SMR based on a dataset of 201 re-sequenced whole genomes that span the past ~150 years. Our sample set includes individuals that predate the bottleneck by up to 100 years, as well as individuals from contemporary populations established during the species recovery program. Despite the SMR's recent demographic recovery, our data reveal a marked increase in both the genetic load and realized load in the extant populations when compared to the historical samples. Conservation management may have reduced the intensity of selection by increasing juvenile survival and relaxing intraspecific competition between individuals, resulting in the accumulation of loss-of-function mutations (i.e. severely deleterious variants) in the rapidly recovering population. In addition, we found a 3-fold decrease in genetic diversity between temporal samples. While the low genetic diversity in modern populations may limit the species' adaptability to future environmental changes, future conservation efforts (including IUCN assessments) may also need to assess the threats posed by their high genetic load. Our computer simulations highlight the value of translocations for genetic rescue and show how this could halt genomic erosion in threatened species such as the SMR.</p>","author":"Emily L. Cavill, \nHernán E. Morales, \nXin Sun, \nMichael V. Westbury, \nCock van Oosterhout, \nWilna Accouche, \nAnna Zora, \nMelissa J. Schulze, \nNirmal Shah, \nPierre‐André Adam, \nM. de L. Brooke, \nPaul Sweet, \nShyam Gopalakrishnan, \nM. Thomas P. Gilbert","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"fdcb565c5cda15e6480264676f6cdffe393c82dfd20e2dc67df99725b2fd73d6","category":"Environment"}