{"title":"What can we do about ultraprocessed foods?","link":"https://arstechnica.com/?p=1970045","date":1695308634000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/cereal-800x533.jpg\" alt=\"fruit cereal in a bowl\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/cereal.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/fruit-cereal-royalty-free-image/1364639436\">Cathy Scola via Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>From breakfast cereals and protein bars to flavored yogurt and frozen pizzas, ultraprocessed foods are everywhere, filling aisle upon aisle at the supermarket. Fully <a href=\"https://www.sciencedirect.com/science/article/pii/S0022316622110011?via%3Dihub\" target=\"_blank\">58 percent</a> of the calories consumed by adults and <a href=\"https://jamanetwork.com/journals/jama/fullarticle/2782866\" target=\"_blank\">67 percent</a> of those consumed by children in the United States are made up of these highly palatable foodstuffs with their highly manipulated ingredients.</p>\n<p>And ultraprocessed foods are not just filling our plates; they’re also taking up more and more space in global conversations about public health and nutrition. In the last decade or so, researchers have ramped up efforts to define ultraprocessed foods and to probe how their consumption correlates to health: A wave of recent studies have linked the foods to heightened risk for conditions ranging from cardiovascular disease and cancer to obesity and depression.</p>\n<p>Still, some researchers—and perhaps unsurprisingly, industry representatives—question the strength of the evidence against ultraprocessed foods. The category is too poorly defined and the studies too circumstantial, they say. Plus, labeling such a large portion of our grocery carts as unhealthy ignores the benefits of industrial food processing in making food affordable, safe from foodborne pathogens, easy to prepare and in some cases more sustainable—such as through the development of <a href=\"https://pubmed.ncbi.nlm.nih.gov/35325028/\" target=\"_blank\">plant-derived products</a> designed to replace meat and milk.</p></div><p><a href=\"https://arstechnica.com/?p=1970045#p3\">Read 30 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1970045&amp;comments=1\">Comments</a></p>","author":"Knowable Magazine","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"fdde6ce1f71f2725c15cbb4d258ca5f1013f2dc1123f4c7647905500b25abdb9","category":"Tech"}