{"title":"AliveCor Files Antitrust Suit Against Apple for Preventing Third-Party Irregular Heart Rhythm Analysis on Apple Watch","link":"https://www.macrumors.com/2021/05/26/alivecor-apple-watch-antitrust-lawsuit/","date":1622050443000,"content":"AliveCor, a company that that has developed an <a href=\"https://www.macrumors.com/2017/11/30/alivecor-kardia-ekg-band-medical-fda-apple-watch/\">ECG 'KardiaBand' for the Apple Watch</a>, today filed an antitrust lawsuit against Apple that accuses the Cupertino company of \"monopolistic conduct.\"\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2016/03/Kardia-Band-apple-watch.jpg\" />\r\n<br />\r\nAccording to AliveCor, Apple's decision to exclude third-party heart rate analysis providers from the Apple Watch has harmed AliveCor and impacted patients and consumers. To go along with the KardiaBand, AliveCor created the SmartRhythm app, which uses data from the Apple Watch's heart rate algorithm to determine when a heart rate is irregular and suggest people take an ECG with the KardiaBand.\r\n<br />\r\n\r\n<br />\r\nThe KardiaBand received FDA approval in 2017, and in 2018, Apple debuted the Apple Watch Series 4 with built-in ECG capabilities and its own irregular heart rhythm notifications followed. AliveCor claims that Apple saw the success of the KardiaBand and changed the functionality of watchOS to sabotage KardiaBand and \"corner the market for heart rate analysis on Apple Watch.\"\r\n<br />\r\n\r\n<br />\r\nAliveCor claims that the SmartRhythm app was initially allowed in the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, but Apple later claimed that it violated ‌App Store‌ guidelines. AliveCor says that it was forced to adapt SmartRhythm multiple times to adjust to Apple's rules, and then Apple \"made changes to watchOS's heart rate algorithm\" to ensure that SmartRhythm and other competing apps would not work. Apple allegedly changed the heart rate algorithm in watchOS 5 to prevent third-party apps from being able to identify irregular heart rate situations.<blockquote>The algorithm was virtually the same on the first four versions of watchOS, but, with the introduction of the Series 4 Apple Watch and Apple's introduction of its competing heartrate analysis app, Apple released watchOS5, which, among other things, \"updated\" the Watch's heartrate algorithm. That update did not improve the user experience for Apple Watch purchasers; instead, its purpose and effect was simply to prevent third parties from identifying irregular heartrate situations and, thus, from offering competing heartrate analysis apps.</blockquote>Prior to Apple's alleged sabotage, AliveCor says that its SmartRhythm app was \"simply better at identifying worrisome heart-related health events,\" and could have successfully competed with the ECG function built into the Apple watch. AliveCor was forced to pull SmartRhythm from the ‌App Store‌ because the irregular rhythm functionality no longer worked.<blockquote>All of this has been devastating to competition, as Apple today commands 100% share of heartrate analysis apps on watchOS devices and, if viewed in the alternative as part of either the U.S. ECG-capable smartwatch or U.S. ECG-capable wearable devices market, over 70% market share. With a single update, Apple thus eliminated competition that consumers clearly wanted and needed, depriving them of choice for heartrate analysis that is better than what Apple can provide.</blockquote>AliveCor has previously filed several patent infringement lawsuits against Apple, alleging that Apple copied AliveCor's cardiological detection and analysis technology. Those lawsuits have not yet been resolved, and with today's antitrust suit, AliveCor is seeking damages and an injunction that would require Apple to \"cease its abusive conduct.\"\r\n<br />\r\n\r\n<br />\r\nThis is just one of several antitrust battles that Apple is facing. A high-profile lawsuit brought by <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> <a href=\"https://www.macrumors.com/2021/05/24/epic-games-v-apple-trial-ends/\">wrapped up earlier this week</a>, and there are also antitrust investigations into Apple's ‌App Store‌ fees <a href=\"https://www.macrumors.com/2021/03/04/uk-watchdog-apple-investigation/\">in the UK</a> and in <a href=\"https://www.macrumors.com/2021/04/09/apple-refuses-to-testify-in-app-store-hearing/\">the United States</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">among other countries</a>.\r\n<br />\r\n\r\n<br />\r\n<div><p><a href=\"https://www.scribd.com/document/509451565/AliveCor-v-Apple-Complaint#from_embed\">AliveCor v. Apple Complaint</a> by <a href=\"https://www.scribd.com/user/212523051/MacRumors#from_embed\">MacRumors</a></p></div><div>Tags: <a href=\"https://www.macrumors.com/guide/lawsuit/\">lawsuit</a>, <a href=\"https://www.macrumors.com/guide/antitrust/\">antitrust</a>, <a href=\"https://www.macrumors.com/guide/alivecor/\">AliveCor</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/26/alivecor-apple-watch-antitrust-lawsuit/\">AliveCor Files Antitrust Suit Against Apple for Preventing Third-Party Irregular Heart Rhythm Analysis on Apple Watch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/alivecor-files-antitrust-suit-against-apple-for-preventing-third-party-irregular-heart-rhythm-analysis-on-apple-watch.2297941/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=CTh-YCoK27Q:mBW-gL_mTZU:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=CTh-YCoK27Q:mBW-gL_mTZU:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/CTh-YCoK27Q\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fde1209ad566a5808af7b499063ccef688861f018c36b6ee9ffa1e20ae2c8aba","category":"Apple"}