{"title":"Effects of Prostaglandin E1 and Balloon Atrial Septostomy on Cerebral Blood Flow and Oxygenation in Newborns Diagnosed with Transposition of the Great Arteries","link":"https://www.preprints.org/manuscript/202408.1068/v1","date":1723639377000,"content":"Dextro-transposition of the great arteries (D-TGA) is a critical congenital heart defect that can impact neurodevelopment due to cerebral perfusion and oxygenation disorders. Materials and Methods: In a retrospective study conducted at a tertiary center between 2016 and 2023, we investigated the early effects of Prostaglandin E1 (PGE1) administration and balloon atrial septostomy (BAS) on cerebral blood flow and oxygenation in inborn neonates with D-TGA. Cerebral Doppler Ultrasound in the anterior cerebral artery (ACA) was performed to assess resistive index (RI), Peak Systolic Velocity (PSV), and End-Diastolic Velocity (EVD) before PGE1, before the BAS procedure and 24 hours after birth. Cerebral regional saturations of oxygen (crSO2) and cerebral fractional tissue oxygen extraction (cFTOE) were evaluated. D-TGA patients were divided into the PGE1 group and the PGE1+BAS group. Age-matched healthy controls were used for comparison. Results: All 83 D-TGA newborns received PGE1 within two hours after delivery, of whom 46 (55.42%) underwent BAS. 77 newborns composed the control group. PGE1 administration increased crSO2 from 47% to 50% in the PGE1 group but lower than in controls at 24 hours of life, while cFTOE remained elevated. The RI increased 24 hours after delivery (0.718 vs. 0.769; p=0.000002) due to decreased EDV (10.71 vs. 8.74; p&amp;lt;0.0001) following PGE1 treatment. The BAS procedure resulted in a significant increase in crSO2 from 42% to 51% at 24 hours of life in the PGE1+BAS group. Doppler parameters exhibited a similar trend as observed in the PGE1 group. Conclusion: PGE1 treatment and BAS are lifesaving interventions that may improve cerebral perfusion and oxygenation in newborns with D-TGA during the transition period.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fde435a639f6334f371b1a02bab01c773b5a1e6d00f4da5bb888b1eac0f24660","category":"Interdisciplinary"}