{"title":"High-performing teams: Is collective intelligence the answer?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307945","date":1723471200000,"content":"<p>by Luke I. Rowe, John Hattie, John Munro</p>\r\nBackground/objectives <p>The concept of a general factor of collective intelligence, proposed by Woolley et al. in 2010, has spurred interest in understanding collective intelligence within small groups. This study aims to extend this investigation by examining the validity of a general collective intelligence factor, assessing its underlying factor structure, and evaluating its utility in predicting performance on future group problem-solving tasks and academic outcomes.</p> Methods <p>Employing a correlational study design, we engaged 85 university students in a series of complex cognitive tasks designed to measure collective intelligence through individual, group, and predictive phases.</p> Results <p>Contrary to the hypothesized single-factor model, our findings favor a two-factor model influenced by Cattell’s theory of crystalized and fluid intelligence. These two factors accounted for substantial variance in group performance outcomes, challenging the prevailing single-factor model. Notably, the predictive validity of these factors on group assignments was statistically significant, with both individual and collective intelligence measures correlating moderately with group assignment scores (<i>r</i><sub>s</sub> = .40 to .47, <i>p</i> &lt; .05).</p> Conclusions <p>Our research suggests that collective intelligence in small group settings may not be uniformly governed by a single factor but rather by multiple dimensions that reflect established theories of individual intelligence. This nuanced understanding of collective intelligence could have significant implications for enhancing group performance in both educational and organizational contexts. Future research should explore these dimensions and their independent contributions to group dynamics and outcomes.</p>","author":"Luke I. Rowe","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fdef15d42548c44100f9627011c8a5961e61bf52b740cd52cb6500055804a535","category":"Interdisciplinary"}