{"title":"Black Friday Apple deals to avoid and what to buy instead","link":"https://www.macworld.com/article/554504/black-friday-apple-deal-pitfalls-avoid.html","date":1637758278000,"content":"<div>\n<section><div></div></section><p>If you want a new Apple device, <a href=\"https://www.macworld.com/article/541154/best-black-friday-apple-deals.html\">this is the week to buy one</a>. Every retailer that sells Apple products will be running a sale between now and Monday, and if you act fast, you can save a bundle on an <a href=\"https://www.macworld.com/article/553124/black-friday-2021-the-best-apple-watch-deals.html\">Apple Watch</a>, iPad, <a href=\"https://www.macworld.com/article/553299/best-black-friday-macbook-deals.html\">Mac</a>, or iPhone.</p>\n\n\n\n<p>But there are some deals that aren’t actually deals, no matter how low the price is. Here are four products you should avoid this Black Friday:</p>\n\n\n\n<h2>Apple Watch Series 3</h2>\n\n\n\n<p>Even though the <a href=\"https://www.macworld.com/article/230567/apple-watch-series-3-lte-review.html\">Apple Watch Series 3</a> is four generations old by now, Apple still sells it for $199 as a budget option even less expensive than the Apple Watch SE. We don’t recommend it at full price and we don’t recommend at its usual sale price of $170. The only exception was the deal Walmart was offering earlier this week, which discounted it by $90 to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.walmart.com/ip/Apple-Watch-Series-3-GPS-38mm-Sport-Band-Aluminum-Case/706203065&amp;xcust=1-1-554504-1-0-0&amp;sref=https://www.macworld.com/feed\">an all-time-low of $109</a> (it’s sold out now). At that price it’s a great option for anyone who wants a rudimentary smartwatch, and if it pops up again, we’d recommend it to anyone who doesn’t mind an older smartwatch. But without the newest sensors or display, and a pokey S3 processor, most people should just pay a little more for an Apple Watch SE instead—especially when it’s <a href=\"https://www.amazon.com/dp/B09G93BDQP/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">discounted to $220</a>.</p>\n\n\n\n<h2>Apple TV HD</h2>\n\n\n\n<p>Apple launched a new <a href=\"https://www.macworld.com/article/347379/apple-tv-4k-review-2.html\">Apple TV 4K</a> earlier this year with an A12 processor and HDMI 2.1, but the Apple TV HD received no such update. While it does come with the new <a href=\"https://www.macworld.com/article/347504/2021-siri-remote-review-apple-tv.html\">Siri Remote</a>, it’s the same box that was released in 2015. Apple still charges $149 for it, but even if you find it at a discount (like <a href=\"https://www.macworld.com/article/553617/apple-four-day-shopping-event-gift-cards.html\">Apple’s four-day shopping event</a>), it’s not worth buying. For a little more, the 4K model will future-proof your setup for years to come.</p>\n\n\n\n<h2>AirPods<sup></sup>(2nd generation)</h2>\n\n\n\n<p>When Apple released the <a href=\"https://www.macworld.com/article/549094/airpods-3rd-generation-review.html\">3rd-generation AirPods</a> at its “Unleashed” event in October, it also cut the price of the <a href=\"https://www.macworld.com/article/232610/airpods-2nd-generation-review.html\">2nd-gen model</a> from $159 to $129. They’re currently marked down to $115 and are likely to go even lower over the Black Friday weekend, possibly hitting a new all-time-low of $85 or less. We still don’t think they’re a smart buy. The 3rd-gen AirPods cost a bit more (though they’ve been <a href=\"https://www.amazon.com/dp/B09JQL3NWT/?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">marked down to $155</a>), but they bring better sound and battery life, spatial audio, adaptive EQ, water resistance, fast charging, and more powerful sensors, not to mention a wireless charging case.</p>\n\n\n\n<h2>Intel Macs</h2>\n\n\n\n<p>Best Buy and other retailers are <a href=\"https://www.macworld.com/article/553432/black-friday-apple-macbook-deals-beware.html\">knocking up to $600 off the price of the most recent Intel MacBooks</a>, which would normally be a great deal. But this isn’t a normal Mac year. The newest M1 Macs have absolutely destroyed their Intel predecessors, and that gap will probably only widen over time. It’s not just that the new Macs are speedier and more power efficient—if the iPhone is any indication, future macOS releases will also run better on Apple silicon Macs versus Intel ones too. So skip anything that doesn’t have Apple silicon.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"fdfdd4402505a0f8bf3933eb0baff270efedeb20fb25db0ac332c9b0a30e4f9a","category":"Apple"}