{"title":"Hydro‐Sedimentary Processes of a Plunging Hyperpycnal River Plume Revealed by Synchronized Remote Imagery and Gridded Current Measurements","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035907?af=R","date":1709798400000,"content":"<h2>Abstract</h2>\n<p>The present knowledge of plunging hyperpycnal river plumes is mainly based on two-dimensional (confined) laboratory experiments. Several hypotheses on three-dimensional (unconfined) flow processes have been made, but not tested in situ. In this field study, the dominant three-dimensional hydro-sedimentary processes related to unconfined plunging were elucidated by synchronizing autonomous time-lapse camera images with boat-towed acoustic Doppler current profiler measurements. It was found that the flow field complies with two-dimensional conceptualizations along the plume centerline. Perpendicular to the centerline, the plume slumped laterally due to its density excess and simultaneously converged laterally due to its vertical divergence. This combination led to a narrowing of the plume near the surface, resulting in a sediment-rich triangle-shaped pattern on the surface near the inflow, and a rather stable width near the bed. The formation of secondary flow cells transporting riverine water and suspended particulate matter (SPM) away from the plume near the bed, up toward the surface and back toward the plume near the surface, was revealed. An increase of the average SPM concentration and the SPM flux in the main flow direction indicates net sediment erosion under the investigated conditions of high discharge and sediment load. This suggests transient storage of sediment during conditions of lower discharge and sediment load, and high morphological activity in the plunging area. These findings allowed extending a classical conceptual plunging model to laterally unconfined sediment-laden plunging inflows for conditions of well-mixed ambient water in the plunging region and inflow densimetric Froude numbers exceeding 1, common in nature.</p>","author":"Stan Thorez, \nUlrich Lemmin, \nD. Andrew Barry, \nKoen Blanckaert","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"fe0ce0934c41343fce0c92560c20c3018f1d5f1fc0a426d81be7708a925ba70c","category":"Environment"}