{"title":"Flower Characteristics and Pollen Viability of Four Industrial Hemp (Cannabis sativa L.) Grain Varieties","link":"https://www.preprints.org/manuscript/202410.0742/v1","date":1728544206000,"content":"Abstract: Industrial hemp (Cannabis sativa L.) is primarily a dioecious plant, and monoecious varieties developed for high yield. Production practices vary by varieties prompting the need for the present study aimed to describe the floral characteristics and evaluate pollen quantity and viability of a monoecious (Henola) and three dioecious (CFX-2, Canda, and Joey) varieties. All varieties have five lanceolate anthers, basifixed to a threadlike filament. Anther length was significantly different but not anther width among varieties. The longest length (0.38 ± 0.046 cm) was recorded in Henola, and shortest (0.34 ± 0.043 cm) in CFX-2. Anther width ranged from 0.088 ± 0.0024 to 0.095 ± 0.0021cm. Pollen grains were triporate and spheroidal in shape and size differed significantly with the largest in Joey (27.83 ± 0.78 μm) and Henola (27.489 ± 0.99 μm), and smallest in Canda (22.04 ± 0.56 μm). The number of pollen grains differed significantly among varieties ranging from 29,183 in Henola to 104,548 in Joey. Even though Henola recorded the lowest pollen number it had the highest percentage (69.3%) of viable pollen and Canda recorded the lowest. There was a moderate, positive and significant relationship (r = 0.496) between anther length and the number of pollen grains in Joey. The relationship in Henola was moderate and non-significant (r = 0.356), weak and non-significant in Canda (r = 0.188), and in CFX-2 (r = 0.037). The findings from our study provide information for growers and researchers on hemp breeding and cultivation practices that may contribute to prevent cross pollination.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fe14ff4e510dc56287fa3c23f6bdd8d88a7c5cf1cd80f38130375724e714f597","category":"Interdisciplinary"}