{"title":"PolicyBazaar แพลตฟอร์มขายประกันออนไลน์จากอินเดีย เตรียมไอพีโอเข้าตลาดหลักทรัพย์","link":"https://www.blognone.com/node/124024","date":1627915942000,"content":"<div><div><div><p>PolicyBazaar ผู้ให้บริการแพลตฟอร์มเปรียบเทียบและจำหน่ายประกันออนไลน์ของอินเดียยื่นไฟลิ่งเตรียมไอพีโอเข้าตลาดหลักทรัพย์อินเดียแล้ว พร้อมระดมทุนราว 504 ล้านดอลลาร์จากการไอพีโอครั้งนี้</p>\n<p>สำหรับ PolicyBazaar เป็นสตาร์ทอัพกลุ่ม InsurTech อายุ 12 ปีในอินเดีย หนึ่งในผู้ลงทุนรายใหญ่คือ SoftBank โดยธุรกิจหลักคือแพลตฟอร์มเปรียบเทียบและขายกรมธรรม์จากหลายบริษัท ครอบคลุมทั้งประกันสุขภาพ, ประกันชีวิต, ประกันการเดินทาง, ประกันรถยนต์ และประกันอสังหาริมทรัพย์</p>\n<p>ปัจจุบัน อินเดียมีประชากรราว 1.3 พันล้านคน ซึ่งปัจจุบันยังมีประชากรน้อยมากที่เข้าถึงผลิตภัณฑ์ด้านประกัน ดังนั้นธุรกิจประกันยังมีช่องให้เติบโตอยู่อีกไม่น้อย โดยนอกจากตลาดอินเดียแล้ว PolicyBazaar ยังทำตลาดในประเทศแถบตะวันออกกลางอีกด้วย</p>\n<p>PolicyBazaar ระบุว่า ธุรกิจประกันของอินเดียน่าจะเติบโตราว 18.8% ต่อปี โดยคาดการณ์ว่าตลาดนี้จะมีมูลค่าราว 31.9 ล้านล้านรูปีภายในปี 2030 ซึ่งปัจจุบัน PolicyBazaar ขายกรมธรรม์ได้ราว 1 ล้านกรมธรรม์ต่อวัน และนักวิเคราะห์จาก Bernstein ประมาณการว่า PolicyBazaar น่าจะมีส่วนแบ่งตลาดขายประกันออนไลน์ราว 90% ในอินเดีย โดยคู่แข่งหลักของบริษัทคือ Acko และ Amazon</p>\n<p>การไอพีโอเข้าตลาดหุ้นของ PolicyBazaar นี้ ทางบริษัทจะระดมทุน 809 ล้านดอลลาร์ โดยจะเป็นการออกหุ้นใหม่ 504 ล้านดอลลาร์ ส่วนที่เหลือจะเป็นการขายหุ้นจากนักลงทุนของบริษัท โดย SoftBank จะนำหุ้นออกขายมูลค่า 250 ล้านดอลลาร์ ส่วนผู้ก่อตั้งบริษัทจะนำหุ้นออกขาย 52.7 ล้านดอลลาร์</p>\n<p>ที่มา - <a href=\"https://techcrunch.com/2021/08/01/indian-online-insurer-policybazaar-files-for-ipo-seeks-to-raise-over-800-million/\">TechCrunch</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/67c3515652a811a1568bf78606af1240.jpg\" /><br />\nภาพจาก <a href=\"https://www.facebook.com/Policybazaar/photos/a.265113580241104/4373013202784434\">PolicyBazaar (Facebook)</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ipo\">IPO</a></div><div><a href=\"/topics/india\">India</a></div><div><a href=\"/topics/insurtech\">InsurTech</a></div><div><a href=\"/topics/insurance\">Insurance</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"fe1a2f93bd9a2ce844132d0c48c39340878b9dba06413d1e8c498b6a86470230","category":"Thai"}