{"title":"Exploring different health care providers´ perceptions on the management of diarrhoea in cholera hotspots in the Democratic Republic of Congo: A qualitative content analysis","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002896","date":1710856800000,"content":"<p>by Mattias Schedwin, Aurélie Bisumba Furaha, Helena Hildenwall, Kelly Elimian, Espoir Bwenge Malembaka, Marc K. Yambayamba, Birger C. Forsberg, Wim Van Damme, Tobias Alfvén, Simone E. Carter, Placide Welo Okitayemba, Mala Ali Mapatano, Carina King</p>\r\n\r\nGlobal cholera guidelines support wider healthcare system strengthening interventions, alongside vertical outbreak responses, to end cholera. Well-trained healthcare providers are essential for a resilient health system and can create synergies with childhood diarrhoea, which has higher mortality. We explored how the main provider groups for diarrhoea in cholera hotspots interact, decide on treatment, and reflect on possible limiting factors and opportunities to improve prevention and treatment. We conducted focus group discussions in September 2022 with different healthcare provider types in two urban and two rural cholera hotspots in the North Kivu and Tanganyika provinces in the Eastern Democratic Republic of Congo. Content analysis was used with the same coding applied to all providers. In total 15 focus group discussions with medical doctors (n = 3), nurses (n = 4), drug shop vendors (n = 4), and traditional health practitioners (n = 4) were performed. Four categories were derived from the analysis. (i) Provider dynamics: scepticism between all cadres was prominent, whilst also acknowledging the important role all provider groups have in current case management. (ii) Choice of treatment: affordability and strong caregiver demands shaped by cultural beliefs strongly affected choice. (iii) Financial consideration on access: empathy was strong, with providers finding innovative ways to create access to treatment. Concurrently, financial incentives were important, and providers asked for this to be considered when subsiding treatment. (iv) How to improve: the current cholera outbreak response approach was appreciated however there was a strong wish for broader long-term interventions targeting root causes, particularly community access to potable water. Drug shops and traditional health practitioners should be considered for inclusion in health policies for cholera and other diarrhoeal diseases. Financial incentives for the provider to improve access to low-cost treatment and investment in access to potable water should furthermore be considered.","author":"Mattias Schedwin","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"fe1d4c36c442e9126763e2d4ff86ecac800338ec604868481f85131c7da261ac","category":"Environment"}