{"title":"Emergence of Time from Primordial Space and Expansion of Space with Time","link":"https://www.preprints.org/manuscript/202403.0117/v2","date":1716899185000,"content":"A model of space-time is presented, whose origin is set before the appearance of any universe. It uses concepts of previous work, a central one being that the information about the laws of nature is stored locally everywhere in space such that all physical processes obey them. Since information storage is bound to matter or energy, space is assumed to consist of dark energy (DE), which thus assumes an importance far beyond its function as a stopgap for an energy deficit in our universe ( U ). The primordial state (PS) is a timeless and relatively large space of 3 dimensions described by a Wheeler DeWitt (WDW) equation, whose solution is interpreted as an arrangement of very many space quanta and possesses properties that remind of the time-honored concept of the unmoved mover. The comparison of WDW solutions belonging to different mass densities of the DE favors one in which the space quanta are mini black holes. This allows the space quanta to be imagined as mass points which are kept at a distance compatible with the quantum volume by the Pauli principle or something equivalent. Triggered by a dramatic increase in probability, the PS is followed by a time-controlled sequence of quantized expansion states (ES i ). The concomitant emergence of time occurs in a lightning huge crash, consuming almost all DE of the PS. The subsequent quantized ES i emerge from a WDW equation, novelly derived from a solution of the modified cosmic momentum equation, which classically describes an exponential space expansion (CS). The huge volme of the ES i is also used as size of the PS. Information is assumed to be geometrically stored in arrangements of space quanta similar to how genetic information is stored in DNA molecules. During the CS information must be transferred from already existing \"information quanta\" to new ones. This requires time, slows down the expansion and is taken into account by a friction term in the cosmological momentum equation thus modified. Since the Friedmann-Lemaître (FL) equation remains fully valid, the model is widely based on recognized equations, so that some results may be understood as interpretations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fe3288376f32447215f1a5f2fd97197c1a1178fe3722d347cf3eba8f66548f35","category":"Interdisciplinary"}