{"title":"A New Test Method of &ldquo;Nuclear Magnetic Resonance + High-Speed Centrifugation&rdquo; for Gas-Water Relative Permeability Curve of Low-Permeability and Tight Sandstone","link":"https://www.preprints.org/manuscript/202407.0886/v1","date":1720679330000,"content":"Gas-water relative permeability curve is the foundation of gas reservoir dynamic analysis and numerical simulation. It is generally obtained through gas displacing water experiment. Referring to the existing national standards, gas-water relative permeability test is carried out for low-permeability and tight sandstone. The flow is discontinuous and the curve smoothness is poor, which affects the application of gas-water relative permeability curve. Based on the comparative analysis of a large number of mercury injection and NMR experimental results of low-permeability and tight sandstone, a method to characterize the throat radius distribution of low-permeability tight sandstone based on NMR T2 spectrum is explored. Combined with high-speed centrifugal experiment, the calculation formulas of core water saturation, phase relative permeability of gas-water under different centrifugal force are established. A new method of \"nuclear magnetic resonance + high-speed centrifugation\" for gas-water relative permeability curve test of low-permeability and tight sandstone is formed, and the test is carried out on Sulige low-permeability tight sandstone core. The results show that: (1) The shape of cumulative distribution curve of throat radius by mercury injection method is basically consistent with that of T2 relaxation time by NMR, and there is a good corresponding relationship between them. (2) The centrifugation process is similar to the gas displacing water process. With the decrease of water saturation, water centrifugation in rock core becomes more and more difficult until it become irreducible. (3) The test process of the new method is unified and standard and up to 6 cores can be tested at the same time. The calculation results of water saturation and relative permeability curve are reliable and the integral curve is smooth, which greatly improves the test efficiency of gas-water relative permeability curve in low-permeability and tight sandstone. The new method can be widely used to study the gas-water two-phase seepage law in low-permeability and tight sandstone gas reservoir.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fe3b5306b4a95bb7db6c5a8778489f0317f8a2e5e1d19bbd32b30a923adcf5f4","category":"Interdisciplinary"}