{"title":"Codification and description of phenological growth stages of taro (Colocasia esculenta var. antiquorum) according to the extended BBCH Scale","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12882?af=R","date":1702272787000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/f339cd78-2d93-45f8-81bb-f4a25c3cc95d/aab12882-toc-0001-m.png\" alt=\"Codification and description of phenological growth stages of taro (Colocasia esculenta var. antiquorum) according to the extended BBCH Scale\" />\n<p>The present study defines codes and phenological growth stages of taro according to the extended Biologische Bundesanstalt, Bundessortenamnt, and Chemische Industrie scale using three-digit numerical coding system for the first time for its description. It has immense importance in crop management, crop improvement, germplasm characterisation, and assessment of impact of climate on phenology under different agro-climatic conditions.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Taro [<i>Colocasia esculenta</i> (L.) Schott var. <i>antiquorum</i>] is an important tuber crop widely cultivated in tropical and sub-tropical regions, for its corms, leaves, and petioles. Millions of people living in developing countries in Asia, Africa, and Central America, utilise taro as a staple or subsistence food and it plays a very crucial role there for food security, nutritional security, livelihood improvement, and employment generation. It exhibits a capacious range of diversity worldwide regarding plant characteristics. However, its phenology has not yet been described systematically. The present study defines codes and phenological growth stages of taro according to the extended Biologische Bundesanstalt, Bundessortenamnt, and Chemische Industrie (BBCH) scale using a three-digit numerical coding system for its description. A total of nine principal growth stages were described such as germination (0), leaf development (1), elongation of shoot/stem (2), tuber formation (3), development of inflorescence/spadix (5), flowering (6), development of berries/fruiting (7), ripening of berries and seed development (8) and senescence and beginning of dormancy (9) and further, each of the principal development stages has been partitioned into optional developmental growth stages. Under remarkable circumstances, it is valuable to use mesostages with three-digit codes for description. The study of extended BBCH scale for taro has immense importance in crop management, crop improvement, germplasm characterisation, and assessment of impact of the climate on phenology under different agro-climatic conditions for the selection of suitable genotypes.</p>","author":"Vijay Bahadur Singh Chauhan, \nSamarendra Narayan Mallick, \nPinki Mohapatra, \nKalidas Pati, \nHanume Gowda, \nRameshkumar Arutselvan, \nArvind Kumar Verma, \nManiyam Nedunchezhiyan","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"fe46bd21f7d79556a8cd39931461062d503d94dfbff5091f411ddc3b542f2cba","category":"Environment"}