{"title":"ActVI-ORFA directs metabolic flux towards actinorhodin by preventing intermediate degradation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308684","date":1723212000000,"content":"<p>by Xuechen Zhu, Rongbin Wang, Vilja Siitonen, Nemanja Vuksanovic, Nicholas R. Silvaggi, Charles E. Melançon III, Mikko Metsä-Ketelä</p>\r\n\r\nThe biosynthetic pathway of actinorhodin in <i>Streptomyces coelicolor</i> A3(2) has been studied for decades as a model system of type II polyketide biosynthesis. The actinorhodin biosynthetic gene cluster includes a gene, <i>actVI-orfA</i>, that encodes a protein that belongs to the nuclear transport factor-2-like (NTF-2-like) superfamily. The function of this ActVI-ORFA protein has been a long-standing question in this field. Several hypothetical functions, including pyran ring cyclase, enzyme complex stability enhancer, and gene transcription regulator, have been proposed for ActVI-ORFA in previous studies. However, although the recent structural analysis of ActVI-ORFA revealed a solvent-accessible cavity, the protein displayed structural differences to the well-characterized cyclase SnoaL and did not possess a DNA-binding domain. The obtained crystal structure facilitates an inspection of the previous hypotheses regarding the function of ActVI-ORFA. In the present study, we investigated the effects of a series of <i>actVI-orfA</i> test plasmids with different mutations in an established vector/host system. Time-course analysis of dynamic metabolism profiles demonstrated that ActVI-ORFA prevented formation of shunt metabolites and may have a metabolic flux directing function, which shepherds the flux of unstable intermediates towards actinorhodin. The expression studies resulted in the isolation and structure elucidation of two new shunt metabolites from the actinorhodin pathway. Next, we utilized computational modeling to probe the active site of ActVI-ORFA and confirmed the importance of residues R76 and H78 in the flux directing functionality by expression studies. This is the first time such a function has been observed for a member of NTF-2-like superfamily in <i>Streptomyces</i> secondary metabolism.","author":"Xuechen Zhu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fe4cb7be584b2f280ccbb6883dc0e4191791a973f052752f848095385eec468b","category":"Interdisciplinary"}