{"title":"Understanding Macrophage Complexity in Metabolic Dysfunction-associated Steatotic Liver Disease: Transitioning from the M1/M2 Paradigm to Spatial Dynamics","link":"https://www.preprints.org/manuscript/202404.0819/v1","date":1712889878000,"content":"Metabolic dysfunction-associated steatotic liver disease (MASLD) encompasses metabolic dysfunction-associated fatty liver (MASL) and metabolic dysfunction-associated steatohepatitis (MASH), with MASH posing a risk of progression to cirrhosis and hepatocellular carcinoma (HCC). The global prevalence of MASLD is estimated at approximately a quarter of the population, with significant healthcare costs and implications for liver transplantation. The pathogenesis of MASLD involves intrahepatic liver cells, extrahepatic components, and immunological aspects, particularly the involvement of macrophages. Hepatic macrophages are a crucial cellular component of the liver and play vital roles in liver function, contributing significantly to tissue homeostasis and swift responses during pathophysiological conditions. Recent advancements in technology have revealed the remarkable heterogeneity and plasticity of hepatic macrophage populations and their activation states in MASLD, challenging traditional classification methods like the M1/M2 paradigm and highlighting the coexistence of harmful and beneficial macrophage phenotypes that are dynamically regulated during MASLD progression. This complexity underscores the importance of considering macrophage heterogeneity in therapeutic targeting strategies, including their distinct ontogeny and functional phenotypes. This review provides an overview of macrophage involvement in MASLD progression, combining traditional paradigms with recent insights from single-cell analysis and spatial dynamics. It also addresses unresolved questions and potential therapeutic targets in this area.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fe4ee19de7aabf2296328439ff1d75fcea402b32fecbd97f6a9c3e1605ad5d0f","category":"Interdisciplinary"}