{"title":"Study on the Potential Probiotics Isolated from Marine Aquaculture System and Evaluation for Aquaculture Application","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/9555271?af=R","date":1721215140000,"content":"<p>In recent years, more attention has been paid to the application of host-associated microorganisms as an appropriate source of probiotics in aquaculture. These probiotics promoted effective colonization and application and provided better benefits than other sources. A total of 32 isolates were collected from the water, shrimp, and sediment of the cultured pond of <i>Litopenaeus vannamei</i>. Probiotic effects were comprehensively evaluated by extracellular enzyme activity, virulence genes detection, bacteriostatic activity, drug susceptibility test, tolerance to adverse environment, and challenge experiment. Six of these isolates exhibited bacteriostatic activity against pathogens, such as <i>Vibrio cholerae</i>, <i>V. owensii</i>, <i>V. fluvialis</i>, <i>V. campbellii</i>, <i>V. rotiferianus</i>, <i>Photobacterium damselae</i>, <i>V. vulnificus</i>, and <i>V. parahaemolyticus</i>. Using 16S rRNA gene sequencing analysis, isolates were identified as <i>Bacillus subtilis</i> (P8, P29, and P30), <i>B. velezensis</i> (P12), <i>Prestia flexa</i> (P21), and <i>Cytobacillus firmus</i> (P23). They were tolerant to high temperature, low acid (pH 2.0), bile salt (2%), and the simulated gastrointestinal environment, secreting phospholipase, amylase, protease, gelatinase, and lipase. They were sensitive to only two or fewer drugs among 27 antibacterial drugs and did not carry any of the tested virulence genes. Biosafety in vivo evaluations showed that they were safe for <i>Ctenopharyngodon idella</i> (P12 ＞ P23 ＝ P29 ＞ P8 ＞ P30 ＝ P21). The results suggest that P8, P12, P23, P21, P29, and P30 have high probiotic potential and can be used as good probiotics in aquaculture and the development of ecological preparations.</p>","author":"Yingli Gao, \nLu Qiang, \nNi Wu, \nRuiming Tan, \nYungui Sun, \nZeyu Li, \nXin Shen, \nYuefeng Cai, \nWing-Keong Ng","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"fe58ff4684354322a9e30459cdc6f37e7a9fc4363985270f04f2f3fe373635f2","category":"Environment"}