{"title":"Inside / Out at Philly’s Keystone Bicycle Co: High Grade Bicycles and Sundries – Bob Myaing","link":"https://theradavist.com/2021/10/inside-out-at-phillys-keystone-bicycle-co-high-grade-bicycles-and-sundries/?utm_source=rss&utm_medium=rss&utm_campaign=inside-out-at-phillys-keystone-bicycle-co-high-grade-bicycles-and-sundries","date":1633345232000,"content":"<p>Here in the Quaker City of Philadelphia, we’re blessed with a number of reliable shops in just about every corner of town. Shops for very serious racers, shops for mountain bikers, shops just for anyone in the neighborhood in need of help getting around on two wheels. We’ve got ‘em all and plenty of ‘em. <a href=\"https://keystone.bike/\" target=\"_blank\">Keystone</a> is one of Philly’s newest shops catering to all kinds of bikes with an emphasis on everything rando, touring, and bikepacking.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/keystone-bicycle-co-7.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Keystone announced its formation as a worker-owned cooperative shop in April 2019 and began its buildout inside a corner of North Philly’s <a href=\"https://nextfab.com/location/north-philadelphia/\">NextFab</a> building in February of 2020. Needless to say, the pandemic landing stateside the following month made opening a new business pretty interesting. Prior to the pandemic, each one of the shop’s five worker-owners were employed at bike shops and bike share operations all over town. Several of them had planned to balance part-time Winter shop schedules with Keystone’s launch but rounds of layoffs expedited those timelines. By May, the service department had been built out enough to begin taking in repairs–a time when service departments in just about every shop were booked solid. Much of their first year operated by appointment, but little by little the shop took shape.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/keystone-bicycle-co-20.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/10/keystone-bicycle-co-13.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Fast forward through a challenging first year and one of Philly’s most unique shops has come to life. Though bike supply is pretty limited as of late, theirs includes a small selection of completes from Kona and frames from Velo Orange and Soma. The crew’s active role in the local randonneur and coffee outside scenes in addition to founding the Philly <a href=\"https://www.instagram.com/phillydynamoheadlightsociety/\">dynamo headlight society</a> has helped shape them into the go-to shop for custom builds of Rivendell’s, Crust’s, and all sorts of steel rides. </p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/keystone-bicycle-co-15.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>In the parts and accessories department, their shelves are full of nice shiny things from Sim Works and Nitto, bags from Ruth Works and Swift, and of course a selection of dynamo lights and hubs. Dedicated to getting riders outfitted for bike camping and touring, Keystone’s inventory of small but well-curated camping gear is one of the largest inside city limits and has definitely saved me a car trip to the burbs for a run to REI.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/10/keystone-bicycle-co-34.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Should you find yourself cruising down Philadelphia’s freshly paved American Street bicycle highway or need help with your next bike project, stop by and say what’s up to any one of the super friendly folks at Keystone. While you’re there, check out one of the neighboring building tenants that include a Mexican restaurant, an architectural salvage shop, and the <a href=\"https://neonmuseumofphiladelphia.com/\">Neon Museum of Philadelphia</a> whose overflowing collection lights up the rafters throughout the 30,000+ square foot warehouse.</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"fe6c74d7d9a0d8acf9808797185de43256dc21b4d60529d5a0c2e75b40fca5d2","category":"Cycling"}