{"title":"Design modification and comparative analysis of glycol‐based natural gas dehydration plant","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300093?af=R","date":1712048341000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/8035c1d3-bbc9-48f0-abc8-f0d5a0efe8f6/appl202300093-gra-0001-m.png\" alt=\"Design modification and comparative analysis of glycol-based natural gas dehydration plant\" /><p>The design and efficiency of glycol-based natural gas dehydration plants are crucial for cost-effective natural gas processing. This study aims to modify and compare different designs of glycol-based natural gas dehydration plants to improve efficiency and reduce operating costs.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Natural gas production from reservoirs is often associated with water, which poses numerous challenges, such as methane hydrate formation, sludge, corrosion and flow assurance issues in gas processing plants and sales gas transmission pipelines. To effectively remove water from natural gas, there is a need to design, compare and modify dehydration plants. This study investigated the performance difference between a conventional triethylene glycol (TEG)-based dehydration system with a cooler at the TEG inlet to the contactor, and a newly proposed TEG-based dehydration system with a heat exchanger replacing the cooler at the TEG inlet with the contactor. The advanced process simulation software Aspen HYSYS was used to design and compare two dehydration system configurations. The modified design configuration exhibited better performance in terms of energy conservation and water-removal capability. The material balance of molar flow, mass flow and volume flow of dry gas produced in the absorber/contactor column showed a higher volume of dry gas produced in the modified system configuration, indicating that it is a better design. The modified design configuration also produced dry gas within the recommended temperature range for underground storage and transmission. There was a significant difference in the percentage difference of 64% between the conventional and modified designs in terms of energy consumption, whereas the percentage differences of 0% and 0.6% showed nonsignificant and significant differences between the two plant design configurations. Both plant design configurations showed a significant reduction (from 0.005 to 0.0002 mol%) in the water composition of natural gas after the simulation.</p>","author":"Chimene Omeke Wosu, \nJackson Gunorubon Akpa, \nAnimia Ajor Wordu, \nEmmanuel Ehirim, \nErnest Mbamalu Ezeh","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"fe7e9ad43f6c000bc92162af0a72b61a425bb37035fd8744a5d9f2e87981b81f","category":"Environment"}