{"title":"Pharmacotherapy causing weight gain and metabolic alteration in those with obesity and obesity‐related conditions: A review","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15112?af=R","date":1708615785000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/99c78af4-8b36-4719-9fb9-210583703720/nyas15112-gra-0001-m.png\" alt=\"Pharmacotherapy causing weight gain and metabolic alteration in those with obesity and obesity-related conditions: A review\" />\n<p>This review explores the diverse pathways by which various medications contribute to the pathophysiology of obesity. From antipsychotics and antihypertensives to steroids and insulin, we dissect the mechanisms causing weight gain and metabolic shifts in those with obesity who are taking pharmacotherapy for a range of obesity-related conditions.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This review aims to summarize pharmacological interventions that may affect adiposity and metabolic equilibrium in individuals with obesity. Pharmacological therapy is frequently used to treat medical conditions that are both directly related to obesity (such as hypertension and type 2 diabetes) and indirectly related to obesity (such as asthma, insomnia, and type 1 diabetes). This pharmacological therapy may result in weight gain and alterations in the metabolic profile. Many medication classes are implicated in the pharmacologic causes of weight gain, including antipsychotics, glucocorticoids, beta-adrenergic blockers, tricyclic antidepressants, antihistamines, insulin, neuropathic agents, sleep agents, and steroids. This article describes the mechanisms of action and pathways of pharmacological interventions causing obesity.</p>","author":"Chika V. Anekwe, \nYoon Ji Ahn, \nSimar Singh Bajaj, \nFatima Cody Stanford","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"fe8054f5bb5f74b04f8a19e7f88e41d91c8498759c9f761ae54156016dee46b7","category":"Environment"}