{"title":"Transcriptomic Analysis Reveals Early Alterations Associated with Intrinsic Resistance to Target Therapy in Lung Adenocarcinoma Cell Lines","link":"https://www.preprints.org/manuscript/202403.1686/v1","date":1711624617000,"content":"Lung adenocarcinoma is the most prevalent form of lung cancer, and drug resistance is a significant obstacle in its treatment. This study aimed to investigate the overexpression of long non-coding RNAs (lncRNAs) as a mechanism that promotes intrinsic resistance in tumor cells from the onset of treatment. Drug-tolerant persister cells (DTP) are a subset of cancer cells that survive and proliferate after exposure to therapeutic drugs, making them an essential object of study for cancer treatment. The molecular mechanisms underlying DTP cell survival are not fully understood; however, long non-coding RNAs (lncRNAs) have been proposed to play a crucial role.  DTP cells from lung adenocarcinoma cell lines were obtained after a single exposure to tyrosine kinase inhibitor TKIs (erlotinib or osimertinib). After establishing DTPs, RNA sequencing was performed to investigate the differential expression of the lncRNAs.  Some lncRNAs and one mRNA were found to be overexpressed in DTP cells. The clinical relevance of lncRNAs was evaluated in a cohort of patients with lung adenocarcinoma from The Cancer Genome Atlas (TCGA). RT-qPCR validated the overexpression of lncRNAs and mRNA in residual DTP cells and LUAD biopsies. Knockdown of these lncRNAs increases the sensitivity of DTP cells to therapeutic drugs. This study provides an opportunity to investigate the involvement of lncRNAs in the genetic and epigenetic mechanisms underlying intrinsic resistance. The identified lncRNAs and CD74 mRNA may serve as potential prognostic markers or therapeutic targets to improve the overall survival of patients with lung cancer.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fe883c9517be490b0cf1400f3b7a943c7c20cc31c8389d57380acf296f37fd65","category":"Interdisciplinary"}