{"title":"Magnetic r‐graphene oxide‐doped tin‐lanthanum intercalated thiosulfate layered double hydroxide as a new nanocomposite sorbent for the extraction of tetracycline and oxytetracycline residues in pharmaceutical wastewater","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14344?af=R","date":1715141849000,"content":"<h2>Abstract</h2>\n<p>A new analytical method combining magnetic micro-solid phase extraction (μ-SPE) in tandem with high-performance liquid chromatography-ultraviolet (HPLC-UV) analysis was developed and used for the simultaneous extraction/preconcentration of tetracycline (TC) and oxytetracycline (OTC) residues in drug manufacturing effluents. The μ-SPE conducted by the introduction of iron oxide reduced-graphene oxide (MrGO) doped tin-lanthanium intercalated with thiosulfate ions to produce magnetic LDH (MrGO/Sn-La-S). The adsorbent was synthesized and characterized using x-ray diffraction, Fourier transform infrared, scanning electron microscopy, energy-dispersive x-ray, elemental mapping, transmission electron microscopy, x-ray photoelectron spectroscopy, and value stream mapping techniques. The effective parameters, including the extraction and desorption steps, were investigated and optimized. Under optimized conditions, the limits of detection (LOD) for TC and OTC were obtained as 5.42 and 3.31 μg.L<sup>−1</sup>, respectively, while the linearity was in the range of 10.0–500.0 μg.L<sup>−1</sup> for both antibiotics with satisfactory determination coefficients (<i>R</i>\n<sup>2</sup>) of 0.9811 and 0.9846 for TC and OTC, respectively. The recovery percentages for the analytes in real samples were achieved in the ranges of 89.2%–101.6% and 91.0%–101.3% for TC and OTC antibiotics, respectively. All these features proved the potential of the developed method and adsorbent for real world applications.</p>","author":"Maryam Malmir, \nFarzaneh Shemirani","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"fe89cbfd08c61419d60f2e9b03b4e9ac6b5d44ddb7e42e97822b808231bd57fc","category":"Environment"}