{"title":"Drag Coefficient of Emergent Vegetation in a Shallow Nonuniform Flow Over a Mobile Sand Bed","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036535?af=R","date":1715670000000,"content":"<h2>Abstract</h2>\n<p>Widely distributed in natural rivers and coasts, vegetation interacts with fluid flows and sediments in a variable and complicated manner. Such interactions make it difficult to predict associated drag forces during sediment transport. This paper investigates the drag coefficient for an emergent vegetated patch area under nonuniform flow and mobile bed conditions, based on an analytical model solving the momentum equation following our previous work (Zhang et al., 2020, <a target=\"_blank\" href=\"https://doi.org/10.1029/2020WR027613\">https://doi.org/10.1029/2020WR027613</a>). Emergent vegetation was modeled with rigid cylinders arranged in staggered arrays of different vegetation coverage ∅. Laboratory flume tests were conducted to measure variations in both the water and bed surfaces along a vegetated patch on a sand bed. Based on the experimental and theoretical analyses, a dimensionless drag model integrating both terms of flow properties and bed effects is proposed to predict the drag coefficient <i>C</i>\n<sub>\n   <i>d</i>\n</sub> over a mobile bed. The calculated values of <i>C</i>\n<sub>\n   <i>d</i>\n</sub> exhibit two different trends, that is, nonmonotonically or monotonically increasing along the streamwise direction, due to the combined effect of water surface gradient and bed slope. The morphodynamic response of the mobile bed to nonuniform flow manifests as an evolution in the bed slope within the vegetated patch. Ongoing scouring directs the flow's energy toward overcoming the rising <i>C</i>\n<sub>\n   <i>d</i>\n</sub> and bed slope, leading to a relatively stable stage with a low sediment transport rate. This study advances the existing understanding of the drag coefficient's role over a mobile bed within nonuniform flows. It also enhances the applicability of vegetation drag models in riverine restoration.</p>","author":"Yonggang Zhang, \nJinhua Cheng, \nMarwan A. Hassan, \nPing Wang, \nZi Wu","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"fe8ecd3871084f0d9d4c0941da817a0775c92ff0b223f6ee459f32b5b5fd877f","category":"Environment"}