{"title":"Epidemiological insights into paratuberculosis in camels in Saudi Arabia: Bayesian estimation of true prevalence and identification of risk factors","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299881","date":1710856800000,"content":"<p>by A. Al Naeem, M. Salem, F. Housawi, K. Al-Mohammed Salem, J. Hussen, M. Fayez, A. Zaghawa, P. Kostoulas</p>\r\n\r\nParatuberculosis, caused by <i>Mycobacterium avium</i> subsp. <i>paratuberculosis</i> (MAP), is a significant concern in the camel population of Saudi Arabia. This study aimed to provide epidemiological insights into the disease by estimating the true prevalence in camels in the Eastern Province and Riyadh, using a Bayesian estimation framework, and exploring the associated risk factors through a frequentist approach. A total of 1200 camel blood samples were collected and analyzed using an indirect ELISA method. The true herd-level prevalence was estimated at 0.7 (95% probability interval: 0.57 to 0.81), and the mean expected true animal-level prevalence was 0.17 (0.14 to 0.20). Risk factors associated with Map seropositivity were identified, including sex, breed, raising system, and production type. Females, single breed camels, and nomadic raising systems were found to have lower odds of seropositivity, while camels used for racing and show had significantly higher odds. The study’s Bayesian approach, adjusting for the imperfect accuracy of MAP tests, provides a nuanced understanding of the disease’s prevalence in the region. The integration of true prevalence estimates with risk factor analysis offers a comprehensive framework that can guide future policies and strategies in the fight against paratuberculosis in Saudi Arabia. The findings emphasize the importance of targeted control measures, underscoring the urgent need for interventions in Saudi Arabia’s camel population. By understanding the true disease prevalence and its associated risk factors, we can enhance disease management strategies, offering valuable insights for future control and eradication efforts in the region.","author":"A. Al Naeem","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"fe91861d6593ddf7bd3f407b8e4d84dbc0cf14fa98ab03dc8adf65f9bdb8c83f","category":"Interdisciplinary"}