{"title":"iPhone 15 Pro Overheating Concerns Highlighted in Two More Reports","link":"https://www.macrumors.com/2023/09/28/iphone-15-pro-overheating-reports/","date":1695907555000,"content":"iPhone 15 Pro and Pro Max overheating concerns continue to make headlines this week, with the topic <a href=\"https://www.wsj.com/tech/personal-tech/apple-new-iphone-15-overheat-dbd5171a\">highlighted by <em>The Wall Street Journal</em></a> and <a href=\"https://www.bloomberg.com/news/articles/2023-09-27/apple-iphone-15-pro-users-complain-that-device-can-get-too-hot\"><em>Bloomberg</em></a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iPhone-15-Pro-lineup.jpg\" alt width=\"2880\" height=\"1620\" />\r<br />\nBoth of the reports document anecdotal complaints from customers, and outline potential causes, but it's unclear how many devices are actually affected. <em>Bloomberg</em> said the overheating could be caused or compounded by the iPhone's setup process, suggesting that the higher temperatures might sometimes be a temporary condition. \r<br />\n\r<br />\n<em>The Wall Street Journal</em> quoted a customer who felt his iPhone 15 Pro Max remained hotter than his iPhone 13 Pro Max a few days after setting up the device:<blockquote>Thomas Galvin, a 23-year-old from Cleveland, says his iPhone 15 Pro Max has been \"super hot\" and that he is considering returning it. Apple customer support told him the heat was a result of setting up the new phone, but even a few days later, it is still \"way worse than the iPhone 13 Pro Max,\" he said.</blockquote><em>The Wall Street Journal</em>'s Joanna Stern said her iPhone 15 Pro Max did heat up while charging and performing processor-intensive tasks, such as gaming, but she said her iPhone 14 Pro Max reached similar temperatures in the same test. During typical everyday usage, Stern said the temperature of both devices was in a normal range. Many customers on social media have also said their iPhone 15 Pro is not experiencing any overheating, and the lack of hard data makes it unclear if there is a widespread problem.\r<br />\n\r<br />\nOn Wednesday, Apple supply chain analyst Ming-Chi Kuo said the titanium frame on iPhone 15 Pro models <a href=\"https://www.macrumors.com/2023/09/26/iphone-15-pro-overheating/\">negatively impacts thermal efficiency</a>. Kuo believes that Apple will likely address the issue through software updates, but he said improvements may be limited unless Apple lowers the performance of the A17 Pro chip.\r<br />\n\r<br />\nApple has not commented on the concerns, and it's unclear if the company will actually make any software optimizations in future iOS updates.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPhone-15-Pro\">iPhone 15 Pro (Buy Now)</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/28/iphone-15-pro-overheating-reports/\">iPhone 15 Pro Overheating Concerns Highlighted in Two More Reports</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-pro-overheating-concerns-highlighted-in-two-more-reports.2405278/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"fe91af2582d2a89ad65cf17e78a320b1e512d59dcea13f26490172eca7c2f7bb","category":"Apple"}