{"title":"Vision Pro Developer Kits Will Feature Customized Sizing, Tracking With AirTag","link":"https://www.macrumors.com/2023/07/27/vision-pro-developer-kit-information/","date":1690491130000,"content":"Apple this week began allowing developers to <a href=\"https://www.macrumors.com/2023/07/24/apple-vision-pro-developer-kits-now-available/\">apply for a Vision Pro developer kit</a>, which Apple plans to loan out to some companies and individuals for the purpose of app development. Developers who are approved for a headset will need to go through a customization process, which will provide a tailored fit for the lead person on the team.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2016/02/apple-vision-pro.jpeg\" alt width=\"1920\" height=\"1080\" />\r<br />\nAs shared by <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> and a <em>MacRumors</em> reader, Apple will use an app to help developers find the correct Head Band and Light Seal fit for the Vision Pro. The \"W\" could perhaps refer to width, while the \"N\" may reference the size of the nose bridge, which are measurements used for fitting glasses and other optical devices.\r<br />\n\r<br />\nDevelopers who wear glasses and need optical inserts will be put in touch with Zeiss to send Zeiss prescription information.\r<br />\n\r<br />\n<div><blockquote><p>Here’s the form a developer will need to fill out when they are approved for a Vision Pro development kit + the Measure and Fit app that uses the camera to determine head band and light seal size. Lenses will come from Zeiss directly. <a href=\"https://t.co/TG7Zuzgcay\">pic.twitter.com/TG7Zuzgcay</a></p>— Mark Gurman (@markgurman) <a href=\"https://twitter.com/markgurman/status/1684641969618759680?ref_src=twsrc%5Etfw\">July 27, 2023</a></blockquote> </div>\r<br />\nBased on the information that's been shared, kits will be tuned to a single developer, and other developers on the team may not be able to experience Vision Pro to its fullest because a snug fit between the face and the Light Seal is required.\r<br />\n\r<br />\nInformation on Apple's developer website also mentions a workflow for unpairing an AirTag when returning a kit, which suggests Apple is using its item trackers to keep tabs on the headsets. Vision Pro developer kits are shipped in a lockable Pelican case that needs to be kept locked when the headset is not in use, and developers must keep the headsets in a secure location. An AirTag could perhaps be included in the storage case to allow it to be tracked down in the event of a theft.\r<br />\n\r<br />\nEach developer that receives a kit will have the testing process overseen by a partnership manager, and developers will receive extra help with app development. Apple plans to prioritize developers who are creating apps that take advantage of the <a href=\"https://www.macrumors.com/roundup/visionos/\">visionOS</a> features and capabilities.\r<br />\n\r<br />\nWhile Apple has been accepting applications since earlier this week, there is no word yet on whether any developers have had their applications approved. It is not yet clear when developer kits will be shipped out, and we may not know because Apple is overseeing the testing process so closely.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/27/vision-pro-developer-kit-information/\">Vision Pro Developer Kits Will Feature Customized Sizing, Tracking With AirTag</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/vision-pro-developer-kits-will-feature-customized-sizing-tracking-with-airtag.2397083/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"feb20901b17fd0754bc18695fb272312a0b27f044af5c9fd554530028faa2214","category":"Apple"}