{"title":"เปิดตัวโครงการทดลองใช้รถยนต์ไฟฟ้าให้บริการแท็กซี่ใน สปป ลาว","link":"https://www.blognone.com/node/124689","date":1631277346000,"content":"<div><div><div><p>แอป LOCA ซึ่งเป็นแอปเรียกรถแท็กซี่แนวเดียวกับแกร็บ หรือ อูเบอร์ และ แบรนด์รถยน BYD จากจีน ร่วมกันเปิดตัวโครงการใช้รถยนต์ไฟฟ้า เพื่อศึกษาความเป็นไปได้ ในการนำเอารถยนต์ไฟฟ้ามาใช้ในการให้บริการขนส่งสาธารณะ ใน สปป ลาว จุดประสงค์ของโครงการนี้คือการนำเอารถยนต์ไฟฟ้ามาปรับใช้กับแท็กซี่ของโลก้า เพื่อเป็นการลดต้นทุนและผลกระทบต่อสิ่งแวดล้อมในระยะยาว</p>\n<p>การร่วมมือของทั้งสองมีเป้าหมายที่จะกลายเป็นผู้ริเริ่ม สนับสนุน และเพื่อแสดงให้ผู้สร้างกรอบนโยบาย รวมทั้งผู้บริโภคได้เห็นว่ารถยนต์ไฟฟ้านั้นเหมาะสมกับตลาดใน สปป ลาว รวมทั้งตอบโจตรที่ สปป ลาว วางวิสัยทรรศน์ที่ต้องการอยากจะเป็นแบ็ตเตอรี่ของอาเซียน</p>\n<p>ทั้งนี้ รถยนต์ที่จะใช้ในการทดลองครั้งนี้คือ BYD E2 โดยรถรุ่นนี้สามารถวิ่งได้ 305 กิโลเมตรต่อการชาร์จแบ็ตเตอรี่เต็มหนึ่งครั้ง รวมทั้งเป็นรถยนต์ไฟฟ้าที่มีราคาเหมาะกับตลาดของ สปป ลาว ที่สุดในตอนนี้</p>\n<p>ในปัจจุบัน โลก้าได้กลายมาเป็นผู้ให้บริการแท็กซี่สาธารระ ที่ใหญ่ที่สุดของ สปป ลาว โดยได้เปิดให้บริการแล้วใน 3 พื้นที่ประกอบด้วย นครหลวงเวียงจันทน์ นครหลวงพระบาง และนครจำปาสัก ซึ่งล่าสุด โลก้ายังกลายเป็นบริษัทสตาร์ทอัพ และธุรกิจขนาดเล็กใน สปป ลาว รายแรกที่อยู่ใน<a href=\"https://www.forbes.com/sites/forbesasiateam/2021/08/09/forbes-asia-100-to-watch/?sh=66a8a60a3752\">รายชื่อ 100 บริษัทที่น่าจับตามองของเอเชีย</a> ที่จัดโดย Forbes Asia อีกด้วย</p>\n<p>ที่มา - <a href=\"https://www.facebook.com/LocaLaos/posts/882298945714164\">Facebook LOCA Laos</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1eb7f7dc2ab78f95ebb52dacaa9b1c81.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/laos\">Laos</a></div><div><a href=\"/topics/taxi\">Taxi</a></div><div><a href=\"/topics/loca\">Loca</a></div><div><a href=\"/topics/byd\">BYD</a></div><div><a href=\"/topics/electric-car\">Electric Car</a></div></div></div>","author":"johnny.sayasane","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"feb4f15459185837c00e9ec2599cc24029a5f421afcfa25bf92d7cc5e9ece281","category":"Thai"}