{"title":"Critical tests for NASA’s large rocket remain as launch day edges closer","link":"https://arstechnica.com/?p=1807492","date":1635253886000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/51614473753_88c81a224f_k-800x497.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/51614473753_88c81a224f_k.jpg\">Enlarge</a> <span>/</span> The Orion spacecraft for NASA’s Artemis I mission is lifted above the Space Launch System rocket in the Vehicle Assembly Building at Kennedy Space Center. (credit: NASA)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Last week NASA and its myriad contractors for the Space Launch System and Orion spacecraft reached a significant milestone—creating a full stack of the rocket and deep-space capsule for the first time. The completed launch vehicle stands an impressive 98 meters (321 feet) tall inside the Vehicle Assembly Building at Kennedy Space Center.</p>\n<p>Although technicians and engineers still must put the rocket and spacecraft through a series of tests in the coming months, for the first time the agency discussed a possible launch window for the Artemis I mission. This launch, sending an uncrewed Orion spacecraft into orbit around the Moon and back, could happen as soon as a 15-day window from February 12 through 27.</p>\n\n<p>Much, and more, has to go right for NASA to make that launch window. So it's likely the Artemis I launch will slip further into the spring of next year. If serious technical issues are discovered, of course, the launch date could be delayed further. During a news briefing with reporters on Friday, launch officials reiterated several times that the rocket would not launch until the hardware was ready.</p></div><p><a href=\"https://arstechnica.com/?p=1807492#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1807492&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"feb60f422ac604cee7e5dcf4efc2cb08c4c598061495441dac6b4cb076cf8351","category":"Tech"}