{"title":"[IDC] ตลาดพีซี ไตรมาส 2/2023 ยังคงลดลงติดต่อกันเป็นไตรมาสที่หก จากหลายปัจจัยที่กระทบ","link":"https://www.blognone.com/node/134784","date":1689118440000,"content":"<div><div><div><p>บริษัทวิจัยตลาด IDC รายงานภาพรวมตลาดพีซีทั่วโลก ของไตรมาสที่ 2 ปี 2023 ภาพรวมมีจำนวนส่งมอบรวม 61.6 ล้านเครื่อง ลดลง 13.4% เมื่อเทียบกับไตรมาสที่ 2 ปี 2022 เป็นตัวเลขที่ลดลงติดต่อกันเป็นไตรมาสที่หก</p>\n<p>IDC บอกว่าสาเหตุยังมาจากปัจจัยเดิมเหมือนกับไตรมาสก่อนหน้า คือปัญหาภาพรวมเศรษฐกิจโลกที่ผันผวน ความต้องการพีซีที่ลดลงทั้งฝั่งลูกค้าบุคคล และลูกค้าองค์กร ตลอดจนงบประมาณด้านไอทีในการซื้ออุปกรณ์ใหม่ที่ลดลง</p>\n<p>ภาพรวมผู้ผลิตพีซีทุกราย พบปัญหาสินค้าคงคลังมีจำนวนสูง ส่งผลให้จำนวนส่งมอบลดลงระดับเลขสองหลัก ยกเว้น 2 รายคือ Apple และ HP โดยกรณีของ Apple มีจำนวนส่งมอบเพิ่มขึ้น 10.3% เนื่องจากตัวเลขเปรียบเทียบที่ต่ำในปี 2022 จากปัญหาซัพพลายเชน และ HP ที่ลดลงเพียง 0.8% จากการแก้ปัญหาสินค้าคงคลังจำนวนมากในปีที่ผ่านมา</p>\n<p>Ryan Reith รองประธานของ IDC ให้ความเห็นว่าผู้ผลิตพีซีไม่ต้องการให้เกิดปัญหาสินค้าขาดแคลน ส่งมอบไม่ทัน แบบที่เกิดช่วงปี 2020-2021 แต่ก็ไม่แน่ใจว่าควรเติมสินค้าคงคลังรอไว้ก่อน หากตลาดกลับมาเติบโตอีกครั้งหรือไม่ ส่วนฝั่งลูกค้าบุคคล IDC บอกว่า พฤติกรรมลูกค้ากลับมาเหมือนยุคก่อนโควิดแล้ว นั่นคือเลือกซื้อสมาร์ทโฟนก่อนพีซี ขณะที่ฝั่งลูกค้าองค์กร การควบคุมค่าใช้จ่ายยังสูงทำให้การสั่งซื้อพีซีใหม่ก็ลดลงตาม</p>\n<p>ส่วนแบ่งตลาดอันดับ 1-5 ยังคงเหมือนเดิมคือ Lenovo, HP, Dell, Apple และ Acer ตามลำดับ</p>\n<p>ที่มา: <a href=\"https://www.idc.com/getdoc.jsp?containerId=prUS51020623&amp;s=31\">IDC</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0e008924d7b0e49677251a1f407738c0.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/idc\">IDC</a></div><div><a href=\"/topics/pc\">PC</a></div><div><a href=\"/topics/market-research\">Market Research</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"fec36e664c473bfd6d396b3bf45de8901777a0431d709aea49edc3ad592a5726","category":"Thai"}