{"title":"Unraveling the Impacts: How Extreme Weather Events Disrupt Wood Product Markets","link":"https://onlinelibrary.wiley.com/doi/10.1029/2024EF004742?af=R","date":1725529253000,"content":"<h2>Abstract</h2>\n<p>While extreme weather events are often localized, the potential effects on global forests can be far reaching due to the interconnected nature of forest product markets. To better understand these dynamics, this study leverages historical forest-based wind damage data in the United States and applies this information as shocks within a global forest sector outlook model. A large, localized wind event modeled as a shock to the US South creates a one-time increase of 18.7 million m<sup>3</sup> from salvage harvest operations, equal to over 4% of national harvest. This crowds out traditional harvest activities, leading to downward pressure on prices in the short run, followed by a persistent effect that could take approximately 25 years to dissipate from markets. Average annual wind damage contributes downward pressure on roundwood prices between 1% and 4% in the United States, and this effect is distributed to other countries. The findings suggest that large, localized shocks reverberate across regions and wood product markets due to their interconnected supply chains and trade patterns, and these impacts have important temporal dynamics. Another key result is that the magnitude of these effects are offset by endogenous market reactions in other markets. In other words, unaffected regions change their harvesting patterns in order to compensate for changes in the availability of fiber, shedding light on the importance of capturing global channels as large shocks materialize in changes in market dynamics internationally. Monte Carlo simulations suggest a wide confidence band on salvage harvest rates and prices.</p>","author":"Craig M. T. Johnston, \nJesse D. Henderson, \nJinggang Guo, \nJeffrey P. Prestemon, \nJennifer Costanza","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"fec822d257293f6a6c5804d0e15b027b96b49c903a353b5923a1efcd8aa6cb4e","category":"Environment"}