{"title":"Assessment of Particulate Matter (PM2.5) and Air Quality Index (AQI) in Eight Locations of Lagos State, Nigeria","link":"https://www.preprints.org/manuscript/202409.1991/v1","date":1727259028000,"content":"Air pollution, particularly fine particulate matter (PM2.5), poses a significant threat to public health, especially in rapidly urbanizing areas like Lagos State. Despite the severity of the issue, there is a lack of comprehensive data on PM2.5 levels and the Air Quality Index (AQI) in Lagos. This study leverages data from AirQo, an innovative air quality monitoring network using low-cost sensors, to provide a detailed assessment of PM2.5 concentrations and AQI across eight locations in Lagos State, Nigeria. This approach offers real-time, continuous monitoring, filling a critical data gap in the region's air quality management efforts. This study uses AirQo data to assess the concentration levels and spatial distribution of PM2.5 and AQI across the selected eight locations. Data on PM2.5 concentrations were obtained from AirQo sensors deployed across the eight strategic locations in Lagos. The spatial distribution of PM2.5 levels and AQI were analyzed, and the results were compared with national and international air quality standards. The findings revealed that PM2.5 levels (minimum – 6.28 µg/m3 (Ikeja) and maximum - 204.68 µg/m3 (Banana Island) in many areas of Lagos exceed annual WHO and national air quality guidelines, indicating significant health risks. The spatial analysis identified pollution hotspots, particularly in densely populated and industrial regions. The data suggested vehicular emissions and industrial activities as major contributors to high PM2.5 levels. This study underscores the severe air quality issues in Lagos State, emphasizing the need for immediate and targeted interventions to mitigate PM2.5 pollution. The use of AirQo sensors proved effective in providing accurate and timely data for air quality assessment. It is recommended that Lagos State implements stricter emission controls, promotes cleaner technologies, and enhances public transportation systems to reduce traffic-related pollution. Additionally, expanding the air quality monitoring network and incorporating more environmental data will provide a more comprehensive understanding of air pollution impacts, thereby facilitating better policy and public health decisions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"fed45ff90faf1df838d2345694560272d0aed1f1086a9adb20ac767c6e1cfb17","category":"Interdisciplinary"}