{"title":"Understanding App Directory Architecture In Next.js","link":"https://smashingmagazine.com/2023/02/understanding-app-directory-architecture-next-js/","date":1675249200000,"content":"<p>Since <a href=\"https://nextjs.org/blog/next-13\">Next.js 13 release</a>, there’s been some debate about how stable the shiny new features packed in the announcement are. On “<a href=\"https://www.smashingmagazine.com/2022/11/whats-new-nextjs-13/\">What’s New in Next.js 13</a>?” we have covered the release announced and established that though carrying some interesting experiments, Next.js 13 is definitely stable. And since then, most of us have seen a very clear landscape when it comes to the new <code>&lt;Link&gt;</code> and <code>&lt;Image&gt;</code> components, and even the (still beta) <code>@next/font</code>; these are all good to go, instant profit. <strong>Turbopack</strong>, as clearly stated in the announcement, is still alpha: aimed strictly for <strong>development</strong> builds and still heavily under development. Whether you can or can’t use it in your daily routine depends on your stack, as there are integrations and optimizations still somewhere on the way. This article’s scope is strictly about the main character of the announcement: the new App Directory architecture (AppDir, for short).</p>\n<p>Because the <strong>App directory</strong> is the one that keeps bringing questions due to it being partnered with an important evolution in the React ecosystem — React Server Components — and with edge runtimes. It clearly is the shape of the future of our Next.js apps. It is <strong>experimental</strong> though, and its <a href=\"https://beta.nextjs.org/docs/app-directory-roadmap\">roadmap</a> is not something we can consider will be done in the next few weeks. So, should you use it in production now? What advantages can you get out of it, and what are the pitfalls you may find yourself climbing out of? As always, the answer in software development is the same: it depends.</p>\nWhat Is The App Directory Anyway?\n<p>It is the new strategy for handling routes and rendering views in Next.js. It is made possible by a couple of different features tied together, and it is built to make the most out of React concurrent features (yes, we are talking about React Suspense). It brings, though, a big paradigm shift in how you think about components and pages in a Next.js app. This new way of building your app has <strong>a lot</strong> of very welcomed improvements to your architecture. Here’s a short, non-exhaustive list:</p>\n<ul>\n<li>Partial Routing.<ul>\n<li>Route Groups.</li>\n<li>Parallel Routes.</li>\n<li>Intercepting Routes.</li>\n</ul>\n</li>\n<li>Server Components vs. Client Components.</li>\n<li>Suspense Boundaries.</li>\n<li>And much more, check the <a href=\"https://beta.nextjs.org/docs#features-overview\">features overview</a> in the new documentation.</li>\n</ul>\n<h3>A Quick Comparison</h3>\n<p>When it comes to the current routing and rendering architecture (in the Pages directory), developers were required to think of data fetching per route.</p>\n<ul>\n<li><code>getServerSideProps</code>: Server-Side Rendered;</li>\n<li><code>getStaticProps</code>: Server-Side Pre-Rendered and/or Incremental Static Regeneration;</li>\n<li><code>getStaticPaths</code> + <code>getStaticProps</code>: Server-Side Pre-Rendered or Static Site Generated.</li>\n</ul>\n<p>Historically, it hadn’t yet been possible to choose the rendering strategy on a per-page basis. Most apps were either going full Server-Side Rendering or full Static Site Generation. Next.js created enough abstractions that made it a standard to think of routes individually within its architecture.</p>\n<p>Once the app reaches the browser, hydration kicks in, and it’s possible to have routes collectively sharing data by wrapping our <code>_app</code> component in a React Context Provider. This gave us tools to <em>hoist</em> data to the top of our rendering tree and cascade it down toward the leaves of our app.</p>\n<pre><code>import { type AppProps } from 'next/app';\n\nexport default function MyApp({ Component, pageProps }: AppProps) {\n  return (\n        &lt;SomeProvider&gt;\n            &lt;Component {...pageProps} /&gt;\n        &lt;/SomeProvider&gt;\n}\n</code></pre>\n\n<p>The ability to render and organize required data per route made this approach an almost good tool for when data absolutely needed to be available globally in the app. And while this strategy will allow data to spread throughout the app, wrapping everything in a Context Provider bundles hydration to the root of your app. It is not possible anymore to render any branches on that tree (any route within that Provider context) on the server. </p>\n<p>Here, enters the <strong>Layout Pattern</strong>. By creating wrappers around pages, we could opt in or out of rendering strategies per route again instead of doing it once with an app-wide decision. Read more on how to manage states in the Pages Directory on the article “<a href=\"https://www.smashingmagazine.com/2021/08/state-management-nextjs/\">State Management in Next.js</a>” and on the <a href=\"https://nextjs.org/docs/basic-features/layouts\">Next.js documentation</a>.</p>\n<p>The <strong>Layout Pattern</strong> proved to be a great solution. Being able to granularly define rendering strategies is a very welcomed feature. So the App directory comes in to put the layout pattern front and center. As a first-class citizen of Next.js architecture, it enables enormous improvements in terms of performance, security, and data handling.</p>\n<p>With React concurrent features, it’s now possible to stream components to the browser and let each one handle its own data. So rendering strategy is even more granular now — instead of page-wide, it’s component-based. Layouts are nested by default, which makes it more clear to the developer what impacts each page based on the file-system architecture. And on top of all that, it is mandatory to explicitly turn a component client-side (via the “use client” directive) in order to use a Context.</p>\nBuilding Blocks Of The App Directory\n<p>This architecture is built around the <strong>Layout Per Page Architecture</strong>. Now, there is no <code>_app</code>, neither is there a <code>_document</code> component. They have both been replaced by the root <code>layout.jsx</code> component. As you would expect, that’s a special layout that will wrap up your entire application.</p>\n<pre><code>export function RootLayout({ children }: { children: React.ReactNode }) {\n    return (\n        &lt;html lang=\"en\"&gt;\n            &lt;body&gt;\n                {children}\n            &lt;/body&gt;\n        &lt;/html&gt;\n}\n</code></pre>\n\n<p>The <strong>root layout</strong> is our way to manipulate the HTML returned by the server to the entire app at once. It is a server component, and it <strong>does not</strong> render again upon navigation. This means any data or state in a layout will persist throughout the lifecycle of the app. </p>\n<p>While the <strong>root layout</strong> is a special component for our entire app, we can also have root components for other building blocks:</p>\n<ul>\n<li><code>loading.jsx</code>: to define the Suspense Boundary of an entire route;</li>\n<li><code>error.jsx</code>: to define the Error Boundary of our entire route;</li>\n<li><code>template.jsx</code>: similar to the layout, but re-renders on every navigation. Especially useful to handle state between routes, such as in or out transitions.</li>\n</ul>\n<p>All of those components and conventions are <strong>nested by default</strong>. This means that <code>/about</code> will be nested within the wrappers of <code>/</code>  automatically.</p>\n<p>Finally, we are also required to have a <code>page.jsx</code> for every route as it will define the main component to render for that URL segment (as known as the place you put your components!). These are obviously not nested by default and will only show in our DOM when there’s an exact match to the URL segment they correspond to.</p>\n<p>There is much more to the architecture (and even more coming!), but this should be enough to get your mental model right before considering migrating from the <strong>Pages directory</strong> to the <strong>App directory</strong> in production. Make sure to check on the official <a href=\"https://beta.nextjs.org/docs/upgrade-guide\">upgrade guide</a> as well.</p>\n<h3>Server Components In A Nutshell</h3>\n<p>React Server Components allow the app to leverage infrastructure towards better performance and overall user experience. For example, the immediate improvement is on bundle size since RSC won’t carry over their dependencies to the final bundle. Because they’re rendered in the server, any kind of parsing, formatting, or component library will remain on the server code. Secondly, thanks to their asynchronous nature, Server Components are <strong>streamed</strong> to the client. This allows the rendered HTML to be progressively enhanced on the browser.</p>\n<p>So, Server Components lead to a more predictable, cacheable, and constant size of your final bundle breaking the linear correlation between app size and bundle size. This immediately puts RSC as a best practice versus traditional React components (which are now referred to as client components to ease disambiguation).</p>\n<p>On Server Components, fetching data is also quite flexible and, in my opinion, feels closer to vanilla JavaScript — which always smooths the learning curve. For example, understanding the JavaScript runtime makes it possible to define data-fetching as either parallel or sequential and thus have more fine-grained control on the resource loading waterfall.</p>\n<ul>\n<li><strong>Parallel Data Fetching</strong>, waiting for all:</li>\n</ul>\n<pre><code>import TodoList from './todo-list'\n\nasync function getUser(userId) {\n  const res = await fetch(`https://&lt;some-api&gt;/user/${userId}`);\n  return res.json()\n}\n\nasync function getTodos(userId) {\n  const res = await fetch(`https://&lt;some-api&gt;/todos/${userId}/list`);\n  return res.json()\n}\n\nexport default async function Page({ params: { userId } }) {\n  // Initiate both requests in parallel.\n  const userResponse = getUser(userId)\n  const  = getTodos(username)\n\n  // Wait for the promises to resolve.\n  const [user, todos] = await Promise.all([userResponse, todosResponse])\n\n  return (\n    &lt;&gt;\n      &lt;h1&gt;{user.name}&lt;/h1&gt;\n      &lt;TodoList list={todos}&gt;&lt;/TodoList&gt;\n    &lt;/&gt;\n  )\n}\n</code></pre>\n\n<ul>\n<li><strong>Parallel</strong>, waiting for one request, streaming the other:</li>\n</ul>\n<pre><code>async function getUser(userId) {\n  const res = await fetch(`https://&lt;some-api&gt;/user/${userId}`);\n  return res.json()\n}\n\nasync function getTodos(userId) {\n  const res = await fetch(`https://&lt;some-api&gt;/todos/${userId}/list`);\n  return res.json()\n}\n\nexport default async function Page({ params: { userId } }) {\n  // Initiate both requests in parallel.\n  const userResponse = getUser(userId)\n  const todosResponse = getTodos(userId)\n\n  // Wait only for the user.\n  const user = await userResponse\n\n  return (\n    &lt;&gt;\n      &lt;h1&gt;{user.name}&lt;/h1&gt;\n            &lt;Suspense fallback={&lt;div&gt;Fetching todos...&lt;/div&gt;}&gt;\n          &lt;TodoList listPromise={todosResponse}&gt;&lt;/TodoList&gt;\n            &lt;/Suspense&gt;\n    &lt;/&gt;\n  )\n}\n\nasync function TodoList ({ listPromise }) {\n  // Wait for the album's promise to resolve.\n  const todos = await listPromise;\n\n  return (\n    &lt;ul&gt;\n      {todos.map(({ id, name }) =&gt; (\n        &lt;li key={id}&gt;{name}&lt;/li&gt;\n      ))}\n    &lt;/ul&gt;\n  );\n}\n</code></pre>\n\n<p>In this case, <code>&lt;TodoList&gt;</code> receives an in-flight Promise and needs to <code>await</code> it before rendering. The app will render the <strong>suspense fallback</strong> component until it’s all done.</p>\n<ul>\n<li><strong>Sequential Data Fetching</strong> fires one request at a time and awaits for each:</li>\n</ul>\n<pre><code>async function getUser(username) {\n  const res = await fetch(`https://&lt;some-api&gt;/user/${userId}`);\n  return res.json()\n}\n\nasync function getTodos(username) {\n  const res = await fetch(`https://&lt;some-api&gt;/todos/${userId}/list`);\n  return res.json()\n}\n\nexport default async function Page({ params: { userId } }) {\n  const user = await getUser(userId)\n\n\n  return (\n    &lt;&gt;\n      &lt;h1&gt;{user.name}&lt;/h1&gt;\n            &lt;Suspense fallback={&lt;div&gt;Fetching todos...&lt;/div&gt;}&gt;\n            &lt;TodoList userId={userId} /&gt;\n            &lt;/Suspense&gt;\n    &lt;/&gt;\n  )\n}\n\nasync function TodoList ({ userId }) {\n  const todos = await getTodos(userId);\n\n  return (\n    &lt;ul&gt;\n      {todos.map(({ id, name }) =&gt; (\n        &lt;li key={id}&gt;{name}&lt;/li&gt;\n      ))}\n    &lt;/ul&gt;\n  );\n}\n</code></pre>\n\n<p>Now, <code>Page</code> will fetch and wait on <code>getUser</code>, then it will start rendering. Once it reaches <code>&lt;TodoList&gt;</code>, it will fetch and wait on <code>getTodos</code>. This is still more granular than what we are used to it with the Pages directory.</p>\n<p>Important things to note:</p>\n<ul>\n<li>Requests fired within the same component scope will be fired in parallel (more about this at <a href=\"#extended-fetch-api\">Extended Fetch API</a> below).</li>\n<li>Same requests fired within the same server runtime will be deduplicated (only one is actually happening, the one with the shortest cache expiration).</li>\n<li>For requests that won’t use <code>fetch</code> (such as third-party libraries like SDKs, ORMs, or database clients), route caching will not be affected unless manually configured via <a href=\"https://beta.nextjs.org/docs/data-fetching/fetching#segment-cache-configuration\">segment cache configuration</a>.</li>\n</ul>\n<pre><code>export const revalidate = 600; // revalidate every 10 minutes\n\nexport default function Contributors({\n  params\n}: {\n  params: { projectId: string };\n}) {\n    const { projectId }  = params\n    const { contributors } = await myORM.db.workspace.project({ id: projectId })\n\n  return &lt;ul&gt;{*/ ... */}&lt;/ul&gt;;\n}\n</code></pre>\n\n<p>To point out how much more control this gives developers: when within the pages directory, rendering would be blocked until all data is available. When using <code>getServerSideProps</code>, the user would still see the loading spinner until data for the entire route is available. To mimic this behavior in the App directory, the fetch requests would need to happen in the <code>layout.tsx</code> for that route, so always avoid doing it. An “all or nothing” approach is rarely what you need, and it leads to worse perceived performance as opposed to this granular strategy.</p>\nExtended Fetch API\n<p>The syntax remains the same: <code>fetch(route, options)</code>. But according to the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API\">Web Fetch Spec</a>, the <code>options.cache</code> will determine how this API will interact with the <strong>browser cache.</strong> But in Next.js, it will interact with the <a href=\"https://beta.nextjs.org/docs/data-fetching/fundamentals#caching-data\">framework server-side HTTP Cache</a>. </p>\n<p>When it comes to the extended <strong>Fetch API</strong> for Next.js and its cache policy, two values are important to understand:</p>\n<ul>\n<li><code>force-cache</code>: the default, looks for a fresh match and returns it.</li>\n<li><code>no-store</code> or <code>no-cache</code>: fetches from the remote server on every request.</li>\n<li><code>next.revalidate</code>: the same syntax as ISR, sets a hard threshold to consider the resource fresh.</li>\n</ul>\n<pre><code>fetch(`https://route`, { cache: 'force-cache', next: { revalidate: 60 } })\n</code></pre>\n\n<p>The caching strategy allows us to categorize our requests:</p>\n<ul>\n<li><strong>Static Data</strong>: persist longer. E.g., blog post.</li>\n<li><strong>Dynamic Data:</strong> changes often and/or is a result of user interaction. E.g., comments section, shopping cart.</li>\n</ul>\n<p>By default, every data is considered <strong>static data</strong>. This is due to the fact <code>force-cache</code> is the default caching strategy. To opt out of it for fully dynamic data, it’s possible to define <code>no-store</code> or <code>no-cache</code>.</p>\n<p>If a dynamic function is used (e.g., setting cookies or headers), the default will switch from <code>force-cache</code> to <code>no-store</code>!</p>\n<p>Finally, to implement something more similar to Incremental Static Regeneration, you’ll need to use <code>next.revalidate</code>. With the benefit that instead of being defined for the entire route, it only defines the component it’s a part of.</p>\nMigrating From Pages To App\n<p>Porting logic from <strong>Pages directory</strong> to <strong>Apps directory</strong> may look like a lot of work, but Next.js has worked prepared to allow both architectures to coexist, and thus <strong>migration can be done incrementally</strong>. Additionally, there is a very good <strong><a href=\"https://beta.nextjs.org/docs/upgrade-guide#migrating-from-pages-to-app\">migration guide</a></strong> in the documentation; I recommend you to read it fully before jumping into a refactoring. </p>\n<p>Guiding you through the migration path is beyond the scope of this article and would make it redundant to the docs. Alternatively, in order to add value on top of what the official documentation offers, I will try to provide insight into the friction points my experience suggests you will find.</p>\n<h3>The Case Of React Context</h3>\n<p>In order to provide all the benefits mentioned above in this article, RSC can’t be interactive, which means they don’t have hooks. Because of that, we have decided to push our client-side logic to the leaves of our rendering tree as late as possible; once you add interactiveness, children of that component will be client-side. </p>\n<p>In a few cases pushing some components will not be possible (especially if some key functionality depends on React Context, for example). Because most libraries are prepared to defend their users against Prop Drilling, many create context providers to skip components from root to distant descendants. So ditching React Context entirely may cause some external libraries not to work well.</p>\n<p>As a temporary solution, there is an escape hatch to it. A client-side wrapper for our providers:</p>\n<pre><code>// /providers.jsx\n‘use client’\n\nimport { type ReactNode, createContext } from 'react';\n\nconst SomeContext = createContext();\n\nexport default function ThemeProvider({ children }: { children: ReactNode }) {\n  return (\n    &lt;SomeContext.Provider value=\"data\"&gt;\n      {children}\n    &lt;/SomeContext.Provider&gt;\n  );\n}\n</code></pre>\n\n<p>And so the layout component will not complain about skipping a client component from rendering. </p>\n<pre><code>// app/.../layout.jsx\nimport { type ReactNode } from 'react';\nimport Providers from ‘./providers’;\n\nexport default function Layout({ children }: { children: ReactNode }) {\n    return (\n    &lt;Providers&gt;{children}&lt;/Providers&gt;\n  );\n}\n</code></pre>\n\n<p>It is important to realize that once you do this, the entire branch will become client-side rendered. This approach will take everything within the <code>&lt;Providers&gt;</code> component to not be rendered on the server, so use it only as a last resort.</p>\n<h3>TypeScript And Async React Elements</h3>\n<p>When using <code>async/await</code> outside of Layouts and Pages, TypeScript will yield an error based on the response type it expects to match its JSX definitions. It is supported and will still work in runtime, but according to Next.js documentation, this needs to be fixed upstream in TypeScript.</p>\n<p>For now, the solution is to add a comment in the above line <code>{/* @ts-expect-error Server Component */}</code>.</p>\n<h3>Client-side Fetch On The Works</h3>\n<p>Historically, Next.js has not had a built-in data mutation story. Requests being fired from the client side were at the developer’s own discretion to figure out. With React Server Components, this is bound for a chance; the React team is working on a <code>use</code> hook which will accept a <code>Promise</code>, then it will handle the promise and return the value directly.</p>\n<p>In the future, this will supplant most bad cases of <code>useEffect</code> in the wild (more on that in the excellent talk “<a href=\"https://www.youtube.com/watch?v=bGzanfKVFeU\">Goodbye UseEffect</a>”) and possibly be the standard for handling asynchronicity (fetching included) in client-side React. </p>\n<p>For the time being, it is still recommended to rely on libraries like React-Query and SWR for your client-side fetching needs. Be especially aware of the <code>fetch</code> behavior, though!</p>\nSo, Is It Ready?\n<p>Experimenting is at the essence of moving forward, and we can’t make a nice omelet without breaking eggs. I hope this article has helped you answer this question for your own specific use case.</p>\n<p>If on a greenfield project, I’d possibly take <strong>App directory</strong> for a spin and keep <strong>Page directory</strong> as a fallback or for the functionality that is critical for business. If refactoring, it would depend on how much client-side fetching I have. Few: do it; many: probably wait for the full story.</p>\n<p>Let me know your thoughts on <a href=\"https://atila.io/twitter\">Twitter</a> or in the comments below.</p>\n<h3>Further Reading On SmashingMag</h3>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/11/optimizing-vue-app/\">Optimizing A Vue App</a>”, Michelle Barker</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/10/nodejs-authentication-twilio-verify/\">Node.js Authentication With Twilio Verify</a>”, Alexander Godwin</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/07/new-pattern-jamstack-segmented-rendering/\">A New Pattern For The Jamstack: Segmented Rendering</a>”, Eric Burel</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2022/07/look-remix-differences-next/\">A Look At Remix And The Differences With Next.js</a>”, Facundo Giuliani</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"f300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"feeea3006dca57248e22b55ddd01032345dbc8602dd6cfc6f52954","category":"Tech"}