{"title":"VS Code ออกเวอร์ชัน 1.57 เพิ่มฟีเจอร์จำกัดการรันโค้ดที่ยังไม่เชื่อถือ, แก้ไขโค้ดบน GitHub โดยตรงไม่ต้องโคลนลงเครื่อง","link":"https://www.blognone.com/node/123345","date":1624422119000,"content":"<div><div><div><p>ไมโครซอฟท์ออกอัพเดตเวอร์ชัน 1.57 ให้ Visual Studio Code โดยได้เพิ่มฟีเจอร์ด้านความปลอดภัยและสิ่งอำนวยความสะดวกหลายอย่าง</p>\n<p>ฟีเจอร์สำคัญอย่างแรกของอัพเดตนี้ คือ Workspace Trust ซึ่งจะช่วยจำกัดสิทธิการรันโค้ดที่ผู้ใช้ยังไม่เชื่อถือ เพื่อความปลอดภัยในกรณีอย่างเช่นการดึงโค้ดโปรเจ็กต์ open-source จาก repository สาธารณะที่ไม่คุ้นเคยมาทดลองใช้งาน ซึ่งมีความเป็นไปได้ว่าจะมีการฝังโค้ดประสงค์ร้ายแอบแฝงไว้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/204c1a8c18f0595dc21fab0ec5e8902c.png\" /></p>\n<p>โดยหลังจากได้อัพเดตฟีเจอร์ดังกล่าวแล้ว เมื่อเปิด workspace ใดๆ นักพัฒนาจะมีสิทธิที่จะเลือกไม่เชื่อถือต้นทางของโค้ดภายใต้ workspace นั้น ซึ่งจะส่งผลให้ VS Code เข้าสู่ restricted mode และจะปิดฟีเจอร์ทั้งในส่วนของการสั่งรัน task, การดีบัก, การตั้งค่าเฉพาะ workspace และการใช้งานส่วนขยาย เพื่อป้องกันไม่ให้เกิดการรันโค้ดที่อาจเป็นอันตรายอัตโนมัติ</p>\n<p>อย่างที่สองเป็นการเพิ่ม<a href=\"https://marketplace.visualstudio.com/items?itemName=github.remotehub\">ส่วนขยาย Remote Respositories</a> ซึ่งจะช่วยเพิ่มความสะดวกให้กับผู้ที่ใช้ GitHub เป็น Source Control ด้วยการเปิดให้สามารถดึงโค้ดจาก GitHub มาแก้ไขบน VS Code ได้โดยตรง ไม่ต้องโคลน repository มายังเครื่องที่ใช้พัฒนาก่อน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/56fabe9a79e2776e8f0d8ef6a8ff0afa.png\" /></p>\n<p>ช่วยให้นักพัฒนาสามารถดึงโค้ดมาศึกษาหรือแก้ไขโค้ดเล็กๆ น้อยๆ (เช่นในส่วนโค้ดที่ไม่จำเป็นต้องบิลด์หรือรันเทสต์) ได้อย่างรวดเร็ว โดยแลกกับการจำกัดความสามารถของ VS Code ในหลายๆ ส่วนเช่นการดีบัก, terminal, IntelliSense รวมไปถึงส่วนขยายบางตัวที่จำเป็นต้องอ่านไฟล์จากเครื่องเท่านั้น</p>\n<p>ส่วนการปรับปรุงอื่นๆ ที่ไมโครซอฟท์ยกให้เป็นไฮไลท์ของอัพเดตครั้งนี้มีดังนี้</p>\n<ul>\n<li>ปรับปรุงหน้าแนะนำการตั้งค่าและวิธีการใช้งานใหม่ สามารถแสดงคำแนะนำจากส่วนขยายที่ติดตั้งไว้ด้วย</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/34216a2e5f61187714fcaf8e6cfab87a.gif\" /></p>\n<ul>\n<li>เพิ่มการแสดงผลแท็บเมื่อเปิด terminal ใช้งานมากกว่าหนึ่งตัว สามารถแสดงสถานะของการรัน task, คลิกแล้วลากเมาส์เพื่อจัดเรียงลำดับหรือจัดกลุ่มแท็บได้</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/313cfaf4f650b6a52cb8356862d2d231.png\" /></p>\n<ul>\n<li>JavaScript debugger สามารถเรียก Microsoft Edge Developer Tools เพื่อตรวจสอบ DOM และเน็ตเวิร์คได้จาก VS Code โดยตรง</li>\n<li>รองรับแท็ก @link สำหรับการสร้างลิงก์ไปยัง symbol เมื่อเขียน document ด้วย JSDoc</li>\n<li>รองรับการใช้คำสั่ง Go to Definition กับการ import รูปหรือไฟล์ css</li>\n</ul>\n<p>ที่มา - <a href=\"https://code.visualstudio.com/updates/v1_57\">Visual Studio Code</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/visual-studio-code\">Visual Studio Code</a></div><div><a href=\"/topics/development\">Development</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div></div></div>","author":"Job_The_Gamer","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"fefef198ef8be18ea5147828ef28a00a1f0adff2f70a97467c6df9f2906bbb1c","category":"Thai"}