{"title":"Improved Protocol for Efficient Agrobacterium-mediated Transformation in Medicago sativa L.","link":"https://www.preprints.org/manuscript/202408.1874/v1","date":1724684990000,"content":"Medicago sativa L. (Alfalfa) is a globally recognized forage legume that has recently gained attention for its high protein content, making it suitable for both human and animal consumption. However, due to its perennial nature and autotetraploid genetics, conventional plant breeding requires a longer timeframe compared to other crops. Therefore, genetic engineering offers a faster route for trait modification and improvement. Here, we describe a protocol for achieving efficient transient gene expression in alfalfa through genetic transformation with the Agrobacterium tumefaciens pCAMBIA1304 vector. This vector contains the reporter genes β-glucuronidase (GUS) and green fluorescent protein (GFP), along with a selectable hygromycin B phosphotransferase gene, all driven by the CaMV 35s promoter. Various transformation parameters—such as different explant types, leaf ages, leaf sizes, wounding types, bacterial concentrations (OD600nm), tissue preculture periods, incubation periods, co-cultivation periods, and different concentrations of acetosyringone, silver nitrate, and calcium chloride—were optimized using 3-week-old plantlets raised in vitro. Results were attained from data based on the semi-quantitative observation of the percentage and number of GUS spots on different days of agro-infection in alfalfa explants. The highest percentage (76.2%) of GUS-positive alfalfa leaf explants was observed after 3 days of agroinfection at a bacterial concentration of 0.6, 2 days of preculture, 30 min of infection time, 150 µM acetosyringone, 4 mM calcium chloride, and 75 µM silver nitrate. The transient expression of genes of interest was confirmed via histochemical GUS and GFP assays. The results based on transient reporter gene expression suggest that various factors influence T-DNA delivery in the Agrobacterium-mediated transformation of alfalfa.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ff0d0735ed85b096d72ae238424079368d05d9a370908ece1cf129459c0f6701","category":"Interdisciplinary"}