{"title":"PSVI-13 Formulated botanical preparation improves passive immunity from sows to piglets","link":"https://academic.oup.com/jas/article/102/Supplement_2/323/7664970?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The medicinal plant turmeric increases immunoglobulin production in livestock and rodents. The purpose of this investigation was to determine the effect of a formulated blend of turmeric, capsicum, and black pepper oleoresins (TCB) on colostrum and milk quality of sows and health of piglets. Twenty-four sows (Parity 2+) were assigned to one of the following dietary treatments (n = 8 sows/treatment): 1) unsupplemented control (CON); 2) 100 ppm of TCB (TCB-100), and 3) 150 ppm of TCB (TCB-150). Supplementation was from 87 d of gestation until weaning (d 28). During gestation and lactation, individually housed sows were fed fortified corn and soybean meal diets at 2.5 kg/d and 2.5 + 0.25 * piglet kg/d, respectively, with ad libitum access to water. Blood and colostrum samples were collected from the sow within 24 h of farrowing for IgG and IgA analysis, and milk samples were collected weekly for IgA analysis. Piglet blood samples were collected at weaning (d 28) for IgG and IgA analysis and at 4-wk post weaning for IgA analysis. Data were subjected to a one-way ANOVA (or two-way in the case of repeated measures), with tests for linear trend of the dose response. Serum IgG and IgA in sows at farrowing were linearly increased with TCB supplementation (Table). Similarly, colostrum IgG, and colostrum and milk IgA were linearly increased with TCB, with greatest concentration in TCB-150 relative to CON (Table). Serum IgG in piglets was not affected by sow supplementation, but serum IgA was linearly increased. Interestingly, the increase in serum IgA persisted through 4-wk post-weaning. Diarrhea frequency in piglets 1 to 4 wk post-weaning was linearly decreased with TCB supplementation (Table). A follow-up study with a similar design was conducted with supplementation of TCB-150 starting at 108 d of gestation to represent a commercial application in lactating diets only. Sow serum IgG and IgA at farrowing were measured, and both were significantly increased with TCB-150 (Table). In conclusion, supplementation of TCB at 150 ppm improves colostrum and milk quality, and passive immunity from sows to piglets. Furthermore, enteric health of the piglets was improved. Additional experiments to determine the implications of this response on sow and piglet health and performance in commercial conditions are warranted.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ff105ea1df6a6b567645695cf20688f3800f87f3ea84b456fe091f0d3421ba6c","category":"Environment"}