{"title":"Assessing the Sound and Heat Insulation Characteristics of Nonwoven Composite Structures: Evaluation of Polypropylene (PP)/Polybutylene Terephthalate (PBT) Meltblown, Polyamide Nanofiber Inner Layers and Recycled Polyester (r-PET) Thermo Bonded Outer","link":"https://www.preprints.org/manuscript/202404.0305/v1","date":1712238828000,"content":"The sound and heat insulation are among the most important concerns in modern life and nonwoven composite structures are highly effective in noise reduction and heat insulation. In this study, three layered nonwoven composite structures composed of recycled polyester (r-Pet) based thermo bonded nonwoven outer layer and meltblown nonwovens from PP and PBT as inner layers were formed to provide heat and sound insulation. Fiber fineness and cross section of thermo bonded outer layer, fiber type (PP/PBT), areal weight (100/200g/m2) and process conditions (calendared/non-calendared) of meltblown inner layer have changed systematically and the influence of these parameters on thickness, bulk density, air permeability, sound absorption coefficient and thermal resistance of composite structures were analyzed statistically. Also; the results were compared with composite structures including electrospun nano fiber web inner layer and with structures without inner layer. It was determined that sound absorption coefficients ranging between 0.77-0.98 for moderate sound frequencies and 0.99-1 for higher sound frequencies were acquired with developed nonwoven composite structures. Besides, higher sound absorption coefficients were obtained as 0.71 and 0.74 for low sound frequencies such as 800 and 1000Hz, respectively. As a result of this study it can be concluded that developed nonwoven composite structures that provides better sound absorption coefficients and similar thermal conductivity values compared to previous studies and materials in the market can be used as insulation material in required areas.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ff15319d1b7e6fc735502577dafe6e58e5cea1214a33bdb840d8be22d6f67139","category":"Interdisciplinary"}