{"title":"275 Assessment of changes in hemoglobin concentration (Hb) in sows and their offspring over two consecutive reproductive cycles","link":"https://academic.oup.com/jas/article/102/Supplement_2/171/7665038?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>There remains a knowledge gap regarding changes in hematological parameters, such as Hb, throughout the reproductive cycle of a sow. The principle aim of this study was to assess Hb concentartions in sows and their offspring over at least two consecutive reproductive cycles. Blood Hb measurements were initiated during the gilt stage and continued through parities 1 and 2, with measurements taken at six time points (d 30, 60, 90, and 112 of gestation; d 2 and 17 of lactation) involving a total of 13 sows. Sow body weight (BW) during gestation was 193.2 ± 38.1 kg for parity 1 and 220.7 ± 26.2 kg for parity 2; in lactation, sow BW was 201.5 ± 14.3 kg for parity 1 and 214.0 ± 19.6 kg for parity 2. Sow daily iron (Fe) intake, based on analyzed Fe content, was 0.621 ± 0.06 g during gestation and 1.79 ± 0.15 g during lactation across parities 1 and 2, which represents more than a 2-fold greater Fe intake than NRC 2012 requirement estimates. All liveborn piglets (n = 204 for parity 1; n = 201 for parity 2) underwent Hb measurements. Blood Hb concentrations were assessed within 24 h of birth before iron supplementation (200 mg iron dextran) and again at 17 d of age. Sows and piglets were classified as either anemic (Hb &lt; 10 g/dL) or non-anemic (Hb ≥ 10 g/dL). Analysis of variance included the main effect of day, parity and their interaction based on Tukey’s comparison. In gestation Hb was less (<span>P</span> = 0.03) at d 90 in parity 1 and at d 90 and 112 in parity 2 (Table 1). Across parity, Hb was less (<span>P</span> = 0.02) at d 60 in parity 2. In lactation, Hb was least (<span>P</span> = 0.0002) at d 17 in parity 1 where sows were deemed anemic; in parity 2, sows were deemed anemic throughout lactation. The total number of piglets born and born alive was 17.15 ± 2.03 and 16.0 ± 1.9, respectively, for parity 1, and 17.0 ± 3.11 and 15.85 ± 2.41, respectively, for parity 2. Regardless of parity, piglet Hb was greater (<span>P</span> &lt; 0.02) at weaning compared with birth. However, Hb concentrations were greater (<span>P</span> &lt; 0.0001) at both time points in parity 2 piglets. There was a reduced incidence of anemia at birth (39.1% vs. 59.02%, respectively) and weaning (14.2% vs 36.1%, respectively) among piglets born in parity 2 compared with parity 1. The decline in sow Hb status with parity, particularly in lactation, suggests the need to explore strategies to improve Hb in sows with advancing parity. Alternatively, piglet Hb status improved with parity, indicating a need to modify iron supplementation methods to facilitate greater Hb in parity 1 litters.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ff1d155b384a4ad1afdc9a16d28f5b17a409847f027947e49fe0b2857f13a13a","category":"Environment"}