{"title":"Classic climbs: Alto de l’Angliru","link":"https://www.cyclist.co.uk/in-depth/classic-climbs-alto-de-l-angliru","date":1694599567000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/classic-climbs-alto-de-l-angliru\">Classic climbs: Alto de l’Angliru</a></p>\n\n<p><em>This article was originally published in issue 85 of <a href=\"http://www.cyclistmag.co.uk\" target=\"_blank\">Cyclist magazine</a></em></p>\n\n\n\n<p>Admittedly it’s akin to the joy of poking yourself in the eye with a spoon rather than a fork, but nonetheless there is a 16% pitch near the top of the Angliru that feels fabulous. I mean genuinely blissful.</p>\n\n\n\n<p>Despite the fact that the tarmac is rearing towards the heavens at a gradient more severe than anything you will find on the Galibier, Stelvio, Ventoux or Alpe d’Huez, this portion of Spain’s toughest climb actually serves as respite after the hellish section preceding it.</p>\n\n\n\n<p>That is exactly the sort of diabolical theatre that Unipublic – organiser of the Vuelta a España before ASO took over in 2014 – was looking for in the late 1990s.</p>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2019/02/02181447/classic_climbs_angliru_03-970x603.jpg\" alt /></figure>\n\n\n\n<p>According to Daniel Friebe in his book <em><a href=\"https://amzn.to/3P9893O\" target=\"_blank\">Mountain High</a></em>, the person who actually found the climb was Miguel Prieto, who not only worked for the blind charity Once (who in turn sponsored the hugely successful cycling team) but was partially sighted himself. The ‘blind visionary’, as he became known, found the recently surfaced cattle track when he was on holiday in the Asturias, and wrote to the men in charge of the Vuelta, Enrique Franco and Alberto Gadea.</p>\n\n\n\n<p>At the time, the Vuelta was seen as the poor relation to the Tour and Giro, and the Spaniards wanted a climb to rival the reputations of Mont Ventoux and the Mortirolo.</p>\n\n\n\n<p>The Angliru was just the tortuous ticket, and in 1999 it made its debut in the Vuelta.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/asturias-spain-cycling\">A grande day out: Asturias, Spain Big Ride</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/in-photos-faces-of-the-angliru\">In photos: Faces of the Angliru</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/vuelta-a-espana-route-race-reports-tv-guide-and-all-you-need-to-know\">Vuelta a España 2023: Stage-by-stage preview and everything we know so far</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2>Key details</h2>\n\n\n\n<div></div>\n\n\n\n<ul>\n<li><strong>Summit height:</strong> 1,590m</li>\n\n\n\n<li><strong>Altitude gain:</strong> 1,250m</li>\n\n\n\n<li><strong>Length:</strong> 13.19km</li>\n\n\n\n<li><strong>Average gradient:</strong> 9%</li>\n\n\n\n<li><strong>Maximum gradient:</strong> 29%</li>\n\n\n\n<li><strong>Strava KoM:</strong> Richard Carapaz 44:13</li>\n\n\n\n<li><strong>Strava QoM: </strong>Rakel Maestre 1:05:06</li>\n</ul>\n\n\n\n<h2>Steeped in history</h2>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2019/02/02181453/classic_climbs_angliru_06-970x647.jpg\" alt /></figure>\n\n\n\n<p>Prieto billed it as a climb of just over 12km, and he was correct, but today’s Strava segment extends to include the final downhill rush to the finish line used in the race, making it 13.19km at an average of 9%.</p>\n\n\n\n<p>As you might imagine, however, this doesn’t begin to tell the full horror story. The first 5km of climbing is no more than a softener for the main event – a little bit of light sparring at single-figure gradients. It still has sustained stretches of 9% so it’s hard to take it easy, yet you should save as much energy as you can. Spin. Soak in the silent scenery.</p>\n\n\n\n<p>The first few kilometres feel rather Italian in nature as they wind through a landscape of rolling, tree-covered hills with terracotta-topped houses dotted across the slopes. Then you reach the sixth kilometre. This is the interval between the first and second acts, a breather from the action where you can stretch your legs and go to your bidon for a drink.</p>\n\n\n\n<p>It is a rather lovely linking section that transfers you through some open, bracken-covered heathland with views out across the early slopes you’ve just scaled. It’s also flat. Don’t be tempted to rush it, though – just relax and take the time to recover. Why? Because the next 6km average an intimidating 13% and will hit well over 20% for several sustained stretches.</p>\n\n\n\n<p>It was this next section that caused the controversy in the early years of the Angliru’s inclusion in the Vuelta, with some calling it impossible and others saying it was effectively pushing the riders to dope. David Millar famously stopped a metre before the finish line and removed his number, disqualifying himself from the 2002 race despite being in the top 10 at the time. He was actually protesting at the dangerous descent preceding the Angliru when he said, ‘This is inhuman!’, but one wonders whether he would have been quite so rash if the climb to the line had been a little less punishing.</p>\n\n\n\n<p>It probably didn’t help that it was wet on the climb that year, just as it was in 1999 (when José María Jiménez was victorious) and when the peloton ascended it on the penultimate stage in 2017 (won by a retiring Alberto Contador).</p>\n\n\n\n<h3>Fighting with gravity</h3>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2019/02/02181457/classic_climbs_angliru_07-970x647.jpg\" alt /></figure>\n\n\n\n<p>It was dry on the day that I tackled it, and the idea of the rear wheel slipping sent shivers down my spine. Even in the dry I had to avoid slippery sections because the quiet nature of the climb means that cattle wander up it and occasionally use it as something of a livestock latrine.</p>\n\n\n\n<p>The first beastly stretch of over 20% extends through a handful of hairpins and, because you’ve just had a rest on the flat section, it seems horrible but not horrific. What it does do is wake up your arms, core and back muscles. Climbing these sorts of gradients feels like a whole body workout as sinews strain in everything from forehead to fingertip.</p>\n\n\n\n<p>The worst section by far, however, is La Cueña les Cabres, which extends between two hairpins about 10km into the climb and has spikes of nearly 30%. As you round the hairpin at its start the road stretches out in front of you like a staircase with no steps. If you’re struggling to raise your gaze from your stem, the start is signposted by a sculpture that looks like the Tin Man from <em>The Wizard Of Oz</em> has died while attempting to cycle up it, possibly going so slowly that he simply rusted to a halt.</p>\n\n\n\n<p>My easiest gear was 36/28, which wasn’t anything like easy enough, and it felt like the biggest bicycle fight I’ve ever been in, plain and simple.</p>\n\n\n\n<p>The transition from sitting in the saddle to standing on the pedals is so tricky on this sort of gradient that you risk stalling and having to put a foot down. Equally the road feels too narrow and cambered to make weaving a viable option. There is nowhere to hide. It’s no consolation while embroiled in your own fight against gravity, but even the pros look like they’re going in slow motion up this stretch.</p>\n\n\n\n<p>Juan José Cobo (in 2011, when he emerged from obscurity to beat Chris Froome and Bradley Wiggins into second and third place respectively) is perhaps the only one who has ever made this pitch look manageable (although given what we now know about Cobo this will come as no surprise).</p>\n\n\n\n<p>It took me nearly <em>eight</em> minutes to cover just 730m. The KoM for this section at the time of writing is Dutch pro Wilco Kelderman and even he took four minutes to haul himself up it.</p>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2019/02/02181501/classic_climbs_angliru_12-970x647.jpg\" alt /></figure>\n\n\n\n<p>Then you reach that blissful 16%. The pain isn’t over because the road ramps up again a few more times, but somehow the summit feels reachable now. If you can beat La Cueña les Cabres then you can beat anything. </p>\n\n\n\n<p>The downhill denouement that comes a little while later feels odd. As you flash across the finish line you realise it’s a rather pointless climb, because there’s nothing at the top. No hotel, no cafe, not even really any view, just a car park that is presumably only as large as it is so it can service the Vuelta circus.</p>\n\n\n\n<p>There’s just a couple of monuments and a peaceful, slightly Mallorcan landscape of green and grey over which you can stare and contemplate the climb you’ve just completed.</p>\n\n\n\n<p>And as the sound of raging blood dissipates, so you realise what a quiet place it is. And as you descend a few minutes later (giving thanks for or bemoaning a lack of disc brakes) you notice, possibly for the first time, that there’s more to the Angliru than the gradient.</p>\n\n\n\n<p>Released by gravity from the painful climbing hunch that restricts your vision to a narrow tunnel, you look out over the most wonderfully expansive view, with Oviedo below and the Bay of Biscay beyond.</p>\n\n\n\n<p>The climb might be cruel but the Angliru is a beast that is also rather beautiful.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/classic-climbs-alto-de-l-angliru\">Classic climbs: Alto de l’Angliru</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"ff2bab929f7d7333cc85de61edfb05b99b29a627c300fcac42386fcf7e580ebb","category":"Cycling"}