{"title":"Proto-Cognitive Bases of Agency","link":"https://www.preprints.org/manuscript/202410.1351/v1","date":1729146806000,"content":"Autonomous systems are permanently in an ongoing interaction with the environment that surrounds them. Agency, in this sense, is often conceived as a system-environment asymmetry, where the system is able to influence the environment more than viceversa. \nAutonomous systems, however, are closed under information, meaning that they can only specify their own states by means of intelligent processes (unless we consider cognitive processes of higher order), even if they can influence and be influenced by physical processes outside of their mechanistic distinctions. \nAgency then, computationally speaking, should be understood as the causal effect that the system by means of its intelligent process can exert over itself, as in opposition to the environment.\nBeing thus, we argue that a first measure of causality should capture the possibility of the system to withstand the effect of the environment over its future states, that is, to measure and compare the influence of the environment and the system, over the the system.\nWe suggest that specific kind of mappings (represented as probability distributions) can increase the degree of underdetermination that can be quantified through information metrics (in particular, using entropy measure and the Earth Mover's Distance for comparisons) in the discrete case. \nAfter revising relevant related concepts, we introduce some mathematical formulations in the attempt to capture more formally the notion of underdetermination in autonomous systems. \nFinally, we exemplify these ideas and formulations through a toy-experiment in the the Game of Life cellular automaton.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ff3092ab1c57910b9a7fd40e50809155a6f53af65e32910733362a2714a8f88f","category":"Interdisciplinary"}