{"title":"La Flèche Wallonne Femmes preview 2023 - Route, predictions and contenders","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/la-fleche-wallonne-femmes-preview-route-predictions-and-contenders","date":1681830051000,"content":"\n      <p><span>After seven consecutive years of Anna van der Breggen’s dominance, La Flèche Wallonne Femmes finally welcomed a new winner last year with Marta Cavalli reigning supreme atop the Mur de Huy. In 2023 the race takes place on April 19 and Cavalli will be back to defend her title. However, with the Italian rider lacking form so far this season after recovering from her crash at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> last year, there is a chance that someone else will take the Queen of the Huy crown on Wednesday, and plenty of riders are in with a chance of victory.</span></p>\n<div></div>\n<p><span>With three ascents of the Mur de Huy to contend with throughout the race, Flèche Wallonne Femmes stands as one of the toughest one-day races on the calendar. It is extremely well-suited to the punchy climbers in the women’s peloton, including the likes of Demi Vollering, Cecilie Uttrup Ludwig and Kasia Niewiadoma. Previous editions all point to a nail-biting finish on the steep gradients of the Mur de Huy and this year the margins between the strongest puncheurs of the peloton seem narrower than ever. With this in mind, we can expect an exciting and dramatic race with a variety of teams fighting for the win.</span></p>\n<h3><strong>Route</strong></h3>\n<p><span>The route for Flèche Wallonne Femmes spans 127.3 kilometres and includes eight crucial, steep climbs. The women’s peloton will first complete one large lap of 58 kilometres before two laps of a shorter 36 kilometre circuit which includes the same trio of climbs seen in the men’s event. The first ascent of the day, the 2.2km Côte de Bohissau comes after just 40km of racing and it is likely that we will see a breakaway establish itself in these early opening stages.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/b3ddd_1024x1024.jpg?v=1681808809\" alt />The first ascent of the Mur de Huy comes 17 kilometres later, giving the riders a taste of what is to come when the race finishes on the same climb in just over 70 kilometres time. In the first 400 metres of the Mur de Huy, the gradient kicks up to more than 10%, only dropping to 6% when the riders enter the final 100 metres. Next up is the Côte d'Ereffe, which spans for 2.1 kilometres climb at an average gradient of 5%, then the the Côte de Cherave which starts hard with a gradient of 8.5% in the first kilometre, before it levels into a false flat to the summit. Riders will then repeat this trio of climbs for the second time before what we expect to be an explosive finale on the final ascent of the Mur de Huy.</span></p>\n<h3><b>Contenders</b></h3>\n<h3>Demi Vollering</h3>\n<p><span>SD Worx has been the team to beat in the women’s peloton in 2023 with 11 victories already to their name. Three of those have come from Demi Vollering at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a>, Dwars door Vlaanderen and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/more-of-the-same-harmonious-sd-worx-execute-perfect-plan-at-amstel-gold-race\">the Amstel Gold Race</a>. Vollering has also finished second in Brabantse Pijl and the Ronde van Vlaanderen, making for some impressive palmarès for the Dutchwoman so far this year. Vollering has always been a rider well-suited to the Ardennes Classics, she had some of her breakthrough results in these races in 2021 when she won Liège-Bastogne-Liège Femmes and finished second in Amstel Gold Race. Since then, Vollering has gotten better and better at knowing when to make her attacks at the right time to put her rivals under pressure.</span></p>\n<p><span><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-00035_1024x1024.jpg?v=1681809331\" alt />Image: Zac Williams/SWpix</em></span></p>\n<p><span>She did exactly this to take the win at Amstel Gold Race last weekend, soloing to victory 10 seconds ahead of the chasing peloton. Vollering has finished third in Flèche Wallonne Femmes on two occasions, both in 2020 and 2022, so she has a good understanding of how to ride the Mur de Huy. Vollering also has the expertise of her former teammate-turned sports director Anna van der Breggen in the team car which will be an asset to her in the race. </span><b>Lotte Kopecky</b><span> is another good option for SD Worx if Vollering doesn’t have the legs on the day and the Belgian has been climbing better than ever in 2023.</span></p>\n<h3>Cecilie Uttrup Ludwig</h3>\n<p><span>Ceclie Uttrup Ludwig was sidelined from the Ardennes Classics in 2022, suffering from Covid-19. This meant that her teammate, Marta Cavalli, picked up the mantle for FDJ-Suez in impressive fashion last year, winning both the Amstel Gold Race and Flèche Wallonne last year. Cavalli hasn’t found the same form so far in 2023, still suffering from the effects of her bad crash at the Tour de France Femmes last year, so this is Uttrup Ludwig’s opportunity to finally get her own chance of victory in the Ardennes Classics. The Danish rider excels on punchy finishes like the Mur de Huy, proving that last year when she won stage three of the Tour de France Femmes on the uphill sprint to Épernay.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_0333_1024x1024.jpg?v=1681808957\" alt /></span><em><span>Image: Alex Whitehead/SWpix</span></em></p>\n<p><span>Uttrup Ludwig finished second in Flèche Wallonne in 2020 and has been in the top-10 on two other occasions, a rider perfectly suited to the repetitive, punchy accelerations that the Ardennes hills require. This season, the FDJ-Suez rider has finished in third place in Strade Bianche and 10th in the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a>, proving she has the form to fight for the win. Uttrup Ludwig’s downfalls have been more tactical than physical in recent races, so a straight sprint up a climb where teammates and strength in numbers will be less valuable could play into the Dane’s favour.</span></p>\n<h3>Kasia Niewiadoma </h3>\n<p><span>Another rider who is synonymous with punchy attacks and sharp accelerations is Kasia Niewiadoma of Canyon//SRAM. Niewiadoma has finished on the podium of Flèche Wallonne twice in her career (in 2017 and 2021) and has been in the top-10 on numerous occasions outside of that, narrowly missing out on victory year after year. With Van der Breggen now retired and Marta Cavalli struggling with form this season, 2023 could finally be the chance that Niewidoma gets to shine in Flèche Wallonne. She has proven her form is there with top-6 finishes in Strade Bianche, the Tour of Flanders and Amstel Gold Race, but Niewiadoma just needs to time things right on the day to finally turn those results into victories.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_1375_1024x1024.jpg?v=1681809023\" alt /><em>Image: Alex Whitehead/SWpix</em></span></p>\n<p><span>Niewiadoma has a strong team around her which includes some formidable climbers in their own right, including the likes of <strong>Elise Chabbey</strong>, <strong>Pauleina Rooijakkers</strong>, <strong>Tiffany Cromwell</strong> and <strong>Soraya Paladin</strong>. This gives Canyon//SRAM multiple options which could help Niewiadoma if they play their cards right. A strong lead-out into the base of the Mur de Huy or sending a rider up the road for Niewiadoma to counter-attack could all be ways in which Canyon//SRAM can get one step ahead of the dominance of SD Worx.</span></p>\n<h3>Silvia Persico</h3>\n<p><span>Once known mostly for her exploits in the cyclo-cross world, Silvia Persico has firmly asserted herself this season as one of the best climbers in the women’s peloton. She secured third overall at the UAE Tour at the start of the season and went on to finish sixth and fourth in Trofeo Binda and the Tour of Flanders respectively. Persico finally got her victory in Brabantse Pijl last week, beating a stellar field which included the likes of Demi Vollering, Liane Lippert and Shirin van Anrooij. At the Amstel Gold Race a few days later, Persico impressed once again with a top-10 finish.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1479100123persicofleceh_1024x1024.jpg?v=1681809090\" alt /></span><em><span>Image: Getty</span></em></p>\n<p><span>The finish up the Mur de Huy is perhaps one of the best suited to Perisco yet, she was one of the few riders able to keep up with Lotte Kopecky on the cobbled, steep bergs of Flanders a few weeks ago as the Belgian dropped even her own teammates. Persico also showed in the final sprint at Brabantse Pijl that she has a strong turn of speed at the finish line. The Italian's season in the cyclo-cross field is clearly helping her explosivity on the road, making the Ardennes Classics prime terrain for Persico to go for her first WorldTour win. Persico is without a strong team around her to support her in her bid for glory, but this hasn’t been a problem for the 25-year-old in the past who seems adept at choosing her own lines and following the wheels of others.</span></p>\n<h3>Annemiek van Vleuten</h3>\n<p><span>World champion Annemiek van Vleuten hasn’t shown the form that many expected of her this season, seemingly slightly off the pace in some of the Classics so far this year. The Movistar rider was distanced on the steep gravel gradients in Strade Bianche and on the cobbles of Flanders (though she did note a mechanical in De Ronde impacted her attempt at victory in that race). However, Van Vleuten has a history with Flèche Wallonne and a point to prove at this race. It remains as one of the few Classics in the Women’s WorldTour that Van Vleuten has never won in her career after it was dominated year on year by Van der Breggen. With this being Van Vleuten’s last season in the professional peloton, this is the last chance for her to add victory atop the Mur de Huy to her already illustrious list of results.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_1012_5c29efb4-8db1-4883-96ac-7ab061f4bef4_1024x1024.jpg?v=1681809145\" alt /></span><em><span>Image: Alex Whitehead/SWpix</span></em></p>\n<p><span>However, there is no denying that Van Vleuten has been unable to fight for the win in any major one-day races so far this year, and there’s no promise that her form will improve enough to change this in time for Flèche Wallonne this year. If Van Vleuten isn’t able to go for the win, Movistar have two other extremely strong contenders for this race with <strong>Liane Lipper</strong>t and<strong> Floortije Mackaij</strong>. Both riders showed attacking style and fighting spirit at the Amstel Gold Race, with Lippert initiating what was eventually the decisive move. Although they were not rewarded for their brave racing that day, things could turn around for Movistar in Flèche Wallonne.</span></p>\n<h3>Elisa Longo Borghini</h3>\n<p><span>Although she is a rider who constantly talks down her chances of winning, Elisa Longo Borghini’s results speak for themselves. The Italian rider has finished on the podium at Flèche Wallonne three times in her career, in 2013, 2014 and 2021, proving she knows how to handle that final ascent of the Huy. Longo Borghini is yet to win a one-day race this season (she did take victory in the UAE Tour at the start of the year), but she has been present in the majority of the major Classics this season. The Trek-Segafredo rider finished third in the Tour of Flanders but performed a team job in Amstel Gold Race, working for her teammate, <strong>Shirin van Anrooij</strong>, rather than going for her own chances. It could be that the roles are reversed and Longo Borghini will be the leader for the team at Flèche Wallonne.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-00066_1024x1024.jpg?v=1681809226\" alt /></span><em><span>Image: Zac Williams/SWpix</span></em></p>\n<p><span>If not, Van Anrooij is another contender for the win here. The Dutch rider had her breakthrough result on the road at the start of the year with a win in Trofeo Binda and has rarely been outside of the top-10 in one-day races since. She finished third in the Amstel Gold Race a few days ago and was 13th in Flèche Wallonne last year, so has every chance of a win in 2023. <strong>Lizzie Deignan</strong> also returns to racing for Trek-Segafredo for the first time since having her second child. It’s unlikely we will see the British rider fighting for victory so soon into her comeback, but she could play a crucial role for the team.</span></p>\n<h3>Ashleigh Moolman</h3>\n<p><span>Since her move to AG Insurance-Soudal-Quick Step this season, Ashleigh Moolman seems to be thriving in the newfound freedom that this team is giving her. She came close to taking the overall win in Setmana Ciclista-Volta Comunitat Valenciana Fèmines at the start of the season and has since backed up this result with top-15 finishes in Strade Bianche, Dwars door Vlaanderen, Brabantse Pijl and the Amstel Gold Race. Consistency has been key during Moolman’s season so far, but she is yet to achieve a victory in a WorldTour race.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-01515-_1_1024x1024.jpg?v=1681809281\" alt /></span><em><span>Image: Zac Williams/SWpix</span></em></p>\n<p><span>The South African rider has been on the podium twice in Flèche Wallonne before in 2013 and 2018 respectively. She is a rider who enjoys steep gradients but can sometimes struggle to match the punchy accelerations of some of her rivals. Moolman will thrive if the final ascent of the Mur de Huy comes after a tough and attritional race. She will also be supported by her young Belgian teammate <strong>Justine Ghekiere</strong> who is another formidable climber and could be an outsider to watch for overall victory in Flèche Wallonne.</span></p>\n<h3>Other contenders</h3>\n<p><span><strong>Juliette Labous</strong> of Team DSM is one to watch on during the hilly Classics – the French rider finished in sixth place at the Tour of Flanders earlier this season. <strong>Veronica Ewers</strong> of EF Education-Tibco-SVB is another rider who will relish the steep gradients of the Mur de Huy, while<strong> Claire Steels</strong> of Israel-Premier Tech Roland is having a stand out first season in the women’s WorldTour. <strong>Gaia Realini</strong> is a third option for Trek-Segafredo, she can climb extremely well and has shown her value to the team so far this season and <strong>Yara Kastelijn</strong> of Fenix-Deceuninck should also be marked as a rider who could excel on the Mur.</span></p>\n<h3><b>Prediction</b></h3>\n<p><span>We are backing Silvia Persico to take the win at Flèche Wallonne Femmes. The Italian rider is having an incredible season so far and will be well-suited to the hard and rolling terrain of Flèche. She will be able to position herself well on the Mur de Huy and can finish strongly from a reduced bunch.</span></p>\n\n<p><em>Cover image: Zac Williams/SWpix</em></p>\n<p><span> </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"ff33429078bda5ac4a81679ecaa91f0fc2e06c2f09b49b889f983961e01c7764","category":"Cycling"}