{"title":"Gonadal Morphology of Stillborn Hawksbill Sea Turtle (Eretmochelys imbricata) Hatchlings","link":"https://academic.oup.com/mam/article/30/1/169/7584954?rss=1","date":1705881600000,"content":"<span><div>Abstract</div>This study aimed to investigate sexual dimorphism in stillborn hawksbill sea turtles (<span>Eretmochelys imbricata</span>) through gonadal morphological characterizations. Macroscopic, light microscopy, and transmission electron analyses were performed for 30 gonad-mesonephros complexes. Female gonads were spindle-shaped and present a translucent whitish appearance with a grainy texture. Male gonads were approximately ovoid with a smooth opaque white surface. A primary sexual difference concerns different marrow structures, with females presenting organized cellularity featuring oocytes, lacunae, and blood vessels, while males presented a distinct organizational medulla pattern marked by testicular cords extending throughout the gonad length. Ultrastructurally, female’s stroma presented interstitial cells and an abundant cytoplasm rich in electrodense droplets and large oval germline cells, with a conspicuous and noncentral nucleus. Males, on the other hand, presented testicular cord cells containing small amounts of heterochromatin and approximately triangular apical and basal cytoplasms with an evident nucleolus characteristic of support cells. Additionally, there were cells with a large spherical nucleus compared with the cell size and a relatively scarce cytoplasm, identified as gonocytes. These findings indicate that macroscopic, microscopic, and ultrastructural evaluations are effective and reliable techniques for the sexual identification of stillborn <span>E. imbricata</span> hatchlings.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"ff54edfd1725d495a7a522514b3bd90f80a312da2bbe7a3c0f2ffdae464ec164","category":"Environment"}