{"title":"Effect of Nitrogen Fertilizer on Capsaicinoids and Related Metabilic Substances of Dried Chilli Pepper Fruit","link":"https://www.preprints.org/manuscript/202406.0713/v1","date":1718104434000,"content":"【Objectives】To elucidate and enhance the impact of nitrogen fertilizer on capsaicin, thus providing guidance on fertilizer application for the cultivation of high spiciness chilli.【Methods】The experiment was conducted with five nitrogen fertilizer concentrations, N1 (urea 750 kg.hm-2), N2 (urea 562.5 kg.hm-2), N3 (urea 375 kg.hm-2), N4 (urea 187.5 kg.hm-2), and N0 (no nitrogen fertilizer). Nitrogen treatment was applied to two varieties with different spiciness from seedling stage, and the fruit was sampled at three fruit developmental periods, and the contents of capsaicin, capsaicin precursors, capsaicin competitive substances, as well as capsaicin related enzyme activities and gene expression were analyzed.【Results】When applying N2 and N3, both types of peppers exhibited higher fruit length, fruit width, and fruit weight, which favored yield increase. Specifically, N2 resulted in varied increases in total phenol, flavonoid, and tannin contents of the two varieties. Moreover, placenta weight and PAL enzyme activity of capsaicin synthase significantly increased, while capsaicin degrading enzyme activities of POD and PPO decreased notably. Additionally, the expression of capsaicin synthetic genes such as PAL, AT3, 4CL, C4H, COMT, PAMT, and HCT was up-regulated in N2-treated fruits, leading to a significantly higher capsaicin content compared to the other four treatments. Further reduction of nitrogen application to N3 and N4 resulted in decreased precursor substance total phenol content and PAL activity, increased competitive substance flavonoid, lignin, POD and PPO enzyme activities, at the same time, the expression levels of capsaicinoid synthetic genes were down-regulated in N3, N4 treatments, which lead to an reduction in total capsaicinoid content. During fruit development, the capsaicinoid content showed a trend of 35 d &gt; 50 d &gt; 20 d for both varieties. Additionally, the contents of total capsaicinoid, total phenol, flavonoid, and lignin, as well as PAL enzyme activity and the expression of PAL, AT3, 4CL, C4H, COMT, PAMT, and HCT of the fruit, exhibited characteristics of lower layer &gt; middle layer &gt; upper layer. Furthermore, the activities of capsaicinoid degrading enzymes POD and PPO gradually increased from bottom to top.【Conclusions】The N2 (562.5 kg.hm-2) treatment resulted increases of placenta mass, maximum precursor substance total phenol content and synthase enzyme activity, and decreases of competing substances and degradative enzyme activity, resulting in more substances being available for capsaicin synthesis. Combined with the higher fruit weight in the N2 treatment, N2 was therefore considered to be a suitable nitrogen fertilizer dosage for high spiciness chilli cultivation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ff55a4bdb4f688962995e98f69951bbb948aba45d500b98b855c013fcd33d1dd","category":"Interdisciplinary"}