{"title":"Fabrication of 3D micropatterned hydrophobic surfaces by fused filament fabrication printing technology","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400003?af=R","date":1716458298000,"content":"<h2>Abstract</h2>\n<p>In recent years, the interest in structured hydrophobic surfaces has considerably grown, finding applications in many industrial fields, including aerospace, automotive, and biomedical. Three-dimensional (3D) printing technology is a simple, rapid and economic process to fabricate structured surfaces based on neat polymers and composite materials, allowing working with a wide variety of plastic materials. The manufactured surfaces show a roughness depending on the printing design and the printing resolution: this characteristic is ideal to achieve superhydrophobic properties. Furthermore, patterned surface structures can be printed by Fused Filament Fabrication (FFF), so increasing the hydrophobic character of the samples; indeed, micro and nano surface structures are required to make a hydrophobic surface.</p>\n<p>In this study, 3D micro-patterned textures of pillars were printed by FFF using polylactide (PLA) and polypropilene (PP) as polymer filaments and PLA/carbon nanotubes (PLA/CNT) and PP/carbon fibers (PP/CF) as composite filaments. Morphologies of printed specimens were analyzed by optical microscopy and scanning electron microscopy (SEM). Good correspondence was found between pillars dimensions and edge-edge pillars distance of CAD model and composites 3D printed samples. Their wettability was evaluated by static contact angle measurements. Results clearly show a significant increase of water contact angle values up to 50% in all micropatterned samples with respect to flat surfaces. This improvement was achieved by surface microstructuring without the use of nanoparticles and/or chemical treatment.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"S. Galvagno, \nL. Tammaro, \nS. Portofino, \nF. Loffredo, \nA. De Girolamo Del Mauro, \nF. Villani, \nG. Pandolfi, \nP. Iovane, \nP. Tassini, \nC. Borriello","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"ff55038d4a69193eec8e329e09ee8e2f3ba7883dd4f6d34bdb41c3719ccf1ff3","category":"Environment"}