{"title":"Swallowing kinematics and submental muscles activation during a newly designed maneuver called Mouth Open Swallowing Maneuver: A comparative study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299845","date":1711375200000,"content":"<p>by Ömer Faruk Yaşaroğlu, Selen Serel Arslan, Emre Cengiz, Rabia Alıcı, Numan Demir, Berna Oğuz, Tülin Düger</p>\r\n\r\nThe aim of this study was to design a new maneuver called the Mouth Open Swallowing Maneuver (MOSM), and to compare swallowing kinematics and submental muscles activation (SMA) between MOSM and two current approaches used in dysphagia rehabilitation. Fifty healthy volunteers were asked to perform three repetitions of dry swallowing (DS) (control task), the MOSM, the Mendelsohn Maneuver (MM), and the Tongue-Hold Maneuver (THM) during videofluoroscopic swallowing study accompanied with simultaneous SMA recording. Swallowing kinematics were measured by frame-by-frame analysis on hyolaryngeal movement using ImageJ. Swallowing with maximum hyolaryngeal movement and SMA during these tasks was used for comparative analysis. Vertical movement of the hyoid during the MOSM was significantly greater than those observed during the DS and the THM (p&lt;0.001, p&lt;0.001). Horizontal movement of the hyoid during DS and the THM was significantly greater than that observed during the MM (p = 0.001, p = 0.001). Vertical movement of the larynx during the MOSM was significantly greater than those observed during DS, MM, and THM (p&lt;0.001). There was no significant difference between tasks in horizontal movement of the larynx (p = 0.785). SMA during the THM was significantly greater than that observed during MOSM (p = 0.002). No significant difference was found between other tasks in terms of SMA (p&gt;0.05). The MOSM as a newly designed maneuver was significantly superior to other maneuvers in increasing vertical hyolaryngeal movement. The THM has as much effect on hyolaryngeal movement as the MM. In this study, the MOSM was shown to be effective in increasing hyolaryngeal movement.\r\nClinicalTrials.gov Protocol Registration and Results System (PRS); the clinical trial registration number (NCT05579041).","author":"Ömer Faruk Yaşaroğlu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ff56e5ff0d40a275053e49a9e5f6a75a37fd37a10d6b479b3643490d8e901af8","category":"Interdisciplinary"}