{"title":"Don’t Be Afraid","link":"https://markpeak.net/dont-be-afraid/","date":1616469913000,"content":"<p>ช่วงนี้กลับมาฟังเพลงบรรเลงใหม่ เลยนำอัลบั้มชุด <a href=\"https://www.ffdistantworlds.com/\">Distant Worlds: Music from Final Fantasy</a> มาฟังอีกรอบ</p>\n<p>นอกจากเพลงที่ชอบเป็นส่วนตัวอย่าง Blinded by Light (XIII), Clash on the Big Bridge (V), Jenova (VII) แล้ว การฟังเพลงรอบนี้ยังได้กลับมาสนใจเพลง <a href=\"https://finalfantasy.fandom.com/wiki/Don%27t_Be_Afraid\">Don&#8217;t Be Afraid</a> เพลงธีมฉากต่อสู้ของภาค VIII อีกครั้ง</p>\n<p>Final Fantasy VIII เป็นภาคที่ผมไม่ได้เล่นเยอะมากนัก เลยไม่ได้ผูกพันมากเท่ากับภาคอื่นๆ แต่พอกลับมาสนใจอีกรอบ โดยเฉพาะชื่อเพลง Don&#8217;t Be Afraid ที่เข้ากับสถานการณ์บ้านเมืองในปัจจุบัน เลยต้องกลับมาค้นว่า ทำไมเพลงถึงได้ชื่อนี้</p>\n<p>รายละเอียดของการแต่งเพลงมีไม่เยอะ เพราะเป็นหนึ่งในเพลงจำนวนมากของเกม แต่ถ้าให้เดาแบบนั่งเทียนเองเลย คิดว่าต้องย้อนกลับไปยังธีมหลักของ FF VIII ที่เน้นเรื่อง &#8220;การเติบโตของวัยรุ่น&#8221; เพราะเป็นภาคแรกของ Final Fantasy ที่มีธีมโรงเรียน เปลี่ยนจากฮีโร่กู้โลกจากมารร้ายในภาคก่อนๆ มาเป็นวัยรุ่นสับสนที่กำลังเติบโตขึ้นมาในโลกยุคหลังสงคราม กลุ่มตัวเอกต้องพัฒนาตัวเองจากวัยรุ่นใสๆ มาเป็นหน่วยรบที่ต้องเผชิญหน้ากับประเทศมหาอำนาจทางการทหาร</p>\n<p>เมื่อก้าวขาออกจากโรงเรียน ต้องเจอกับโลกภายนอกที่โหดร้าย มอนสเตอร์ และศัตรูอื่น โดยไม่มีครู หรือพ่อแม่คอยให้ความคุ้มครองอีกต่อไป  สิ่งสำคัญที่เกมอยากบอกกับผู้เล่นผ่านเพลงคงเป็นว่า</p>\n<p>&#8220;จงอย่ากลัว&#8221;</p>\n<p><iframe class='youtube-player' width='700' height='394' src='https://www.youtube.com/embed/l_4buHR8mWU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent' allowfullscreen='true' style='border:0;' sandbox='allow-scripts allow-same-origin allow-popups allow-presentation'></iframe></p>\n<p>นี่คงเป็นสิ่งที่เราอยากบอกกับ <a href=\"https://markpeak.net/worst-generation/\">คนรุ่นใหม่</a> ที่จะต้องแบกรับภาระของ generation ถัดจากนี้ไป</p>The post <a href=\"https://markpeak.net/dont-be-afraid/\">Don’t Be Afraid</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"ff5fe95df23d55b25826701de229b673dd2e2472906b2a66ce7fa431857270f4","category":"Thai"}