{"title":"เพลง AI เลียนแบบเสียง Travis Scott, Drake ถูกลบออกจาก YouTube เพราะละเมิดลิขสิทธิ์","link":"https://www.blognone.com/node/133606","date":1682664968000,"content":"<div><div><div><p>Generative AI ถูกนำมาสร้างสรรค์ผลงานทั้งในวงการศิลปะ, ภาพยนตร์ รวมไปถึงอุตสาหกรรมเพลง แต่เมื่อสัปดาห์ที่ผ่านมาอัลบั้มเพลงที่ถูกสร้างจาก AI ให้เลียนแบบเสียงของศิลปินชื่อดัง ที่มีชื่ออัลบั้มว่า UTOP-AI มีเพลงอยู่ในอัลบั้ม 16 เพลง ซึ่งรวมเสียงของศิลปินอย่าง Travis Scott, Drake, Baby Keem, และ Playboi Carti เป็นต้น ได้ถูกอัปโหลดขึ้น Youtube และ SoundCloud</p>\n<p>หลังจากนั้นไม่นาน Warner Music Group ค่ายเพลงพาร์ทเนอร์กับ Travis Scott ก็ได้แจ้งเตือนอัลบั้มเพลงดังกล่าวเนื่องจากการละเมิดลิขสิทธิ์ และได้มีการถูกลบออกไปหลังจากอัปโหลดเพียงไม่นาน แต่อัลบั้มเพลงที่ถูกสร้างจาก AI นี้กลับได้รับความนิยมพอสมควรเนื่องจากมีผู้เข้าไปฟังผ่าน Youtube จำนวน 17,000 ครั้ง และ SoundCloud อีกประมาณ 150,000 ครั้ง</p>\n<p>โปรเจกต์อัลบั้มเพลงจาก AI เกิดจากสมาชิกในกลุ่ม AI Hub หนึ่งในเซิร์ฟเวอร์ของ Discord ที่มีจำนวนสมาชิกกว่า 36,000 คน โดยใช้เวลาในการสร้างเพลงและภาพหน้าปกเพียงหนึ่งสัปดาห์เท่านั้น</p>\n<p>ซึ่งที่ผ่านมาเพลงที่สร้างด้วย AI ทำให้เกิดการประเด็นเรื่องลิขสิทธิ์และค่าลิขสิทธิ์ โดยค่ายเพลงใหญ่ได้ออกมาเรียกร้องให้มีการป้องกันการละเมิดลิขสิทธิ์ของเพลงที่เกิดจาก AI เช่น ก่อนหน้านี้มีค่ายเพลงได้เรียกร้องให้ Spotify แพลตฟอร์มสตรีมเมอร์เพลงชื่อดังให้ทำการตรวจสอบเพลงที่ถูกอัปโหลดลง Spotify</p>\n<p>ส่วนใหญ่เพลงที่สร้างจาก AI เป็นเพลงเดี่ยวหรือเพลงที่ได้รับความนิยมอยู่แล้ว แต่ถูกนำมาปรับแต่งใหม่อย่างเช่น การ Cover เพลงของ Beyoncé อย่าง Cuff It ที่ถูกร้องโดยเสียงของ Rihanna</p>\n<p>ที่มา: <a href=\"https://www.businessinsider.com/fake-ai-generated-travis-scott-album-taken-off-youtube-soundcloud-2023-4\">Businessinsider</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f78a0e2b2ff35ffdadac0e28d13ae209.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/travis-scott\">Travis Scott</a></div><div><a href=\"/topics/youtube\">YouTube</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/copyright-infringement\">Copyright Infringement</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ff7184873001cb1913108265c38256baf40827189f6b5013de2db14be044bcfa","category":"Thai"}