{"title":"160 Awardee Talk: Impact of indigestible protein on coccidiosis and meat and bone meal autoclaving time-related reduction in amino acid digestibility for broiler chickens and growing pigs","link":"https://academic.oup.com/jas/article/102/Supplement_2/95/7665016?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Meat and bone meal (MBM) is a byproduct of the processing of livestock in the rendering industry. Because of its highly digestible protein and balanced amino acid profile, MBM is a valuable protein source in swine and poultry diets. Rendering may reduce amino acid digestibility of MBM because of heat damage to MBM, and the effect of heat damage on amino acid digestibility in MBM may be different between broiler chickens and growing pigs. For this reason, the objective of this study was to determine the effect of autoclaving on standardized ileal digestibility (SID) of amino acid in MBM fed to broiler chickens and growing pigs. Meat and bone meal from the same batch was autoclaved at 134°C for 0, 30, 60, 90, 120, 150, or 180 min, generating 7 samples. Eight experimental diets consisted of 7 diets containing each MBM sample as a sole source of nitrogen and a nitrogen-free diet. In Exp. 1, male broiler chickens [n = 656; initial body weight (BW) = 777 ± 69 g] at d 18 post hatching were assigned to the 8 diets in a randomized complete block design with BW as a blocking factor. On d 23, birds were euthanized by CO<sub>2</sub> asphyxiation and dissected for the collection of ileal digesta. In Exp. 2, barrows (n = 16; initial BW = 25.7 ± 1.0 kg) surgically fitted with T-cannulas at the distal ileum were allotted to duplicate 8 × 4 incomplete Latin square design with the 8 diets and 4 periods. Each experimental period consisted of 5-d adaptation and 2-d ileal digesta collection periods. Data for Exp. 1 and 2 were pooled as a 2 × 7 factorial treatment arrangement with the effects of species (i.e., broiler chickens or pigs) and autoclaving time (i.e., 0 to 180 min). The basal endogenous losses of most AA in growing pigs were greater (<span>P</span> &lt; 0.05) compared with broiler chickens. The SID of nitrogen and tryptophan in MBM linearly decreased (<span>P</span> &lt; 0.05) in both species with increasing autoclaving time. An interaction between species and quadratic effect of autoclaving time was observed (<span>P</span> &lt; 0.05) in SID of arginine, histidine, isoleucine, leucine, lysine, methionine, phenylalanine, threonine, and valine in MBM. Specifically, the SID of lysine both linearly and quadratically decreased (<span>P</span> &lt; 0.05) in broiler chickens (85.0 to 56.0%), whereas the SID of lysine only linearly decreased (<span>P</span> &lt; 0.05) in growing pigs (79.5 to 46.7%) as autoclaving time increased. In conclusion, given the species differences in amino acid digestibility response to the severity of heat damage, target species should be considered when using amino acid digestibility value of MBM in diet formulation.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"ff791ec6c8d72193530440cbccad12bb0a6849d0739c84804e7e0abd34a8750c","category":"Environment"}