{"title":"How the M3 Ultra Mac Studio will forever change Apple’s desktop Macs","link":"https://www.macworld.com/article/2175175/m3-ultra-mac-studio-performance-graphics-price.html","date":1704364200000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>With the current M-series Mac lineup, Apple is taking absolutely no prisoners. In this dog-eat-dog, survival-of-the-fittest release cycle featuring the <a href=\"https://www.macworld.com/article/2120691/m3-m3-pro-and-m3-max-specs-features-cpu-gpu.html\">M3, M3 Pro, and M3 Max chips</a>, Apple demonstrates that it prioritizes perpetual progress. Apple has one chip left in the M3 series to be released, the M3 Ultra, and if <a href=\"https://www.macworld.com/article/1952628/first-m2-ultra-mac-pro-benchmarks.html\">history</a> is any indication, it is poised to be an incredible powerhouse</p>\n\n\n\n<p>On paper, the <a href=\"https://www.macworld.com/article/2124958/16-inch-macbook-pro-m3-max-review.html\">M3 Max MacBook Pro</a> is inferior to the top-end M2 Ultra Mac Studio, but in practice, its performance in real-world scenarios gets very close. Both the performance and efficiency gains of the M3 Max lead to a potentially groundbreaking chip with the anticipated M3 Ultra.</p>\n\n\n\n<p>The performance of the M3 Ultra crammed into the small Mac Studio could be a supernova-level event for Mac users. Let’s take a look at what the M3 Ultra Mac Studio will be like and how it will shake up the whole Mac lineup.</p>\n\n\n\n<h2>Pro machines have been forever changed</h2>\n\n\n\n<p>For years, pro users and enthusiasts would have to compromise when choosing a Mac. Some would forego the hefty Mac Pro and be content with the lesser performance of a Mac mini or MacBook Pro to have a compact design. Price was an issue too, as the top-end gear always carried a substantial premium.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-macbook-pro.jpeg?quality=50&amp;strip=all&amp;w=1200\" alt=\"MacBook Pro Mac Pro\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-macbook-pro.jpeg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-macbook-pro.jpeg?resize=300%2C194&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-macbook-pro.jpeg?resize=768%2C497&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-macbook-pro.jpeg?resize=1200%2C776&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-macbook-pro.jpeg?resize=1536%2C993&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-macbook-pro.jpeg?resize=2048%2C1324&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"776\" /><figcaption><p>The M3 Max in the MacBook Pro gives us an idea of what to expect in an M3 U;tra chip.</p></figcaption></figure><p>Thiago Trevisan</p></div>\n\n\n\n<p>With Apple silicon, we’ve seen that gap quickly dwindle. Performance in small machines is better than ever, and the price is not as stratospheric as it once was. That’s because of the M-series MacBook Pro and Mac Studio.</p>\n\n\n\n<p>Remember when laptops were severely hampered by battery life, heat, and reduced system performance due to the form factor? Apple silicon has erased that, and the M3 Max is a shining example.</p>\n\n\n\n<p>Expand that laptop into a larger housing such as the Mac Studio, and there’s plenty of room for even Mac Pro-level hardware. This was demonstrated by the parity in performance between the newest M2 Ultra Mac Studio and Mac Pro.</p>\n\n\n\n<h2>M3 Ultra Mac Studio: Potential performance</h2>\n\n\n\n<p>To get an idea of what we can expect from the M3 Ultra, we can examine the M2 Ultra Mac Studio and the newly-minted M3 Max MacBook Pro. Based on the specifications, the M2 Ultra has a definite advantage, especially when it comes to the number of CPU and GPU cores.</p>\n\n\n\n<figure><table><thead><tr><th><strong>Chip</strong></th><th>CPU cores</th><th>GPU cores</th></tr></thead><tbody><tr><td>M2 Ultra</td><td>24 cores<br />(16 performance, 8 efficiency)</td><td>60 cores<br />(upgradable to 76 cores)</td></tr><tr><td>M3 Max</td><td>16 cores<br />(12 performance, 4 efficiency)</td><td>40 cores</td></tr></tbody></table></figure>\n\n\n\n<p>In practice, the MacBook Pro’s M3 Max chip pulls off some stunning numbers that show there is more than meets the eye under the hood. In <a href=\"https://www.macworld.com/article/2124958/16-inch-macbook-pro-m3-max-review.html\">Macworld’s M3 Max MacBook Pro review</a>, the M3 Max chip bests the 24-core M2 Ultra CPU in Geekbench 6 tests. The M3 chips are on an entirely higher level.</p>\n\n\n\n<div><div>\n<p>With real-world performance, the story continues. Here’s a simple test with R3D Raw codec footage, a 20-minute video exported to ProRes HQ 422 in Final Cut Pro. R3D Raw is more heavily dependent on the GPU horsepower compared to other codecs, and the results are telling. (Results are in seconds. Lower times and shorter bars are better.)</p>\n\n\n\n<h3>Red raw 6K file export in Final Cut Pro</h3>\n\n\n\t\t\n\t\t<div></div>\n\t\t\n\t\t\t</div></div>\n\n\n\n<p>The newer Apple chips dominate the now-ancient AMD Radeon Vega II GPU, which was a high-end option back in 2019. The MacBook Pro with M3 Max is virtually tied with the Mac Studio M2 Ultra.</p>\n\n\n\n<p>Software is also rapidly being further optimized to take advantage of Apple silicon Macs, which helps to further explain how the previous generation hardware is getting left behind.</p>\n\n\n\n<p>There are certainly areas where the Mac Studio with M2 Ultra will still excel, however. With its mighty 76-core GPU, some 3D use cases will still be superior to the M3 Max.</p>\n\n\n\n<p>For example, in <em>Shadow of the Tomb Raider</em> in 4K on high, the M2 Ultra achieves an average of 76 frames per second. The MacBook Pro with M3 Max gets significantly less at 54 fps, showing the delta that still exists between them.</p>\n\n\n\n<p>If we assume performance will continue to peak, the M3 Ultra in a Mac Studio will be an absolute powerhouse. An M3 Ultra with more GPU cores will certainly blow the M2 Ultra out of the water, rounding out the dominance that M3 chips are starting to assert.</p>\n\n\n\n<p>Apple has placed some attention on gaming with Macs, recently showing off how M3 Max has hardware-accelerated ray tracing and mesh shading. Pair these technological advancements with the raw power that an M3 Ultra will hold, and the picture becomes clear of how dominant it will be against the existing M2 Ultra.</p>\n\n\n\n<h2>M3 Ultra Mac Studio: What to expect</h2>\n\n\n\n<p>While there is no confirmation or even set date when the supposed M3 Ultra is coming, based on the M2 Ultra Mac Studio release, it likely will be in the spring or at WWDC in June. We’ll see the M3 Ultra offered in the Mac Studio and the Mac Pro.</p>\n\n\n\n<p>That will result in the Mac Studio being one of the most powerful machines for its size we’ve ever seen. And the Mac Pro will continue as the option for those needing PCIe slots.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-Studio-pro.jpeg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Mac Studio\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-Studio-pro.jpeg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-Studio-pro.jpeg?resize=300%2C286&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-Studio-pro.jpeg?resize=768%2C732&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-Studio-pro.jpeg?resize=1200%2C1144&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-Studio-pro.jpeg?resize=1536%2C1464&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/12/mac-Studio-pro.jpeg?resize=2048%2C1952&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"1144\" /><figcaption><p>The Mac Studio introduced a new concept to the Mac lineup: workstation performance in a compact form.</p></figcaption></figure><p>Thiago Trevisan</p></div>\n\n\n\n<p>What does this mean for buyers who have already invested in the Apple silicon ecosystem? These recent release cycles do seem to be more aggressive than is typical of Apple. The M3, M3 Pro, and M3 Max were released 10 months after the M2 Pro and Max shipped. Should the M3 Ultra be released in June, it will come a year after the M2 Ultra. The cycle between the M1 and M2 series was about two years.</p>\n\n\n\n<p>If the new MacBook Pros were just a minor refresh or color change, then it would be easy to not give the new releases a second thought. But the M3 Max packs a significant boost in performance over the M2 Max, as much as 43 percent in multi-core Geekbench 6. This is also an indicator that the M2 Ultra may be quickly outclassed by the upcoming M3 Ultra, leaving the once-dominant option further behind the curve than normal.</p>\n\n\n\n<p>Apple’s aggressive upgrade curve can make customers unsure of what to do. It’s different from the cycles of Intel Macs since Apple depended on Intel’s release schedule. Apple silicon does streamline this process in favor of advancing rapidly. Couple that with some sluggish Mac sales in the last few months, and Apple has an incentive to get exciting products released quickly to entice new buyers.</p>\n\n\n\n<p>The M2 Ultra is still a powerful chip. Existing owners need not worry about the latest and greatest. While upgrade cycles have certainly gotten shorter with Apple silicon, the top-end performance is still more than capable for years to come.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ff7a330f0c705483795764e18b7c0645a59816fa06accc9a751586c2339679eb","category":"Apple"}