{"title":"The Racial Breakdown of U.S. Mass Shooters","link":"https://jezebel.com/usa-today-takes-the-bait-1846562969","date":1616873346000,"content":"\n<p>Molly Osberg, writing for Jezebel:</p>\n\n<blockquote>\n  <p>Today Hemal Jhaveri, a USA Today employee with almost eight years\nat the paper, <a href=\"https://hemjhaveri.medium.com/i-am-no-longer-working-at-usa-today-heres-what-happened-7ebd540a510e\">published a blog on Medium</a> saying she’d\nrecently been fired from her position as the “race and inclusion”\neditor of For the Win, the publication’s sports vertical, over an\noffending tweet. In other words: Facing manufactured pressure from\na bad-faith right-wing ecosystem hellbent on false equivalencies,\nUSA Today took the bait.</p>\n\n<p>On Monday night, in the immediate aftermath of news of the\nBoulder, Colorado shooting at a grocery store, Jhaveri wrote in a\nreply to another reporter that “It’s always an angry white man.\nalways.” The comment was perhaps unwise given the notoriously\nmercurial nature of breaking news in the early hours of a mass\nshooting event. But <a href=\"https://www.statista.com/statistics/476456/mass-shootings-in-the-us-by-shooter-s-race/\">given the overwhelmingly white and male\nprofile of mass shooters</a> it is, in the moment, a sensible\nassumption.</p>\n</blockquote>\n\n<p>I followed that second link with interest, because I’d been following the controversy regarding Jhaveri’s firing, and idly wondering about the racial breakdown of U.S. mass shooters. <em>Was</em> it a wrong assumption? <a href=\"https://www.statista.com/statistics/476456/mass-shootings-in-the-us-by-shooter-s-race/\">It’s a Statista report published just this week</a>:</p>\n\n<blockquote>\n  <p>Between 1982 and March 2021, 66 out of the 121 mass shootings in\nthe United States were carried out by white shooters. By\ncomparison, the perpetrator was African American in 21 mass\nshootings, and Latino in 10. When calculated as percentages, this\namounts to 54 percent, 17 percent and 8 percent respectively.</p>\n\n<p><em>Race of Mass Shooters Reflects the U.S. Population</em></p>\n\n<p>Broadly speaking, the racial distribution of mass shootings\nmirrors the racial distribution of the U.S. population as a whole.\nWhile a superficial comparison of the statistics seems to suggest\nAfrican American shooters are over-represented and Latino shooters\nunderrepresented, the fact that the shooter’s race is unclear in\naround five percent of cases, along with the different time frames\nover which these statistics are calculated means no such\nconclusions should be drawn. Conversely, looking at the <a href=\"https://www.statista.com/statistics/476445/mass-shootings-in-the-us-by-shooter-s-gender/\">mass\nshootings in the United States by gender</a> clearly demonstrates that\nthe majority of mass shootings are carried out by men.</p>\n</blockquote>\n\n<p>Another day, <a href=\"https://daringfireball.net/linked/2021/03/26/nyt-ncaa-tournaments\">another</a> head-scratcher. I don’t understand how Osberg could link to this report to support the idea that “it’s always a white man” was a “sensible assumption”, when the report concludes, right at the top in a subhead, that the “race of mass shooters reflects the U.S. population”. It’s not buried in a footnote, or something the reader must parse from a table of data — it’s the lede of the report.</p>\n\n<p>By gender, the tally was striking but unsurprising: 116 male, 3 female, 1 “male and female” (a Mickey and Mallory situation, I presume), and 1 “unknown/not released”. So there is a broad generalization one can rush to when our next mass shooting occurs: the perpetrator will almost certainly be a man. But the United States’s shameful decades-long epidemic of mass shootings has been perpetrated by disturbed men who span the racial divide.</p>\n\n<p>(To be clear, other than for something truly egregious, I don’t think anyone should be fired for a bad tweet. I’m a fan of <a href=\"https://www.theredhandfiles.com/what-is-mercy-for-you/\">mercy and tolerance</a>, and believe more apologies should be accepted. But one gets the feeling that Jhaveri’s rift with USA Today was longstanding, that her idea of “race and inclusion” is wholly different and incompatible with the publication’s, and that this was just the breaking point.)</p>\n\n<p><strong>Update:</strong> A bunch of readers point out that the one “male and female” shooting is probably <a href=\"https://daringfireball.net/search/san+bernardino\">the 2015 incident in San Bernardino</a>, which became a controversy for Apple when the FBI asked them to create a version of iOS to install on a phone from one of the shooters that would give the FBI access to the contents of the device.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/03/27/racial-breakdown-of-us-mass-shooters\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"ff813b74a0c862d46311ea3d15ab5140f718d6c42d0eb2e6b76565622bff09ef","category":"Tech"}