{"title":"When robots screw up, how can they regain human trust?","link":"https://arstechnica.com/?p=1786879","date":1629120978000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/12/GettyImages-586932964-800x574.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/12/GettyImages-586932964.jpg\">Enlarge</a> <span>/</span> Today, in robots-and-fireworks news. (credit: <a href=\"https://www.gettyimages.com/\">Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Establishing human-robot harmony in the workplace isn't always easy. Beyond the common fear of automation taking human jobs, robots sometimes simply mess up. When this happens, reestablishing trust between robots and their human colleagues can be a tricky affair.</p>\n<p>However, <a href=\"https://deepblue.lib.umich.edu/bitstream/handle/2027.42/168396/Esterwood%20and%20Robert%202021.pdf?sequence=1&amp;isAllowed=y\">new research</a> sheds some light on how automated workers can restore confidence. Largely, the study suggests that humans have an easier time trusting a robot that makes a mistake if it appears somewhat human and if the machine offers some kind of explanation, according to Lionel Robert, an associate professor at the University of Michigan's School of Information.</p>\n<h2>When robots mess up</h2>\n<p>Even though robots are made of metal and plastic, Robert said we need to start considering our interactions with them in social terms, particularly if we want to have humans trust and rely on their automated co-workers. \"Humans mess up and are able to keep working together,\" he told Ars.</p></div><p><a href=\"https://arstechnica.com/?p=1786879#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1786879&amp;comments=1\">Comments</a></p>","author":"Doug Johnson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ff8e550d2c2935b62de5aee9d8ebf12f9997e4227db4a827cf6066f1117e8ab9","category":"Tech"}