{"title":"Advances in life‐history knowledge for 35 seahorse species from community science","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15699?af=R","date":1708999191000,"content":"<h2>Abstract</h2>\n<p>Marine community science presents an important route to gather valuable scientific information while also influencing local management and policy, thus contributing to marine conservation efforts. Because seahorses are cryptic but charismatic species, they are good candidates for engaging diverse people to help overcome the many gaps in biological knowledge. We have synthesized information contributed to the community science project iSeahorse from October 2013 to April 2022 for 35 of 46 known seahorse species. We then compared the obtained results with information in existing IUCN Red List assessments, executed from 2014 to 2017, to explore the potential of iSeahorse in expanding seahorse knowledge. Our results show updated geographic ranges for 7 seahorse species, new habitats described for 24 species, observations outside the previously recorded depth range for 14 species, and new information on sex ratio for 15 species and on pregnancy seasonality for 11 species. As one example of the power of iSeahorse, contributed observations on Coleman's pygmy seahorse (<i>Hippocampus colemani</i>) indicated that its geographic range is thousands of square kilometers larger, its habitat more diverse, and its depth range shallower than previously known. It is clear that iSeahorse is expanding knowledge on seahorses to a level that will help improve IUCN Red List assessments. The power of community science for marine conservation in general needs to be fully explored.</p>","author":"Elsa Camins, \nLily M. Stanton, \nMiguel Correia, \nSarah J. Foster, \nHeather J. Koldewey, \nAmanada C. J. Vincent","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"ff903f2a31535bf91c3fa1af913df814eddad730cc8919c2941b98001be61a04","category":"Environment"}