{"title":"Prediction of Yield Spatial Variability within Vineyard Based on DIGIVIT Mobile App","link":"https://www.preprints.org/manuscript/202408.0496/v1","date":1723019372000,"content":"The viticulture sector, spanning over 7.3 million hectares worldwide, plays a crucial economic role but faces challenges such as labor shortages, rising production costs, market competition, and climate change stresses. Addressing these issues requires monitoring the spatial and temporal variability in vineyard productivity. Traditional ground-based observations, though accurate, are time-consuming and limited in scope. Precision viticulture, leveraging technologies like GPS, remote sensing, and artificial intelligence, offers efficient, non-destructive monitoring tools. This study aims to develop and test a technological workflow using the mobile app Digivit, integrated with the AgroSat platform, to estimate yield variability in vineyards. The workflow was performed during the 2023 growing season in a series of vineyards near Siena (Italy) and involved two main steps: spatial variability characterization using AgroSat and yield estimation using the mobile Digivit app. AgroSat processed Sentinel-2 NDVI data to identify homogeneous zones, while Digivit used smartphone images of grape clusters to estimate yields. The field campaign, performed three weeks before harvest, involved monitoring representative vines within identified zones and uploading georeferenced images for cluster segmentation analysis. Yield estimates were validated against measured weights, showing a strong linear correlation (R²=0.85, RMSE=43.74g). Excluding one outlier improved correlation to R²=0.95, RMSE=14.58g. Vineyard-level yield predictions were compared with harvest data, achieving an overall error of approximately 7%, in agreement with other methods in the literature. The study demonstrates that the Digivit app provides accurate, timely yield prediction, supporting farmers in harvest planning and winemaking management. The user-friendly mobile app approach facilitates a broader adoption of precision viticulture technologies among farmers, overcoming barriers related to technical expertise.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ff985a49469195957fb4d1075c8b8cfb718438107ec0c0884b0f68ff7e479c90","category":"Interdisciplinary"}