{"title":"Apple confirms what we knew all along: iMessage is never coming to Android","link":"https://www.macworld.com/article/342923/apple-confirms-what-we-knew-all-along-imessage-is-never-coming-to-android.html","date":1617982164000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>When you&rsquo;re in a group message with one of your Android-using friends, those green bubbles can be annoying. And not only are they ugly, but they also limit interactions, don&rsquo;t play nicely with Messages on the Mac, and can have issues with delivering. But for those of us who have been holding out for an Android app that brings the iMessages experience across enemy lines, it&rsquo;s likely to be a very, <em>very</em> long wait.</p>\n\n\n\n<p>In <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.courtlistener.com/recap/gov.uscourts.cand.364265/gov.uscourts.cand.364265.407.0.pdf&amp;xcust=1-1-342923-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">a &ldquo;proposed findings of fact and conclusion of law&rdquo; filing by Epic Games</a> in its <a href=\"https://www.macworld.com/article/234497/epic-games-v-apple-court-battle-antitrust-lawsuit.html\">suit against Apple over the terms of the App Store</a>, Epic revealed that Apple once considered a version of iMessage for Android but decided against it &ldquo;as early as 2013,&rdquo; just two years after it launched on iOS. Using information gleaned from depositions with senior Vice President Eddie Cue, along with comments from Apple fellow Phil Schiller and senior vice president Craig Federighi, Epic claims that Apple&rsquo;s ultimately decided that the iMessage&rsquo;s &ldquo;serious lock-in&rdquo; was more valuable to the company than cross-platform convenience.</p>\n\n\n\n<p><em>b. Mr. Cue testified that Apple &ldquo;could have made a version on Android that worked with iOS&rdquo; such that there would &ldquo;have been cross-compatibility with the iOS platform so that users of both platforms would have been able to exchange messages with one another seamlessly&rdquo;.<br>c. However, Craig Federighi, Apple&rsquo;s Senior Vice President of Software Engineering and the executive in charge of iOS, feared that &ldquo;iMessage on Android would simply serve to remove [an] obstacle to iPhone families giving their kids Android phones&rdquo;.<br>d. Phil Schiller, an Apple executive in charge of the App Store, agreed that Apple should not offer iMessage on Android devices.<br>e. In 2016, when a former Apple employee commented that &ldquo;the #1 most difficult [reason] to leave the Apple universe app is iMessage . . . iMessage amounts to serious lock-in&rdquo; to the Apple ecosystem, Mr. Schiller commented that &ldquo;moving iMessage to Android will hurt us more than help us, this email illustrates why&rdquo;.</em></p>\n\n\n\n<p>Cue also added the &ldquo;one of the results of the Apple ecosystem [is that products such as iMessage] don&rsquo;t work seamlessly with devices written for other OSes,&rdquo; according to the filing. Additionally, Federighi testifies that it would be &ldquo;a horrible idea&rdquo; make it easier for someone to switch to another platform by eliminating all of the iPhone&rsquo;s differentiation.</p>\n\n\n\n<p>Epic uses the iMessage stance (along with Find My and Continuity) to show how Apple pursues a system that continues to lock customers into its ecosystem, &ldquo;even when its conduct results in higher consumer prices.&rdquo; The company&rsquo;s lawyers point to the 2012 eBook lawsuit that found Apple guilty of conspiring to fix eBook prices in order to compete with Amazon.</p>\n\n\n\n<p>Epic concludes that Apple consciously makes switching to a new platform purposefully complex, expensive, and frustrating. Consequently, Epic argues, mobile app developers &ldquo;cannot afford to forgo distributing their apps to iOS users, as doing so would entail giving up access to approximately one billion potential customers, who form the most lucrative part of the available customer base.&rdquo; That gives Apple &ldquo;enormous bargaining power over developers&rdquo; and &ldquo;makes developers heavily dependent on Apple.&rdquo;</p>\n\n\n\n<p>Of course, none of this should be a surprise to anyone who has used an Apple device in the last ten years. And it&rsquo;s not all that different over on Android. But it does shine a light on just how much control Apple has over the user experience and how much it&rsquo;s dependent on ecosystem lock-in. It&rsquo;s not just about creating a seamless and simple system for its users so they want to stay, but also making it very hard to leave even if they want to.</p>\n</div></body></html>","author":"Michael Simon","siteTitle":"Apple TV+: All the upcoming shows, series, and movies","siteHash":"6820a958a76cba098b78af0adad654544d754f9ebbb8081424c797fee53f76e2","entryHash":"ffa6b127ba1e39063bbfb290b989daa7efba0ba2f289ffbeb29a6cc65b3d16c9","category":"Apple"}