{"title":"Nurse-Driven Quality Improvement Interventions Reduced the Incidence of Central-Line-Associated Bloodstream Infection and Catheter-Related Bloodstream Infection to Close to Zero, a Turning Point in One Pediatric Oncologic Facility","link":"https://www.preprints.org/manuscript/202407.2378/v1","date":1722317644000,"content":"This study assesses the impact of nurse-originated changes in central venous catheter (CVC) management on the incidence of central line-associated bloodstream infections (CLABSI) and catheter-related bloodstream infections (CRBSI). It is a single-center retrospective cohort study conducted at an urban, tertiary referral, and academic center serving pediatric patients. The study cohort comprised 236 patients and 323 CVCs seen between 2012 and 2022. CLABSI and CRBSI were defined according to the Centers for Disease Control and Prevention definitions. Oncology nurse leaders developed CVC-specific educational modules for CLABSI prevention. All relevant information during the CVC maintenance period was noted in the patient's CVC logbook. 24 (7%) cases of confirmed CLABSI were identified. The incidence of CVC-related infections was 0.32 cases per 1000 catheter days. The incidence decreased by 40% between the first and second three-year study period. Documented exit-site infection was reported in 32 (10%) cases. The correlation between exit-site infection and CLABSI was found in 9 (28%) cases. Our CVC-related infection rates are significantly lower than the incidence reported by the Italian Association of Pediatric Hematology and Oncology, which settles at 3-5 cases per 1000 catheter days. Our data confirm the effectiveness of local CVC management guidelines in preventing CVC-related infectious complications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ffb3c2f8cc2525634b326fce509946f39131adf007d4ae05e2c48f7c4b664f42","category":"Interdisciplinary"}