{"title":"Optimization of process parameters of refractance window drying for aonla slices and comparison with other drying techniques","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13615?af=R","date":1717595061000,"content":"<h2>Abstract</h2>\n<h2>BACKROUND</h2>\n<p>Aonla is as a good source of antioxidants due to its high ascorbic acid and polyphenol contents. However, because of its high acidity and astringent taste, aonla is rarely consumed in its fresh form. As the constituents in aonla are heat sensitive, it is essential to find a suitable drying method for preservation. Therefore, refractance window drying (RWD) of aonla slices was studied as it has the potential of retaining heat-sensitive compounds.</p>\n<h2>Results</h2>\n<p>The effect of RWD process variables, namely water temperature (75, 82.5, 90 °C) and slice thickness (2, 4, 6 mm), on different quality parameters of dehydrated aonla was studied. Increasing water temperature resulted in significantly higher ascorbic acid content, titratable acidity and product temperature, while total phenolic content, free radical scavenging activity and moisture content decreased. With the exception of product temperature, higher slice thickness led to an increase in the values of all the parameters. At the optimized processing conditions of 83 °C water temperature and 4 mm slice thickness, the ascorbic acid content, total phenolic content, free radical scavenging activity, titratable acidity and moisture content values were found to be 269.03 mg (100 g)<sup>−1</sup>, 242.33 mg (100 g)<sup>−1</sup>, 87.11%, 3.62% and 4% respectively. The aonla slices subjected to RWD also possessed 4–6% higher phytochemical content than osmotically dried and hot-air-dried samples.</p>\n<h2>Conclusion</h2>\n<p>This research highlights the effectiveness of RWD in preserving heat-sensitive compounds in food like aonla. The RW-dried slices had a smoother and more uniform microstructure compared to osmotically dried and hot-air-dried samples. © 2024 Society of Chemical Industry.</p>","author":"Lalita, \nSaroj Kumar Giri, \nDebabandya Mohapatra, \nManoj Kumar Tripathi, \nAdinath Kate, \nAseeya Wahid","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"ffb6ca981fe95f4120a080368956f82147b229c98e04e22c27194f2686017224","category":"Environment"}