{"title":"Protein and lipid nutrition in crabs","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12908?af=R","date":1710214779000,"content":"<h2>Abstract</h2>\n<p>Understanding the nutrition of crabs has a key role in ensuring the success and sustainability of their culture, as providing a well-balanced, cost-effective and sustainable diet that ensures the survival, growth and health of crabs is crucial. The present review is the first to focus primarily on the current state of knowledge of the nutrient requirements and related nutritional aspects in farmed crab species. The most common farmed and studied crabs are the Chinese mitten crab (<i>Eriocheir sinensis</i> Milne-Edwards, 1853), giant mud crab (<i>Scylla serrata</i> Forsskal, 1775), green mud crab (<i>Scylla paramamosain</i> Estampador, 1949) and swimming crab (<i>Portunus trituberculatus</i> Miers, 1876). The article reviews how levels of dietary protein and lipid, the two most important and expensive macronutrient ingredients for most marine animals, directly affect reproduction, growth performance and survival of crabs, and the important impacts they have on immune response and antioxidant capacity. Furthermore, essential amino acids, and essential fatty acids, especially the long-chain polyunsaturated fatty acids, as well as key lipid classes such as cholesterol and phospholipid will be discussed in terms of dietary requirements. Nutrient digestibility is a crucial method to determine protein quality, and studies on this topic in crabs were covered. The replacement of fishmeal and fish oil, as the predominant ingredients traditionally used in aquafeeds for marine animals, with more sustainable alternatives in diet formulations for crabs are also discussed. Modern ‘omics’ studies and high-throughput technologies as fast-growing approaches in protein and lipid research are also covered. Crabs generally require approximately 35%–50% protein, 5%–10% lipid, ~2.5% arginine, ~2.5% lysine, 1.5%–2.5% phenylalanine, 2.2% leucine, 0.7% tryptophan, 0.7% taurine, 1%–2% each of eicosapentaenoic acid, docosahexaenoic acid and arachidonic acid, 1% cholesterol and ~2% phospholipid in their diets.</p>","author":"Noah Esmaeili, \nHongyu Ma, \nSunil Kadri, \nDouglas R. Tocher","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"ffb7d28455a718b434a18af83e4dbfe2bcbf5ab47b0e7527011308d2f1275ccb","category":"Environment"}