{"title":"New – AWS Data Exchange for Amazon Redshift","link":"https://aws.amazon.com/blogs/aws/new-aws-data-exchange-for-amazon-redshift/","date":1634680262000,"content":"<p>Back in 2019 I told you about <a href=\"https://aws.amazon.com/data-exchange\">AWS Data Exchange</a> and showed you how to <a href=\"https://aws.amazon.com/blogs/aws/aws-data-exchange-find-subscribe-to-and-use-data-products/\">Find, Subscribe To, and Use Data Products</a>. Today, you can choose from over 3600 data products in ten categories:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/12/adx_cat_1.png\" /></p> \n<p>In my introductory post I showed you how could subscribe to data products and then download the data sets into an <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a> bucket. I then suggested various options for further processing, including <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a> functions, a <a href=\"https://aws.amazon.com/glue/\">AWS Glue</a> crawler, or an <a href=\"https://aws.amazon.com/athena\">Amazon Athena</a> query.</p> \n<p>Today we are making it even easier for you to find, subscribe to, and use third-party data with the introduction of <a href=\"https://aws.amazon.com/redshift/features/aws-data-exchange-for-amazon-redshift/\">AWS Data Exchange for Amazon Redshift</a>. As a subscriber, you can directly use data from providers without any further processing, and no need for an Extract Transform Load (ETL) process. Because you don’t have to do any processing, the data is always current and can be used directly in your Amazon Redshift queries. <span>AWS Data Exchange for Amazon Redshift</span> takes care of managing all entitlements and payments for you, with all charges billed to your AWS account.</p> \n<p>As a provider, you now have a new way to license your data and make it available to your customers.</p> \n<p>As I was writing this post, it was cool to realize just how many existing aspects of Redshift, and <span>Data Exchange</span> played central roles. Because Redshift has a clean separation of storage and compute, along with built-in data sharing features, the data provider allocates and pays for storage, and the data subscriber does the same for compute. The provider does not need to scale their cluster in proportion to the size of their subscriber base, and can focus on acquiring and providing data.</p> \n<p>Let’s take a look at this feature from two vantage points: subscribing to a data product, and publishing a data product.</p> \n<p><span><strong><span>AWS Data Exchange for Amazon Redshift</span> – Subscribing to a Data Product</strong></span><br /> As a data subscriber I can browse through the AWS Data Exchange catalog and find data products that are relevant to my business, and subscribe to them.</p> \n<p>Data providers can also create private offers and extend them to me for access via the AWS Data Exchange Console. I click <strong>My product offers</strong>, and review the offers that have been extended to me. I click on <strong>Continue to subscribe</strong> to proceed:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/19/adx_private_offers_2.png\" /></p> \n<p>Then I complete my subscription by reviewing the offer and the subscription terms, noting the data sets that I will get, and clicking <strong>Subscribe</strong>:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/19/adx_sub_review_2.png\" /></p> \n<p>Once the subscription is completed, I am notified and can move forward:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/19/adx_subscribed_2.png\" /></p> \n<p>From the Redshift Console, I click <strong>Datashares</strong>, select <strong>Subscriptions</strong>, and I can see the subscribed data set:</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/19/Datashares-screenshot.png\"><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/19/Datashares-screenshot.png\" /></a></p> \n<p>Next, I associate it with one or more of my Redshift clusters by creating a database that points to the subscribed datashare, and use the tables, views, and stored procedures to power my Redshift queries and my applications.</p> \n<p><span><strong><span>AWS Data Exchange for Amazon Redshift</span> – Publishing a Data Product</strong></span><br /> As a data provider I can include Redshift tables, views, schemas and user-defined functions in my AWS Data Exchange product. To keep things simple, I’ll create a product that includes just one Redshift table.</p> \n<p>I use the spiffy new <a href=\"https://aws.amazon.com/blogs/aws/amazon-redshift-query-editor-v2-web-query-authoring/\">Redshift Query Editor V2</a> to create a table that maps US area codes to a city and a state:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/13/adx_table_1.png\" /></p> \n<p>Then I examine the list of existing datashares for my Redshift cluster, and click <strong>Create datashare</strong> to make a new one:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/13/adx_my_shares_no_shares_1.png\" /></p> \n<p>Next, I go through the usual process for creating a datashare. I select <strong>AWS Data Exchange datashare</strong>, assign a name (<strong>area_code_reference</strong>), pick the database within the cluster, and make the datashare accessible to publicly accessible clusters:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/19/adx_create_top_3.png\" /></p> \n<p>Then I scroll down and click <strong>Add</strong> to move forward:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/13/adk_add_list_1.png\" /></p> \n<p>I choose my schema (<strong>public</strong>), opt to include only tables and views in my datashare, and then add the <strong>area_codes</strong> table:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/13/adm_add_ds_obs_1.png\" /></p> \n<p>At this point I can click <strong>Add</strong> to wrap up, or <strong>Add and repeat</strong> to make a more complex product that contains additional objects.</p> \n<p>I confirm that the datashare contains the table, and click <strong>Create datashare</strong> to move forward:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/18/adx_create_bottom_3.png\" /></p> \n<p>Now I am ready to start publishing my data! I visit the AWS Data Exchange Console, expand the navigation on the left, and click <strong>Owned data sets</strong>:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/13/adx_con_main_1.png\" /></p> \n<p>I review the <strong>Data set creation steps</strong>, and click <strong>Create data set</strong> to proceed:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/13/adx_dcs_1.png\" /></p> \n<p>I select <strong>Amazon Redshift datashare</strong>, give my data set a name (<strong>United States Area Codes</strong>), enter a description, and click <strong>Create data set</strong> to proceed:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/13/adx_cds_step1_1-1.png\" /></p> \n<p>I create a revision called <strong>v1:</strong></p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/13/adx_create_rev_1.png\" /></p> \n<p>I select my datashare and click <strong>Add datashare(s)</strong>:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/14/adx_add_sharez_1.png\" /></p> \n<p>Then I finalize the revision:</p> \n<p><img src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2021/10/14/adx_finalize_1.png\" /></p> \n<p>I showed you how to create a datashare and a dataset, and to publish a product using the console. If you are publishing multiple products and/or making regular revisions, you can automate all of these steps using the <a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (CLI)</a> and the Amazon Data Exchange APIs.</p> \n<p><span><strong>Initial Data Products</strong></span><br /> Multiple data providers are working to make their data products available to you through <a href=\"https://aws.amazon.com/redshift/features/aws-data-exchange-for-amazon-redshift/\">AWS Data Exchange for Amazon Redshift</a>. Here are some of the initial offerings and the official descriptions:</p> \n<ul> \n <li><a href=\"https://aws.amazon.com/marketplace/pp/prodview-h6mqbgeckx2gk\"><strong>FactSet Supply Chain Relationships</strong></a> – FactSet Revere Supply Chain Relationships data is built to expose business relationship interconnections among companies globally. This feed provides access to the complex networks of companies’ key customers, suppliers, competitors, and strategic partners, collected from annual filings, investor presentations, and press releases.</li> \n <li><a href=\"https://aws.amazon.com/marketplace/pp/prodview-767om5lgpqsr2\"><strong>Foursquare Places 2021: New York City Sample</strong></a> – This trial dataset contains Foursquare’ss integrated Places (POI) database for New York City, accessible as a Redshift Data Share. Instantly load Foursquare’s Places data in to a Redshift table for further processing and analysis. Foursquare data is privacy-compliant, uniquely sourced, and trusted by top enterprises like Uber, Samsung, and Apple.</li> \n <li><a href=\"https://aws.amazon.com/marketplace/pp/prodview-eklanvpivw3gq\"><strong>Mathematica Medicare Pilot Dataset</strong></a> – Aggregate Medicare HCC counts and prevalence by state, county, payer, and filtered to the diabetic population from 2017 to 2019.</li> \n <li><a href=\"https://aws.amazon.com/marketplace/pp/prodview-mbh7m6ogeldiy\"><strong>COVID-19 Vaccination in Canada</strong></a> – This listing contains sample datasets for COVID-19 Vaccination in Canada data.</li> \n <li><a href=\"https://aws.amazon.com/marketplace/pp/prodview-6y5je3lr3rygy\"><strong>Revelio Labs Workforce Composition and Trends Data (Trial data)</strong></a> – Understand the workforce composition and trends of any company.</li> \n <li><a href=\"https://aws.amazon.com/marketplace/pp/prodview-p5r5xxpedq5rs\"><strong>Facteus – US Card Consumer Payment – CPG Backtest</strong></a> – Historical sample from panel of SKU-level transaction detail from cash and card transactions across hundreds of Consumer-Packaged Goods sold at over 9,000 urban convenience stores and bodegas across the U.S.</li> \n <li><a href=\"https://aws.amazon.com/marketplace/pp/prodview-usrv2ghuqme5u\"><strong>Decadata Argo Supply Chain Trial Data</strong></a> – Supply chain data for CPG firms delivering products to US Grocery Retailers.</li> \n</ul> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"ffbd09640c705fb601218753ee267046e5347a0224a1a13fe18fdcda85598986","category":"Tech"}