{"title":"Microsoft brings iMessage to Windows 11 PCs–if you don’t want to send pics","link":"https://www.macworld.com/article/1526760/microsoft-windows-imessage-phone-link-app.html","date":1682527335000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Following up on an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blogs.windows.com/windowsexperience/2023/02/28/introducing-a-big-update-to-windows-11-making-the-everyday-easier-including-bringing-the-new-ai-powered-bing-to-the-taskbar/&amp;xcust=1-1-1526760-1-0-0&amp;sref=https://www.macworld.com/feed\">announcement</a> made in February, Microsoft on Tuesday stated its <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blogs.windows.com/windowsexperience/2023/04/26/phone-link-for-ios-is-now-rolling-out-to-all-windows-11-customers/&amp;xcust=1-1-1526760-1-0-0&amp;sref=https://www.macworld.com/feed\">rollout</a> of Phone Link for iOS on Windows 11. For iPhone users who also use a Windows PC as their main computer, Phone Link on Windows 11 will let users access iMessage on the iPhone and perform basic chat functions.</p>\n\n\n\n<p>Microsoft provides details on how it will work in its <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://blogs.windows.com/windows-insider/2023/02/28/previewing-phone-link-for-iphone-users-on-windows-11-with-windows-insiders/&amp;xcust=1-1-1526760-1-0-0&amp;sref=https://www.macworld.com/feed\">Windows Insider Blog</a>. The Phone Link app, which previously used Bluetooth to connect only to Android phones, will have a new option for the iPhone. Once a connection is established and the setup is performed, users will have basic support for accessing contacts, making calls, and using the iPhone’s Messages for text conversations.</p>\n\n\n\n<p>Phone Link for iOS requires an iPhone with iOS 14 or later, Windows 11 on the PC, and a Bluetooth connection between the PC and the iPhone. Microsoft notes that the iPad and Mac do not work with Phone Link–as the app’s name says, it’s for phones only. Microsoft is rolling out Phone Link over the next several weeks to its global market, so if you can’t get it now, try again at a later time.</p>\n\n\n\n<p>The support for Messages does not go much beyond one-on-one interactions. According to the Microsoft blog post, group messaging is not supported, and you will not be able to send images, audio, or video. In an interview with <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/2023/2/28/23618224/microsoft-windows-imessage-support-phone-link-ios-iphone&amp;xcust=1-1-1526760-1-0-0&amp;sref=https://www.macworld.com/feed\">The Verge</a>, Microsoft’s Yusuf Mehdi also points out that Phone Link can’t tell the difference between a standard text message and one sent through iMessage–so no green or blue chat bubbles. Also, Phone Link can see only messages that it has sent and received, so it will not display the full chat history on an iPhone.</p>\n\n\n\n<p>Microsoft did not mention if iMessage features such as editing or unsending messages, or the bubble and screen effects will be available, but it’s safe to assume that they won’t be. Still, for the very large number of iPhone users who also use Windows PCs as their main computer, it’s another welcome new feature to allow for access to Apple devices and services. Last November, Microsoft added to <a href=\"https://www.macworld.com/article/1351885/windows-11-photos-app-icloud-apple-music-tv-plus.html\">iCloud Photos access to the Windows 11 Photos app</a>. Microsoft also has available preview versions of the <a href=\"https://click.linksynergy.com/deeplink?id=*l6kYCuH720&amp;mid=24542&amp;u1=1-1-1526760-1-0-0&amp;murl=https://apps.microsoft.com/store/detail/apple-music-preview/9PFHDD62MXS1\">Apple Music</a> and <a href=\"https://click.linksynergy.com/deeplink?id=*l6kYCuH720&amp;mid=24542&amp;u1=1-1-1526760-1-0-0&amp;murl=https://apps.microsoft.com/store/detail/apple-tv-preview/9NM4T8B9JQZ1\">Apple TV</a> apps for Windows; these apps should be finalized later this year.</p>\n\niOS, iPhone, Windows</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"ffbe989e8afab1e2d3a0344eeccf3e0695480cfe4e456c0e243d19726f3ba602","category":"Apple"}