{"title":"Oops—It looks like the Ariane 6 rocket may not offer Europe any launch savings","link":"https://arstechnica.com/?p=1975565","date":1697124419000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Under_the_stars_on_the_Ariane_6_launch_pad-800x452.png\" alt=\"Night time at a giant rocket hanger.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Under_the_stars_on_the_Ariane_6_launch_pad.png\">Enlarge</a> <span>/</span> Under the stars with the Ariane 6 launch base at Europe’s spaceport in French Guiana. (credit: <a href=\"https://www.esa.int/\">ESA</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Nearly a decade ago the European Space Agency announced plans to develop the next generation of its Ariane rocket, the Ariane 6 booster. The goal was to bring a less costly workhorse rocket to market that could compete with the likes of SpaceX's Falcon 9 booster and begin flying by 2020.</p>\n<p>It has been well documented that development of the Ariane 6 is <a href=\"https://arstechnica.com/space/2023/09/no-firm-date-on-ariane-6s-debut-and-no-public-talk-on-prices-either/\">running years behind</a>—the vehicle is now unlikely to fly before the middle of 2024 and subject to further delays. For example, a critical long-duration hot fire of the vehicle's Vulcain 2.1 main engine had been scheduled for \"early October,\" but there have been no recent updates on when this key test will take place.</p>\n<p>However, there are also increasing concerns that the Ariane 6 rocket will not meet its ambitious price targets. For years, European officials have said they would like to cut the price of launches by half with a rocket that is easier to manufacture and by flying an increased cadence of missions.</p></div><p><a href=\"https://arstechnica.com/?p=1975565#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1975565&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ffc005ee482ad35909b0adf677a72218e5de8682fd2268083307802a8be8a0f2","category":"Tech"}