{"title":"Bitbucket เล่าประสบการณ์ย้ายเซิร์ฟเวอร์ขึ้นคลาวด์ AWS พบระบบเสถียร ประสิทธิภาพดีขึ้น","link":"https://www.blognone.com/node/125834","date":1636941596000,"content":"<div><div><div><p>Atlassian เปิดเผยว่าย้ายบริการฝากซอร์สโค้ด Bitbucket จากศูนย์ข้อมูลของตัวเอง ขึ้นมาอยู่บน AWS ทั้งหมดตั้งแต่เดือนสิงหาคมที่ผ่านมา</p>\n<p>เดิมที Bitbucket โฮสต์อยู่ในศูนย์ข้อมูลของ Atlassian เองมานานกว่าสิบปี แต่บริษัทก็พบปัญหาในการดูแลศูนย์ข้อมูลของตัวเองมากขึ้นเรื่อยๆ (เช่น ปัญหาระบบล่ม ฮาร์ดแวร์พัง) ทำให้บริการถูกจำกัดศักยภาพจากศูนย์ข้อมูลแบบดั้งเดิม จึงตัดสินใจย้ายระบบมาสู่ AWS โดยรันบนแพลตฟอร์มคลาวด์ Micros ของตัวเอง (ที่รันอยู่บนเครื่อง AWS อีกที)</p>\n<p>ทีมงาน Atlassian ให้สัมภาษณ์กับ The Register ว่าต้องปรับสถาปัตยกรรมของ Bitbucket พอสมควร เพราะมันออกแบบมาสำหรับการรันในศูนย์ข้อมูล ไม่ใช่สำหรับคลาวด์ กระบวนการทั้งหมดใช้เวลา 18 เดือน เป้าหมายคือ<br />\nย้าย repository จำนวน 50 ล้านอันขึ้นระบบคลาวด์สตอเรจ</p>\n<p>กระบวนการย้ายคือ replicate ข้อมูลทั้งหมดที่เขียนลงสตอเรจของ Atlassian ไปยังเครื่อง AWS แบบเรียลไทม์ และการย้ายขั้นตอนสุดท้ายในเดือนสิงหาคม มีเวลาดาวน์ไทม์ 3 ชั่วโมง เพื่อชี้บริการไปยังเครื่องใหม่บน AWS ทีมงานระบุว่าลูกค้าส่วนใหญ่ไม่ทราบเลยว่าย้ายระบบแล้ว และบริษัทแจ้งให้ลูกค้ารายใหญ่ๆ เพียงไม่กี่รายให้ทราบเท่านั้น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/06f7baabd34a2d620f86ac9ab79e4b23.png\" /></p>\n<p>Atlassian สรุปข้อดีของการย้ายระบบขึ้นคลาวด์ว่า</p>\n<ul>\n<li>ระบบเสถียรขึ้นมาก รันมา 2 เดือนกว่าแล้วยังไม่เจอปัญหาระบบล่มหรือประสิทธิภาพตกใหญ่ๆ เลย จำนวนคำขอซัพพอร์ตรายสัปดาห์ที่เกี่ยวกับเรื่องเสถียรภาพลดลงจากเดิม 93%</li>\n<li>ปลอดภัยขึ้น เพราะใช้มาตรฐานความปลอดภัยของ AWS, ลดโอกาสเข้าถึงเครื่องในทางกายภาพ, เข้ารหัสข้อมูลสตอเรจทั้งหมด</li>\n<li>ประสิทธิภาพดีขึ้น อัตราการตอบสนองหน้าเว็บ (response time) เพิ่มขึ้น 55%</li>\n</ul>\n<p>ที่มา - <a href=\"https://bitbucket.org/blog/bitbucket-cloud-has-landed-in-aws\">Atlassian</a>, <a href=\"https://www.theregister.com/2021/11/03/atlassian_aws/\">The Register</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/bitbucket\">Bitbucket</a></div><div><a href=\"/topics/atlassian\">Atlassian</a></div><div><a href=\"/topics/aws\">AWS</a></div><div><a href=\"/topics/cloud-computing\">Cloud Computing</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ffc20bc3f3a909782acc7247b5641e250f71a4b50fb4047a5f3392712770e797","category":"Thai"}