{"title":"Polarizing Magnetic Field Effect on Some Electrical Properties of a Ferrofluid in Microwave Field","link":"https://www.preprints.org/manuscript/202410.0816/v1","date":1728614180000,"content":"The complex dielectric permittivity, ε (f, H) = εʹ (f, H)- i εʺ (f, H), in the microwave frequency range  f, of (0.1 - 3) GHz and polarizing field values H, in the range of (0 - 135) kA/m, was measured for a kerosene-based ferrofluid with magnetite particles. A relaxation process attributed to interfacial type relaxation was highlighted, determining for the first time in the microwave field, the activation energy of the dielectric relaxation process in the presence of the magnetic field, EA(H), in relation to the activation energy in zero field, EA(H=0). Based on the complex permittivity measurements and the Claussius-Mossotti equation, the dependencies on frequency (f), and magnetic field (H), of the polarizability (α) and electrical conductivity (σ), were determined. From the dependence of  α(f,H), the electric dipolar moment, p, of the particles in the ferrofluid, was determined. The conductivity spectrum, σ(f,H), was found to be in agreement with Jonscher's universal law and the electrical conduction mechanism in the ferrofluid was explained using both Mott's VRH (variable range hopping) model and CBH (correlated barrier hopping) model. Based on these models and conductivity measurements, the hopping distance, Rh, of the charge carriers and the maximum barrier height, Wm, for the investigated ferrofluid was determined for the first time in the microwave field. Knowledge of these electrical properties of the ferrofluid in the microwave field is useful for explaining the mechanisms of polarization and control of electrical conductivity with an external magnetic field, in order to use ferrofluids in various technological applications in microwave field.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"ffc7246b3cc950d78aab17b848b9aa68ccaad41744a409b1f01762b36e134f71","category":"Interdisciplinary"}