{"title":"Early attentional processing and cortical remapping strategies of tactile stimuli in adults with an early and late-onset visual impairment: A cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306478","date":1720533600000,"content":"<p>by Mónica-Alba Ahulló-Fuster, M. Luz Sánchez-Sánchez, Enrique Varela-Donoso, Tomás Ortiz</p>\r\n\r\nNeuroplastic changes appear in people with visual impairment (VI) and they show greater tactile abilities. Improvements in performance could be associated with the development of enhanced early attentional processes based on neuroplasticity. Currently, the various early attentional and cortical remapping strategies that are utilized by people with early (EB) and late-onset blindness (LB) remain unclear. Thus, more research is required to develop effective rehabilitation programs and substitution devices. Our objective was to explore the differences in spatial tactile brain processing in adults with EB, LB and a sighted control group (CG). In this cross-sectional study 27 participants with VI were categorized into EB (n = 14) and LB (n = 13) groups. They were then compared with a CG (n = 15). A vibrotactile device and event-related potentials (ERPs) were utilized while participants performed a spatial tactile line recognition task. The P100 latency and cortical areas of maximal activity were analyzed during the task. The three groups had no statistical differences in P100 latency (p&gt;0.05). All subjects showed significant activation in the right superior frontal areas. Only individuals with VI activated the left superior frontal regions. In EB subjects, a higher activation was found in the mid-frontal and occipital areas. A higher activation of the mid-frontal, anterior cingulate cortex and orbitofrontal zones was observed in LB participants. Compared to the CG, LB individuals showed greater activity in the left orbitofrontal zone, while EB exhibited greater activity in the right superior parietal cortex. The EB had greater activity in the left orbitofrontal region compared to the LB. People with VI may not have faster early attentional processing. EB subjects activate the occipital lobe and right superior parietal cortex during tactile stimulation because of an early lack of visual stimuli and a multimodal information processing. In individuals with LB and EB the orbitofrontal area is activated, suggesting greater emotional processing.","author":"Mónica-Alba Ahulló-Fuster","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ffc7450ff0e424ea5b8e3da945e1573de7574094e2a146abe99054163653c0cf","category":"Interdisciplinary"}