{"title":"Konami แผลงฤทธิ์! ยื่นฟ้อง Cygame ข้อหาละเมิดสิทธิบัตรระบบเกม","link":"https://www.blognone.com/node/133892","date":1684398991000,"content":"<div><div><div><p>บริษัท <strong>Konami Digital Entertainment</strong> ยื่นหนังสือฟ้องค่ายเกมมือถืออย่าง <strong>Cygames</strong> โดยกล่าวหาว่าเกม <strong>Uma Musume Pretty Derby</strong> มีระบบเกมบางส่วนที่ละเมิดสิทธิบัตรของทาง Konami ซึ่งทาง Konami ได้เรียกร้องค่าเสียหายเป็นเงินจำนวน 4 พันล้านเยน และเรียกร้องให้ศาลออกหมายบังคับให้เกม Uma Musume ยุติการให้บริการ</p>\n<p>ทางฝั่งของ Cygames นั้นเคยมีการเจรจากับทาง Konami มาก่อนเพื่อแก้ไขระบบของเกมที่มีปัญหาอยู่ก่อนแล้ว แต่ทาง Konami กลับไม่ยอม แล้วยื่นฟ้องจนเป็นคดีความในที่สุด ซึ่งทาง Cygames เชื่อว่าจริง ๆ แล้ว เกม Uma Mesume Pretty Derby ไม่ได้ละเมิดสิทธิบัตรของทาง Konami และเตรียมสู้คดีต่อไป โดยคาดว่าระบบเกมที่เป็นปัญหาคือระบบกาชาภายในเกม</p>\n<p>ซึ่งคงอีกยาวกว่าจะรู้ผลว่าฝ่ายไหนชนะ เพราะก่อนหน้านี้เคยมีกรณีที่ Nintendo ฟ้องค่าย Colopl เรื่องระบบ Touch Screen ของเกม Shironeko Project เมื่อหลายปีก่อน ซึ่งใช้เวลา 2-3 ปี กว่าศาลจะตัดสิน ท้ายสุดถึง Colopl แพ้ ก็จ่ายแค่ค่าเสียหายกับปรับบางส่วน แต่เกมก็ยังเปิดให้บริการต่อไป</p>\n<p>จากรายงานของ Sensor Tower เกม Uma Musume Pretty Derby เป็นเกมที่ทำรายได้ถึง 2 แสนล้านเยน ภายในเวลา 2 ปี ถือเป็นหนึ่งในเกมมือถือที่ทำรายได้ระดับนี้เร็วที่สุด โดยมีผู้เล่นทั้งหมดที่จ่ายเงินซื้อของในเกม เป็นชาวญี่ปุ่น 95% ตามด้วยเกาหลีใต้ 3.3% และไต้หวัน 1%</p>\n<p>ที่มา - <a href=\"https://www.cygames.co.jp/news/id-23172?fbclid=IwAR35-l9iEg193pRKY7CzGSk-ojMx1W4Op2x8ez2rTOb_STCft1wtcDezLio\">Cygames</a> via <a href=\"https://gameworldobserver.com/2023/05/17/konami-cygames-lawsuit-uma-musume-pretty-derby\">Game World Observer</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/78c2e481780301618ba530a1063001e7.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/konami\">Konami</a></div><div><a href=\"/topics/cygames\">Cygames</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"ffcd273be03005498fc11ed032741d5da69c894e6a348002750efc529e714e99","category":"Thai"}