{"title":"Targeted A-to-G base editing in the organellar genomes of Arabidopsis with monomeric programmable deaminases","link":"https://academic.oup.com/plphys/article/194/4/2278/7490820?rss=1","date":1703116800000,"content":"<span><div>Abstract</div>Plastids and mitochondria are 2 intracellular organelles containing DNA-encoding partial but essential components for their roles, photosynthesis, and respiration. Precise base editing in both plastid and mitochondrial genomes would benefit their gene functional analysis and crop breeding. Targeted base editing in organellar genomes relies on a protein-based genome-editing system that uses the TALE-DNA recognition motif with deaminases. This is because the efficient delivery of guide RNA for clustered regularly interspaced short palindromic repeats (CRISPR)/Cas9 systems into organelles is currently impossible. Since TALE-based base editors used in organellar genomes are usually dimeric types, in this study, we used targeted A-to-G base editing in Arabidopsis (<span>Arabidopsis thaliana</span>) plastid and mitochondrial genomes with monomeric TALE-based deaminase for easier assembling of vectors. As a result, inheritable targeted A-to-G base editing of adenosine triphosphatase subunit 6-2 (<span>atp6-2</span>) in plant mitochondrial genomes and of 16S ribosomal RNA (<span>16S rRNA</span>) in plastid genomes of Arabidopsis was successfully induced by monomeric TALE-based adenine deaminase (AD) without off-target mutations. The monomeric TALE-based adenine deaminases also demonstrated a preference for editing the 8th T on the same strand from the recognition end. Phenotypic analysis showed that A-to-G conversion at 1139A of plastid <span>16S rRNA</span> conferred substantial spectinomycin resistance in Arabidopsis, but not the other 2 potential-resistant mutations at 1131T and 1137T, predicted from the previous bacterial data. Our study demonstrated the feasibility of monomeric TALE-based ADs in plant organelles and their potential contribution to the functional analyses of plant organelles with easier assembling.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"ffcee08e7e7e5b8e2ba4138f47197f4c2b6e94a84759f79770e1732c9040c6ca","category":"Environment"}