{"title":"Persistence comparison of two Shiga-toxin producing <i>Escherichia coli</i> (STEC) serovars during long-term storage and thermal inactivation in various wheat flours","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299922","date":1709906400000,"content":"<p>by Ian S. Hines, Tom Jurkiw, Emily Nguyen, Martine Ferguson, Sultana Solaiman, Elizabeth Reed, Maria Hoffmann, Jie Zheng</p>\r\n\r\nFoodborne outbreaks associated with Shiga toxin-producing <i>Escherichia coli</i> (STEC) contaminated wheat flour have been an increasing food safety concern in recent decades. However, there is little literature aimed at investigating the impact of different flour types on the persistence of STEC during storage and thermal inactivation. Therefore, two serovars of STEC, O121 and O157, were selected to inoculate each of five different types of common wheat flours: whole wheat, bleached, unbleached, bread, and self-rising. Inoculated flours were examined for the stability of STEC during storage for up to 42 days at room temperature (RT) and a<sub>w</sub> ~0.56. Additionally, the thermal resistance of O121 and O157 under isothermal conditions at 60, 70, 80, and 90°C was analyzed for the inoculated flours. STEC storage persistence at RT was generally not affected by flour type, however, decreases of 1.2 and 2.4 log CFU/day within whole wheat flour for O121 and O157, respectively, were significantly lower than other flours. Though few differences were identified in relation to flour type, O121 exhibited significantly better survival rates than O157 during both equilibrium and storage periods. Compared to an approximate 6 log reduction in the population of O157, O121 population levels were reduced by a significantly lower amount (~3 log) during the entire storage period at RT. At each isothermal temperature, the impact of flour type on the thermal resistance capabilities of O121 or O157 was not a significant factor and resulted in similar survival curves regardless of serovar. Instead of exhibiting linear survival curves, both O121 and O157 displayed nonlinear curves with some shoulder/tail effect. Similar for both O121 and O157, the predicted decimal reduction time (D-value) decreased from approximately 25 min to around 8 min as the isothermal temperature increased from 60°C to 90°C. Results reported here can contribute to risk assessment models concerning contamination of STEC in wheat flour and add to our understanding of the impacts of flour type and STEC serovar on desiccation stability during storage and isothermal inactivation during thermal treatment.","author":"Ian S. Hines","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"ffd0a206fce63ef0228494b500fd86e2a9794b6ff5377c77dda0298c858e63c3","category":"Interdisciplinary"}