{"title":"Field phenology of emerald ash borer (Coleoptera: Buprestidae) parasitoids in New York State","link":"https://academic.oup.com/ee/article/53/4/532/7676652?rss=1","date":1716163200000,"content":"<span><div>Abstract</div>Emerald ash borer (EAB), <span>Agrilus planipennis</span> Fairmaire (Coleoptera: Buprestidae), has caused extensive mortality of ash across North America. Biological control offers a potential long-term management option, allowing for long-term survival of ash. Careful monitoring of populations of biocontrol agents is necessary to understand their relative impacts. Understanding the emergence and flight phenology of these species allows for the optimization of monitoring schemes and improves our understanding of host–parasitoid interactions. We used yellow pan trapping data to assess the adult phenology of both EAB and its associated native and introduced parasitoids in 3 New York counties. We monitored 2 introduced larval biocontrol agents, <span>Tetrastichus planipennisi</span> Yang (Hymenoptera: Eulophidae) and <span>Spathius galinae</span> Belokobylskij &amp; Strazanac (Braconidae), for 3–4 years post-release, as well as the native parasitoid <span>Phasgonophora sulcata</span> Westword (Chalcididae). Results indicate a single discrete emergence event for both EAB and <span>P. sulcata</span> in all monitored counties, which is consistent with previously reported results. Our results also suggest there are 4 generations per year of <span>T. planipennisi</span> and 3 generations of <span>S. galinae</span> in the monitored counties. We recorded an additional generation of <span>T. planipennisi</span> that had not previously been reported in New York, and both <span>T. planipennisi</span> and <span>S. galinae</span> appeared to emerge earlier than previously documented.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"ffe18d947d813582d0c45d5c5ed48196c9e5b3f178321768673eba651e37b63b","category":"Environment"}