{"title":"Preparation of fern root resistant starch by pullulanase and glucoamylase combined with autoclaving‐enzymatic method: physicochemical properties and structural characterization","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13889?af=R","date":1726044920000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Fern root starch has a high percentage of amylose and has great potential for application in the field of slow-digesting foods. Clarifying the effect of treatment conditions on fern root starch is key to achieving industrialized production of fern root resistant starch. In the present study, fern root starch was treated by the autoclave-enzymatic method with pullulanase, glucoamylase and mixed enzyme.</p>\n<h2>RESULTS</h2>\n<p>The content of resistant starch in fern roots treated with mixed enzyme was the highest (24.07 ± 1.11%), which was approximately 320% times that of the native starch, had the best water-holding capacity (151.08%), vital transparency and freeze–thaw stability. By contrast, the solubility, swelling and viscosity were lower than natural starch. In addition, mixed enzyme shows a denser structure, and the crystal form changes from C-type to V-type, with a high relative crystallinity and significantly enhanced thermal stability.</p>\n<h2>CONCLUSION</h2>\n<p>After mixed enzyme combined with autoclave treatment, the content of resistant starch in fern root was greatly increased. The modified starch molecules did not produce new functional groups, which made the crystal structure of starch molecules more compact, and resistance to enzymatic hydrolysis and high temperature thermal stability were significantly enhanced. This provides a positive reference for further in-depth study of fern root starch, improvement of utilization value, development and innovation of new food health products, and diabetes treatment. © 2024 Society of Chemical Industry.</p>","author":"Min Huang, \nLi Li, \nGuoqing Lei, \nRan Qiu, \nYi Wang, \nJianhang Wu, \nXuyan Zong","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"ffe252238fd21ac4bb9343a7dcf58c8a8fa57d20eb9595394a0d956c8a621e47","category":"Environment"}