{"title":"HashiCorp at AWS re:Invent: Breakouts, Experts, Demos, and More","link":"https://www.hashicorp.com/blog/hashicorp-at-aws-re-invent-breakouts-experts-demos-and-more","date":1637686800000,"content":"<p>Amazon Web Services’ flagship cloud conference — <a href=\"https://reinvent.awsevents.com/\">AWS re:Invent</a> — is back in-person this year, and once again HashiCorp will be there in full force. (Although the in-person event is sold out, you can still attend remotely for free: <a href=\"https://portal.awsevents.com/events/reInvent2021/registration\">register here</a>.)</p>\n<p>For both in-person and remote attendees, we’re pleased to share the latest news on our long-standing relationship with Amazon, and how we help organizations provision, secure, run, and connect applications running in AWS.</p>\n<p>HashiCorp is a key partner for many enterprises that use AWS. Whether organizations go fully cloud-native or maintain a hybrid infrastructure combining cloud and on-premises resources, HashiCorp products can support those diverse environments. For many organizations, <a href=\"https://www.hashicorp.com/products/terraform\">HashiCorp Terraform</a> is the preferred way to provision resources on AWS at scale. Similarly, <a href=\"https://www.hashicorp.com/products/vault\">HashiCorp Vault</a> is central to adopting zero trust security on AWS. And increasingly, <a href=\"https://www.hashicorp.com/products/consul\">HashiCorp Consul</a> is how DevOps teams choose to automate networking across AWS runtimes.</p>\n<p>Here are some highlights of what we’ll have going on at the event, Monday through Friday, Nov. 29 - Dec. 3 in Las Vegas:</p>\n<h2><a href=\"#visit-the-hashicorp-booth-where-all-major-walkways-converge\">»</a><a></a>Visit the HashiCorp Booth: Where All Major Walkways Converge</h2>\n<p>HashiCorp is a Diamond sponsor of AWS re:Invent 2021. We invite in-person attendees to stop by our booth on the expo floor (Booth #927) to chat with our technical experts, take in a product demo or three at one of our product kiosks, snap a pic on our selfie wall for a chance to win a pair of HashiCorp AirPod Pros, pick up some cool swag (t-shirts, stickers, and more), and get up to speed on the latest HashiCorp integrations with AWS.</p>\n<p>You can find us in the center of the expo hall, where all major walkways converge.</p><img src=\"https://www.datocms-assets.com/2885/1637612686-reinvent-2021-map.png\" /><h2><a href=\"#breakout-talks\">»</a><a></a>Breakout Talks</h2>\n<p>At re:Invent, we are hosting several breakout sessions and floor presentations discussing how HashiCorp Terraform, Vault, and more work with AWS services:</p>\n<h3><a href=\"#optimizing-aws-workflows-with-the-cdk-for-terraform\">»</a><a></a>Optimizing AWS Workflows with the CDK for Terraform</h3>\n<p><strong>Thursday, December 2, at 1pm PT</strong></p>\n<p>There are countless ways to provision and manage the plethora of available AWS services. This session will showcase how using the <a href=\"https://www.hashicorp.com/blog/announcing-cdk-for-terraform-0-7\">CDK for Terraform</a> eases management of your Kubernetes cluster and overall AWS infrastructure without impacting your applications. A consistent workflow has never been more critical, from AMIs to Amazon EKS, from identity-and-access (IAM) roles to security groups.</p>\n<p><em>Session ID: COP402-S, COPO402-S-OF</em></p>\n<h3><a href=\"#zero-trust-foundations-in-amazon-ecs-with-hashicorp-boundary-vault-and-consul\">»</a><a></a>Zero-Trust Foundations in Amazon ECS with HashiCorp Boundary, Vault, and Consul</h3>\n<p><strong>Thursday, December 2, at 1:45pm PT</strong></p>\n<p>This session addresses how to apply a zero trust security approach to your Amazon ECS services using HashiCorp Boundary, Vault, and Consul. We’ll start with an overview of Boundary’s access and authorization model and operational components, including AWS KMS integration. We will also demonstrate how to generate AWS IAM and Amazon RDS credentials using Vault, and manage service-to-service communication with Amazon EC2 and AWS Fargate launch types on ECS with Consul. The session will conclude with patterns and practices to secure access management between users, machines, and services.</p>\n<p><em>Session ID: SEC303-S,  SEC303-S-OF</em></p>\n<h2><a href=\"#product-demos\">»</a><a></a>Product Demos</h2>\n<p>On Tuesday, Wednesday, and Thursday, Nov. 30 - Dec. 2, we’ll be hosting a full lineup of HashiCorp product demos in our booth on the AWS re:Invent show floor. Here is the daily schedule:</p>\n<h3><a href=\"#cloud-operating-model\">»</a><a></a>Cloud Operating Model</h3>\n<p><strong>10:30 a.m. - 10:45 a.m. PT</strong></p>\n<p>The Cloud Operating Model is a new approach for IT operations that organizations need to use to be successful with cloud adoption and thrive in an era of multi-cloud architectures. Attend this demo to learn how organizations like yours use HashiCorp tools to unlock the <a href=\"https://www.hashicorp.com/cloud-operating-model\">cloud operating model</a>.</p>\n<h3><a href=\"#hashicorp-terraform\">»</a><a></a>HashiCorp Terraform</h3>\n<p><strong>11:30 a.m. - 11:45 a.m. PT</strong></p>\n<p>Learn why <a href=\"https://www.terraform.io/\">Terraform</a> is used by millions of practitioners to provision infrastructure every day. The demo will also highlight how <a href=\"https://cloud.hashicorp.com/products/packer\">HCP Packer</a> enhances existing Terraform workflows!</p>\n<h3><a href=\"#hashicorp-vault\">»</a><a></a>HashiCorp Vault</h3>\n<p><strong>12:30 p.m. - 12:45 p.m. PT</strong></p>\n<p>Everyone is buzzing about <a href=\"https://www.hashicorp.com/solutions/zero-trust-security\">zero trust security</a>. But what does that mean in the real world? Attend this demo and learn why Vault is the foundation for a modern cloud native security posture.</p>\n<h3><a href=\"#hashicorp-consul\">»</a><a></a>HashiCorp Consul</h3>\n<p><strong>1:30 p.m. - 1:45 p.m. PT</strong></p>\n<p>Consul is one of the most popular networking technologies used with AWS. In this demo, experts from HashiCorp will explain how <a href=\"https://www.hashicorp.com/blog/consul-service-mesh-on-amazon-ecs-now-generally-available\">Consul securely connects services running in Amazon ECS and EKS</a>, and also demonstrate the product’s <a href=\"https://www.hashicorp.com/blog/announcing-hashicorp-consul-api-gateway\">new API gateway features</a>. Plus, we’ll show how the new <a href=\"https://www.consul.io/docs/enterprise/admin-partitions\">admin partitions</a> features ease operational complexity at scale, and how <a href=\"https://www.consul.io/docs/nia/installation/install\">Consul-Terraform Sync</a> complements your provisioning workflows.</p>\n<h3><a href=\"#hashicorp-boundary\">»</a><a></a>HashiCorp Boundary</h3>\n<p><strong>2:30 p.m. - 2:45 p.m. PT</strong></p>\n<p>Get to know one of HashiCorp’s newest products. Boundary offers simple and secure remote access at scale — use it to enable access to any system from anywhere based on user identity. In this demo, we’ll explain how Boundary performs AuthN and AuthZ sync from AWS. We’ll also show how it handles credential brokering with <a href=\"https://cloud.hashicorp.com/\">HCP Vault</a>.</p>\n<p>You can also swing by a product kiosk at the HashiCorp booth at any time to get a personal mini-demo on any of our products. Don’t forget to grab some HashiCorp swag to commemorate your visit while you’re there.</p>\n<h2><a href=\"#see-you-at-aws-re-invent\">»</a><a></a>See You at AWS re:Invent</h2>\n<p>There’s never been a more exciting time to be in enterprise IT. Even as the pace of innovations continues to accelerate, there are now real playbooks for achieving success in the cloud. Seize the moment, and make the most of your time at AWS re:Invent, whether remote or in person. If you’re going to be in Las Vegas, please reach out to your account team to arrange an executive briefing, and be sure to stop by our booth to learn how companies like yours are accelerating their cloud strategy with HashiCorp and AWS.</p>","author":"Jared Ruckle","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"fffc16ff6e0af5ae628d378190bb9b7ecd042d5e605e9889aee8808eda50ece5","category":"Tech"}